; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22balancer\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22big\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math/big\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22math/big\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22rand\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math/rand\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22math/rand\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22sort\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22sort\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22sort\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./balancer.go", directory: "/home/wangcong/go_path/src/github.com/project-iris/iris/balancer")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "balancer.Balance..1command_line_arguments.Balancer", linkageName: "command_line_arguments.Balancer.Balance", scope: null, file: !10, line: 105, type: !11, isLocal: false, isDefinition: true, scopeLine: 105, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DIFile(filename: "balancer.go", directory: ".")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !100, !100, !17}
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Int,error}", file: !14, size: 192, align: 8, elements: !15)
!14 = !DIFile(filename: "", directory: "")
!15 = !{!16, !31}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 105, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !10, line: 26, size: 256, align: 8, elements: !19)
!19 = !{!20, !22}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !10, line: 26, baseType: !21, size: 8, align: 8)
!21 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !10, line: 26, baseType: !23, size: 192, align: 64, offset: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !10, line: 26, size: 192, align: 8, elements: !24)
!24 = !{!25, !28, !30}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !29, size: 64, align: 64, offset: 64)
!29 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !29, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 105, baseType: !32, size: 128, align: 64, offset: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !33)
!33 = !{!34, !99}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !14, size: 128, align: 8, elements: !37)
!37 = !{!38, !95}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 1, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !41)
!41 = !{!42, !44, !45, !46, !48, !49, !50, !60, !68, !70, !76, !94}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !43, size: 64, align: 64)
!43 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !47, size: 8, align: 8, offset: 160)
!47 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !47, size: 8, align: 8, offset: 168)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !47, size: 8, align: 8, offset: 176)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !51, size: 64, align: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !53)
!53 = !{!54}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!43, !58, !43}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIBasicType(name: "void")
!60 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !61, size: 64, align: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !63)
!63 = !{!64}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!21, !58, !58}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !69, size: 64, align: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !71, size: 64, align: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !73)
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !69, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !29, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !77, size: 64, align: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !79)
!79 = !{!80, !81, !82}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !71, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !71, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !83, size: 192, align: 64, offset: 128)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !14, size: 192, align: 8, elements: !84)
!84 = !{!85, !92, !93}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !88)
!88 = !{!80, !81, !89, !90, !91}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !58, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !58, size: 64, align: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !58, size: 64, align: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !14, line: 1, baseType: !29, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !14, line: 1, baseType: !29, size: 64, align: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !58, size: 64, align: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !14, line: 1, baseType: !96, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!72, !58}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !58, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "Balancer", file: !10, line: 33, size: 448, align: 8, elements: !102)
!102 = !{!103, !116, !117}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "members", file: !10, line: 34, baseType: !104, size: 192, align: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.entitySlice", file: !105, line: 36, size: 192, align: 8, elements: !106)
!105 = !DIFile(filename: "entity.go", directory: ".")
!106 = !{!107, !114, !115}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !105, line: 1, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.entity", file: !105, line: 30, size: 128, align: 8, elements: !111)
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !105, line: 31, baseType: !17, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "cap", file: !105, line: 32, baseType: !29, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !105, line: 1, baseType: !29, size: 64, align: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !105, line: 1, baseType: !29, size: 64, align: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", file: !10, line: 35, baseType: !29, size: 64, align: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !10, line: 36, baseType: !118, size: 192, align: 32, offset: 256)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !10, line: 29, size: 192, align: 8, elements: !119)
!119 = !{!120, !126, !127, !128, !129}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !10, line: 29, baseType: !121, size: 64, align: 32)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !10, line: 29, size: 64, align: 8, elements: !122)
!122 = !{!123, !125}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !10, line: 29, baseType: !124, size: 32, align: 32)
!124 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !10, line: 29, baseType: !8, size: 32, align: 32, offset: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !10, line: 29, baseType: !8, size: 32, align: 32, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !10, line: 29, baseType: !8, size: 32, align: 32, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !10, line: 29, baseType: !124, size: 32, align: 32, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !10, line: 29, baseType: !124, size: 32, align: 32, offset: 160)
!130 = !DILocalVariable(name: "b", arg: 1, scope: !9, file: !10, line: 105, type: !100)
!131 = !DILocation(line: 105, column: 1, scope: !9)
!132 = !DILocalVariable(name: "ex", arg: 2, scope: !9, file: !10, line: 105, type: !17)
!133 = !DILocation(line: 105, column: 28, scope: !9)
!134 = !DILocalVariable(name: "$ret2", scope: !9, file: !10, line: 105, type: !17)
!135 = !DILocation(line: 105, column: 42, scope: !9)
!136 = !DILocalVariable(name: "$ret3", scope: !9, file: !10, line: 105, type: !32)
!137 = !DILocation(line: 105, column: 52, scope: !9)
!138 = !DILocation(line: 106, column: 3, scope: !139)
!139 = distinct !DILexicalBlock(scope: !9, file: !10, line: 105, column: 1)
!140 = !DILocation(line: 139, column: 1, scope: !9)
!141 = !DILocation(line: 106, column: 8, scope: !139)
!142 = !DILocation(line: 107, column: 9, scope: !139)
!143 = !DILocation(line: 107, column: 2, scope: !139)
!144 = !DILocation(line: 110, column: 6, scope: !139)
!145 = !DILocation(line: 110, column: 16, scope: !139)
!146 = !DILocation(line: 111, column: 19, scope: !139)
!147 = !DILocalVariable(name: "available", scope: !139, file: !10, line: 114, type: !29)
!148 = !DILocation(line: 114, column: 2, scope: !9)
!149 = !DILocalVariable(name: "exclude", scope: !139, file: !10, line: 115, type: !29)
!150 = !DILocation(line: 115, column: 2, scope: !9)
!151 = !DILocation(line: 116, column: 8, scope: !139)
!152 = !DILocation(line: 126, column: 14, scope: !139)
!153 = !DILocation(line: 117, column: 19, scope: !154)
!154 = distinct !DILexicalBlock(scope: !139, file: !10, line: 116, column: 15)
!155 = !DILocation(line: 118, column: 17, scope: !154)
!156 = !DILocation(line: 118, column: 10, scope: !154)
!157 = !DILocation(line: 118, column: 56, scope: !154)
!158 = !DILocation(line: 118, column: 39, scope: !154)
!159 = !DILocation(line: 118, column: 44, scope: !154)
!160 = !DILocation(line: 118, column: 47, scope: !154)
!161 = !DILocation(line: 119, column: 29, scope: !154)
!162 = !DILocation(line: 119, column: 34, scope: !154)
!163 = !DILocation(line: 119, column: 17, scope: !154)
!164 = !DILocation(line: 120, column: 27, scope: !154)
!165 = !DILocation(line: 120, column: 32, scope: !154)
!166 = !DILocation(line: 120, column: 15, scope: !154)
!167 = !DILocalVariable(name: "cap", scope: !139, file: !10, line: 126, type: !29)
!168 = !DILocation(line: 126, column: 2, scope: !9)
!169 = !DILocation(line: 127, column: 2, scope: !170)
!170 = distinct !DILexicalBlock(scope: !139, file: !10, line: 127, column: 2)
!171 = !DILocalVariable(name: "i", scope: !170, file: !10, line: 127, type: !29)
!172 = !DILocation(line: 127, column: 6, scope: !139)
!173 = !DILocalVariable(name: "m", scope: !170, file: !10, line: 127, type: !109)
!174 = !DILocation(line: 129, column: 8, scope: !170)
!175 = !DILocation(line: 132, column: 11, scope: !170)
!176 = !DILocation(line: 132, column: 7, scope: !170)
!177 = !DILocation(line: 133, column: 10, scope: !170)
!178 = !DILocation(line: 134, column: 12, scope: !170)
!179 = !DILocation(line: 138, column: 2, scope: !139)
!180 = !DILocation(line: 111, column: 3, scope: !9)
!181 = distinct !DISubprogram(name: "balancer.Capacity..1command_line_arguments.Balancer", linkageName: "command_line_arguments.Balancer.Capacity", scope: null, file: !10, line: 143, type: !182, isLocal: false, isDefinition: true, scopeLine: 143, isOptimized: false, unit: !1, retainedNodes: !3)
!182 = !DISubroutineType(types: !183)
!183 = !{!29, !100, !100, !17}
!184 = !DILocalVariable(name: "b", arg: 1, scope: !181, file: !10, line: 143, type: !100)
!185 = !DILocation(line: 143, column: 1, scope: !181)
!186 = !DILocalVariable(name: "ex", arg: 2, scope: !181, file: !10, line: 143, type: !17)
!187 = !DILocation(line: 143, column: 29, scope: !181)
!188 = !DILocalVariable(name: "$ret4", scope: !181, file: !10, line: 143, type: !29)
