; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22config\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22crypto\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22aes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/aes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/aes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22md5\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/md5\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/md5\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22big\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math/big\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22math/big\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./config.go", directory: "/home/wangcong/go_path/src/github.com/project-iris/iris/config")
!3 = !{}
!4 = !{!5, !22, !26, !28, !130, !132, !135, !137, !139, !141, !143, !145, !179, !182, !184, !186, !188, !190, !192, !194, !200, !202, !204, !206, !208, !210, !212, !214, !216, !218, !220, !222, !224, !226, !228, !230, !232, !234, !236, !238, !240, !242, !244, !246, !248, !250, !252, !254, !256, !258, !260, !262, !264, !266, !268, !270, !272, !274, !276, !278}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.StsGroup", linkageName: "command_line_arguments.StsGroup", scope: !1, file: !7, line: 31, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "config.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !7, line: 26, size: 256, align: 8, elements: !10)
!10 = !{!11, !13}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !7, line: 26, baseType: !12, size: 8, align: 8)
!12 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !7, line: 26, baseType: !14, size: 192, align: 64, offset: 64)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !7, line: 26, size: 192, align: 8, elements: !15)
!15 = !{!16, !19, !21}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !7, line: 1, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !7, line: 1, baseType: !20, size: 64, align: 64, offset: 64)
!20 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !7, line: 1, baseType: !20, size: 64, align: 64, offset: 128)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !24, line: 1, type: !25, isLocal: false, isDefinition: true)
!24 = !DIFile(filename: "<built-in>", directory: "")
!25 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "command_line_arguments.StsGenerator", linkageName: "command_line_arguments.StsGenerator", scope: !1, file: !7, line: 74, type: !8, isLocal: false, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "command_line_arguments.StsCipher", linkageName: "command_line_arguments.StsCipher", scope: !1, file: !7, line: 117, type: !30, isLocal: false, isDefinition: true)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 24, size: 64, align: 8, elements: !32)
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 24, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !112}
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Block,error}", file: !38, size: 256, align: 8, elements: !39)
!38 = !DIFile(filename: "", directory: "")
!39 = !{!40, !117}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 24, baseType: !41, size: 128, align: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "Block", file: !7, line: 24, size: 128, align: 8, elements: !42)
!42 = !{!43, !116}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 24, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,struct{*uint8,int,int},struct{*uint8,int,int})void,*func(*void,struct{*uint8,int,int},struct{*uint8,int,int})void}", file: !38, size: 256, align: 8, elements: !46)
!46 = !{!47, !104, !108, !115}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !38, line: 24, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !24, line: 1, size: 576, align: 8, elements: !50)
!50 = !{!51, !53, !54, !55, !57, !58, !59, !69, !77, !79, !85, !103}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !24, line: 1, baseType: !52, size: 64, align: 64)
!52 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !24, line: 1, baseType: !52, size: 64, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !24, line: 1, baseType: !25, size: 32, align: 32, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !24, line: 1, baseType: !56, size: 8, align: 8, offset: 160)
!56 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !24, line: 1, baseType: !56, size: 8, align: 8, offset: 168)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !24, line: 1, baseType: !56, size: 8, align: 8, offset: 176)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !24, line: 1, baseType: !60, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !24, line: 1, size: 64, align: 8, elements: !62)
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !24, line: 1, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!52, !67, !52}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIBasicType(name: "void")
!69 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !24, line: 1, baseType: !70, size: 64, align: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !24, line: 1, size: 64, align: 8, elements: !72)
!72 = !{!73}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !24, line: 1, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!12, !67, !67}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !24, line: 1, baseType: !78, size: 64, align: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !24, line: 1, baseType: !80, size: 64, align: 64, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !24, line: 1, size: 128, align: 8, elements: !82)
!82 = !{!83, !84}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !24, line: 1, baseType: !78, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !24, line: 1, baseType: !20, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !24, line: 1, baseType: !86, size: 64, align: 64, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !24, line: 1, size: 320, align: 8, elements: !88)
!88 = !{!89, !90, !91}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !24, line: 1, baseType: !80, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !24, line: 1, baseType: !80, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !24, line: 1, baseType: !92, size: 192, align: 64, offset: 128)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !38, size: 192, align: 8, elements: !93)
!93 = !{!94, !101, !102}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !24, line: 1, size: 320, align: 8, elements: !97)
!97 = !{!89, !90, !98, !99, !100}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !24, line: 1, baseType: !67, size: 64, align: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !24, line: 1, baseType: !67, size: 64, align: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !24, line: 1, baseType: !67, size: 64, align: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !38, line: 1, baseType: !20, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !38, line: 1, baseType: !20, size: 64, align: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !24, line: 1, baseType: !67, size: 64, align: 64, offset: 512)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "BlockSize", file: !38, line: 24, baseType: !105, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!20, !67}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Decrypt", file: !38, line: 24, baseType: !109, size: 64, align: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!68, !67, !112, !112}
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !38, size: 192, align: 8, elements: !113)
!113 = !{!114, !101, !102}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !78, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Encrypt", file: !38, line: 24, baseType: !109, size: 64, align: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !67, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 24, baseType: !118, size: 128, align: 64, offset: 128)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !24, line: 1, size: 128, align: 8, elements: !119)
!119 = !{!120, !129}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 1, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !38, size: 128, align: 8, elements: !123)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !38, line: 1, baseType: !48, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !38, line: 1, baseType: !126, size: 64, align: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!81, !67}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !24, line: 1, baseType: !67, size: 64, align: 64, offset: 64)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "command_line_arguments.StsCipherBits", linkageName: "command_line_arguments.StsCipherBits", scope: !1, file: !7, line: 120, type: !20, isLocal: false, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "command_line_arguments.StsSigHash", linkageName: "command_line_arguments.StsSigHash", scope: !1, file: !7, line: 123, type: !134, isLocal: false, isDefinition: true)
!134 = !DIBasicType(name: "Hash", size: 64, encoding: DW_ATE_unsigned)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "command_line_arguments.HkdfHash", linkageName: "command_line_arguments.HkdfHash", scope: !1, file: !7, line: 126, type: !134, isLocal: false, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "command_line_arguments.HkdfSalt", linkageName: "command_line_arguments.HkdfSalt", scope: !1, file: !7, line: 129, type: !112, isLocal: false, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "command_line_arguments.HkdfInfo", linkageName: "command_line_arguments.HkdfInfo", scope: !1, file: !7, line: 132, type: !112, isLocal: false, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "command_line_arguments.SessionCipher", linkageName: "command_line_arguments.SessionCipher", scope: !1, file: !7, line: 135, type: !30, isLocal: false, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "command_line_arguments.SessionCipherBits", linkageName: "command_line_arguments.SessionCipherBits", scope: !1, file: !7, line: 138, type: !20, isLocal: false, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "command_line_arguments.SessionHash", linkageName: "command_line_arguments.SessionHash", scope: !1, file: !7, line: 141, type: !147, isLocal: false, isDefinition: true)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 25, size: 64, align: 8, elements: !149)
!149 = !{!150}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 25, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!154}
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "Hash", file: !7, line: 23, size: 128, align: 8, elements: !155)
!155 = !{!156, !116}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 23, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void)void,*func(*void)int,*func(*void,struct{*uint8,int,int})struct{*uint8,int,int},*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !38, size: 384, align: 8, elements: !159)
!159 = !{!160, !161, !162, !166, !167, !171}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !38, line: 23, baseType: !48, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "BlockSize", file: !38, line: 23, baseType: !105, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", file: !38, line: 23, baseType: !163, size: 64, align: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!68, !67}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !38, line: 23, baseType: !105, size: 64, align: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Sum", file: !38, line: 23, baseType: !168, size: 64, align: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!112, !67, !112}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !38, line: 23, baseType: !172, size: 64, align: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!175, !67, !112}
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !38, size: 192, align: 8, elements: !176)
!176 = !{!177, !178}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !38, line: 23, baseType: !20, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !38, line: 23, baseType: !118, size: 128, align: 64, offset: 64)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "command_line_arguments.SessionDialTimeout", linkageName: "command_line_arguments.SessionDialTimeout", scope: !1, file: !7, line: 144, type: !181, isLocal: false, isDefinition: true)
!181 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "command_line_arguments.SessionAcceptTimeout", linkageName: "command_line_arguments.SessionAcceptTimeout", scope: !1, file: !7, line: 147, type: !181, isLocal: false, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "command_line_arguments.SessionShakeTimeout", linkageName: "command_line_arguments.SessionShakeTimeout", scope: !1, file: !7, line: 150, type: !181, isLocal: false, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "command_line_arguments.SessionLinkTimeout", linkageName: "command_line_arguments.SessionLinkTimeout", scope: !1, file: !7, line: 153, type: !181, isLocal: false, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "command_line_arguments.SessionGraceTimeout", linkageName: "command_line_arguments.SessionGraceTimeout", scope: !1, file: !7, line: 156, type: !181, isLocal: false, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "command_line_arguments.PacketCipher", linkageName: "command_line_arguments.PacketCipher", scope: !1, file: !7, line: 159, type: !30, isLocal: false, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "command_line_arguments.PacketCipherBits", linkageName: "command_line_arguments.PacketCipherBits", scope: !1, file: !7, line: 162, type: !20, isLocal: false, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "command_line_arguments.BootPorts", linkageName: "command_line_arguments.BootPorts", scope: !1, file: !7, line: 165, type: !196, isLocal: false, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !38, size: 192, align: 8, elements: !197)
!197 = !{!198, !101, !102}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "command_line_arguments.BootBeatsBuffer", linkageName: "command_line_arguments.BootBeatsBuffer", scope: !1, file: !7, line: 168, type: !20, isLocal: false, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "command_line_arguments.BootFastProbe", linkageName: "command_line_arguments.BootFastProbe", scope: !1, file: !7, line: 171, type: !20, isLocal: false, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "command_line_arguments.BootSlowProbe", linkageName: "command_line_arguments.BootSlowProbe", scope: !1, file: !7, line: 174, type: !20, isLocal: false, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "command_line_arguments.BootScan", linkageName: "command_line_arguments.BootScan", scope: !1, file: !7, line: 177, type: !20, isLocal: false, isDefinition: true)
