; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22queue\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22func \22"
module asm "\09.ascii \22New\22"
module asm "\09.ascii \22 (\22"
module asm "\09.ascii \22)\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22<type 1 \22"
module asm "\09.ascii \22*\22"
module asm "\09.ascii \22<type 2 \22"
module asm "\09.ascii \22\5C\22Queue\5C\22 \22"
module asm "\09.ascii \22<type 3 \22"
module asm "\09.ascii \22struct { \22"
module asm "\09.ascii \22.command-line-arguments.tailIdx\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22<type -11>\22"
module asm "\09.ascii \22; \22"
module asm "\09.ascii \22.command-line-arguments.headIdx\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22<type -11>\22"
module asm "\09.ascii \22; \22"
module asm "\09.ascii \22.command-line-arguments.tailOff\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22<type -11>\22"
module asm "\09.ascii \22; \22"
module asm "\09.ascii \22.command-line-arguments.headOff\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./queue.go", directory: "/home/wangcong/go_path/src/github.com/project-iris/iris/container/queue")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "queue.Empty..1command_line_arguments.Queue", linkageName: "command_line_arguments.Queue.Empty", scope: null, file: !10, line: 90, type: !11, isLocal: false, isDefinition: true, scopeLine: 90, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DIFile(filename: "queue.go", directory: ".")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !14}
!13 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "Queue", file: !10, line: 30, size: 832, align: 8, elements: !16)
!16 = !{!17, !19, !20, !21, !22, !92, !93}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "tailIdx", file: !10, line: 31, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "headIdx", file: !10, line: 32, baseType: !18, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "tailOff", file: !10, line: 33, baseType: !18, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "headOff", file: !10, line: 34, baseType: !18, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", file: !10, line: 36, baseType: !23, size: 192, align: 64, offset: 256)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*struct{*_type,*void},int,int},int,int}", file: !24, size: 192, align: 8, elements: !25)
!24 = !DIFile(filename: "", directory: "")
!25 = !{!26, !88, !89}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*void},int,int}", file: !24, size: 192, align: 8, elements: !29)
!29 = !{!30, !88, !89}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !24, size: 128, align: 8, elements: !33)
!33 = !{!34, !91}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !24, line: 1, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !37)
!37 = !{!38, !40, !41, !42, !44, !45, !46, !56, !64, !66, !72, !90}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !39, size: 64, align: 64)
!39 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !43, size: 8, align: 8, offset: 160)
!43 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !43, size: 8, align: 8, offset: 168)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !43, size: 8, align: 8, offset: 176)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !47, size: 64, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !49)
!49 = !{!50}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!39, !54, !39}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIBasicType(name: "void")
!56 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !57, size: 64, align: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !59)
!59 = !{!60}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!13, !54, !54}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !65, size: 64, align: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !67, size: 64, align: 64, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !69)
!69 = !{!70, !71}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !65, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !73, size: 64, align: 64, offset: 448)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !75)
!75 = !{!76, !77, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !67, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !67, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !79, size: 192, align: 64, offset: 128)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !24, size: 192, align: 8, elements: !80)
!80 = !{!81, !88, !89}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !84)
!84 = !{!76, !77, !85, !86, !87}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !54, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !54, size: 64, align: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !54, size: 64, align: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !24, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !24, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !54, size: 64, align: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !24, line: 1, baseType: !54, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !10, line: 37, baseType: !28, size: 192, align: 64, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !10, line: 38, baseType: !28, size: 192, align: 64, offset: 640)
!94 = !DILocalVariable(name: "q", arg: 1, scope: !9, file: !10, line: 90, type: !14)
!95 = !DILocation(line: 90, column: 1, scope: !9)
!96 = !DILocalVariable(name: "$ret2", scope: !9, file: !10, line: 90, type: !13)
!97 = !DILocation(line: 90, column: 25, scope: !9)
!98 = !DILocation(line: 91, column: 10, scope: !9)
!99 = !DILocation(line: 91, column: 23, scope: !9)
!100 = !DILocation(line: 91, column: 19, scope: !9)
!101 = !DILocation(line: 91, column: 2, scope: !9)
!102 = !DILocation(line: 91, column: 36, scope: !9)
!103 = !DILocation(line: 91, column: 49, scope: !9)
!104 = !DILocation(line: 91, column: 45, scope: !9)
!105 = distinct !DISubprogram(name: "queue.Front..1command_line_arguments.Queue", linkageName: "command_line_arguments.Queue.Front", scope: null, file: !10, line: 85, type: !106, isLocal: false, isDefinition: true, scopeLine: 85, isOptimized: false, unit: !1, retainedNodes: !3)
!106 = !DISubroutineType(types: !107)
!107 = !{!32, !14, !14}
!108 = !DILocalVariable(name: "q", arg: 1, scope: !105, file: !10, line: 85, type: !14)
!109 = !DILocation(line: 85, column: 1, scope: !105)
!110 = !DILocation(line: 86, column: 10, scope: !105)
!111 = !DILocation(line: 86, column: 17, scope: !105)
!112 = !DILocation(line: 86, column: 15, scope: !105)
!113 = !DILocation(line: 86, column: 2, scope: !105)
!114 = !DILocalVariable(name: "$ret1", scope: !105, file: !10, line: 85, type: !32)
!115 = !DILocation(line: 85, column: 25, scope: !105)
!116 = distinct !DISubprogram(name: "queue.Pop..1command_line_arguments.Queue", linkageName: "command_line_arguments.Queue.Pop", scope: null, file: !10, line: 73, type: !106, isLocal: false, isDefinition: true, scopeLine: 73, isOptimized: false, unit: !1, retainedNodes: !3)
!117 = !DILocalVariable(name: "q", arg: 1, scope: !116, file: !10, line: 73, type: !14)
!118 = !DILocation(line: 73, column: 1, scope: !116)
!119 = !DILocation(line: 74, column: 8, scope: !116)
!120 = !DILocation(line: 74, column: 15, scope: !116)
!121 = !DILocation(line: 74, column: 33, scope: !116)
!122 = !DILocalVariable(name: "res", scope: !116, file: !10, line: 73, type: !32)
!123 = !DILocation(line: 73, column: 24, scope: !116)
!124 = !DILocation(line: 74, column: 25, scope: !116)
!125 = !DILocation(line: 75, column: 3, scope: !116)
!126 = !DILocation(line: 76, column: 15, scope: !116)
!127 = !DILocation(line: 81, column: 2, scope: !116)
!128 = !DILocation(line: 77, column: 13, scope: !116)
!129 = !DILocation(line: 78, column: 38, scope: !116)
!130 = !DILocation(line: 78, column: 17, scope: !116)
!131 = !DILocation(line: 78, column: 13, scope: !116)
!132 = !DILocation(line: 79, column: 20, scope: !116)
!133 = !DILocation(line: 78, column: 31, scope: !116)
!134 = !DILocation(line: 78, column: 26, scope: !116)
!135 = !DILocation(line: 79, column: 4, scope: !116)
!136 = !DILocation(line: 79, column: 10, scope: !116)
!137 = distinct !DISubprogram(name: "queue.Push..1command_line_arguments.Queue", linkageName: "command_line_arguments.Queue.Push", scope: null, file: !10, line: 51, type: !138, isLocal: false, isDefinition: true, scopeLine: 51, isOptimized: false, unit: !1, retainedNodes: !3)
!138 = !DISubroutineType(types: !139)
!139 = !{!55, !14, !14, !32}
!140 = !DILocalVariable(name: "q", arg: 1, scope: !137, file: !10, line: 51, type: !14)
!141 = !DILocation(line: 51, column: 1, scope: !137)
!142 = !DILocalVariable(name: "data", arg: 2, scope: !137, file: !10, line: 51, type: !32)
!143 = !DILocation(line: 51, column: 22, scope: !137)
!144 = !DILocation(line: 52, column: 3, scope: !137)
!145 = !DILocation(line: 52, column: 10, scope: !137)
!146 = !DILocation(line: 52, column: 8, scope: !137)
!147 = !DILocation(line: 52, column: 20, scope: !137)
!148 = !DILocation(line: 53, column: 3, scope: !137)
!149 = !DILocation(line: 54, column: 15, scope: !137)
!150 = !DILocation(line: 55, column: 13, scope: !137)
