; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22cyclic\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22rand\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/rand\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/rand\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22io\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22io\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22io\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22big\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math/big\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22math/big\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./cyclic.go", directory: "/home/wangcong/go_path/src/github.com/project-iris/iris/crypto/cyclic")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.negligibleExp", linkageName: "command_line_arguments.negligibleExp", scope: !1, file: !7, line: 34, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "cyclic.go", directory: ".")
!8 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!9 = distinct !DISubprogram(name: "cyclic.New", linkageName: "command_line_arguments.New", scope: null, file: !7, line: 43, type: !10, isLocal: false, isDefinition: true, scopeLine: 43, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !105, !8}
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Group,error}", file: !13, size: 192, align: 8, elements: !14)
!13 = !DIFile(filename: "", directory: "")
!14 = !{!15, !34}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !13, line: 43, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !7, line: 37, size: 128, align: 8, elements: !18)
!18 = !{!19, !33}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !7, line: 38, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !7, line: 28, size: 256, align: 8, elements: !22)
!22 = !{!23, !25}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !7, line: 28, baseType: !24, size: 8, align: 8)
!24 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !7, line: 28, baseType: !26, size: 192, align: 64, offset: 64)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !7, line: 28, size: 192, align: 8, elements: !27)
!27 = !{!28, !31, !32}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !7, line: 1, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !7, line: 1, baseType: !8, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !7, line: 1, baseType: !8, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "Generator", file: !7, line: 39, baseType: !20, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !13, line: 43, baseType: !35, size: 128, align: 64, offset: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !36, line: 1, size: 128, align: 8, elements: !37)
!36 = !DIFile(filename: "<built-in>", directory: "")
!37 = !{!38, !104}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !36, line: 1, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !13, size: 128, align: 8, elements: !41)
!41 = !{!42, !100}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !13, line: 1, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !36, line: 1, size: 576, align: 8, elements: !45)
!45 = !{!46, !48, !49, !51, !53, !54, !55, !65, !73, !75, !81, !99}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !36, line: 1, baseType: !47, size: 64, align: 64)
!47 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !36, line: 1, baseType: !47, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !36, line: 1, baseType: !50, size: 32, align: 32, offset: 128)
!50 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !36, line: 1, baseType: !52, size: 8, align: 8, offset: 160)
!52 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !36, line: 1, baseType: !52, size: 8, align: 8, offset: 168)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !36, line: 1, baseType: !52, size: 8, align: 8, offset: 176)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !36, line: 1, baseType: !56, size: 64, align: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !36, line: 1, size: 64, align: 8, elements: !58)
!58 = !{!59}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !36, line: 1, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!47, !63, !47}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIBasicType(name: "void")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !36, line: 1, baseType: !66, size: 64, align: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !36, line: 1, size: 64, align: 8, elements: !68)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !36, line: 1, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!24, !63, !63}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !36, line: 1, baseType: !74, size: 64, align: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !36, line: 1, baseType: !76, size: 64, align: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !36, line: 1, size: 128, align: 8, elements: !78)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !36, line: 1, baseType: !74, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !36, line: 1, baseType: !8, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !36, line: 1, baseType: !82, size: 64, align: 64, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !36, line: 1, size: 320, align: 8, elements: !84)
!84 = !{!85, !86, !87}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !36, line: 1, baseType: !76, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !36, line: 1, baseType: !76, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !36, line: 1, baseType: !88, size: 192, align: 64, offset: 128)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !13, size: 192, align: 8, elements: !89)
!89 = !{!90, !97, !98}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !13, line: 1, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !36, line: 1, size: 320, align: 8, elements: !93)
!93 = !{!85, !86, !94, !95, !96}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !36, line: 1, baseType: !63, size: 64, align: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !36, line: 1, baseType: !63, size: 64, align: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !36, line: 1, baseType: !63, size: 64, align: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !13, line: 1, baseType: !8, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !13, line: 1, baseType: !8, size: 64, align: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !36, line: 1, baseType: !63, size: 64, align: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !13, line: 1, baseType: !101, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!77, !63}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !36, line: 1, baseType: !63, size: 64, align: 64, offset: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !7, line: 28, size: 128, align: 8, elements: !106)
!106 = !{!107, !123}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 28, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !13, size: 128, align: 8, elements: !110)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !13, line: 28, baseType: !43, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !13, line: 28, baseType: !113, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!116, !63, !120}
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !13, size: 192, align: 8, elements: !117)
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !13, line: 28, baseType: !8, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !13, line: 28, baseType: !35, size: 128, align: 64, offset: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !13, size: 192, align: 8, elements: !121)
!121 = !{!122, !97, !98}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !13, line: 1, baseType: !74, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !63, size: 64, align: 64, offset: 64)
!124 = !DILocalVariable(name: "random", arg: 1, scope: !9, file: !7, line: 43, type: !105)
!125 = !DILocation(line: 43, column: 10, scope: !9)
!126 = !DILocalVariable(name: "bits", arg: 2, scope: !9, file: !7, line: 43, type: !8)
!127 = !DILocation(line: 43, column: 28, scope: !9)
!128 = !DILocalVariable(name: "$ret0", scope: !9, file: !7, line: 43, type: !16)
!129 = !DILocation(line: 43, column: 39, scope: !9)
!130 = !DILocation(line: 46, column: 18, scope: !131)
!131 = distinct !DILexicalBlock(scope: !9, file: !7, line: 44, column: 6)
!132 = !DILocalVariable(name: "q", scope: !131, file: !7, line: 46, type: !20)
!133 = !DILocation(line: 46, column: 3, scope: !9)
!134 = !DILocalVariable(name: "err", scope: !131, file: !7, line: 46, type: !35)
!135 = !DILocation(line: 47, column: 10, scope: !131)
!136 = !DILocalVariable(name: "$ret1", scope: !9, file: !7, line: 43, type: !35)
!137 = !DILocation(line: 43, column: 47, scope: !9)
!138 = !DILocation(line: 48, column: 4, scope: !131)
!139 = !DILocation(line: 51, column: 32, scope: !131)
!140 = !DILocation(line: 51, column: 8, scope: !131)
!141 = !DILocation(line: 51, column: 20, scope: !131)
!142 = !DILocalVariable(name: "p", scope: !131, file: !7, line: 51, type: !20)
!143 = !DILocation(line: 51, column: 3, scope: !9)
!144 = !DILocation(line: 52, column: 31, scope: !131)
!145 = !DILocation(line: 52, column: 7, scope: !131)
!146 = !DILocation(line: 52, column: 19, scope: !131)
!147 = !DILocation(line: 55, column: 7, scope: !131)
!148 = !DILocation(line: 55, column: 3, scope: !131)
!149 = !DILocation(line: 58, column: 20, scope: !150)
!150 = distinct !DILexicalBlock(scope: !131, file: !7, line: 56, column: 8)
!151 = !DILocalVariable(name: "err", scope: !150, file: !7, line: 58, type: !35)
!152 = !DILocation(line: 58, column: 5, scope: !131)
!153 = !DILocation(line: 59, column: 12, scope: !150)
!154 = !DILocalVariable(name: "a", scope: !150, file: !7, line: 58, type: !20)
!155 = !DILocation(line: 60, column: 6, scope: !150)
!156 = !DILocation(line: 63, column: 37, scope: !157)
!157 = distinct !DILexicalBlock(scope: !150, file: !7, line: 63, column: 5)
!158 = !DILocation(line: 63, column: 25, scope: !157)
!159 = !DILocalVariable(name: "b", scope: !157, file: !7, line: 63, type: !20)
!160 = !DILocation(line: 63, column: 8, scope: !150)
!161 = !DILocation(line: 63, column: 62, scope: !157)
!162 = !DILocation(line: 63, column: 53, scope: !157)
!163 = !DILocation(line: 63, column: 73, scope: !157)
!164 = !DILocation(line: 67, column: 25, scope: !165)
!165 = distinct !DILexicalBlock(scope: !150, file: !7, line: 67, column: 5)
!166 = !DILocalVariable(name: "b", scope: !165, file: !7, line: 67, type: !20)
!167 = !DILocation(line: 67, column: 8, scope: !150)
!168 = !DILocation(line: 67, column: 50, scope: !165)
!169 = !DILocation(line: 67, column: 41, scope: !165)
!170 = !DILocation(line: 67, column: 61, scope: !165)
!171 = !DILocation(line: 68, column: 13, scope: !165)
!172 = !DILocation(line: 68, column: 14, scope: !165)
!173 = !DILocation(line: 68, column: 6, scope: !165)
!174 = distinct !DISubprogram(name: "cyclic.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 25, type: !175, isLocal: false, isDefinition: true, scopeLine: 25, isOptimized: false, unit: !1, retainedNodes: !3)
!175 = !DISubroutineType(types: !176)
!176 = !{!64}
!177 = !DILocation(line: 1, column: 1, scope: !178)
!178 = !DILexicalBlockFile(scope: !174, file: !36, discriminator: 0)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "cyclic"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "command-line-arguments"
	.ascii ";\n"
	.ascii "import "
	.ascii "rand"
	.ascii " "
	.ascii "crypto/rand"
	.ascii " \""
	.ascii "crypto/rand"
	.ascii "\";\n"
	.ascii "import "
	.ascii "io"
	.ascii " "
	.ascii "io"
	.ascii " \""
