; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22sortext\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22big\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math/big\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22math/big\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22sort\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22sort\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22sort\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22binary\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding_binary..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt..import\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./search.go", directory: "/home/wangcong/go_path/src/github.com/project-iris/iris/ext/sortext")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "sortext.SearchBigInts", linkageName: "command_line_arguments.SearchBigInts", scope: null, file: !10, line: 30, type: !11, isLocal: false, isDefinition: true, scopeLine: 30, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DIFile(filename: "search.go", directory: ".")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !19}
!13 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Int,int,int}", file: !15, size: 192, align: 8, elements: !16)
!15 = !DIFile(filename: "", directory: "")
!16 = !{!17, !32, !33}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !15, line: 1, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !10, line: 22, size: 256, align: 8, elements: !21)
!21 = !{!22, !24}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !10, line: 22, baseType: !23, size: 8, align: 8)
!23 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !10, line: 22, baseType: !25, size: 192, align: 64, offset: 64)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !10, line: 22, size: 192, align: 8, elements: !26)
!26 = !{!27, !30, !31}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !13, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !15, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !15, line: 1, baseType: !13, size: 64, align: 64, offset: 128)
!34 = !DILocalVariable(name: "a", arg: 1, scope: !9, file: !10, line: 30, type: !14)
!35 = !DILocation(line: 30, column: 20, scope: !9)
!36 = !DILocalVariable(name: "x", arg: 2, scope: !9, file: !10, line: 30, type: !19)
!37 = !DILocation(line: 30, column: 34, scope: !9)
!38 = !DILocalVariable(name: "$ret0", scope: !9, file: !10, line: 30, type: !13)
!39 = !DILocation(line: 30, column: 46, scope: !9)
!40 = !DILocation(line: 31, column: 25, scope: !9)
!41 = !DILocation(line: 31, column: 29, scope: !9)
!42 = !DILocation(line: 31, column: 14, scope: !9)
!43 = !DILocation(line: 31, column: 2, scope: !9)
!44 = distinct !DISubprogram(name: "sortext.SearchBigInts..func1", scope: null, file: !10, line: 31, type: !45, isLocal: true, isDefinition: true, scopeLine: 31, isOptimized: false, unit: !1, retainedNodes: !3)
!45 = !DISubroutineType(types: !46)
!46 = !{!23, !13}
!47 = !DILocalVariable(name: "i", arg: 1, scope: !44, file: !10, line: 31, type: !13)
!48 = !DILocation(line: 31, column: 34, scope: !44)
!49 = !DILocalVariable(name: "$ret1", scope: !44, file: !10, line: 31, type: !23)
!50 = !DILocation(line: 31, column: 41, scope: !44)
!51 = !DILocation(line: 31, column: 55, scope: !44)
!52 = !DILocation(line: 31, column: 56, scope: !44)
!53 = !DILocation(line: 31, column: 64, scope: !44)
!54 = !DILocation(line: 31, column: 59, scope: !44)
!55 = !DILocation(line: 31, column: 67, scope: !44)
!56 = !DILocation(line: 31, column: 48, scope: !44)
!57 = distinct !DISubprogram(name: "sortext.SearchBigRats", linkageName: "command_line_arguments.SearchBigRats", scope: null, file: !10, line: 38, type: !58, isLocal: false, isDefinition: true, scopeLine: 38, isOptimized: false, unit: !1, retainedNodes: !3)
!58 = !DISubroutineType(types: !59)
!59 = !{!13, !60, !64}
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Rat,int,int}", file: !15, size: 192, align: 8, elements: !61)
!61 = !{!62, !32, !33}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !15, line: 1, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rat", file: !10, line: 22, size: 512, align: 8, elements: !66)
!66 = !{!67, !68}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "a", file: !10, line: 22, baseType: !20, size: 256, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !10, line: 22, baseType: !20, size: 256, align: 64, offset: 256)
!69 = !DILocalVariable(name: "a", arg: 1, scope: !57, file: !10, line: 38, type: !60)
!70 = !DILocation(line: 38, column: 20, scope: !57)
!71 = !DILocalVariable(name: "x", arg: 2, scope: !57, file: !10, line: 38, type: !64)
!72 = !DILocation(line: 38, column: 34, scope: !57)
!73 = !DILocalVariable(name: "$ret2", scope: !57, file: !10, line: 38, type: !13)
!74 = !DILocation(line: 38, column: 46, scope: !57)
!75 = !DILocation(line: 39, column: 25, scope: !57)
!76 = !DILocation(line: 39, column: 29, scope: !57)
!77 = !DILocation(line: 39, column: 14, scope: !57)
!78 = !DILocation(line: 39, column: 2, scope: !57)
!79 = distinct !DISubprogram(name: "sortext.SearchBigRats..func1", scope: null, file: !10, line: 39, type: !45, isLocal: true, isDefinition: true, scopeLine: 39, isOptimized: false, unit: !1, retainedNodes: !3)
!80 = !DILocalVariable(name: "i", arg: 1, scope: !79, file: !10, line: 39, type: !13)
!81 = !DILocation(line: 39, column: 34, scope: !79)
!82 = !DILocalVariable(name: "$ret3", scope: !79, file: !10, line: 39, type: !23)
!83 = !DILocation(line: 39, column: 41, scope: !79)
!84 = !DILocation(line: 39, column: 55, scope: !79)
!85 = !DILocation(line: 39, column: 56, scope: !79)
!86 = !DILocation(line: 39, column: 64, scope: !79)
!87 = !DILocation(line: 39, column: 59, scope: !79)
!88 = !DILocation(line: 39, column: 67, scope: !79)
!89 = !DILocation(line: 39, column: 48, scope: !79)
!90 = distinct !DISubprogram(name: "sortext.Search.command_line_arguments.BigIntSlice", linkageName: "command_line_arguments.BigIntSlice.Search", scope: null, file: !10, line: 43, type: !91, isLocal: false, isDefinition: true, scopeLine: 43, isOptimized: false, unit: !1, retainedNodes: !3)
!91 = !DISubroutineType(types: !92)
!92 = !{!13, !93, !93, !19}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "BigIntSlice", file: !95, line: 28, size: 192, align: 8, elements: !96)
!95 = !DIFile(filename: "sort.go", directory: ".")
!96 = !{!97, !98, !99}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !95, line: 1, baseType: !18, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !95, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !95, line: 1, baseType: !13, size: 64, align: 64, offset: 128)
!100 = !DILocalVariable(name: "pointer", arg: 1, scope: !90, file: !10, line: 43, type: !93)
!101 = !DILocation(line: 43, column: 1, scope: !90)
!102 = !DILocalVariable(name: "x", arg: 2, scope: !90, file: !10, line: 43, type: !19)
!103 = !DILocation(line: 43, column: 29, scope: !90)
!104 = !DILocalVariable(name: "$ret4", scope: !90, file: !10, line: 43, type: !13)
!105 = !DILocation(line: 43, column: 41, scope: !90)
!106 = !DILocation(line: 30, column: 34, scope: !9, inlinedAt: !107)
!107 = distinct !DILocation(line: 43, column: 54, scope: !90)
!108 = !DILocation(line: 30, column: 46, scope: !9, inlinedAt: !107)
!109 = !DILocation(line: 31, column: 25, scope: !9, inlinedAt: !107)
!110 = !DILocation(line: 31, column: 29, scope: !9, inlinedAt: !107)
!111 = !DILocation(line: 31, column: 14, scope: !9, inlinedAt: !107)
!112 = !DILocation(line: 31, column: 2, scope: !9, inlinedAt: !107)
!113 = !DILocation(line: 43, column: 47, scope: !90)
!114 = distinct !DISubprogram(name: "sortext.Search.command_line_arguments.BigRatSlice", linkageName: "command_line_arguments.BigRatSlice.Search", scope: null, file: !10, line: 46, type: !115, isLocal: false, isDefinition: true, scopeLine: 46, isOptimized: false, unit: !1, retainedNodes: !3)
!115 = !DISubroutineType(types: !116)
!116 = !{!13, !117, !117, !64}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "BigRatSlice", file: !95, line: 38, size: 192, align: 8, elements: !119)
!119 = !{!120, !98, !99}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !95, line: 1, baseType: !63, size: 64, align: 64)
!121 = !DILocalVariable(name: "pointer", arg: 1, scope: !114, file: !10, line: 46, type: !117)
!122 = !DILocation(line: 46, column: 1, scope: !114)
!123 = !DILocalVariable(name: "x", arg: 2, scope: !114, file: !10, line: 46, type: !64)
!124 = !DILocation(line: 46, column: 29, scope: !114)
!125 = !DILocalVariable(name: "$ret5", scope: !114, file: !10, line: 46, type: !13)
!126 = !DILocation(line: 46, column: 41, scope: !114)
!127 = !DILocation(line: 38, column: 34, scope: !57, inlinedAt: !128)
!128 = distinct !DILocation(line: 46, column: 54, scope: !114)
!129 = !DILocation(line: 38, column: 46, scope: !57, inlinedAt: !128)
!130 = !DILocation(line: 39, column: 25, scope: !57, inlinedAt: !128)
!131 = !DILocation(line: 39, column: 29, scope: !57, inlinedAt: !128)
!132 = !DILocation(line: 39, column: 14, scope: !57, inlinedAt: !128)
!133 = !DILocation(line: 39, column: 2, scope: !57, inlinedAt: !128)
!134 = !DILocation(line: 46, column: 47, scope: !114)
!135 = distinct !DISubprogram(name: "sortext.Len.command_line_arguments.BigIntSlice", linkageName: "command_line_arguments.BigIntSlice.Len", scope: null, file: !95, line: 30, type: !136, isLocal: false, isDefinition: true, scopeLine: 30, isOptimized: false, unit: !1, retainedNodes: !3)
!136 = !DISubroutineType(types: !137)
!137 = !{!13, !93, !93}
!138 = !DILocalVariable(name: "pointer", arg: 1, scope: !135, file: !95, line: 30, type: !93)
!139 = !DILocation(line: 30, column: 1, scope: !135)
!140 = !DILocalVariable(name: "b", scope: !135, file: !95, line: 30, type: !94)
!141 = !DILocalVariable(name: "$ret6", scope: !135, file: !95, line: 30, type: !13)
!142 = !DILocation(line: 30, column: 28, scope: !135)
!143 = !DILocation(line: 30, column: 44, scope: !135)
!144 = distinct !DISubprogram(name: "sortext.Less.command_line_arguments.BigIntSlice", linkageName: "command_line_arguments.BigIntSlice.Less", scope: null, file: !95, line: 31, type: !145, isLocal: false, isDefinition: true, scopeLine: 31, isOptimized: false, unit: !1, retainedNodes: !3)
!145 = !DISubroutineType(types: !146)
!146 = !{!23, !93, !93, !13, !13}
!147 = !DILocalVariable(name: "pointer", arg: 1, scope: !144, file: !95, line: 31, type: !93)
!148 = !DILocation(line: 31, column: 1, scope: !144)
!149 = !DILocalVariable(name: "i", arg: 2, scope: !144, file: !95, line: 31, type: !13)
!150 = !DILocation(line: 31, column: 27, scope: !144)
!151 = !DILocalVariable(name: "j", arg: 3, scope: !144, file: !95, line: 31, type: !13)
!152 = !DILocation(line: 31, column: 30, scope: !144)
!153 = !DILocalVariable(name: "b", scope: !144, file: !95, line: 31, type: !94)
!154 = !DILocalVariable(name: "$ret7", scope: !144, file: !95, line: 31, type: !23)
!155 = !DILocation(line: 31, column: 37, scope: !144)
!156 = !DILocation(line: 31, column: 52, scope: !144)
!157 = !DILocation(line: 31, column: 61, scope: !144)
!158 = !DILocation(line: 31, column: 55, scope: !144)
!159 = !DILocation(line: 31, column: 66, scope: !144)
!160 = !DILocation(line: 31, column: 44, scope: !144)
!161 = distinct !DISubprogram(name: "sortext.Sort.command_line_arguments.BigIntSlice", linkageName: "command_line_arguments.BigIntSlice.Sort", scope: null, file: !95, line: 35, type: !162, isLocal: false, isDefinition: true, scopeLine: 35, isOptimized: false, unit: !1, retainedNodes: !3)
!162 = !DISubroutineType(types: !163)
!163 = !{!164, !93, !93}
!164 = !DIBasicType(name: "void")
!165 = !DILocalVariable(name: "pointer", arg: 1, scope: !161, file: !95, line: 35, type: !93)
!166 = !DILocation(line: 35, column: 1, scope: !161)
!167 = !DILocation(line: 35, column: 41, scope: !161)
!168 = !DILocation(line: 35, column: 36, scope: !161)
!169 = distinct !DISubprogram(name: "sortext.Swap.command_line_arguments.BigIntSlice", linkageName: "command_line_arguments.BigIntSlice.Swap", scope: null, file: !95, line: 32, type: !170, isLocal: false, isDefinition: true, scopeLine: 32, isOptimized: false, unit: !1, retainedNodes: !3)
!170 = !DISubroutineType(types: !171)
!171 = !{!164, !93, !93, !13, !13}
!172 = !DILocalVariable(name: "pointer", arg: 1, scope: !169, file: !95, line: 32, type: !93)
!173 = !DILocation(line: 32, column: 1, scope: !169)
!174 = !DILocalVariable(name: "i", arg: 2, scope: !169, file: !95, line: 32, type: !13)
!175 = !DILocation(line: 32, column: 27, scope: !169)
!176 = !DILocalVariable(name: "j", arg: 3, scope: !169, file: !95, line: 32, type: !13)
!177 = !DILocation(line: 32, column: 30, scope: !169)
!178 = !DILocalVariable(name: "b", scope: !169, file: !95, line: 32, type: !94)
!179 = !DILocation(line: 32, column: 58, scope: !169)
!180 = !DILocation(line: 32, column: 64, scope: !169)
!181 = !DILocation(line: 32, column: 55, scope: !169)
!182 = distinct !DISubprogram(name: "sortext.Len.command_line_arguments.BigRatSlice", linkageName: "command_line_arguments.BigRatSlice.Len", scope: null, file: !95, line: 40, type: !183, isLocal: false, isDefinition: true, scopeLine: 40, isOptimized: false, unit: !1, retainedNodes: !3)
!183 = !DISubroutineType(types: !184)
!184 = !{!13, !117, !117}
!185 = !DILocalVariable(name: "pointer", arg: 1, scope: !182, file: !95, line: 40, type: !117)
!186 = !DILocation(line: 40, column: 1, scope: !182)
!187 = !DILocalVariable(name: "b", scope: !182, file: !95, line: 40, type: !118)
!188 = !DILocalVariable(name: "$ret8", scope: !182, file: !95, line: 40, type: !13)
!189 = !DILocation(line: 40, column: 28, scope: !182)
!190 = !DILocation(line: 40, column: 44, scope: !182)
!191 = distinct !DISubprogram(name: "sortext.Less.command_line_arguments.BigRatSlice", linkageName: "command_line_arguments.BigRatSlice.Less", scope: null, file: !95, line: 41, type: !192, isLocal: false, isDefinition: true, scopeLine: 41, isOptimized: false, unit: !1, retainedNodes: !3)
!192 = !DISubroutineType(types: !193)
!193 = !{!23, !117, !117, !13, !13}
!194 = !DILocalVariable(name: "pointer", arg: 1, scope: !191, file: !95, line: 41, type: !117)
!195 = !DILocation(line: 41, column: 1, scope: !191)
!196 = !DILocalVariable(name: "i", arg: 2, scope: !191, file: !95, line: 41, type: !13)
!197 = !DILocation(line: 41, column: 27, scope: !191)
!198 = !DILocalVariable(name: "j", arg: 3, scope: !191, file: !95, line: 41, type: !13)
!199 = !DILocation(line: 41, column: 30, scope: !191)
!200 = !DILocalVariable(name: "b", scope: !191, file: !95, line: 41, type: !118)
!201 = !DILocalVariable(name: "$ret9", scope: !191, file: !95, line: 41, type: !23)
!202 = !DILocation(line: 41, column: 37, scope: !191)
!203 = !DILocation(line: 41, column: 52, scope: !191)
!204 = !DILocation(line: 41, column: 61, scope: !191)
!205 = !DILocation(line: 41, column: 55, scope: !191)
!206 = !DILocation(line: 41, column: 66, scope: !191)
!207 = !DILocation(line: 41, column: 44, scope: !191)
!208 = distinct !DISubprogram(name: "sortext.Sort.command_line_arguments.BigRatSlice", linkageName: "command_line_arguments.BigRatSlice.Sort", scope: null, file: !95, line: 45, type: !209, isLocal: false, isDefinition: true, scopeLine: 45, isOptimized: false, unit: !1, retainedNodes: !3)
!209 = !DISubroutineType(types: !210)
!210 = !{!164, !117, !117}
!211 = !DILocalVariable(name: "pointer", arg: 1, scope: !208, file: !95, line: 45, type: !117)
!212 = !DILocation(line: 45, column: 1, scope: !208)
!213 = !DILocation(line: 45, column: 41, scope: !208)
!214 = !DILocation(line: 45, column: 36, scope: !208)
!215 = distinct !DISubprogram(name: "sortext.Swap.command_line_arguments.BigRatSlice", linkageName: "command_line_arguments.BigRatSlice.Swap", scope: null, file: !95, line: 42, type: !216, isLocal: false, isDefinition: true, scopeLine: 42, isOptimized: false, unit: !1, retainedNodes: !3)
!216 = !DISubroutineType(types: !217)
!217 = !{!164, !117, !117, !13, !13}
!218 = !DILocalVariable(name: "pointer", arg: 1, scope: !215, file: !95, line: 42, type: !117)
!219 = !DILocation(line: 42, column: 1, scope: !215)
!220 = !DILocalVariable(name: "i", arg: 2, scope: !215, file: !95, line: 42, type: !13)
!221 = !DILocation(line: 42, column: 27, scope: !215)
!222 = !DILocalVariable(name: "j", arg: 3, scope: !215, file: !95, line: 42, type: !13)
!223 = !DILocation(line: 42, column: 30, scope: !215)
!224 = !DILocalVariable(name: "b", scope: !215, file: !95, line: 42, type: !118)
!225 = !DILocation(line: 42, column: 58, scope: !215)
!226 = !DILocation(line: 42, column: 64, scope: !215)
!227 = !DILocation(line: 42, column: 55, scope: !215)
!228 = distinct !DISubprogram(name: "sortext.BigInts", linkageName: "command_line_arguments.BigInts", scope: null, file: !95, line: 48, type: !229, isLocal: false, isDefinition: true, scopeLine: 48, isOptimized: false, unit: !1, retainedNodes: !3)
!229 = !DISubroutineType(types: !230)
!230 = !{!164, !14}
!231 = !DILocalVariable(name: "a", arg: 1, scope: !228, file: !95, line: 48, type: !14)
!232 = !DILocation(line: 48, column: 14, scope: !228)
!233 = !DILocation(line: 48, column: 51, scope: !228)
!234 = !DILocation(line: 48, column: 35, scope: !228)
!235 = distinct !DISubprogram(name: "sortext.BigRats", linkageName: "command_line_arguments.BigRats", scope: null, file: !95, line: 51, type: !236, isLocal: false, isDefinition: true, scopeLine: 51, isOptimized: false, unit: !1, retainedNodes: !3)
!236 = !DISubroutineType(types: !237)
!237 = !{!164, !60}
!238 = !DILocalVariable(name: "a", arg: 1, scope: !235, file: !95, line: 51, type: !60)
!239 = !DILocation(line: 51, column: 14, scope: !235)
!240 = !DILocation(line: 51, column: 51, scope: !235)
!241 = !DILocation(line: 51, column: 35, scope: !235)
!242 = distinct !DISubprogram(name: "sortext.BigIntsAreSorted", linkageName: "command_line_arguments.BigIntsAreSorted", scope: null, file: !95, line: 54, type: !243, isLocal: false, isDefinition: true, scopeLine: 54, isOptimized: false, unit: !1, retainedNodes: !3)
!243 = !DISubroutineType(types: !244)
!244 = !{!23, !14}
!245 = !DILocalVariable(name: "a", arg: 1, scope: !242, file: !95, line: 54, type: !14)
!246 = !DILocation(line: 54, column: 23, scope: !242)
!247 = !DILocalVariable(name: "$ret10", scope: !242, file: !95, line: 54, type: !23)
!248 = !DILocation(line: 54, column: 37, scope: !242)
!249 = !DILocation(line: 54, column: 76, scope: !242)
!250 = !DILocation(line: 54, column: 56, scope: !242)
!251 = !DILocation(line: 54, column: 44, scope: !242)
!252 = distinct !DISubprogram(name: "sortext.BigRatsAreSorted", linkageName: "command_line_arguments.BigRatsAreSorted", scope: null, file: !95, line: 57, type: !253, isLocal: false, isDefinition: true, scopeLine: 57, isOptimized: false, unit: !1, retainedNodes: !3)
!253 = !DISubroutineType(types: !254)
!254 = !{!23, !60}
!255 = !DILocalVariable(name: "a", arg: 1, scope: !252, file: !95, line: 57, type: !60)
!256 = !DILocation(line: 57, column: 23, scope: !252)
!257 = !DILocalVariable(name: "$ret11", scope: !252, file: !95, line: 57, type: !23)
!258 = !DILocation(line: 57, column: 37, scope: !252)
!259 = !DILocation(line: 57, column: 76, scope: !252)
!260 = !DILocation(line: 57, column: 56, scope: !252)
!261 = !DILocation(line: 57, column: 44, scope: !252)
!262 = distinct !DISubprogram(name: "sortext.Unique", linkageName: "command_line_arguments.Unique", scope: null, file: !263, line: 28, type: !264, isLocal: false, isDefinition: true, scopeLine: 28, isOptimized: false, unit: !1, retainedNodes: !3)
!263 = !DIFile(filename: "unique.go", directory: ".")
!264 = !DISubroutineType(types: !265)
!265 = !{!13, !266}
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interface", file: !10, line: 23, size: 128, align: 8, elements: !267)
!267 = !{!268, !338}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 23, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,int,int)bool,*func(*void,int,int)void}", file: !15, size: 256, align: 8, elements: !271)
!271 = !{!272, !326, !330, !334}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !15, line: 23, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !275)
!275 = !{!276, !278, !279, !280, !282, !283, !284, !293, !301, !303, !309, !325}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !277, size: 64, align: 64)
!277 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !277, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !281, size: 8, align: 8, offset: 160)
!281 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !281, size: 8, align: 8, offset: 168)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !281, size: 8, align: 8, offset: 176)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !285, size: 64, align: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !287)
!287 = !{!288}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!277, !292, !277}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !294, size: 64, align: 64, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !296)
!296 = !{!297}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!23, !292, !292}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !302, size: 64, align: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !304, size: 64, align: 64, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !302, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !310, size: 64, align: 64, offset: 448)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !312)
!312 = !{!313, !314, !315}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !304, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !304, size: 64, align: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !316, size: 192, align: 64, offset: 128)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !15, size: 192, align: 8, elements: !317)
!317 = !{!318, !32, !33}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !15, line: 1, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !321)
!321 = !{!313, !314, !322, !323, !324}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !292, size: 64, align: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !292, size: 64, align: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !292, size: 64, align: 64, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !292, size: 64, align: 64, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !15, line: 23, baseType: !327, size: 64, align: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!13, !292}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Less", file: !15, line: 23, baseType: !331, size: 64, align: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!23, !292, !13, !13}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Swap", file: !15, line: 23, baseType: !335, size: 64, align: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!164, !292, !13, !13}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !292, size: 64, align: 64, offset: 64)
!339 = !DILocalVariable(name: "data", arg: 1, scope: !262, file: !263, line: 28, type: !266)
!340 = !DILocation(line: 28, column: 13, scope: !262)
!341 = !DILocalVariable(name: "$ret12", scope: !262, file: !263, line: 28, type: !13)
!342 = !DILocation(line: 28, column: 34, scope: !262)
!343 = !DILocation(line: 29, column: 17, scope: !344)
!344 = distinct !DILexicalBlock(scope: !262, file: !263, line: 28, column: 1)
!345 = !DILocalVariable(name: "n", scope: !344, file: !263, line: 29, type: !13)
!346 = !DILocation(line: 29, column: 2, scope: !262)
!347 = !DILocalVariable(name: "u", scope: !344, file: !263, line: 29, type: !13)
!348 = !DILocalVariable(name: "i", scope: !344, file: !263, line: 29, type: !13)
!349 = !DILocation(line: 30, column: 7, scope: !344)
!350 = !DILocation(line: 31, column: 3, scope: !344)
!351 = !DILocation(line: 35, column: 4, scope: !344)
!352 = !DILocation(line: 36, column: 8, scope: !344)
!353 = !DILocation(line: 38, column: 3, scope: !344)
!354 = !DILocation(line: 33, column: 8, scope: !344)
!355 = !DILocation(line: 34, column: 10, scope: !344)
!356 = !DILocation(line: 34, column: 3, scope: !344)
!357 = !DILocation(line: 40, column: 11, scope: !344)
!358 = !DILocation(line: 40, column: 2, scope: !344)
!359 = distinct !DISubprogram(name: "sortext.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !10, line: 19, type: !360, isLocal: false, isDefinition: true, scopeLine: 19, isOptimized: false, unit: !1, retainedNodes: !3)
!360 = !DISubroutineType(types: !361)
!361 = !{!164}
!362 = !DILocation(line: 1, column: 1, scope: !363)
!363 = !DILexicalBlockFile(scope: !359, file: !7, discriminator: 0)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "sortext"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "command-line-arguments"
	.ascii ";\n"
	.ascii "import "
	.ascii "big"
	.ascii " "
	.ascii "math/big"
	.ascii " \""
	.ascii "math/big"
	.ascii "\";\n"
	.ascii "import "
	.ascii "sort"
	.ascii " "
	.ascii "sort"
	.ascii " \""
	.ascii "sort"
	.ascii "\";\n"
	.ascii "init"
	.ascii " "
	.ascii "bytes"
	.ascii " "
	.ascii "bytes..import"
	.ascii " "
	.ascii "binary"
	.ascii " "
	.ascii "encoding_binary..import"
	.ascii " "
	.ascii "fmt"
	.ascii " "
	.ascii "fmt..import"
	.ascii " "
	.ascii "poll"
	.ascii " "
	.ascii "internal_poll..import"
	.ascii " "
	.ascii "testlog"
	.ascii " "
	.ascii "internal_testlog..import"
	.ascii " "
	.ascii "io"
	.ascii " "
	.ascii "io..import"
	.ascii " "
	.ascii "big"
	.ascii " "
	.ascii "math_big..import"
	.ascii " "
	.ascii "rand"
	.ascii " "
	.ascii "math_rand..import"
	.ascii " "
	.ascii "os"
	.ascii " "
	.ascii "os..import"
	.ascii " "
	.ascii "reflect"
	.ascii " "
	.ascii "reflect..import"
	.ascii " "
	.ascii "runtime"
	.ascii " "
	.ascii "runtime..import"
	.ascii " "
	.ascii "sys"
	.ascii " "
	.ascii "runtime_internal_sys..import"
	.ascii " "
	.ascii "strconv"
	.ascii " "
	.ascii "strconv..import"
	.ascii " "
	.ascii "sync"
	.ascii " "
	.ascii "sync..import"
	.ascii " "
	.ascii "syscall"
	.ascii " "
	.ascii "syscall..import"
	.ascii " "
	.ascii "time"
	.ascii " "
	.ascii "time..import"
	.ascii " "
	.ascii "unicode"
	.ascii " "
	.ascii "unicode..import"
	.ascii ";\n"
	.ascii "init_graph"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "5"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "10"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "11"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "13"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "16"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "5"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "9"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "10"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "11"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "12"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "13"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "16"
	.ascii " "
