; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22gobber\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22gob\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/gob\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/gob\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22binary\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding_binary..import\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./gobber.go", directory: "/home/wangcong/go_path/src/github.com/project-iris/iris/gobber")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "gobber.Decode..1command_line_arguments.Gobber", linkageName: "command_line_arguments.Gobber.Decode", scope: null, file: !10, line: 78, type: !11, isLocal: false, isDefinition: true, scopeLine: 78, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DIFile(filename: "gobber.go", directory: ".")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !84, !84, !91, !203}
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !14)
!14 = !{!15, !83}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !18, size: 128, align: 8, elements: !19)
!18 = !DIFile(filename: "", directory: "")
!19 = !{!20, !79}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 1, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !23)
!23 = !{!24, !26, !27, !28, !30, !31, !32, !42, !51, !53, !60, !78}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 160)
!29 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 168)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 176)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !33, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !35)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!25, !40, !25}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "void")
!42 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !43, size: 64, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !45)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !40, !40}
!50 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !52, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !54, size: 64, align: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !52, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !61, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !63)
!63 = !{!64, !65, !66}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !54, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !54, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !67, size: 192, align: 64, offset: 128)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !18, size: 192, align: 8, elements: !68)
!68 = !{!69, !76, !77}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !72)
!72 = !{!64, !65, !73, !74, !75}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !18, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !18, line: 1, baseType: !59, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !18, line: 1, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!55, !40}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "Gobber", file: !10, line: 28, size: 1984, align: 8, elements: !86)
!86 = !{!87, !101, !102, !168, !198}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "outBuf", file: !10, line: 29, baseType: !88, size: 832, align: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", file: !10, line: 23, size: 832, align: 8, elements: !89)
!89 = !{!90, !94, !95, !99}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !10, line: 23, baseType: !91, size: 192, align: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !18, size: 192, align: 8, elements: !92)
!92 = !{!93, !76, !77}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !52, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "off", file: !10, line: 23, baseType: !59, size: 64, align: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "bootstrap", file: !10, line: 23, baseType: !96, size: 512, align: 8, offset: 256)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 512, align: 1, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "lastRead", file: !10, line: 23, baseType: !100, size: 8, align: 8, offset: 768)
!100 = !DIBasicType(name: ".bytes.readOp", size: 8, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "inBuf", file: !10, line: 30, baseType: !88, size: 832, align: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "outEnc", file: !10, line: 32, baseType: !103, size: 64, align: 64, offset: 1664)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "Encoder", file: !10, line: 24, size: 1280, align: 8, elements: !105)
!105 = !{!106, !112, !133, !147, !165, !166, !167}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !10, line: 24, baseType: !107, size: 64, align: 32)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !10, line: 24, size: 64, align: 8, elements: !108)
!108 = !{!109, !111}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !10, line: 24, baseType: !110, size: 32, align: 32)
!110 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !10, line: 24, baseType: !8, size: 32, align: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !10, line: 24, baseType: !113, size: 192, align: 64, offset: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Writer,int,int}", file: !18, size: 192, align: 8, elements: !114)
!114 = !{!115, !76, !77}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !10, line: 23, size: 128, align: 8, elements: !118)
!118 = !{!119, !132}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 23, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !18, size: 128, align: 8, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 23, baseType: !21, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !18, line: 23, baseType: !125, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!128, !40, !91}
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !18, size: 192, align: 8, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !18, line: 23, baseType: !59, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !18, line: 23, baseType: !13, size: 128, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "sent", file: !10, line: 24, baseType: !134, size: 64, align: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !136)
!136 = !{!137, !138, !139, !140, !142, !143, !144, !145, !146}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !59, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 72)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !141, size: 16, align: 16, offset: 80)
!141 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !25, size: 64, align: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "countState", file: !10, line: 24, baseType: !148, size: 64, align: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.encoderState", file: !10, line: 24, size: 448, align: 8, elements: !150)
!150 = !{!151, !152, !158, !159, !160, !164}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "enc", file: !10, line: 24, baseType: !40, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !10, line: 24, baseType: !153, size: 64, align: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.encBuffer", file: !10, line: 24, size: 704, align: 8, elements: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "data", file: !10, line: 24, baseType: !91, size: 192, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", file: !10, line: 24, baseType: !96, size: 512, align: 8, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "sendZero", file: !10, line: 24, baseType: !50, size: 8, align: 8, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "fieldnum", file: !10, line: 24, baseType: !59, size: 64, align: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !10, line: 24, baseType: !161, size: 72, align: 8, offset: 256)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 72, align: 1, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 9)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !10, line: 24, baseType: !40, size: 64, align: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "freeList", file: !10, line: 24, baseType: !148, size: 64, align: 64, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "byteBuf", file: !10, line: 24, baseType: !154, size: 704, align: 64, offset: 448)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !10, line: 24, baseType: !13, size: 128, align: 64, offset: 1152)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "inDec", file: !10, line: 33, baseType: !169, size: 64, align: 64, offset: 1728)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "Decoder", file: !10, line: 24, size: 1024, align: 8, elements: !171)
!171 = !{!106, !172, !180, !184, !185, !186, !187, !196, !197}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !10, line: 24, baseType: !173, size: 128, align: 64, offset: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !10, line: 23, size: 128, align: 8, elements: !174)
!174 = !{!175, !132}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 23, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !18, size: 128, align: 8, elements: !178)
!178 = !{!123, !179}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !18, line: 23, baseType: !125, size: 64, align: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !10, line: 24, baseType: !181, size: 256, align: 64, offset: 192)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.decBuffer", file: !10, line: 24, size: 256, align: 8, elements: !182)
!182 = !{!156, !183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !10, line: 24, baseType: !59, size: 64, align: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "wireType", file: !10, line: 24, baseType: !134, size: 64, align: 64, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "decoderCache", file: !10, line: 24, baseType: !134, size: 64, align: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ignorerCache", file: !10, line: 24, baseType: !134, size: 64, align: 64, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "freeList", file: !10, line: 24, baseType: !188, size: 64, align: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.decoderState", file: !10, line: 24, size: 256, align: 8, elements: !190)
!190 = !{!191, !192, !194, !195}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "dec", file: !10, line: 24, baseType: !40, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !10, line: 24, baseType: !193, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "fieldnum", file: !10, line: 24, baseType: !59, size: 64, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !10, line: 24, baseType: !40, size: 64, align: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "countBuf", file: !10, line: 24, baseType: !91, size: 192, align: 64, offset: 704)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !10, line: 24, baseType: !13, size: 128, align: 64, offset: 896)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !10, line: 35, baseType: !199, size: 192, align: 64, offset: 1792)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*void},int,int}", file: !18, size: 192, align: 8, elements: !200)
!200 = !{!201, !76, !77}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !18, size: 128, align: 8, elements: !204)
!204 = !{!20, !205}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !18, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!206 = !DILocalVariable(name: "data", arg: 2, scope: !9, file: !10, line: 78, type: !91)
!207 = !DILocation(line: 78, column: 25, scope: !9)
!208 = !DILocalVariable(name: "g", arg: 1, scope: !9, file: !10, line: 78, type: !84)
!209 = !DILocation(line: 78, column: 1, scope: !9)
!210 = !DILocalVariable(name: "msg", arg: 3, scope: !9, file: !10, line: 78, type: !203)
!211 = !DILocation(line: 78, column: 38, scope: !9)
!212 = !DILocalVariable(name: "$ret4", scope: !9, file: !10, line: 78, type: !13)
!213 = !DILocation(line: 78, column: 55, scope: !9)
!214 = !DILocation(line: 80, column: 9, scope: !9)
!215 = !DILocation(line: 100, column: 1, scope: !9)
!216 = !DILocation(line: 80, column: 2, scope: !9)
!217 = !DILocation(line: 81, column: 3, scope: !9)
!218 = !DILocation(line: 81, column: 9, scope: !9)
!219 = !DILocation(line: 82, column: 13, scope: !220)
!220 = distinct !DILexicalBlock(scope: !9, file: !10, line: 82, column: 2)
!221 = !DILocation(line: 82, column: 19, scope: !220)
!222 = !DILocalVariable(name: "err", scope: !220, file: !10, line: 82, type: !13)
!223 = !DILocation(line: 82, column: 5, scope: !9)
!224 = !DILocation(line: 82, column: 37, scope: !220)
!225 = !DILocation(line: 84, column: 29, scope: !226)
!226 = distinct !DILexicalBlock(scope: !220, file: !10, line: 82, column: 44)
!227 = !DILocation(line: 84, column: 18, scope: !226)
!228 = !DILocation(line: 84, column: 4, scope: !226)
!229 = !DILocation(line: 84, column: 12, scope: !226)
!230 = !DILocation(line: 85, column: 28, scope: !226)
!231 = !DILocation(line: 85, column: 17, scope: !226)
!232 = !DILocation(line: 85, column: 11, scope: !226)
!233 = !DILocation(line: 88, column: 22, scope: !226)
!234 = !DILocation(line: 88, column: 40, scope: !226)
!235 = !DILocation(line: 88, column: 15, scope: !226)
!236 = !DILocalVariable(name: "oldTypes", scope: !226, file: !10, line: 88, type: !199)
!237 = !DILocation(line: 88, column: 3, scope: !220)
!238 = !DILocation(line: 89, column: 3, scope: !239)
!239 = distinct !DILexicalBlock(scope: !226, file: !10, line: 89, column: 3)
!240 = !DILocalVariable(name: "msg", scope: !239, file: !10, line: 89, type: !203)
!241 = !DILocation(line: 89, column: 7, scope: !226)
!242 = !DILocation(line: 90, column: 15, scope: !243)
!243 = distinct !DILexicalBlock(scope: !239, file: !10, line: 90, column: 4)
!244 = !DILocalVariable(name: "err", scope: !243, file: !10, line: 90, type: !13)
!245 = !DILocation(line: 90, column: 7, scope: !239)
!246 = !DILocation(line: 90, column: 31, scope: !243)
!247 = !DILocation(line: 91, column: 11, scope: !243)
!248 = !DILocation(line: 91, column: 5, scope: !243)
!249 = !DILocation(line: 94, column: 4, scope: !226)
!250 = !DILocation(line: 94, column: 11, scope: !226)
!251 = !DILocation(line: 97, column: 3, scope: !9)
!252 = distinct !DISubprogram(name: "gobber.Encode..1command_line_arguments.Gobber", linkageName: "command_line_arguments.Gobber.Encode", scope: null, file: !10, line: 68, type: !253, isLocal: false, isDefinition: true, scopeLine: 68, isOptimized: false, unit: !1, retainedNodes: !3)
!253 = !DISubroutineType(types: !254)
!254 = !{!255, !84, !84, !203}
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !18, size: 320, align: 8, elements: !256)
!256 = !{!257, !258}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 68, baseType: !91, size: 192, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 68, baseType: !13, size: 128, align: 64, offset: 192)
!259 = !DILocalVariable(name: "g", arg: 1, scope: !252, file: !10, line: 68, type: !84)
!260 = !DILocation(line: 68, column: 1, scope: !252)
!261 = !DILocalVariable(name: "msg", arg: 2, scope: !252, file: !10, line: 68, type: !203)
!262 = !DILocation(line: 68, column: 25, scope: !252)
!263 = !DILocalVariable(name: "$ret3", scope: !252, file: !10, line: 68, type: !13)
!264 = !DILocation(line: 68, column: 51, scope: !252)
!265 = !DILocation(line: 70, column: 9, scope: !252)
!266 = !DILocation(line: 75, column: 1, scope: !252)
!267 = !DILocation(line: 70, column: 2, scope: !252)
!268 = !DILocation(line: 71, column: 13, scope: !269)
!269 = distinct !DILexicalBlock(scope: !252, file: !10, line: 71, column: 2)
!270 = !DILocation(line: 71, column: 20, scope: !269)
!271 = !DILocalVariable(name: "err", scope: !269, file: !10, line: 71, type: !13)
!272 = !DILocation(line: 71, column: 5, scope: !252)
!273 = !DILocation(line: 71, column: 38, scope: !269)
!274 = !DILocation(line: 72, column: 3, scope: !269)
!275 = !DILocation(line: 74, column: 17, scope: !252)
!276 = !DILocation(line: 72, column: 3, scope: !252)
!277 = distinct !DISubprogram(name: "gobber.Init..1command_line_arguments.Gobber", linkageName: "command_line_arguments.Gobber.Init", scope: null, file: !10, line: 48, type: !278, isLocal: false, isDefinition: true, scopeLine: 48, isOptimized: false, unit: !1, retainedNodes: !3)
!278 = !DISubroutineType(types: !279)
!279 = !{!13, !84, !84, !203}
!280 = !DILocalVariable(name: "g", arg: 1, scope: !277, file: !10, line: 48, type: !84)
!281 = !DILocation(line: 48, column: 1, scope: !277)
!282 = !DILocalVariable(name: "msg", arg: 2, scope: !277, file: !10, line: 48, type: !203)
!283 = !DILocation(line: 48, column: 23, scope: !277)
!284 = !DILocalVariable(name: "$ret1", scope: !277, file: !10, line: 48, type: !13)
!285 = !DILocation(line: 48, column: 40, scope: !277)
!286 = !DILocation(line: 50, column: 3, scope: !277)
!287 = !DILocation(line: 64, column: 1, scope: !277)
!288 = !DILocation(line: 50, column: 20, scope: !277)
!289 = !DILocation(line: 50, column: 12, scope: !277)
!290 = !DILocation(line: 50, column: 10, scope: !277)
!291 = !DILocation(line: 53, column: 13, scope: !292)
!292 = distinct !DILexicalBlock(scope: !277, file: !10, line: 53, column: 2)
!293 = !DILocation(line: 53, column: 20, scope: !292)
!294 = !DILocalVariable(name: "err", scope: !292, file: !10, line: 53, type: !13)
!295 = !DILocation(line: 53, column: 5, scope: !277)
!296 = !DILocation(line: 53, column: 38, scope: !292)
!297 = !DILocation(line: 56, column: 9, scope: !277)
!298 = !DILocation(line: 56, column: 2, scope: !277)
!299 = !DILocation(line: 59, column: 24, scope: !277)
!300 = !DILocation(line: 59, column: 3, scope: !277)
!301 = !DILocation(line: 59, column: 9, scope: !277)
!302 = !DILocation(line: 60, column: 13, scope: !303)
!303 = distinct !DILexicalBlock(scope: !277, file: !10, line: 60, column: 2)
!304 = !DILocation(line: 60, column: 19, scope: !303)
!305 = !DILocalVariable(name: "err", scope: !303, file: !10, line: 60, type: !13)
!306 = !DILocation(line: 60, column: 5, scope: !277)
!307 = !DILocation(line: 60, column: 37, scope: !303)
!308 = !DILocation(line: 54, column: 3, scope: !277)
!309 = distinct !DISubprogram(name: "gobber.New", linkageName: "command_line_arguments.New", scope: null, file: !10, line: 39, type: !310, isLocal: false, isDefinition: true, scopeLine: 39, isOptimized: false, unit: !1, retainedNodes: !3)
!310 = !DISubroutineType(types: !311)
!311 = !{!84}
!312 = !DILocalVariable(name: "$ret0", scope: !309, file: !10, line: 39, type: !84)
!313 = !DILocation(line: 39, column: 12, scope: !309)
!314 = !DILocation(line: 40, column: 7, scope: !315)
!315 = distinct !DILexicalBlock(scope: !309, file: !10, line: 39, column: 1)
!316 = !DILocalVariable(name: "g", scope: !315, file: !10, line: 40, type: !84)
