; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22heart\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22big\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math/big\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22math/big\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22sort\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22sort\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22sort\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22sync\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22sync\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22sync\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./entity.go", directory: "/home/wangcong/go_path/src/github.com/project-iris/iris/heart")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "heart.Len.command_line_arguments.entitySlice", linkageName: "command_line_arguments.entitySlice.Len", scope: null, file: !10, line: 39, type: !11, isLocal: false, isDefinition: true, scopeLine: 39, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DIFile(filename: "entity.go", directory: ".")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !14}
!13 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.entitySlice", file: !10, line: 36, size: 192, align: 8, elements: !16)
!16 = !{!17, !34, !35}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.entity", file: !10, line: 30, size: 128, align: 8, elements: !21)
!21 = !{!22, !36}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !10, line: 31, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !10, line: 25, size: 256, align: 8, elements: !25)
!25 = !{!26, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !10, line: 25, baseType: !27, size: 8, align: 8)
!27 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !10, line: 25, baseType: !29, size: 192, align: 64, offset: 64)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !10, line: 25, size: 192, align: 8, elements: !30)
!30 = !{!31, !34, !35}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !13, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tick", file: !10, line: 32, baseType: !13, size: 64, align: 64, offset: 64)
!37 = !DILocalVariable(name: "pointer", arg: 1, scope: !9, file: !10, line: 39, type: !14)
!38 = !DILocation(line: 39, column: 1, scope: !9)
!39 = !DILocalVariable(name: "s", scope: !9, file: !10, line: 39, type: !15)
!40 = !DILocalVariable(name: "$ret0", scope: !9, file: !10, line: 39, type: !13)
!41 = !DILocation(line: 39, column: 28, scope: !9)
!42 = !DILocation(line: 40, column: 2, scope: !9)
!43 = distinct !DISubprogram(name: "heart.Less.command_line_arguments.entitySlice", linkageName: "command_line_arguments.entitySlice.Less", scope: null, file: !10, line: 44, type: !44, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!44 = !DISubroutineType(types: !45)
!45 = !{!27, !14, !14, !13, !13}
!46 = !DILocalVariable(name: "pointer", arg: 1, scope: !43, file: !10, line: 44, type: !14)
!47 = !DILocation(line: 44, column: 1, scope: !43)
!48 = !DILocalVariable(name: "i", arg: 2, scope: !43, file: !10, line: 44, type: !13)
!49 = !DILocation(line: 44, column: 27, scope: !43)
!50 = !DILocalVariable(name: "j", arg: 3, scope: !43, file: !10, line: 44, type: !13)
!51 = !DILocation(line: 44, column: 30, scope: !43)
!52 = !DILocalVariable(name: "s", scope: !43, file: !10, line: 44, type: !15)
!53 = !DILocalVariable(name: "$ret1", scope: !43, file: !10, line: 44, type: !27)
!54 = !DILocation(line: 44, column: 37, scope: !43)
!55 = !DILocation(line: 45, column: 10, scope: !43)
!56 = !DILocation(line: 45, column: 22, scope: !43)
!57 = !DILocation(line: 45, column: 13, scope: !43)
!58 = !DILocation(line: 45, column: 25, scope: !43)
!59 = !DILocation(line: 45, column: 16, scope: !43)
!60 = !DILocation(line: 45, column: 30, scope: !43)
!61 = !DILocation(line: 45, column: 2, scope: !43)
!62 = distinct !DISubprogram(name: "heart.Search.command_line_arguments.entitySlice", linkageName: "command_line_arguments.entitySlice.Search", scope: null, file: !10, line: 54, type: !63, isLocal: false, isDefinition: true, scopeLine: 54, isOptimized: false, unit: !1, retainedNodes: !3)
!63 = !DISubroutineType(types: !64)
!64 = !{!13, !14, !14, !23}
!65 = !DILocalVariable(name: "pointer", arg: 1, scope: !62, file: !10, line: 54, type: !14)
!66 = !DILocation(line: 54, column: 1, scope: !62)
!67 = !DILocalVariable(name: "x", arg: 2, scope: !62, file: !10, line: 54, type: !23)
!68 = !DILocation(line: 54, column: 29, scope: !62)
!69 = !DILocalVariable(name: "$ret2", scope: !62, file: !10, line: 54, type: !13)
!70 = !DILocation(line: 54, column: 41, scope: !62)
!71 = !DILocation(line: 55, column: 25, scope: !62)
!72 = !DILocation(line: 55, column: 29, scope: !62)
!73 = !DILocation(line: 55, column: 14, scope: !62)
!74 = !DILocation(line: 55, column: 2, scope: !62)
!75 = distinct !DISubprogram(name: "heart.Swap.command_line_arguments.entitySlice", linkageName: "command_line_arguments.entitySlice.Swap", scope: null, file: !10, line: 49, type: !76, isLocal: false, isDefinition: true, scopeLine: 49, isOptimized: false, unit: !1, retainedNodes: !3)
!76 = !DISubroutineType(types: !77)
!77 = !{!78, !14, !14, !13, !13}
!78 = !DIBasicType(name: "void")
!79 = !DILocalVariable(name: "pointer", arg: 1, scope: !75, file: !10, line: 49, type: !14)
!80 = !DILocation(line: 49, column: 1, scope: !75)
!81 = !DILocalVariable(name: "i", arg: 2, scope: !75, file: !10, line: 49, type: !13)
!82 = !DILocation(line: 49, column: 27, scope: !75)
!83 = !DILocalVariable(name: "j", arg: 3, scope: !75, file: !10, line: 49, type: !13)
!84 = !DILocation(line: 49, column: 30, scope: !75)
!85 = !DILocalVariable(name: "s", scope: !75, file: !10, line: 49, type: !15)
!86 = !DILocation(line: 50, column: 16, scope: !75)
!87 = !DILocation(line: 50, column: 22, scope: !75)
!88 = !DILocation(line: 50, column: 13, scope: !75)
!89 = distinct !DISubprogram(name: "heart.command_line_arguments.entitySlice.Search..func1", scope: null, file: !10, line: 55, type: !90, isLocal: true, isDefinition: true, scopeLine: 55, isOptimized: false, unit: !1, retainedNodes: !3)
!90 = !DISubroutineType(types: !91)
!91 = !{!27, !13}
!92 = !DILocalVariable(name: "i", arg: 1, scope: !89, file: !10, line: 55, type: !13)
!93 = !DILocation(line: 55, column: 34, scope: !89)
!94 = !DILocalVariable(name: "$ret3", scope: !89, file: !10, line: 55, type: !27)
!95 = !DILocation(line: 55, column: 41, scope: !89)
!96 = !DILocation(line: 55, column: 55, scope: !89)
!97 = !DILocation(line: 55, column: 56, scope: !89)
!98 = !DILocation(line: 55, column: 59, scope: !89)
!99 = !DILocation(line: 55, column: 67, scope: !89)
!100 = !DILocation(line: 55, column: 62, scope: !89)
!101 = !DILocation(line: 55, column: 70, scope: !89)
!102 = !DILocation(line: 55, column: 48, scope: !89)
!103 = distinct !DISubprogram(name: "heart.Monitor..1command_line_arguments.Heart", linkageName: "command_line_arguments.Heart.Monitor", scope: null, file: !104, line: 75, type: !105, isLocal: false, isDefinition: true, scopeLine: 75, isOptimized: false, unit: !1, retainedNodes: !3)
!104 = !DIFile(filename: "heart.go", directory: ".")
!105 = !DISubroutineType(types: !106)
!106 = !{!107, !175, !175, !23}
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !108)
!108 = !{!109, !174}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !112, size: 128, align: 8, elements: !113)
!112 = !DIFile(filename: "", directory: "")
!113 = !{!114, !170}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !112, line: 1, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !117)
!117 = !{!118, !120, !121, !122, !124, !125, !126, !135, !143, !145, !151, !169}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !119, size: 64, align: 64)
!119 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !119, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !123, size: 8, align: 8, offset: 160)
!123 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !123, size: 8, align: 8, offset: 168)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !123, size: 8, align: 8, offset: 176)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !127, size: 64, align: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !129)
!129 = !{!130}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!119, !134, !119}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !136, size: 64, align: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !138)
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!27, !134, !134}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !144, size: 64, align: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !146, size: 64, align: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !148)
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !144, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !152, size: 64, align: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !154)
!154 = !{!155, !156, !157}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !146, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !146, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !158, size: 192, align: 64, offset: 128)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !112, size: 192, align: 8, elements: !159)
!159 = !{!160, !167, !168}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !112, line: 1, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !163)
!163 = !{!155, !156, !164, !165, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !134, size: 64, align: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !134, size: 64, align: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !134, size: 64, align: 64, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !112, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !112, line: 1, baseType: !13, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !134, size: 64, align: 64, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !112, line: 1, baseType: !171, size: 64, align: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!147, !134}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !134, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "Heart", file: !104, line: 38, size: 640, align: 8, elements: !177)
!177 = !{!178, !179, !180, !182, !183, !200, !203}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "mems", file: !104, line: 39, baseType: !15, size: 192, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tick", file: !104, line: 40, baseType: !13, size: 64, align: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "beat", file: !104, line: 41, baseType: !181, size: 64, align: 64, offset: 256)
!181 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "kill", file: !104, line: 42, baseType: !13, size: 64, align: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "call", file: !104, line: 44, baseType: !184, size: 128, align: 64, offset: 384)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "Callback", file: !104, line: 32, size: 128, align: 8, elements: !185)
!185 = !{!186, !199}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !104, line: 32, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void,*Int)void}", file: !112, size: 192, align: 8, elements: !189)
!189 = !{!190, !191, !195}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !112, line: 32, baseType: !115, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Beat", file: !112, line: 32, baseType: !192, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!78, !134}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Dead", file: !112, line: 32, baseType: !196, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!78, !134, !23}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !104, line: 1, baseType: !134, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "quit", file: !104, line: 46, baseType: !201, size: 64, align: 64, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !7, line: 1, align: 8, elements: !3)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !104, line: 47, baseType: !204, size: 64, align: 32, offset: 576)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !104, line: 27, size: 64, align: 8, elements: !205)
!205 = !{!206, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !104, line: 27, baseType: !207, size: 32, align: 32)
!207 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !104, line: 27, baseType: !8, size: 32, align: 32, offset: 32)
!209 = !DILocalVariable(name: "h", arg: 1, scope: !103, file: !104, line: 75, type: !175)
!210 = !DILocation(line: 75, column: 1, scope: !103)
!211 = !DILocalVariable(name: "id", arg: 2, scope: !103, file: !104, line: 75, type: !23)
!212 = !DILocation(line: 75, column: 25, scope: !103)
!213 = !DILocalVariable(name: "$ret6", scope: !103, file: !104, line: 75, type: !107)
!214 = !DILocation(line: 75, column: 38, scope: !103)
!215 = !DILocation(line: 76, column: 3, scope: !216)
!216 = distinct !DILexicalBlock(scope: !103, file: !104, line: 75, column: 1)
!217 = !DILocation(line: 87, column: 1, scope: !103)
!218 = !DILocation(line: 76, column: 8, scope: !216)
!219 = !DILocation(line: 77, column: 9, scope: !216)
!220 = !DILocation(line: 77, column: 2, scope: !216)
!221 = !DILocation(line: 80, column: 10, scope: !216)
!222 = !DILocation(line: 80, column: 15, scope: !216)
!223 = !DILocation(line: 81, column: 16, scope: !216)
!224 = !DILocation(line: 81, column: 9, scope: !216)
!225 = !DILocation(line: 81, column: 49, scope: !216)
!226 = !DILocation(line: 81, column: 32, scope: !216)
!227 = !DILocation(line: 81, column: 37, scope: !216)
!228 = !DILocation(line: 81, column: 40, scope: !216)
!229 = !DILocation(line: 82, column: 14, scope: !216)
!230 = !DILocation(line: 84, column: 49, scope: !216)
!231 = !DILocation(line: 84, column: 11, scope: !216)
!232 = !DILocation(line: 84, column: 26, scope: !216)
!233 = !DILocation(line: 84, column: 27, scope: !216)
!234 = !DILocation(line: 84, column: 9, scope: !216)
!235 = !DILocation(line: 85, column: 13, scope: !216)
!236 = !DILocation(line: 85, column: 7, scope: !216)
!237 = !DILocation(line: 82, column: 3, scope: !103)
!238 = distinct !DISubprogram(name: "heart.Ping..1command_line_arguments.Heart", linkageName: "command_line_arguments.Heart.Ping", scope: null, file: !104, line: 109, type: !105, isLocal: false, isDefinition: true, scopeLine: 109, isOptimized: false, unit: !1, retainedNodes: !3)
!239 = !DILocalVariable(name: "h", arg: 1, scope: !238, file: !104, line: 109, type: !175)
!240 = !DILocation(line: 109, column: 1, scope: !238)
!241 = !DILocalVariable(name: "id", arg: 2, scope: !238, file: !104, line: 109, type: !23)
!242 = !DILocation(line: 109, column: 22, scope: !238)
!243 = !DILocalVariable(name: "$ret8", scope: !238, file: !104, line: 109, type: !107)
!244 = !DILocation(line: 109, column: 35, scope: !238)
!245 = !DILocation(line: 110, column: 3, scope: !246)
!246 = distinct !DILexicalBlock(scope: !238, file: !104, line: 109, column: 1)
!247 = !DILocation(line: 119, column: 1, scope: !238)
!248 = !DILocation(line: 110, column: 8, scope: !246)
!249 = !DILocation(line: 111, column: 9, scope: !246)
!250 = !DILocation(line: 111, column: 2, scope: !246)
!251 = !DILocation(line: 113, column: 10, scope: !246)
!252 = !DILocation(line: 113, column: 15, scope: !246)
!253 = !DILocation(line: 114, column: 16, scope: !246)
!254 = !DILocation(line: 114, column: 9, scope: !246)
!255 = !DILocation(line: 114, column: 49, scope: !246)
!256 = !DILocation(line: 114, column: 32, scope: !246)
!257 = !DILocation(line: 114, column: 37, scope: !246)
!258 = !DILocation(line: 114, column: 40, scope: !246)
!259 = !DILocation(line: 118, column: 13, scope: !246)
!260 = !DILocation(line: 115, column: 9, scope: !246)
!261 = !DILocation(line: 115, column: 14, scope: !246)
!262 = !DILocation(line: 115, column: 23, scope: !246)
!263 = !DILocation(line: 115, column: 20, scope: !246)
!264 = !DILocation(line: 116, column: 3, scope: !238)
!265 = distinct !DISubprogram(name: "heart.Start..1command_line_arguments.Heart", linkageName: "command_line_arguments.Heart.Start", scope: null, file: !104, line: 63, type: !266, isLocal: false, isDefinition: true, scopeLine: 63, isOptimized: false, unit: !1, retainedNodes: !3)
!266 = !DISubroutineType(types: !267)
!267 = !{!78, !175, !175}
!268 = !DILocalVariable(name: "h", arg: 1, scope: !265, file: !104, line: 63, type: !175)
!269 = !DILocation(line: 63, column: 1, scope: !265)
!270 = !DILocation(line: 64, column: 2, scope: !265)
!271 = distinct !DISubprogram(name: "heart.Terminate..1command_line_arguments.Heart", linkageName: "command_line_arguments.Heart.Terminate", scope: null, file: !104, line: 68, type: !272, isLocal: false, isDefinition: true, scopeLine: 68, isOptimized: false, unit: !1, retainedNodes: !3)
!272 = !DISubroutineType(types: !273)
!273 = !{!107, !175, !175}
!274 = !DILocalVariable(name: "h", arg: 1, scope: !271, file: !104, line: 68, type: !175)
!275 = !DILocation(line: 68, column: 1, scope: !271)
!276 = !DILocation(line: 69, column: 10, scope: !277)
!277 = distinct !DILexicalBlock(scope: !271, file: !104, line: 68, column: 1)
!278 = !DILocalVariable(name: "errc", scope: !277, file: !104, line: 69, type: !201)
!279 = !DILocation(line: 69, column: 2, scope: !271)
!280 = !DILocation(line: 70, column: 3, scope: !277)
!281 = !DILocation(line: 70, column: 9, scope: !277)
!282 = !DILocation(line: 71, column: 9, scope: !277)
!283 = !DILocalVariable(name: "$ret5", scope: !271, file: !104, line: 68, type: !107)
!284 = !DILocation(line: 68, column: 29, scope: !271)
!285 = !DILocation(line: 71, column: 2, scope: !277)
!286 = distinct !DISubprogram(name: "heart.Unmonitor..1command_line_arguments.Heart", linkageName: "command_line_arguments.Heart.Unmonitor", scope: null, file: !104, line: 90, type: !105, isLocal: false, isDefinition: true, scopeLine: 90, isOptimized: false, unit: !1, retainedNodes: !3)
!287 = !DILocalVariable(name: "h", arg: 1, scope: !286, file: !104, line: 90, type: !175)
!288 = !DILocation(line: 90, column: 1, scope: !286)
!289 = !DILocalVariable(name: "id", arg: 2, scope: !286, file: !104, line: 90, type: !23)
!290 = !DILocation(line: 90, column: 27, scope: !286)
!291 = !DILocalVariable(name: "$ret7", scope: !286, file: !104, line: 90, type: !107)
!292 = !DILocation(line: 90, column: 40, scope: !286)
!293 = !DILocation(line: 91, column: 3, scope: !294)
!294 = distinct !DILexicalBlock(scope: !286, file: !104, line: 90, column: 1)
!295 = !DILocation(line: 106, column: 1, scope: !286)
!296 = !DILocation(line: 91, column: 8, scope: !294)
!297 = !DILocation(line: 92, column: 9, scope: !294)
!298 = !DILocation(line: 92, column: 2, scope: !294)
!299 = !DILocation(line: 94, column: 10, scope: !294)
!300 = !DILocation(line: 94, column: 15, scope: !294)
!301 = !DILocation(line: 95, column: 16, scope: !294)
!302 = !DILocation(line: 95, column: 9, scope: !294)
!303 = !DILocation(line: 95, column: 49, scope: !294)
!304 = !DILocation(line: 95, column: 32, scope: !294)
!305 = !DILocation(line: 95, column: 37, scope: !294)
!306 = !DILocation(line: 95, column: 40, scope: !294)
!307 = !DILocation(line: 105, column: 13, scope: !294)
!308 = !DILocation(line: 97, column: 16, scope: !309)
!309 = distinct !DILexicalBlock(scope: !294, file: !104, line: 95, column: 54)
!310 = !DILocation(line: 97, column: 23, scope: !309)
!311 = !DILocalVariable(name: "last", scope: !309, file: !104, line: 97, type: !13)
!312 = !DILocation(line: 97, column: 3, scope: !294)
!313 = !DILocation(line: 98, column: 9, scope: !309)
!314 = !DILocation(line: 98, column: 23, scope: !309)
!315 = !DILocation(line: 98, column: 15, scope: !309)
!316 = !DILocation(line: 99, column: 18, scope: !309)
!317 = !DILocation(line: 99, column: 10, scope: !309)
!318 = !DILocation(line: 102, column: 14, scope: !309)
!319 = !DILocation(line: 102, column: 8, scope: !309)
!320 = !DILocation(line: 103, column: 3, scope: !286)
!321 = distinct !DISubprogram(name: "heart.beater..1command_line_arguments.Heart", linkageName: "command_line_arguments.Heart.beater", scope: null, file: !104, line: 123, type: !266, isLocal: false, isDefinition: true, scopeLine: 123, isOptimized: false, unit: !1, retainedNodes: !3)
!322 = !DILocalVariable(name: "h", arg: 1, scope: !321, file: !104, line: 123, type: !175)
!323 = !DILocation(line: 123, column: 1, scope: !321)
!324 = !DILocation(line: 125, column: 26, scope: !325)
!325 = distinct !DILexicalBlock(scope: !321, file: !104, line: 123, column: 1)
!326 = !DILocation(line: 157, column: 1, scope: !321)
!327 = !DILocation(line: 125, column: 15, scope: !325)
!328 = !DILocalVariable(name: "beat", scope: !325, file: !104, line: 125, type: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ticker", file: !104, line: 28, size: 576, align: 8, elements: !331)
!331 = !{!332, !333}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "C", file: !104, line: 28, baseType: !201, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !104, line: 28, baseType: !334, size: 512, align: 64, offset: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.runtimeTimer", file: !104, line: 28, size: 512, align: 8, elements: !335)
!335 = !{!336, !337, !338, !340, !341, !352, !353}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tb", file: !104, line: 28, baseType: !119, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "i", file: !104, line: 28, baseType: !13, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !104, line: 28, baseType: !339, size: 64, align: 64, offset: 128)
!339 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !104, line: 28, baseType: !339, size: 64, align: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !104, line: 28, baseType: !342, size: 64, align: 64, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !104, line: 28, size: 64, align: 8, elements: !344)
!344 = !{!345}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !104, line: 28, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!78, !349, !119}
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !112, size: 128, align: 8, elements: !350)
!350 = !{!114, !351}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !112, line: 1, baseType: !134, size: 64, align: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !104, line: 28, baseType: !349, size: 128, align: 64, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !104, line: 28, baseType: !119, size: 64, align: 64, offset: 448)
!354 = !DILocation(line: 125, column: 2, scope: !321)
!355 = !DILocation(line: 126, column: 2, scope: !325)
!356 = !DILocation(line: 128, column: 10, scope: !325)
!357 = !DILocalVariable(name: "dead", scope: !325, file: !104, line: 128, type: !358)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Int,int,int}", file: !112, size: 192, align: 8, elements: !359)
!359 = !{!360, !167, !168}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !112, line: 1, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!362 = !DILocation(line: 128, column: 2, scope: !321)
!363 = !DILocalVariable(name: "errc", scope: !325, file: !104, line: 130, type: !201)
!364 = !DILocation(line: 130, column: 6, scope: !321)
!365 = !DILocation(line: 133, column: 18, scope: !325)
!366 = !DILocation(line: 133, column: 3, scope: !325)
!367 = !DILocation(line: 136, column: 14, scope: !325)
!368 = !DILocation(line: 136, column: 3, scope: !325)
!369 = !DILocation(line: 132, column: 3, scope: !325)
!370 = !DILocation(line: 0, scope: !325)
!371 = !DILocation(line: 131, column: 11, scope: !325)
!372 = !DILocation(line: 138, column: 10, scope: !325)
!373 = !DILocation(line: 139, column: 5, scope: !325)
!374 = !DILocation(line: 140, column: 15, scope: !325)
!375 = !DILocalVariable(name: "m", scope: !376, file: !104, line: 141, type: !19)
!376 = distinct !DILexicalBlock(scope: !325, file: !104, line: 141, column: 4)
!377 = !DILocation(line: 141, column: 8, scope: !325)
!378 = !DILocation(line: 141, column: 4, scope: !376)
!379 = !DILocation(line: 142, column: 9, scope: !376)
!380 = !DILocation(line: 142, column: 16, scope: !376)
!381 = !DILocation(line: 142, column: 14, scope: !376)
!382 = !DILocation(line: 142, column: 26, scope: !376)
!383 = !DILocation(line: 142, column: 22, scope: !376)
!384 = !DILocation(line: 143, column: 27, scope: !376)
!385 = !DILocation(line: 143, column: 13, scope: !376)
!386 = !DILocation(line: 143, column: 11, scope: !376)
!387 = !DILocation(line: 0, scope: !376)
!388 = !DILocation(line: 146, column: 10, scope: !325)
!389 = !DILocation(line: 149, column: 10, scope: !325)
!390 = !DILocation(line: 150, column: 4, scope: !391)
!391 = distinct !DILexicalBlock(scope: !325, file: !104, line: 150, column: 4)
!392 = !DILocalVariable(name: "id", scope: !391, file: !104, line: 150, type: !23)
!393 = !DILocation(line: 150, column: 8, scope: !325)
!394 = !DILocation(line: 151, column: 6, scope: !391)
!395 = !DILocation(line: 151, column: 11, scope: !391)
!396 = !DILocation(line: 156, column: 7, scope: !325)
!397 = distinct !DISubprogram(name: "heart.New", linkageName: "command_line_arguments.New", scope: null, file: !104, line: 52, type: !398, isLocal: false, isDefinition: true, scopeLine: 52, isOptimized: false, unit: !1, retainedNodes: !3)
!398 = !DISubroutineType(types: !399)
!399 = !{!175, !181, !13, !184}
!400 = !DILocalVariable(name: "beat", arg: 1, scope: !397, file: !104, line: 52, type: !181)
!401 = !DILocation(line: 52, column: 10, scope: !397)
!402 = !DILocalVariable(name: "kill", arg: 2, scope: !397, file: !104, line: 52, type: !13)
!403 = !DILocation(line: 52, column: 30, scope: !397)
!404 = !DILocalVariable(name: "handler", arg: 3, scope: !397, file: !104, line: 52, type: !184)
!405 = !DILocation(line: 52, column: 40, scope: !397)
!406 = !DILocalVariable(name: "$ret4", scope: !397, file: !104, line: 52, type: !175)
!407 = !DILocation(line: 52, column: 58, scope: !397)
!408 = !DILocation(line: 58, column: 9, scope: !397)
!409 = !DILocation(line: 54, column: 9, scope: !397)
!410 = !DILocation(line: 53, column: 9, scope: !397)
!411 = !DILocation(line: 53, column: 10, scope: !397)
!412 = !DILocation(line: 53, column: 2, scope: !397)
