; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22pool\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22queue\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/project-iris/iris/container/queue\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/project-iris/iris/container/queue\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22sync\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22sync\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22sync\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22pool\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./thread.go", directory: "/home/wangcong/go_path/src/github.com/project-iris/iris/pool")
!3 = !{}
!4 = !{!5, !81}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.ErrTerminating", linkageName: "command_line_arguments.ErrTerminating", scope: !1, file: !7, line: 32, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "thread.go", directory: ".")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !9, line: 1, size: 128, align: 8, elements: !10)
!9 = !DIFile(filename: "<built-in>", directory: "")
!10 = !{!11, !80}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !9, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !14, size: 128, align: 8, elements: !15)
!14 = !DIFile(filename: "", directory: "")
!15 = !{!16, !76}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 1, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !9, line: 1, size: 576, align: 8, elements: !19)
!19 = !{!20, !22, !23, !25, !27, !28, !29, !39, !48, !50, !57, !75}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !9, line: 1, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !9, line: 1, baseType: !21, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !9, line: 1, baseType: !24, size: 32, align: 32, offset: 128)
!24 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !9, line: 1, baseType: !26, size: 8, align: 8, offset: 160)
!26 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !9, line: 1, baseType: !26, size: 8, align: 8, offset: 168)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !9, line: 1, baseType: !26, size: 8, align: 8, offset: 176)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !9, line: 1, baseType: !30, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !9, line: 1, size: 64, align: 8, elements: !32)
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !9, line: 1, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{!21, !37, !21}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIBasicType(name: "void")
!39 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !9, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !9, line: 1, size: 64, align: 8, elements: !42)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !9, line: 1, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !37, !37}
!47 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !9, line: 1, baseType: !49, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !9, line: 1, baseType: !51, size: 64, align: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !9, line: 1, size: 128, align: 8, elements: !53)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !9, line: 1, baseType: !49, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !9, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !9, line: 1, baseType: !58, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !9, line: 1, size: 320, align: 8, elements: !60)
!60 = !{!61, !62, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !9, line: 1, baseType: !51, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !9, line: 1, baseType: !51, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !9, line: 1, baseType: !64, size: 192, align: 64, offset: 128)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !14, size: 192, align: 8, elements: !65)
!65 = !{!66, !73, !74}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !9, line: 1, size: 320, align: 8, elements: !69)
!69 = !{!61, !62, !70, !71, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !14, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !14, line: 1, baseType: !56, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !14, line: 1, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!52, !37}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !9, line: 1, type: !24, isLocal: false, isDefinition: true)
!83 = distinct !DISubprogram(name: "pool.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 23, type: !84, isLocal: false, isDefinition: true, scopeLine: 23, isOptimized: false, unit: !1, retainedNodes: !3)
!84 = !DISubroutineType(types: !85)
!85 = !{!38}
!86 = !DILocation(line: 1, column: 1, scope: !87)
!87 = !DILexicalBlockFile(scope: !83, file: !9, discriminator: 0)
!88 = !DILocation(line: 32, column: 29, scope: !89)
!89 = !DILexicalBlockFile(scope: !83, file: !7, discriminator: 0)
!90 = !DILocation(line: 32, column: 5, scope: !89)
!91 = distinct !DISubprogram(name: "pool.command_line_arguments.ThreadPool..hash", linkageName: "command_line_arguments.command_line_arguments.ThreadPool..hash", scope: null, file: !9, line: 1, type: !35, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!92 = !DILocalVariable(name: "key", arg: 1, scope: !91, file: !9, line: 1, type: !37)
!93 = !DILocation(line: 1, column: 1, scope: !91)
!94 = !DILocalVariable(name: "seed", arg: 2, scope: !91, file: !9, line: 1, type: !21)
!95 = !DILocalVariable(name: "$ret8", scope: !91, file: !9, line: 1, type: !21)
!96 = distinct !DISubprogram(name: "pool.command_line_arguments.ThreadPool..eq", linkageName: "command_line_arguments.command_line_arguments.ThreadPool..eq", scope: null, file: !9, line: 1, type: !45, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!97 = !DILocalVariable(name: "key1", arg: 1, scope: !96, file: !9, line: 1, type: !37)
!98 = !DILocation(line: 1, column: 1, scope: !96)
!99 = !DILocalVariable(name: "key2", arg: 2, scope: !96, file: !9, line: 1, type: !37)
!100 = !DILocalVariable(name: "$ret9", scope: !96, file: !9, line: 1, type: !47)
!101 = distinct !DISubprogram(name: "pool.Clear..1command_line_arguments.ThreadPool", linkageName: "command_line_arguments.ThreadPool.Clear", scope: null, file: !7, line: 115, type: !102, isLocal: false, isDefinition: true, scopeLine: 115, isOptimized: false, unit: !1, retainedNodes: !3)
!102 = !DISubroutineType(types: !103)
!103 = !{!38, !104, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadPool", file: !7, line: 39, size: 384, align: 8, elements: !106)
!106 = !{!107, !129, !130, !131, !132, !133, !139}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", file: !7, line: 40, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "Queue", file: !7, line: 29, size: 832, align: 8, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !127, !128}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tailIdx", file: !7, line: 29, baseType: !56, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "headIdx", file: !7, line: 29, baseType: !56, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tailOff", file: !7, line: 29, baseType: !56, size: 64, align: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "headOff", file: !7, line: 29, baseType: !56, size: 64, align: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", file: !7, line: 29, baseType: !116, size: 192, align: 64, offset: 256)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*struct{*_type,*void},int,int},int,int}", file: !14, size: 192, align: 8, elements: !117)
!117 = !{!118, !73, !74}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*void},int,int}", file: !14, size: 192, align: 8, elements: !121)
!121 = !{!122, !73, !74}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !14, size: 128, align: 8, elements: !125)
!125 = !{!16, !126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !14, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !7, line: 29, baseType: !120, size: 192, align: 64, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !7, line: 29, baseType: !120, size: 192, align: 64, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "idle", file: !7, line: 42, baseType: !56, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "total", file: !7, line: 43, baseType: !56, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "start", file: !7, line: 45, baseType: !47, size: 8, align: 8, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "quit", file: !7, line: 46, baseType: !47, size: 8, align: 8, offset: 200)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !7, line: 48, baseType: !134, size: 64, align: 32, offset: 224)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 27, size: 64, align: 8, elements: !135)
!135 = !{!136, !138}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 27, baseType: !137, size: 32, align: 32)
!137 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 27, baseType: !24, size: 32, align: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "done", file: !7, line: 49, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cond", file: !7, line: 27, size: 448, align: 8, elements: !142)
!142 = !{!143, !145, !159, !167}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "noCopy", file: !7, line: 27, baseType: !144, align: 8)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: ".sync.noCopy", file: !7, line: 27, align: 8, elements: !3)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "L", file: !7, line: 27, baseType: !146, size: 128, align: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "Locker", file: !7, line: 27, size: 128, align: 8, elements: !147)
!147 = !{!148, !158}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 27, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void}", file: !14, size: 192, align: 8, elements: !151)
!151 = !{!152, !153, !157}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 27, baseType: !17, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", file: !14, line: 27, baseType: !154, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!38, !37}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Unlock", file: !14, line: 27, baseType: !154, size: 64, align: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "notify", file: !7, line: 27, baseType: !160, size: 256, align: 64, offset: 128)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: ".sync.notifyList", file: !7, line: 27, size: 256, align: 8, elements: !161)
!161 = !{!162, !163, !164, !165, !166}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "wait", file: !7, line: 27, baseType: !24, size: 32, align: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "notify", file: !7, line: 27, baseType: !24, size: 32, align: 32, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !7, line: 27, baseType: !21, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !7, line: 27, baseType: !37, size: 64, align: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !7, line: 27, baseType: !37, size: 64, align: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "checker", file: !7, line: 27, baseType: !168, size: 64, align: 64, offset: 384)
!168 = !DIBasicType(name: ".sync.copyChecker", size: 64, encoding: DW_ATE_unsigned)
!169 = !DILocalVariable(name: "t", arg: 1, scope: !101, file: !7, line: 115, type: !104)
!170 = !DILocation(line: 115, column: 1, scope: !101)
!171 = !DILocation(line: 116, column: 3, scope: !101)
!172 = !DILocation(line: 120, column: 1, scope: !101)
!173 = !DILocation(line: 116, column: 9, scope: !101)
!174 = !DILocation(line: 117, column: 9, scope: !101)
!175 = !DILocation(line: 117, column: 2, scope: !101)
!176 = !DILocation(line: 119, column: 3, scope: !101)
!177 = !DILocation(line: 119, column: 9, scope: !101)
!178 = distinct !DISubprogram(name: "pool.Schedule..1command_line_arguments.ThreadPool", linkageName: "command_line_arguments.ThreadPool.Schedule", scope: null, file: !7, line: 96, type: !179, isLocal: false, isDefinition: true, scopeLine: 96, isOptimized: false, unit: !1, retainedNodes: !3)
!179 = !DISubroutineType(types: !180)
!180 = !{!8, !104, !104, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 35, size: 64, align: 8, elements: !183)
!183 = !{!184}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 35, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!186 = !DILocalVariable(name: "t", arg: 1, scope: !178, file: !7, line: 96, type: !104)
!187 = !DILocation(line: 96, column: 1, scope: !178)
!188 = !DILocalVariable(name: "task", arg: 2, scope: !178, file: !7, line: 96, type: !181)
!189 = !DILocation(line: 96, column: 31, scope: !178)
!190 = !DILocalVariable(name: "$ret1", scope: !178, file: !7, line: 96, type: !8)
!191 = !DILocation(line: 96, column: 42, scope: !178)
!192 = !DILocation(line: 97, column: 3, scope: !178)
!193 = !DILocation(line: 112, column: 1, scope: !178)
!194 = !DILocation(line: 97, column: 9, scope: !178)
!195 = !DILocation(line: 98, column: 9, scope: !178)
!196 = !DILocation(line: 98, column: 2, scope: !178)
!197 = !DILocation(line: 101, column: 6, scope: !178)
!198 = !DILocation(line: 101, column: 2, scope: !178)
!199 = !DILocation(line: 102, column: 3, scope: !178)
!200 = !DILocation(line: 105, column: 6, scope: !178)
!201 = !DILocation(line: 105, column: 13, scope: !178)
!202 = !DILocation(line: 105, column: 2, scope: !178)
!203 = !DILocation(line: 105, column: 17, scope: !178)
!204 = !DILocation(line: 105, column: 23, scope: !178)
!205 = !DILocation(line: 106, column: 4, scope: !178)
!206 = !DILocation(line: 107, column: 3, scope: !178)
!207 = !DILocation(line: 109, column: 4, scope: !178)
!208 = !DILocation(line: 109, column: 16, scope: !178)
!209 = !DILocation(line: 109, column: 10, scope: !178)
!210 = distinct !DISubprogram(name: "pool.Start..1command_line_arguments.ThreadPool", linkageName: "command_line_arguments.ThreadPool.Start", scope: null, file: !7, line: 64, type: !102, isLocal: false, isDefinition: true, scopeLine: 64, isOptimized: false, unit: !1, retainedNodes: !3)
!211 = !DILocalVariable(name: "t", arg: 1, scope: !210, file: !7, line: 64, type: !104)
!212 = !DILocation(line: 64, column: 1, scope: !210)
!213 = !DILocation(line: 65, column: 3, scope: !210)
!214 = !DILocation(line: 75, column: 1, scope: !210)
!215 = !DILocation(line: 65, column: 9, scope: !210)
!216 = !DILocation(line: 66, column: 9, scope: !210)
!217 = !DILocation(line: 66, column: 2, scope: !210)
!218 = !DILocation(line: 68, column: 7, scope: !210)
!219 = !DILocation(line: 68, column: 5, scope: !210)
!220 = !DILocalVariable(name: "i", scope: !221, file: !7, line: 69, type: !56)
!221 = distinct !DILexicalBlock(scope: !210, file: !7, line: 69, column: 3)
!222 = !DILocation(line: 69, column: 7, scope: !210)
!223 = !DILocation(line: 69, column: 20, scope: !221)
!224 = !DILocation(line: 69, column: 17, scope: !221)
!225 = !DILocation(line: 70, column: 5, scope: !221)
!226 = !DILocation(line: 71, column: 17, scope: !221)
!227 = !DILocation(line: 71, column: 23, scope: !221)
!228 = !DILocation(line: 71, column: 29, scope: !221)
!229 = !DILocation(line: 71, column: 4, scope: !221)
!230 = !DILocation(line: 69, column: 48, scope: !221)
!231 = !DILocation(line: 69, column: 30, scope: !221)
!232 = !DILocation(line: 69, column: 32, scope: !221)
!233 = !DILocation(line: 69, column: 38, scope: !221)
!234 = !DILocation(line: 73, column: 4, scope: !210)
!235 = !DILocation(line: 73, column: 11, scope: !210)
!236 = distinct !DISubprogram(name: "pool.Terminate..1command_line_arguments.ThreadPool", linkageName: "command_line_arguments.ThreadPool.Terminate", scope: null, file: !7, line: 79, type: !237, isLocal: false, isDefinition: true, scopeLine: 79, isOptimized: false, unit: !1, retainedNodes: !3)
!237 = !DISubroutineType(types: !238)
!238 = !{!38, !104, !104, !47}
!239 = !DILocalVariable(name: "t", arg: 1, scope: !236, file: !7, line: 79, type: !104)
!240 = !DILocation(line: 79, column: 1, scope: !236)
!241 = !DILocalVariable(name: "clear", arg: 2, scope: !236, file: !7, line: 79, type: !47)
!242 = !DILocation(line: 79, column: 32, scope: !236)
!243 = !DILocation(line: 80, column: 3, scope: !236)
!244 = !DILocation(line: 93, column: 1, scope: !236)
!245 = !DILocation(line: 80, column: 9, scope: !236)
!246 = !DILocation(line: 81, column: 9, scope: !236)
!247 = !DILocation(line: 81, column: 2, scope: !236)
!248 = !DILocation(line: 83, column: 3, scope: !236)
!249 = !DILocation(line: 83, column: 9, scope: !236)
!250 = !DILocation(line: 84, column: 2, scope: !236)
!251 = !DILocation(line: 85, column: 4, scope: !236)
!252 = !DILocation(line: 85, column: 10, scope: !236)
!253 = !DILocation(line: 89, column: 4, scope: !236)
!254 = !DILocation(line: 89, column: 9, scope: !236)
!255 = !DILocation(line: 88, column: 7, scope: !236)
!256 = !DILocation(line: 88, column: 16, scope: !236)
!257 = !DILocation(line: 88, column: 13, scope: !236)
!258 = !DILocation(line: 92, column: 3, scope: !236)
!259 = !DILocation(line: 92, column: 10, scope: !236)
!260 = distinct !DISubprogram(name: "pool.next..1command_line_arguments.ThreadPool", linkageName: "command_line_arguments.ThreadPool.next", scope: null, file: !7, line: 146, type: !261, isLocal: false, isDefinition: true, scopeLine: 146, isOptimized: false, unit: !1, retainedNodes: !3)
!261 = !DISubroutineType(types: !262)
!262 = !{!181, !104, !104}
!263 = !DILocalVariable(name: "t", arg: 1, scope: !260, file: !7, line: 146, type: !104)
!264 = !DILocation(line: 146, column: 1, scope: !260)
!265 = !DILocalVariable(name: "$ret2", scope: !260, file: !7, line: 146, type: !181)
!266 = !DILocation(line: 146, column: 29, scope: !260)
!267 = !DILocation(line: 147, column: 3, scope: !260)
!268 = !DILocation(line: 154, column: 1, scope: !260)
!269 = !DILocation(line: 147, column: 9, scope: !260)
!270 = !DILocation(line: 148, column: 9, scope: !260)
!271 = !DILocation(line: 148, column: 2, scope: !260)
!272 = !DILocation(line: 150, column: 6, scope: !260)
!273 = !DILocation(line: 150, column: 12, scope: !260)
!274 = !DILocation(line: 150, column: 2, scope: !260)
!275 = !DILocation(line: 153, column: 10, scope: !260)
!276 = !DILocation(line: 153, column: 16, scope: !260)
!277 = !DILocation(line: 153, column: 22, scope: !260)
!278 = !DILocation(line: 151, column: 3, scope: !260)
!279 = distinct !DISubprogram(name: "pool.runner..1command_line_arguments.ThreadPool", linkageName: "command_line_arguments.ThreadPool.runner", scope: null, file: !7, line: 123, type: !280, isLocal: false, isDefinition: true, scopeLine: 123, isOptimized: false, unit: !1, retainedNodes: !3)
!280 = !DISubroutineType(types: !281)
!281 = !{!38, !104, !104, !181}
!282 = !DILocalVariable(name: "t", arg: 1, scope: !279, file: !7, line: 123, type: !104)
!283 = !DILocation(line: 123, column: 1, scope: !279)
!284 = !DILocalVariable(name: "task", arg: 2, scope: !279, file: !7, line: 123, type: !181)
!285 = !DILocation(line: 123, column: 29, scope: !279)
!286 = !DILocation(line: 125, column: 8, scope: !279)
!287 = !DILocation(line: 125, column: 2, scope: !279)
!288 = !DILocation(line: 143, column: 1, scope: !279)
!289 = !DILocation(line: 140, column: 13, scope: !279)
!290 = !DILocation(line: 140, column: 28, scope: !279)
!291 = !DILocation(line: 140, column: 29, scope: !279)
!292 = !DILocation(line: 141, column: 3, scope: !279)
!293 = distinct !DISubprogram(name: "pool.NewThreadPool", linkageName: "command_line_arguments.NewThreadPool", scope: null, file: !7, line: 53, type: !294, isLocal: false, isDefinition: true, scopeLine: 53, isOptimized: false, unit: !1, retainedNodes: !3)
!294 = !DISubroutineType(types: !295)
!295 = !{!104, !56}
!296 = !DILocalVariable(name: "cap", arg: 1, scope: !293, file: !7, line: 53, type: !56)
!297 = !DILocation(line: 53, column: 20, scope: !293)
!298 = !DILocalVariable(name: "$ret0", scope: !293, file: !7, line: 53, type: !104)
!299 = !DILocation(line: 53, column: 29, scope: !293)
!300 = !DILocation(line: 55, column: 16, scope: !301)
!301 = distinct !DILexicalBlock(scope: !293, file: !7, line: 53, column: 1)
!302 = !DILocation(line: 54, column: 7, scope: !301)
!303 = !DILocation(line: 54, column: 8, scope: !301)
!304 = !DILocalVariable(name: "t", scope: !301, file: !7, line: 54, type: !104)
!305 = !DILocation(line: 54, column: 2, scope: !293)
!306 = !DILocation(line: 59, column: 26, scope: !301)
!307 = !DILocation(line: 59, column: 24, scope: !301)
!308 = !DILocation(line: 59, column: 16, scope: !301)
!309 = !DILocation(line: 59, column: 3, scope: !301)
!310 = !DILocation(line: 59, column: 9, scope: !301)
!311 = !DILocation(line: 60, column: 2, scope: !301)
!312 = distinct !DISubprogram(name: "pool.command_line_arguments..thunk0", scope: null, file: !7, line: 66, type: !313, isLocal: true, isDefinition: true, scopeLine: 66, isOptimized: false, unit: !1, retainedNodes: !3)
!313 = !DISubroutineType(types: !314)
!314 = !{!47, !315}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Mutex}", file: !14, size: 64, align: 8, elements: !317)
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !14, line: 66, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!320 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !312, file: !7, line: 66, type: !315)
!321 = !DILocation(line: 66, column: 2, scope: !312)
!322 = !DILocalVariable(name: "$ret3", scope: !312, file: !7, line: 66, type: !47)
!323 = distinct !DISubprogram(name: "pool.command_line_arguments..thunk1", scope: null, file: !7, line: 71, type: !324, isLocal: true, isDefinition: true, scopeLine: 71, isOptimized: false, unit: !1, retainedNodes: !3)
!324 = !DISubroutineType(types: !325)
!325 = !{!38, !326}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ThreadPool,Task}", file: !14, size: 128, align: 8, elements: !328)
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !14, line: 71, baseType: !104, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "a1", file: !14, line: 71, baseType: !181, size: 64, align: 64, offset: 64)
!331 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !323, file: !7, line: 71, type: !326)
!332 = !DILocation(line: 71, column: 4, scope: !323)
!333 = distinct !DISubprogram(name: "pool.command_line_arguments..thunk2", scope: null, file: !7, line: 81, type: !313, isLocal: true, isDefinition: true, scopeLine: 81, isOptimized: false, unit: !1, retainedNodes: !3)
!334 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !333, file: !7, line: 81, type: !315)
!335 = !DILocation(line: 81, column: 2, scope: !333)
!336 = !DILocalVariable(name: "$ret4", scope: !333, file: !7, line: 81, type: !47)
!337 = distinct !DISubprogram(name: "pool.command_line_arguments..thunk3", scope: null, file: !7, line: 98, type: !313, isLocal: true, isDefinition: true, scopeLine: 98, isOptimized: false, unit: !1, retainedNodes: !3)
!338 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !337, file: !7, line: 98, type: !315)
!339 = !DILocation(line: 98, column: 2, scope: !337)
!340 = !DILocalVariable(name: "$ret5", scope: !337, file: !7, line: 98, type: !47)
!341 = distinct !DISubprogram(name: "pool.command_line_arguments..thunk4", scope: null, file: !7, line: 107, type: !324, isLocal: true, isDefinition: true, scopeLine: 107, isOptimized: false, unit: !1, retainedNodes: !3)
!342 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !341, file: !7, line: 107, type: !326)
!343 = !DILocation(line: 107, column: 3, scope: !341)
!344 = distinct !DISubprogram(name: "pool.command_line_arguments..thunk5", scope: null, file: !7, line: 117, type: !313, isLocal: true, isDefinition: true, scopeLine: 117, isOptimized: false, unit: !1, retainedNodes: !3)
!345 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !344, file: !7, line: 117, type: !315)
!346 = !DILocation(line: 117, column: 2, scope: !344)
!347 = !DILocalVariable(name: "$ret6", scope: !344, file: !7, line: 117, type: !47)
!348 = distinct !DISubprogram(name: "pool.func1", scope: null, file: !7, line: 125, type: !84, isLocal: true, isDefinition: true, scopeLine: 125, isOptimized: false, unit: !1, retainedNodes: !3)
!349 = !DILocation(line: 126, column: 3, scope: !348)
!350 = !DILocation(line: 126, column: 4, scope: !348)
!351 = !DILocation(line: 126, column: 10, scope: !348)
!352 = !DILocation(line: 131, column: 6, scope: !348)
!353 = !DILocation(line: 131, column: 7, scope: !348)
!354 = !DILocation(line: 131, column: 13, scope: !348)
!355 = !DILocation(line: 131, column: 3, scope: !348)
!356 = !DILocation(line: 0, scope: !348)
!357 = !DILocation(line: 136, column: 3, scope: !348)
!358 = !DILocation(line: 136, column: 4, scope: !348)
!359 = !DILocation(line: 132, column: 5, scope: !348)
!360 = !DILocation(line: 134, column: 17, scope: !348)
!361 = !DILocation(line: 134, column: 23, scope: !348)
!362 = !DILocation(line: 134, column: 29, scope: !348)
!363 = !DILocation(line: 134, column: 4, scope: !348)
!364 = !DILocation(line: 134, column: 7, scope: !348)
!365 = !DILocation(line: 136, column: 10, scope: !348)
!366 = !DILocation(line: 137, column: 3, scope: !348)
!367 = !DILocation(line: 137, column: 4, scope: !348)
!368 = !DILocation(line: 137, column: 9, scope: !348)
!369 = distinct !DISubprogram(name: "pool.command_line_arguments..thunk6", scope: null, file: !7, line: 125, type: !370, isLocal: true, isDefinition: true, scopeLine: 125, isOptimized: false, unit: !1, retainedNodes: !3)
!370 = !DISubroutineType(types: !371)
!371 = !{!38, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*__go_descriptor}", file: !14, size: 64, align: 8, elements: !374)
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !14, line: 125, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
