; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22cipher\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/cipher\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/cipher\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22rand\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/rand\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/rand\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22config\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/project-iris/iris/config\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/project-iris/iris/config\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22io\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22io\22"
module asm "\09.ascii \22 \5C\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./proto.go", directory: "/home/wangcong/go_path/src/github.com/project-iris/iris/proto")
!3 = !{}
!4 = !{!5, !9, !102, !130}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "github_com_project_iris_iris_config.PacketCipherBits", linkageName: "github_com_project_iris_iris_config.PacketCipherBits", scope: !1, file: !7, line: 28, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "proto.go", directory: ".")
!8 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "crypto_rand.Reader", linkageName: "crypto_rand.Reader", scope: !1, file: !7, line: 25, type: !11, isLocal: false, isDefinition: true)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !7, line: 24, size: 128, align: 8, elements: !12)
!12 = !{!13, !101}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 24, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !16, size: 128, align: 8, elements: !17)
!16 = !DIFile(filename: "", directory: "")
!17 = !{!18, !78}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 24, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !21, line: 1, size: 576, align: 8, elements: !22)
!21 = !DIFile(filename: "<built-in>", directory: "")
!22 = !{!23, !25, !26, !28, !30, !31, !32, !42, !51, !53, !59, !77}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !21, line: 1, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !21, line: 1, baseType: !24, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !21, line: 1, baseType: !27, size: 32, align: 32, offset: 128)
!27 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !21, line: 1, baseType: !29, size: 8, align: 8, offset: 160)
!29 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !21, line: 1, baseType: !29, size: 8, align: 8, offset: 168)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !21, line: 1, baseType: !29, size: 8, align: 8, offset: 176)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !21, line: 1, baseType: !33, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !21, line: 1, size: 64, align: 8, elements: !35)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !21, line: 1, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!24, !40, !24}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "void")
!42 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !21, line: 1, baseType: !43, size: 64, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !21, line: 1, size: 64, align: 8, elements: !45)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !21, line: 1, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !40, !40}
!50 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !21, line: 1, baseType: !52, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !21, line: 1, baseType: !54, size: 64, align: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !21, line: 1, size: 128, align: 8, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !21, line: 1, baseType: !52, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !21, line: 1, baseType: !8, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !21, line: 1, baseType: !60, size: 64, align: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !21, line: 1, size: 320, align: 8, elements: !62)
!62 = !{!63, !64, !65}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !21, line: 1, baseType: !54, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !21, line: 1, baseType: !54, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !21, line: 1, baseType: !66, size: 192, align: 64, offset: 128)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !16, size: 192, align: 8, elements: !67)
!67 = !{!68, !75, !76}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !21, line: 1, size: 320, align: 8, elements: !71)
!71 = !{!63, !64, !72, !73, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !21, line: 1, baseType: !40, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !21, line: 1, baseType: !40, size: 64, align: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !21, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !16, line: 1, baseType: !8, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !16, line: 1, baseType: !8, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !21, line: 1, baseType: !40, size: 64, align: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !16, line: 24, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!82, !40, !98}
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !16, size: 192, align: 8, elements: !83)
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !16, line: 24, baseType: !8, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !16, line: 24, baseType: !86, size: 128, align: 64, offset: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !21, line: 1, size: 128, align: 8, elements: !87)
!87 = !{!88, !97}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !21, line: 1, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !16, size: 128, align: 8, elements: !91)
!91 = !{!92, !93}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 1, baseType: !19, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !16, line: 1, baseType: !94, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!55, !40}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !21, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !16, size: 192, align: 8, elements: !99)
!99 = !{!100, !75, !76}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !52, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "github_com_project_iris_iris_config.PacketCipher", linkageName: "github_com_project_iris_iris_config.PacketCipher", scope: !1, file: !7, line: 28, type: !104, isLocal: false, isDefinition: true)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 28, size: 64, align: 8, elements: !106)
!106 = !{!107}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 28, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!111, !98}
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Block,error}", file: !16, size: 256, align: 8, elements: !112)
!112 = !{!113, !129}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 28, baseType: !114, size: 128, align: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "Block", file: !7, line: 24, size: 128, align: 8, elements: !115)
!115 = !{!116, !101}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 24, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,struct{*uint8,int,int},struct{*uint8,int,int})void,*func(*void,struct{*uint8,int,int},struct{*uint8,int,int})void}", file: !16, size: 256, align: 8, elements: !119)
!119 = !{!18, !120, !124, !128}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "BlockSize", file: !16, line: 24, baseType: !121, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!8, !40}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Decrypt", file: !16, line: 24, baseType: !125, size: 64, align: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!41, !40, !98, !98}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Encrypt", file: !16, line: 24, baseType: !125, size: 64, align: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 28, baseType: !86, size: 128, align: 64, offset: 128)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !21, line: 1, type: !27, isLocal: false, isDefinition: true)
!132 = distinct !DISubprogram(name: "proto.Decrypt..1command_line_arguments.Message", linkageName: "command_line_arguments.Message.Decrypt", scope: null, file: !7, line: 74, type: !133, isLocal: false, isDefinition: true, scopeLine: 74, isOptimized: false, unit: !1, retainedNodes: !3)
!133 = !DISubroutineType(types: !134)
!134 = !{!86, !135, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !7, line: 39, size: 768, align: 8, elements: !137)
!137 = !{!138, !147, !148}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "Head", file: !7, line: 40, baseType: !139, size: 512, align: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "Header", file: !7, line: 32, size: 512, align: 8, elements: !140)
!140 = !{!141, !145, !146}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Meta", file: !7, line: 33, baseType: !142, size: 128, align: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !16, size: 128, align: 8, elements: !143)
!143 = !{!92, !144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !16, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !7, line: 34, baseType: !98, size: 192, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Iv", file: !7, line: 35, baseType: !98, size: 192, align: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Data", file: !7, line: 41, baseType: !98, size: 192, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "secure", file: !7, line: 43, baseType: !50, size: 8, align: 8, offset: 704)
!149 = !DILocalVariable(name: "m", arg: 1, scope: !132, file: !7, line: 74, type: !135)
!150 = !DILocation(line: 74, column: 1, scope: !132)
!151 = !DILocation(line: 76, column: 23, scope: !152)
!152 = distinct !DILexicalBlock(scope: !132, file: !7, line: 74, column: 1)
!153 = !DILocation(line: 76, column: 37, scope: !152)
!154 = !DILocation(line: 76, column: 42, scope: !152)
!155 = !DILocalVariable(name: "err", scope: !152, file: !7, line: 76, type: !86)
!156 = !DILocation(line: 76, column: 2, scope: !132)
!157 = !DILocation(line: 77, column: 9, scope: !152)
!158 = !DILocation(line: 78, column: 3, scope: !152)
!159 = !DILocalVariable(name: "$ret1", scope: !132, file: !7, line: 74, type: !86)
!160 = !DILocation(line: 74, column: 29, scope: !132)
!161 = !DILocalVariable(name: "block", scope: !152, file: !7, line: 76, type: !114)
!162 = !DILocation(line: 80, column: 39, scope: !152)
!163 = !DILocation(line: 80, column: 19, scope: !152)
!164 = !DILocalVariable(name: "stream", scope: !152, file: !7, line: 80, type: !165)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stream", file: !7, line: 24, size: 128, align: 8, elements: !166)
!166 = !{!167, !101}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 24, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int},struct{*uint8,int,int})void}", file: !16, size: 128, align: 8, elements: !170)
!170 = !{!18, !171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "XORKeyStream", file: !16, line: 24, baseType: !125, size: 64, align: 64, offset: 64)
!172 = !DILocation(line: 80, column: 2, scope: !132)
!173 = !DILocation(line: 83, column: 8, scope: !152)
!174 = !DILocation(line: 83, column: 23, scope: !152)
!175 = !DILocation(line: 84, column: 13, scope: !152)
!176 = !DILocation(line: 85, column: 12, scope: !152)
!177 = !DILocation(line: 86, column: 2, scope: !152)
!178 = distinct !DISubprogram(name: "proto.Encrypt..1command_line_arguments.Message", linkageName: "command_line_arguments.Message.Encrypt", scope: null, file: !7, line: 47, type: !133, isLocal: false, isDefinition: true, scopeLine: 47, isOptimized: false, unit: !1, retainedNodes: !3)
!179 = !DILocalVariable(name: "m", arg: 1, scope: !178, file: !7, line: 47, type: !135)
!180 = !DILocation(line: 47, column: 1, scope: !178)
!181 = !DILocation(line: 49, column: 29, scope: !182)
!182 = distinct !DILexicalBlock(scope: !178, file: !7, line: 47, column: 1)
!183 = !DILocation(line: 49, column: 45, scope: !182)
!184 = !DILocation(line: 49, column: 9, scope: !182)
!185 = !DILocation(line: 50, column: 18, scope: !186)
!186 = distinct !DILexicalBlock(scope: !182, file: !7, line: 50, column: 2)
!187 = !DILocalVariable(name: "key", scope: !182, file: !7, line: 49, type: !98)
!188 = !DILocation(line: 49, column: 2, scope: !178)
!189 = !DILocalVariable(name: "n", scope: !186, file: !7, line: 50, type: !8)
!190 = !DILocation(line: 50, column: 5, scope: !182)
!191 = !DILocalVariable(name: "err", scope: !186, file: !7, line: 50, type: !86)
!192 = !DILocation(line: 50, column: 55, scope: !186)
!193 = !DILocation(line: 50, column: 48, scope: !186)
!194 = !DILocation(line: 50, column: 67, scope: !186)
!195 = !DILocation(line: 51, column: 3, scope: !186)
!196 = !DILocalVariable(name: "$ret0", scope: !178, file: !7, line: 47, type: !86)
!197 = !DILocation(line: 47, column: 29, scope: !178)
!198 = !DILocation(line: 53, column: 23, scope: !182)
!199 = !DILocalVariable(name: "block", scope: !182, file: !7, line: 53, type: !114)
!200 = !DILocation(line: 53, column: 2, scope: !178)
!201 = !DILocalVariable(name: "err", scope: !182, file: !7, line: 53, type: !86)
!202 = !DILocation(line: 54, column: 9, scope: !182)
!203 = !DILocation(line: 55, column: 3, scope: !182)
!204 = !DILocation(line: 58, column: 26, scope: !182)
!205 = !DILocation(line: 58, column: 8, scope: !182)
!206 = !DILocation(line: 59, column: 18, scope: !207)
!207 = distinct !DILexicalBlock(scope: !182, file: !7, line: 59, column: 2)
!208 = !DILocalVariable(name: "iv", scope: !182, file: !7, line: 58, type: !98)
!209 = !DILocation(line: 58, column: 2, scope: !178)
!210 = !DILocalVariable(name: "n", scope: !207, file: !7, line: 59, type: !8)
!211 = !DILocation(line: 59, column: 5, scope: !182)
!212 = !DILocalVariable(name: "err", scope: !207, file: !7, line: 59, type: !86)
!213 = !DILocation(line: 59, column: 54, scope: !207)
!214 = !DILocation(line: 59, column: 47, scope: !207)
!215 = !DILocation(line: 59, column: 65, scope: !207)
!216 = !DILocation(line: 60, column: 3, scope: !207)
!217 = !DILocation(line: 62, column: 19, scope: !182)
!218 = !DILocation(line: 65, column: 23, scope: !182)
!219 = !DILocalVariable(name: "stream", scope: !182, file: !7, line: 62, type: !165)
!220 = !DILocation(line: 62, column: 2, scope: !178)
!221 = !DILocation(line: 65, column: 8, scope: !182)
!222 = !DILocation(line: 66, column: 8, scope: !182)
!223 = !DILocation(line: 66, column: 13, scope: !182)
!224 = !DILocation(line: 67, column: 8, scope: !182)
!225 = !DILocation(line: 67, column: 12, scope: !182)
!226 = !DILocation(line: 69, column: 3, scope: !182)
!227 = !DILocation(line: 69, column: 11, scope: !182)
!228 = !DILocation(line: 70, column: 2, scope: !182)
