; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22link\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22cipher\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/cipher\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/cipher\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22hmac\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/hmac\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/hmac\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22gob\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/gob\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/gob\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./link.go", directory: "/home/wangcong/go_path/src/github.com/project-iris/iris/proto/link")
!3 = !{}
!4 = !{!5, !9, !13, !116, !150}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "github_com_project_iris_iris_config.SessionCipherBits", linkageName: "github_com_project_iris_iris_config.SessionCipherBits", scope: !1, file: !11, line: 35, type: !12, isLocal: false, isDefinition: true)
!11 = !DIFile(filename: "link.go", directory: ".")
!12 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "github_com_project_iris_iris_config.SessionCipher", linkageName: "github_com_project_iris_iris_config.SessionCipher", scope: !1, file: !11, line: 35, type: !15, isLocal: false, isDefinition: true)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !11, line: 35, size: 64, align: 8, elements: !17)
!17 = !{!18}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !11, line: 35, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !98}
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Block,error}", file: !23, size: 256, align: 8, elements: !24)
!23 = !DIFile(filename: "", directory: "")
!24 = !{!25, !103}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !23, line: 35, baseType: !26, size: 128, align: 64)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "Block", file: !11, line: 24, size: 128, align: 8, elements: !27)
!27 = !{!28, !102}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 24, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,struct{*uint8,int,int},struct{*uint8,int,int})void,*func(*void,struct{*uint8,int,int},struct{*uint8,int,int})void}", file: !23, size: 256, align: 8, elements: !31)
!31 = !{!32, !90, !94, !101}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !23, line: 24, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !35)
!35 = !{!36, !38, !39, !40, !42, !43, !44, !54, !63, !65, !71, !89}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !37, size: 64, align: 64)
!37 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !41, size: 8, align: 8, offset: 160)
!41 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !41, size: 8, align: 8, offset: 168)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !41, size: 8, align: 8, offset: 176)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !45, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !47)
!47 = !{!48}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!37, !52, !37}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIBasicType(name: "void")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !55, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !57)
!57 = !{!58}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !52, !52}
!62 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !64, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !66, size: 64, align: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !64, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !72, size: 64, align: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !74)
!74 = !{!75, !76, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !66, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !66, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !78, size: 192, align: 64, offset: 128)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !23, size: 192, align: 8, elements: !79)
!79 = !{!80, !87, !88}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !23, line: 1, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !83)
!83 = !{!75, !76, !84, !85, !86}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !52, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !52, size: 64, align: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !52, size: 64, align: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !23, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !23, line: 1, baseType: !12, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !52, size: 64, align: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "BlockSize", file: !23, line: 24, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!12, !52}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Decrypt", file: !23, line: 24, baseType: !95, size: 64, align: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!53, !52, !98, !98}
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !23, size: 192, align: 8, elements: !99)
!99 = !{!100, !87, !88}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !23, line: 1, baseType: !64, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Encrypt", file: !23, line: 24, baseType: !95, size: 64, align: 64, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !11, line: 1, baseType: !52, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !23, line: 35, baseType: !104, size: 128, align: 64, offset: 128)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !105)
!105 = !{!106, !115}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !23, size: 128, align: 8, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !23, line: 1, baseType: !33, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !23, line: 1, baseType: !112, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!67, !52}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !52, size: 64, align: 64, offset: 64)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "github_com_project_iris_iris_config.SessionHash", linkageName: "github_com_project_iris_iris_config.SessionHash", scope: !1, file: !11, line: 35, type: !118, isLocal: false, isDefinition: true)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !11, line: 35, size: 64, align: 8, elements: !120)
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !11, line: 35, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!125}
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "Hash", file: !11, line: 25, size: 128, align: 8, elements: !126)
!126 = !{!127, !102}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 25, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void)void,*func(*void)int,*func(*void,struct{*uint8,int,int})struct{*uint8,int,int},*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !23, size: 384, align: 8, elements: !130)
!130 = !{!131, !132, !133, !137, !138, !142}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !23, line: 25, baseType: !33, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "BlockSize", file: !23, line: 25, baseType: !91, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", file: !23, line: 25, baseType: !134, size: 64, align: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!53, !52}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !23, line: 25, baseType: !91, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "Sum", file: !23, line: 25, baseType: !139, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!98, !52, !98}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !23, line: 25, baseType: !143, size: 64, align: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!146, !52, !98}
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !23, size: 192, align: 8, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !23, line: 23, baseType: !12, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !23, line: 23, baseType: !104, size: 128, align: 64, offset: 64)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "github_com_project_iris_iris_config.SessionGraceTimeout", linkageName: "github_com_project_iris_iris_config.SessionGraceTimeout", scope: !1, file: !11, line: 35, type: !152, isLocal: false, isDefinition: true)
!152 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!153 = distinct !DISubprogram(name: "link.command_line_arguments..init0", linkageName: "command_line_arguments.command_line_arguments..init0", scope: null, file: !11, line: 45, type: !154, isLocal: false, isDefinition: true, scopeLine: 45, isOptimized: false, unit: !1, retainedNodes: !3)
!154 = !DISubroutineType(types: !155)
!155 = !{!53}
!156 = !DILocation(line: 46, column: 15, scope: !153)
!157 = !DILocation(line: 46, column: 6, scope: !153)
!158 = distinct !DISubprogram(name: "link.Close..1command_line_arguments.Link", linkageName: "command_line_arguments.Link.Close", scope: null, file: !11, line: 144, type: !159, isLocal: false, isDefinition: true, scopeLine: 144, isOptimized: false, unit: !1, retainedNodes: !3)
!159 = !DISubroutineType(types: !160)
!160 = !{!104, !161, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "Link", file: !11, line: 52, size: 3008, align: 8, elements: !163)
!163 = !{!164, !339, !347, !348, !349, !350, !358, !359, !360, !361, !362, !363, !366, !367, !368}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "socket", file: !11, line: 53, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stream", file: !11, line: 37, size: 256, align: 8, elements: !167)
!167 = !{!168, !225, !263, !316}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "socket", file: !11, line: 37, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "TCPConn", file: !11, line: 32, size: 64, align: 8, elements: !171)
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "conn", file: !11, line: 32, baseType: !173, size: 64, align: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: ".net.conn", file: !11, line: 32, size: 64, align: 8, elements: !174)
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "fd", file: !11, line: 32, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: ".net.netFD", file: !11, line: 32, size: 960, align: 8, elements: !178)
!178 = !{!179, !210, !211, !212, !213, !214, !224}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !11, line: 32, baseType: !180, size: 384, align: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !11, line: 32, size: 384, align: 8, elements: !181)
!181 = !{!182, !189, !190, !194, !205, !206, !207, !208, !209}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !11, line: 32, baseType: !183, size: 128, align: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !11, line: 32, size: 128, align: 8, elements: !184)
!184 = !{!185, !187, !188}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !11, line: 32, baseType: !186, size: 64, align: 64)
!186 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !11, line: 32, baseType: !8, size: 32, align: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !11, line: 32, baseType: !8, size: 32, align: 32, offset: 96)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !11, line: 32, baseType: !12, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !11, line: 32, baseType: !191, size: 64, align: 64, offset: 192)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !11, line: 32, size: 64, align: 8, elements: !192)
!192 = !{!193}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !11, line: 32, baseType: !37, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !11, line: 32, baseType: !195, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !23, size: 192, align: 8, elements: !197)
!197 = !{!198, !87, !88}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !23, line: 1, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !11, line: 32, size: 128, align: 8, elements: !201)
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !11, line: 32, baseType: !64, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !11, line: 32, baseType: !204, size: 64, align: 64, offset: 64)
!204 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !11, line: 32, baseType: !8, size: 32, align: 32, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !11, line: 32, baseType: !62, size: 8, align: 8, offset: 352)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !11, line: 32, baseType: !62, size: 8, align: 8, offset: 360)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !11, line: 32, baseType: !62, size: 8, align: 8, offset: 368)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !11, line: 32, baseType: !62, size: 8, align: 8, offset: 376)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "family", file: !11, line: 32, baseType: !12, size: 64, align: 64, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sotype", file: !11, line: 32, baseType: !12, size: 64, align: 64, offset: 448)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "isConnected", file: !11, line: 32, baseType: !62, size: 8, align: 8, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "net", file: !11, line: 32, baseType: !67, size: 128, align: 64, offset: 576)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "laddr", file: !11, line: 32, baseType: !215, size: 128, align: 64, offset: 704)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "Addr", file: !11, line: 32, size: 128, align: 8, elements: !216)
!216 = !{!217, !102}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 32, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)string}", file: !23, size: 192, align: 8, elements: !220)
!220 = !{!221, !222, !223}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !23, line: 32, baseType: !33, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Network", file: !23, line: 32, baseType: !112, size: 64, align: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !23, line: 32, baseType: !112, size: 64, align: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "raddr", file: !11, line: 32, baseType: !215, size: 128, align: 64, offset: 832)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "buffers", file: !11, line: 37, baseType: !226, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriter", file: !11, line: 37, size: 128, align: 8, elements: !228)
!228 = !{!229, !248}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Reader", file: !11, line: 37, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !11, line: 37, size: 704, align: 8, elements: !232)
!232 = !{!233, !234, !243, !244, !245, !246, !247}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !11, line: 37, baseType: !98, size: 192, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "rd", file: !11, line: 37, baseType: !235, size: 128, align: 64, offset: 192)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !11, line: 23, size: 128, align: 8, elements: !236)
!236 = !{!237, !102}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 23, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !23, size: 128, align: 8, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !23, line: 23, baseType: !33, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !23, line: 23, baseType: !143, size: 64, align: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !11, line: 37, baseType: !12, size: 64, align: 64, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !11, line: 37, baseType: !12, size: 64, align: 64, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !11, line: 37, baseType: !104, size: 128, align: 64, offset: 448)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "lastByte", file: !11, line: 37, baseType: !12, size: 64, align: 64, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lastRuneSize", file: !11, line: 37, baseType: !12, size: 64, align: 64, offset: 640)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Writer", file: !11, line: 37, baseType: !249, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !11, line: 37, size: 512, align: 8, elements: !251)
!251 = !{!252, !253, !254, !255}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !11, line: 37, baseType: !104, size: 128, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !11, line: 37, baseType: !98, size: 192, align: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !11, line: 37, baseType: !12, size: 64, align: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "wr", file: !11, line: 37, baseType: !256, size: 128, align: 64, offset: 384)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !11, line: 23, size: 128, align: 8, elements: !257)
!257 = !{!258, !102}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 23, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !23, size: 128, align: 8, elements: !261)
!261 = !{!241, !262}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !23, line: 23, baseType: !143, size: 64, align: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", file: !11, line: 37, baseType: !264, size: 64, align: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "Encoder", file: !11, line: 26, size: 1280, align: 8, elements: !266)
!266 = !{!267, !273, !278, !292, !313, !314, !315}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !11, line: 26, baseType: !268, size: 64, align: 32)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !11, line: 26, size: 64, align: 8, elements: !269)
!269 = !{!270, !272}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !11, line: 26, baseType: !271, size: 32, align: 32)
!271 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !11, line: 26, baseType: !8, size: 32, align: 32, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !11, line: 26, baseType: !274, size: 192, align: 64, offset: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Writer,int,int}", file: !23, size: 192, align: 8, elements: !275)
!275 = !{!276, !87, !88}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !23, line: 1, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "sent", file: !11, line: 26, baseType: !279, size: 64, align: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !281)
!281 = !{!282, !283, !284, !285, !287, !288, !289, !290, !291}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !12, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !41, size: 8, align: 8, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !41, size: 8, align: 8, offset: 72)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !286, size: 16, align: 16, offset: 80)
!286 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !52, size: 64, align: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !52, size: 64, align: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !37, size: 64, align: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !52, size: 64, align: 64, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "countState", file: !11, line: 26, baseType: !293, size: 64, align: 64, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.encoderState", file: !11, line: 26, size: 448, align: 8, elements: !295)
!295 = !{!296, !297, !306, !307, !308, !312}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "enc", file: !11, line: 26, baseType: !52, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !11, line: 26, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.encBuffer", file: !11, line: 26, size: 704, align: 8, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "data", file: !11, line: 26, baseType: !98, size: 192, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", file: !11, line: 26, baseType: !303, size: 512, align: 8, offset: 192)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 512, align: 1, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sendZero", file: !11, line: 26, baseType: !62, size: 8, align: 8, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "fieldnum", file: !11, line: 26, baseType: !12, size: 64, align: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !11, line: 26, baseType: !309, size: 72, align: 8, offset: 256)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 72, align: 1, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 9)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !11, line: 26, baseType: !52, size: 64, align: 64, offset: 384)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "freeList", file: !11, line: 26, baseType: !293, size: 64, align: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "byteBuf", file: !11, line: 26, baseType: !299, size: 704, align: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !11, line: 26, baseType: !104, size: 128, align: 64, offset: 1152)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", file: !11, line: 37, baseType: !317, size: 64, align: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "Decoder", file: !11, line: 26, size: 1024, align: 8, elements: !319)
!319 = !{!267, !320, !321, !325, !326, !327, !328, !337, !338}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !11, line: 26, baseType: !235, size: 128, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !11, line: 26, baseType: !322, size: 256, align: 64, offset: 192)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.decBuffer", file: !11, line: 26, size: 256, align: 8, elements: !323)
!323 = !{!301, !324}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !11, line: 26, baseType: !12, size: 64, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "wireType", file: !11, line: 26, baseType: !279, size: 64, align: 64, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "decoderCache", file: !11, line: 26, baseType: !279, size: 64, align: 64, offset: 512)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ignorerCache", file: !11, line: 26, baseType: !279, size: 64, align: 64, offset: 576)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "freeList", file: !11, line: 26, baseType: !329, size: 64, align: 64, offset: 640)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.decoderState", file: !11, line: 26, size: 256, align: 8, elements: !331)
!331 = !{!332, !333, !335, !336}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "dec", file: !11, line: 26, baseType: !52, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !11, line: 26, baseType: !334, size: 64, align: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "fieldnum", file: !11, line: 26, baseType: !12, size: 64, align: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !11, line: 26, baseType: !52, size: 64, align: 64, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "countBuf", file: !11, line: 26, baseType: !98, size: 192, align: 64, offset: 704)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !11, line: 26, baseType: !104, size: 128, align: 64, offset: 896)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "inCipher", file: !11, line: 55, baseType: !340, size: 128, align: 64, offset: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stream", file: !11, line: 24, size: 128, align: 8, elements: !341)
!341 = !{!342, !102}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 24, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int},struct{*uint8,int,int})void}", file: !23, size: 128, align: 8, elements: !345)
!345 = !{!32, !346}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "XORKeyStream", file: !23, line: 24, baseType: !95, size: 64, align: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "outCipher", file: !11, line: 56, baseType: !340, size: 128, align: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "inMacer", file: !11, line: 58, baseType: !125, size: 128, align: 64, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "outMacer", file: !11, line: 59, baseType: !125, size: 128, align: 64, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "inBuffer", file: !11, line: 61, baseType: !351, size: 832, align: 64, offset: 576)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", file: !11, line: 23, size: 832, align: 8, elements: !352)
!352 = !{!353, !354, !355, !356}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !11, line: 23, baseType: !98, size: 192, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "off", file: !11, line: 23, baseType: !12, size: 64, align: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "bootstrap", file: !11, line: 23, baseType: !303, size: 512, align: 8, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "lastRead", file: !11, line: 23, baseType: !357, size: 8, align: 8, offset: 768)
!357 = !DIBasicType(name: ".bytes.readOp", size: 8, encoding: DW_ATE_signed)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "outBuffer", file: !11, line: 62, baseType: !351, size: 832, align: 64, offset: 1408)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "inCoder", file: !11, line: 64, baseType: !317, size: 64, align: 64, offset: 2240)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "outCoder", file: !11, line: 65, baseType: !264, size: 64, align: 64, offset: 2304)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "inHeadBuf", file: !11, line: 67, baseType: !98, size: 192, align: 64, offset: 2368)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "inMacBuf", file: !11, line: 68, baseType: !98, size: 192, align: 64, offset: 2560)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Send", file: !11, line: 70, baseType: !364, size: 64, align: 64, offset: 2752)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !7, line: 1, align: 8, elements: !3)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Recv", file: !11, line: 71, baseType: !364, size: 64, align: 64, offset: 2816)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "sendQuit", file: !11, line: 72, baseType: !364, size: 64, align: 64, offset: 2880)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "recvQuit", file: !11, line: 73, baseType: !364, size: 64, align: 64, offset: 2944)
!369 = !DILocalVariable(name: "l", arg: 1, scope: !158, file: !11, line: 144, type: !161)
!370 = !DILocation(line: 144, column: 1, scope: !158)
!371 = !DILocalVariable(name: "res", scope: !372, file: !11, line: 145, type: !104)
!372 = distinct !DILexicalBlock(scope: !158, file: !11, line: 144, column: 1)
!373 = !DILocation(line: 145, column: 6, scope: !158)
!374 = !DILocation(line: 148, column: 3, scope: !372)
!375 = !DILocation(line: 148, column: 10, scope: !372)
!376 = !DILocation(line: 148, column: 35, scope: !372)
!377 = !DILocation(line: 148, column: 52, scope: !372)
!378 = !DILocation(line: 148, column: 40, scope: !372)
!379 = !DILocation(line: 148, column: 17, scope: !372)
!380 = !DILocation(line: 151, column: 6, scope: !372)
!381 = !DILocation(line: 151, column: 16, scope: !372)
!382 = !DILocation(line: 152, column: 11, scope: !383)
!383 = distinct !DILexicalBlock(scope: !372, file: !11, line: 151, column: 23)
!384 = !DILocalVariable(name: "errc", scope: !383, file: !11, line: 152, type: !364)
!385 = !DILocation(line: 152, column: 3, scope: !372)
!386 = !DILocation(line: 153, column: 4, scope: !383)
!387 = !DILocation(line: 153, column: 14, scope: !383)
!388 = !DILocation(line: 154, column: 13, scope: !389)
!389 = distinct !DILexicalBlock(scope: !383, file: !11, line: 154, column: 3)
!390 = !DILocalVariable(name: "err", scope: !389, file: !11, line: 154, type: !104)
!391 = !DILocation(line: 154, column: 6, scope: !383)
!392 = !DILocation(line: 159, column: 6, scope: !372)
!393 = !DILocation(line: 159, column: 16, scope: !372)
!394 = !DILocation(line: 160, column: 11, scope: !395)
!395 = distinct !DILexicalBlock(scope: !372, file: !11, line: 159, column: 23)
!396 = !DILocalVariable(name: "errc", scope: !395, file: !11, line: 160, type: !364)
!397 = !DILocation(line: 160, column: 3, scope: !372)
!398 = !DILocation(line: 161, column: 4, scope: !395)
!399 = !DILocation(line: 161, column: 14, scope: !395)
!400 = !DILocation(line: 162, column: 13, scope: !401)
!401 = distinct !DILexicalBlock(scope: !395, file: !11, line: 162, column: 3)
!402 = !DILocation(line: 162, column: 25, scope: !401)
!403 = !DILocalVariable(name: "err", scope: !401, file: !11, line: 162, type: !104)
!404 = !DILocation(line: 162, column: 6, scope: !395)
!405 = !DILocation(line: 0, scope: !389)
!406 = !DILocation(line: 167, column: 13, scope: !407)
!407 = distinct !DILexicalBlock(scope: !372, file: !11, line: 167, column: 2)
!408 = !DILocation(line: 167, column: 20, scope: !407)
!409 = !DILocation(line: 167, column: 34, scope: !407)
!410 = !DILocalVariable(name: "err", scope: !407, file: !11, line: 167, type: !104)
!411 = !DILocation(line: 167, column: 5, scope: !372)
!412 = !DILocalVariable(name: "$ret3", scope: !158, file: !11, line: 144, type: !104)
!413 = !DILocation(line: 144, column: 24, scope: !158)
!414 = !DILocation(line: 170, column: 2, scope: !372)
!415 = distinct !DISubprogram(name: "link.RecvDirect..1command_line_arguments.Link", linkageName: "command_line_arguments.Link.RecvDirect", scope: null, file: !11, line: 211, type: !416, isLocal: false, isDefinition: true, scopeLine: 211, isOptimized: false, unit: !1, retainedNodes: !3)
!416 = !DISubroutineType(types: !417)
!417 = !{!418, !161, !161}
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Message,error}", file: !23, size: 192, align: 8, elements: !419)
!419 = !{!420, !435}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !23, line: 211, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !11, line: 36, size: 768, align: 8, elements: !423)
!423 = !{!424, !433, !434}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Head", file: !11, line: 36, baseType: !425, size: 512, align: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "Header", file: !11, line: 36, size: 512, align: 8, elements: !426)
!426 = !{!427, !431, !432}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Meta", file: !11, line: 36, baseType: !428, size: 128, align: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !23, size: 128, align: 8, elements: !429)
!429 = !{!110, !430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !23, line: 1, baseType: !52, size: 64, align: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !11, line: 36, baseType: !98, size: 192, align: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Iv", file: !11, line: 36, baseType: !98, size: 192, align: 64, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Data", file: !11, line: 36, baseType: !98, size: 192, align: 64, offset: 512)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "secure", file: !11, line: 36, baseType: !62, size: 8, align: 8, offset: 704)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !23, line: 211, baseType: !104, size: 128, align: 64, offset: 64)
!436 = !DILocalVariable(name: "l", arg: 1, scope: !415, file: !11, line: 211, type: !161)
!437 = !DILocation(line: 211, column: 1, scope: !415)
!438 = !DILocalVariable(name: "$ret5", scope: !415, file: !11, line: 211, type: !421)
!439 = !DILocation(line: 211, column: 30, scope: !415)
!440 = !DILocation(line: 212, column: 6, scope: !441)
!441 = distinct !DILexicalBlock(scope: !415, file: !11, line: 211, column: 1)
!442 = !DILocalVariable(name: "msg", scope: !441, file: !11, line: 212, type: !421)
!443 = !DILocation(line: 212, column: 6, scope: !415)
!444 = !DILocation(line: 216, column: 27, scope: !441)
!445 = !DILocation(line: 216, column: 12, scope: !441)
!446 = !DILocation(line: 216, column: 25, scope: !441)
!447 = !DILocation(line: 216, column: 19, scope: !441)
!448 = !DILocalVariable(name: "err", scope: !441, file: !11, line: 213, type: !104)
!449 = !DILocation(line: 213, column: 6, scope: !415)
!450 = !DILocation(line: 216, column: 44, scope: !441)
!451 = !DILocalVariable(name: "$ret6", scope: !415, file: !11, line: 211, type: !104)
!452 = !DILocation(line: 211, column: 46, scope: !415)
!453 = !DILocation(line: 217, column: 3, scope: !441)
!454 = !DILocation(line: 219, column: 29, scope: !441)
!455 = !DILocation(line: 219, column: 12, scope: !441)
!456 = !DILocation(line: 219, column: 25, scope: !441)
!457 = !DILocation(line: 219, column: 19, scope: !441)
!458 = !DILocation(line: 219, column: 41, scope: !441)
!459 = !DILocation(line: 220, column: 3, scope: !441)
!460 = !DILocation(line: 222, column: 27, scope: !441)
!461 = !DILocation(line: 222, column: 12, scope: !441)
!462 = !DILocation(line: 222, column: 25, scope: !441)
!463 = !DILocation(line: 222, column: 19, scope: !441)
!464 = !DILocation(line: 222, column: 43, scope: !441)
!465 = !DILocation(line: 223, column: 3, scope: !441)
!466 = !DILocation(line: 226, column: 11, scope: !441)
!467 = !DILocation(line: 227, column: 11, scope: !441)
!468 = !DILocation(line: 228, column: 39, scope: !441)
!469 = !DILocation(line: 228, column: 12, scope: !441)
!470 = !DILocation(line: 228, column: 5, scope: !441)
!471 = !DILocation(line: 229, column: 76, scope: !441)
!472 = !DILocation(line: 229, column: 24, scope: !441)
!473 = !DILocation(line: 229, column: 16, scope: !441)
!474 = !DILocation(line: 230, column: 3, scope: !441)
!475 = !DILocation(line: 233, column: 12, scope: !441)
!476 = !DILocation(line: 234, column: 3, scope: !441)
!477 = !DILocation(line: 234, column: 12, scope: !441)
!478 = !DILocation(line: 235, column: 12, scope: !441)
!479 = !DILocation(line: 235, column: 28, scope: !441)
!480 = !DILocation(line: 235, column: 20, scope: !441)
!481 = !DILocation(line: 235, column: 44, scope: !441)
!482 = !DILocation(line: 236, column: 3, scope: !441)
!483 = !DILocation(line: 239, column: 5, scope: !441)
!484 = !DILocation(line: 240, column: 2, scope: !441)
!485 = distinct !DISubprogram(name: "link.SendDirect..1command_line_arguments.Link", linkageName: "command_line_arguments.Link.SendDirect", scope: null, file: !11, line: 176, type: !486, isLocal: false, isDefinition: true, scopeLine: 176, isOptimized: false, unit: !1, retainedNodes: !3)
!486 = !DISubroutineType(types: !487)
!487 = !{!104, !161, !161, !421}
!488 = !DILocalVariable(name: "l", arg: 1, scope: !485, file: !11, line: 176, type: !161)
!489 = !DILocation(line: 176, column: 1, scope: !485)
!490 = !DILocalVariable(name: "msg", arg: 2, scope: !485, file: !11, line: 176, type: !421)
!491 = !DILocation(line: 176, column: 27, scope: !485)
!492 = !DILocalVariable(name: "$ret4", scope: !485, file: !11, line: 176, type: !104)
!493 = !DILocation(line: 176, column: 47, scope: !485)
!494 = !DILocation(line: 180, column: 9, scope: !495)
!495 = distinct !DILexicalBlock(scope: !485, file: !11, line: 176, column: 1)
!496 = !DILocation(line: 206, column: 1, scope: !485)
!497 = !DILocation(line: 180, column: 5, scope: !495)
!498 = !DILocation(line: 0, scope: !495)
!499 = !DILocation(line: 180, column: 29, scope: !495)
!500 = !DILocation(line: 180, column: 36, scope: !495)
!501 = !DILocation(line: 181, column: 7, scope: !495)
!502 = !DILocation(line: 182, column: 17, scope: !495)
!503 = !DILocation(line: 185, column: 32, scope: !495)
!504 = !DILocation(line: 185, column: 12, scope: !495)
!505 = !DILocation(line: 185, column: 21, scope: !495)
!506 = !DILocalVariable(name: "err", scope: !495, file: !11, line: 177, type: !104)
!507 = !DILocation(line: 177, column: 6, scope: !485)
!508 = !DILocation(line: 185, column: 44, scope: !495)
!509 = !DILocation(line: 188, column: 28, scope: !495)
!510 = !DILocation(line: 188, column: 38, scope: !495)
!511 = !DILocation(line: 188, column: 59, scope: !495)
!512 = !DILocation(line: 188, column: 13, scope: !495)
!513 = !DILocation(line: 189, column: 2, scope: !495)
!514 = !DILocation(line: 192, column: 30, scope: !495)
!515 = !DILocation(line: 192, column: 12, scope: !495)
!516 = !DILocation(line: 193, column: 12, scope: !495)
!517 = !DILocation(line: 193, column: 22, scope: !495)
!518 = !DILocation(line: 196, column: 36, scope: !495)
!519 = !DILocation(line: 196, column: 12, scope: !495)
!520 = !DILocation(line: 196, column: 19, scope: !495)
!521 = !DILocation(line: 196, column: 51, scope: !495)
!522 = !DILocation(line: 199, column: 28, scope: !495)
!523 = !DILocation(line: 199, column: 12, scope: !495)
!524 = !DILocation(line: 199, column: 19, scope: !495)
!525 = !DILocation(line: 199, column: 40, scope: !495)
!526 = !DILocation(line: 202, column: 35, scope: !495)
!527 = !DILocation(line: 202, column: 12, scope: !495)
!528 = !DILocation(line: 202, column: 19, scope: !495)
!529 = !DILocation(line: 202, column: 51, scope: !495)
!530 = !DILocation(line: 205, column: 10, scope: !495)
!531 = !DILocation(line: 205, column: 17, scope: !495)
!532 = !DILocation(line: 182, column: 3, scope: !485)
!533 = distinct !DISubprogram(name: "link.Sock..1command_line_arguments.Link", linkageName: "command_line_arguments.Link.Sock", scope: null, file: !11, line: 323, type: !534, isLocal: false, isDefinition: true, scopeLine: 323, isOptimized: false, unit: !1, retainedNodes: !3)
!534 = !DISubroutineType(types: !535)
!535 = !{!169, !161, !161}
!536 = !DILocalVariable(name: "l", arg: 1, scope: !533, file: !11, line: 323, type: !161)
!537 = !DILocation(line: 323, column: 1, scope: !533)
!538 = !DILocalVariable(name: "$ret7", scope: !533, file: !11, line: 323, type: !169)
!539 = !DILocation(line: 323, column: 23, scope: !533)
!540 = !DILocation(line: 324, column: 10, scope: !533)
!541 = !DILocation(line: 324, column: 17, scope: !533)
!542 = !DILocation(line: 324, column: 2, scope: !533)
!543 = distinct !DISubprogram(name: "link.Start..1command_line_arguments.Link", linkageName: "command_line_arguments.Link.Start", scope: null, file: !11, line: 131, type: !544, isLocal: false, isDefinition: true, scopeLine: 131, isOptimized: false, unit: !1, retainedNodes: !3)
!544 = !DISubroutineType(types: !545)
!545 = !{!53, !161, !161, !12}
!546 = !DILocalVariable(name: "l", arg: 1, scope: !543, file: !11, line: 131, type: !161)
!547 = !DILocation(line: 131, column: 1, scope: !543)
!548 = !DILocalVariable(name: "cap", arg: 2, scope: !543, file: !11, line: 131, type: !12)
!549 = !DILocation(line: 131, column: 22, scope: !543)
!550 = !DILocation(line: 133, column: 11, scope: !543)
!551 = !DILocation(line: 133, column: 3, scope: !543)
!552 = !DILocation(line: 133, column: 9, scope: !543)
!553 = !DILocation(line: 134, column: 11, scope: !543)
!554 = !DILocation(line: 134, column: 3, scope: !543)
!555 = !DILocation(line: 134, column: 9, scope: !543)
!556 = !DILocation(line: 135, column: 15, scope: !543)
!557 = !DILocation(line: 135, column: 3, scope: !543)
!558 = !DILocation(line: 135, column: 13, scope: !543)
!559 = !DILocation(line: 136, column: 15, scope: !543)
!560 = !DILocation(line: 136, column: 3, scope: !543)
!561 = !DILocation(line: 136, column: 13, scope: !543)
!562 = !DILocation(line: 139, column: 2, scope: !543)
!563 = !DILocation(line: 140, column: 2, scope: !543)
!564 = distinct !DISubprogram(name: "link.receiver..1command_line_arguments.Link", linkageName: "command_line_arguments.Link.receiver", scope: null, file: !11, line: 284, type: !565, isLocal: false, isDefinition: true, scopeLine: 284, isOptimized: false, unit: !1, retainedNodes: !3)
!565 = !DISubroutineType(types: !566)
!566 = !{!53, !161, !161}
!567 = !DILocalVariable(name: "l", arg: 1, scope: !564, file: !11, line: 284, type: !161)
!568 = !DILocation(line: 284, column: 1, scope: !564)
!569 = !DILocalVariable(name: "errc", scope: !570, file: !11, line: 285, type: !364)
!570 = distinct !DILexicalBlock(scope: !564, file: !11, line: 284, column: 1)
!571 = !DILocation(line: 285, column: 6, scope: !564)
!572 = !DILocalVariable(name: "errv", scope: !570, file: !11, line: 286, type: !104)
!573 = !DILocation(line: 286, column: 6, scope: !564)
!574 = !DILocation(line: 291, column: 16, scope: !575)
!575 = distinct !DILexicalBlock(scope: !570, file: !11, line: 289, column: 33)
!576 = !DILocalVariable(name: "err", scope: !575, file: !11, line: 291, type: !104)
!577 = !DILocation(line: 291, column: 3, scope: !570)
!578 = !DILocalVariable(name: "ok", scope: !579, file: !11, line: 297, type: !62)
!579 = distinct !DILexicalBlock(scope: !575, file: !11, line: 297, column: 3)
!580 = !DILocation(line: 297, column: 6, scope: !575)
!581 = !DILocation(line: 297, column: 18, scope: !579)
!582 = !DILocation(line: 289, column: 26, scope: !570)
!583 = !DILocation(line: 297, column: 6, scope: !579)
!584 = !DILocation(line: 297, column: 3, scope: !579)
!585 = !DILocation(line: 301, column: 3, scope: !575)
!586 = !DILocation(line: 315, column: 9, scope: !570)
!587 = !DILocation(line: 315, column: 2, scope: !570)
!588 = !DILocation(line: 317, column: 13, scope: !570)
!589 = !DILocation(line: 317, column: 10, scope: !570)
!590 = !DILocation(line: 302, column: 9, scope: !575)
!591 = !DILocation(line: 302, column: 3, scope: !575)
!592 = !DILocation(line: 304, column: 3, scope: !575)
!593 = !DILocation(line: 306, column: 4, scope: !575)
!594 = !DILocation(line: 307, column: 10, scope: !575)
!595 = !DILocation(line: 307, column: 4, scope: !575)
!596 = !DILocation(line: 309, column: 19, scope: !575)
!597 = !DILocation(line: 309, column: 4, scope: !575)
!598 = !DILocalVariable(name: "msg", scope: !575, file: !11, line: 291, type: !421)
!599 = !DILocation(line: 292, column: 10, scope: !575)
!600 = !DILocation(line: 319, column: 7, scope: !570)
!601 = distinct !DISubprogram(name: "link.sender..1command_line_arguments.Link", linkageName: "command_line_arguments.Link.sender", scope: null, file: !11, line: 244, type: !565, isLocal: false, isDefinition: true, scopeLine: 244, isOptimized: false, unit: !1, retainedNodes: !3)
!602 = !DILocalVariable(name: "l", arg: 1, scope: !601, file: !11, line: 244, type: !161)
!603 = !DILocation(line: 244, column: 1, scope: !601)
!604 = !DILocalVariable(name: "errc", scope: !605, file: !11, line: 245, type: !364)
!605 = distinct !DILexicalBlock(scope: !601, file: !11, line: 244, column: 1)
!606 = !DILocation(line: 245, column: 6, scope: !601)
!607 = !DILocalVariable(name: "errv", scope: !605, file: !11, line: 246, type: !104)
!608 = !DILocation(line: 246, column: 6, scope: !601)
!609 = !DILocation(line: 251, column: 18, scope: !605)
!610 = !DILocation(line: 251, column: 3, scope: !605)
!611 = !DILocation(line: 253, column: 18, scope: !605)
!612 = !DILocation(line: 253, column: 3, scope: !605)
!613 = !DILocation(line: 250, column: 3, scope: !605)
!614 = !DILocation(line: 253, column: 3, scope: !615)
!615 = distinct !DILexicalBlock(scope: !605, file: !11, line: 254, column: 4)
!616 = !DILocalVariable(name: "msg", scope: !615, file: !11, line: 253, type: !421)
!617 = !DILocation(line: 254, column: 12, scope: !615)
!618 = !DILocation(line: 249, column: 11, scope: !605)
!619 = !DILocation(line: 249, column: 26, scope: !605)
!620 = !DILocalVariable(name: "done", scope: !621, file: !11, line: 260, type: !62)
!621 = distinct !DILexicalBlock(scope: !605, file: !11, line: 260, column: 3)
!622 = !DILocation(line: 260, column: 7, scope: !605)
!623 = !DILocation(line: 280, column: 7, scope: !605)
!624 = !DILocation(line: 261, column: 4, scope: !621)
!625 = !DILocation(line: 262, column: 19, scope: !621)
!626 = !DILocation(line: 262, column: 4, scope: !621)
!627 = !DILocation(line: 264, column: 4, scope: !621)
!628 = !DILocation(line: 262, column: 4, scope: !629)
!629 = distinct !DILexicalBlock(scope: !621, file: !11, line: 263, column: 5)
!630 = !DILocalVariable(name: "msg", scope: !629, file: !11, line: 262, type: !421)
!631 = !DILocation(line: 263, column: 13, scope: !629)
!632 = !DILocation(line: 260, column: 36, scope: !621)
!633 = !DILocation(line: 272, column: 12, scope: !605)
!634 = !DILocation(line: 270, column: 31, scope: !605)
!635 = !DILocation(line: 270, column: 12, scope: !605)
!636 = !DILocation(line: 278, column: 13, scope: !605)
!637 = !DILocation(line: 278, column: 10, scope: !605)
!638 = distinct !DISubprogram(name: "link.New", linkageName: "command_line_arguments.New", scope: null, file: !11, line: 79, type: !639, isLocal: false, isDefinition: true, scopeLine: 79, isOptimized: false, unit: !1, retainedNodes: !3)
!639 = !DISubroutineType(types: !640)
!640 = !{!161, !165, !235, !62}
!641 = !DILocalVariable(name: "conn", arg: 1, scope: !638, file: !11, line: 79, type: !165)
!642 = !DILocation(line: 79, column: 10, scope: !638)
!643 = !DILocalVariable(name: "hkdf", arg: 2, scope: !638, file: !11, line: 79, type: !235)
!644 = !DILocation(line: 79, column: 31, scope: !638)
!645 = !DILocalVariable(name: "server", arg: 3, scope: !638, file: !11, line: 79, type: !62)
!646 = !DILocation(line: 79, column: 47, scope: !638)
!647 = !DILocalVariable(name: "$ret0", scope: !638, file: !11, line: 79, type: !161)
!648 = !DILocation(line: 79, column: 60, scope: !638)
!649 = !DILocation(line: 80, column: 7, scope: !650)
!650 = distinct !DILexicalBlock(scope: !638, file: !11, line: 79, column: 1)
!651 = !DILocation(line: 80, column: 8, scope: !650)
!652 = !DILocalVariable(name: "l", scope: !650, file: !11, line: 80, type: !161)
!653 = !DILocation(line: 80, column: 2, scope: !638)
!654 = !DILocation(line: 84, column: 12, scope: !650)
!655 = !DILocation(line: 85, column: 12, scope: !650)
!656 = !DILocation(line: 86, column: 2, scope: !650)
!657 = !DILocation(line: 87, column: 4, scope: !650)
!658 = !DILocation(line: 89, column: 4, scope: !650)
!659 = !DILocation(line: 87, column: 50, scope: !650)
!660 = !DILocation(line: 87, column: 16, scope: !650)
!661 = !DILocation(line: 87, column: 29, scope: !650)
!662 = !DILocation(line: 87, column: 40, scope: !650)
!663 = !DILocation(line: 89, column: 50, scope: !650)
!664 = !DILocation(line: 89, column: 16, scope: !650)
!665 = !DILocation(line: 89, column: 29, scope: !650)
!666 = !DILocation(line: 89, column: 40, scope: !650)
!667 = !DILocation(line: 92, column: 31, scope: !650)
!668 = !DILocation(line: 92, column: 29, scope: !650)
!669 = !DILocation(line: 92, column: 18, scope: !650)
!670 = !DILocation(line: 92, column: 3, scope: !650)
!671 = !DILocation(line: 92, column: 12, scope: !650)
!672 = !DILocation(line: 93, column: 32, scope: !650)
!673 = !DILocation(line: 93, column: 30, scope: !650)
!674 = !DILocation(line: 93, column: 19, scope: !650)
!675 = !DILocation(line: 93, column: 3, scope: !650)
!676 = !DILocation(line: 93, column: 13, scope: !650)
!677 = !DILocation(line: 95, column: 2, scope: !650)
!678 = distinct !DISubprogram(name: "link.makeHalfDuplex", scope: null, file: !11, line: 100, type: !679, isLocal: true, isDefinition: true, scopeLine: 100, isOptimized: false, unit: !1, retainedNodes: !3)
!679 = !DISubroutineType(types: !680)
!680 = !{!681, !235}
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Stream,Hash}", file: !23, size: 256, align: 8, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !23, line: 100, baseType: !340, size: 128, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !23, line: 100, baseType: !125, size: 128, align: 64, offset: 128)
!685 = !DILocalVariable(name: "hkdf", arg: 1, scope: !678, file: !11, line: 100, type: !235)
!686 = !DILocation(line: 100, column: 21, scope: !678)
!687 = !DILocation(line: 102, column: 29, scope: !688)
!688 = distinct !DILexicalBlock(scope: !678, file: !11, line: 100, column: 1)
!689 = !DILocation(line: 102, column: 46, scope: !688)
!690 = !DILocation(line: 102, column: 9, scope: !688)
!691 = !DILocalVariable(name: "key", scope: !688, file: !11, line: 102, type: !98)
!692 = !DILocation(line: 102, column: 2, scope: !678)
!693 = !DILocation(line: 103, column: 15, scope: !688)
!694 = !DILocalVariable(name: "n", scope: !688, file: !11, line: 103, type: !12)
!695 = !DILocation(line: 103, column: 2, scope: !678)
!696 = !DILocalVariable(name: "err", scope: !688, file: !11, line: 103, type: !104)
!697 = !DILocation(line: 104, column: 14, scope: !688)
!698 = !DILocation(line: 104, column: 7, scope: !688)
!699 = !DILocation(line: 104, column: 26, scope: !688)
!700 = !DILocation(line: 105, column: 58, scope: !688)
!701 = !DILocation(line: 107, column: 23, scope: !688)
!702 = !DILocalVariable(name: "block", scope: !688, file: !11, line: 107, type: !26)
!703 = !DILocation(line: 107, column: 2, scope: !678)
!704 = !DILocation(line: 108, column: 9, scope: !688)
!705 = !DILocation(line: 105, column: 13, scope: !688)
!706 = !DILocation(line: 105, column: 3, scope: !688)
!707 = !DILocation(line: 112, column: 26, scope: !688)
!708 = !DILocation(line: 112, column: 8, scope: !688)
!709 = !DILocalVariable(name: "iv", scope: !688, file: !11, line: 112, type: !98)
!710 = !DILocation(line: 112, column: 2, scope: !678)
!711 = !DILocation(line: 113, column: 14, scope: !688)
!712 = !DILocation(line: 114, column: 14, scope: !688)
!713 = !DILocation(line: 114, column: 7, scope: !688)
!714 = !DILocation(line: 114, column: 25, scope: !688)
!715 = !DILocation(line: 109, column: 60, scope: !688)
!716 = !DILocation(line: 109, column: 13, scope: !688)
!717 = !DILocation(line: 109, column: 3, scope: !688)
!718 = !DILocation(line: 115, column: 57, scope: !688)
!719 = !DILocation(line: 117, column: 19, scope: !688)
!720 = !DILocation(line: 120, column: 30, scope: !688)
!721 = !DILocation(line: 120, column: 43, scope: !688)
!722 = !DILocation(line: 120, column: 10, scope: !688)
!723 = !DILocalVariable(name: "salt", scope: !688, file: !11, line: 120, type: !98)
!724 = !DILocation(line: 120, column: 2, scope: !678)
!725 = !DILocation(line: 121, column: 14, scope: !688)
!726 = !DILocation(line: 122, column: 14, scope: !688)
!727 = !DILocation(line: 122, column: 7, scope: !688)
!728 = !DILocation(line: 122, column: 27, scope: !688)
!729 = !DILocation(line: 115, column: 13, scope: !688)
!730 = !DILocation(line: 115, column: 3, scope: !688)
!731 = !DILocation(line: 123, column: 63, scope: !688)
!732 = !DILocalVariable(name: "stream", scope: !688, file: !11, line: 117, type: !340)
!733 = !DILocation(line: 117, column: 2, scope: !678)
!734 = !DILocation(line: 125, column: 25, scope: !688)
!735 = !DILocation(line: 125, column: 14, scope: !688)
!736 = !DILocalVariable(name: "mac", scope: !688, file: !11, line: 125, type: !125)
!737 = !DILocation(line: 125, column: 2, scope: !678)
!738 = !DILocalVariable(name: "$ret1", scope: !678, file: !11, line: 100, type: !340)
!739 = !DILocation(line: 100, column: 38, scope: !678)
!740 = !DILocalVariable(name: "$ret2", scope: !678, file: !11, line: 100, type: !125)
!741 = !DILocation(line: 100, column: 53, scope: !678)
!742 = !DILocation(line: 127, column: 2, scope: !688)
!743 = !DILocation(line: 123, column: 13, scope: !688)
!744 = !DILocation(line: 123, column: 3, scope: !688)
!745 = distinct !DISubprogram(name: "link.command_line_arguments..thunk0", scope: null, file: !11, line: 139, type: !746, isLocal: true, isDefinition: true, scopeLine: 139, isOptimized: false, unit: !1, retainedNodes: !3)
!746 = !DISubroutineType(types: !747)
