; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22stream\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22gob\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/gob\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/gob\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22net\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22net\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22net\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3)
!2 = !DIFile(filename: "./stream.go", directory: "/home/wangcong/go_path/src/github.com/project-iris/iris/proto/stream")
!3 = !{}
!4 = distinct !DISubprogram(name: "stream.command_line_arguments.Listener..hash", linkageName: "command_line_arguments.command_line_arguments.Listener..hash", scope: null, file: !5, line: 1, type: !6, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!5 = !DIFile(filename: "<built-in>", directory: "")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !9, !8}
!8 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "void")
!11 = !DILocalVariable(name: "key", arg: 1, scope: !4, file: !5, line: 1, type: !9)
!12 = !DILocation(line: 1, column: 1, scope: !4)
!13 = !DILocalVariable(name: "seed", arg: 2, scope: !4, file: !5, line: 1, type: !8)
!14 = !DILocalVariable(name: "$ret11", scope: !4, file: !5, line: 1, type: !8)
!15 = distinct !DISubprogram(name: "stream.command_line_arguments.Listener..eq", linkageName: "command_line_arguments.command_line_arguments.Listener..eq", scope: null, file: !5, line: 1, type: !16, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !9, !9}
!18 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!19 = !DILocalVariable(name: "key1", arg: 1, scope: !15, file: !5, line: 1, type: !9)
!20 = !DILocation(line: 1, column: 1, scope: !15)
!21 = !DILocalVariable(name: "key2", arg: 2, scope: !15, file: !5, line: 1, type: !9)
!22 = !DILocalVariable(name: "$ret12", scope: !15, file: !5, line: 1, type: !18)
!23 = distinct !DISubprogram(name: "stream.Accept..1command_line_arguments.Listener", linkageName: "command_line_arguments.Listener.Accept", scope: null, file: !24, line: 74, type: !25, isLocal: false, isDefinition: true, scopeLine: 74, isOptimized: false, unit: !1, retainedNodes: !3)
!24 = !DIFile(filename: "stream.go", directory: ".")
!25 = !DISubroutineType(types: !26)
!26 = !{!10, !27, !27, !144}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "Listener", file: !24, line: 39, size: 192, align: 8, elements: !29)
!29 = !{!30, !33, !143}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Sink", file: !24, line: 40, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !5, line: 1, align: 8, elements: !3)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "socket", file: !24, line: 42, baseType: !34, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "TCPListener", file: !24, line: 31, size: 64, align: 8, elements: !36)
!36 = !{!37}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "fd", file: !24, line: 31, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: ".net.netFD", file: !24, line: 31, size: 960, align: 8, elements: !40)
!40 = !{!41, !79, !80, !81, !82, !87, !142}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !24, line: 31, baseType: !42, size: 384, align: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !24, line: 31, size: 384, align: 8, elements: !43)
!43 = !{!44, !52, !54, !58, !74, !75, !76, !77, !78}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !24, line: 31, baseType: !45, size: 128, align: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !24, line: 31, size: 128, align: 8, elements: !46)
!46 = !{!47, !49, !51}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !24, line: 31, baseType: !48, size: 64, align: 64)
!48 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !24, line: 31, baseType: !50, size: 32, align: 32, offset: 64)
!50 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !24, line: 31, baseType: !50, size: 32, align: 32, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !24, line: 31, baseType: !53, size: 64, align: 64, offset: 128)
!53 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !24, line: 31, baseType: !55, size: 64, align: 64, offset: 192)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !24, line: 31, size: 64, align: 8, elements: !56)
!56 = !{!57}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !24, line: 31, baseType: !8, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !24, line: 31, baseType: !59, size: 64, align: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !61, size: 192, align: 8, elements: !62)
!61 = !DIFile(filename: "", directory: "")
!62 = !{!63, !72, !73}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !61, line: 1, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !24, line: 31, size: 128, align: 8, elements: !66)
!66 = !{!67, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !24, line: 31, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !24, line: 31, baseType: !71, size: 64, align: 64, offset: 64)
!71 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !61, line: 1, baseType: !53, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !61, line: 1, baseType: !53, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !24, line: 31, baseType: !50, size: 32, align: 32, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !24, line: 31, baseType: !18, size: 8, align: 8, offset: 352)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !24, line: 31, baseType: !18, size: 8, align: 8, offset: 360)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !24, line: 31, baseType: !18, size: 8, align: 8, offset: 368)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !24, line: 31, baseType: !18, size: 8, align: 8, offset: 376)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "family", file: !24, line: 31, baseType: !53, size: 64, align: 64, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "sotype", file: !24, line: 31, baseType: !53, size: 64, align: 64, offset: 448)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "isConnected", file: !24, line: 31, baseType: !18, size: 8, align: 8, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "net", file: !24, line: 31, baseType: !83, size: 128, align: 64, offset: 576)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !5, line: 1, size: 128, align: 8, elements: !84)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !5, line: 1, baseType: !68, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !5, line: 1, baseType: !53, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "laddr", file: !24, line: 31, baseType: !88, size: 128, align: 64, offset: 704)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "Addr", file: !24, line: 31, size: 128, align: 8, elements: !89)
!89 = !{!90, !141}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 31, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)string}", file: !61, size: 192, align: 8, elements: !93)
!93 = !{!94, !136, !140}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !61, line: 31, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !5, line: 1, size: 576, align: 8, elements: !97)
!97 = !{!98, !99, !100, !101, !102, !103, !104, !110, !116, !117, !119, !135}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !5, line: 1, baseType: !8, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !5, line: 1, baseType: !8, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !5, line: 1, baseType: !50, size: 32, align: 32, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !5, line: 1, baseType: !69, size: 8, align: 8, offset: 160)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !5, line: 1, baseType: !69, size: 8, align: 8, offset: 168)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !5, line: 1, baseType: !69, size: 8, align: 8, offset: 176)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !5, line: 1, baseType: !105, size: 64, align: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 1, size: 64, align: 8, elements: !107)
!107 = !{!108}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 1, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !5, line: 1, baseType: !111, size: 64, align: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 1, size: 64, align: 8, elements: !113)
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 1, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !5, line: 1, baseType: !68, size: 64, align: 64, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !5, line: 1, baseType: !118, size: 64, align: 64, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !5, line: 1, baseType: !120, size: 64, align: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !5, line: 1, size: 320, align: 8, elements: !122)
!122 = !{!123, !124, !125}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !5, line: 1, baseType: !118, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !5, line: 1, baseType: !118, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !5, line: 1, baseType: !126, size: 192, align: 64, offset: 128)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !61, size: 192, align: 8, elements: !127)
!127 = !{!128, !72, !73}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !61, line: 1, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !5, line: 1, size: 320, align: 8, elements: !131)
!131 = !{!123, !124, !132, !133, !134}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Network", file: !61, line: 31, baseType: !137, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!83, !9}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !61, line: 31, baseType: !137, size: 64, align: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !24, line: 1, baseType: !9, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "raddr", file: !24, line: 31, baseType: !88, size: 128, align: 64, offset: 832)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "quit", file: !24, line: 43, baseType: !31, size: 64, align: 64, offset: 128)
!144 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!145 = !DILocalVariable(name: "l", arg: 1, scope: !23, file: !24, line: 74, type: !27)
!146 = !DILocation(line: 74, column: 1, scope: !23)
!147 = !DILocalVariable(name: "timeout", arg: 2, scope: !23, file: !24, line: 74, type: !144)
!148 = !DILocation(line: 74, column: 27, scope: !23)
!149 = !DILocation(line: 75, column: 2, scope: !23)
!150 = distinct !DISubprogram(name: "stream.Close..1command_line_arguments.Listener", linkageName: "command_line_arguments.Listener.Close", scope: null, file: !24, line: 79, type: !151, isLocal: false, isDefinition: true, scopeLine: 79, isOptimized: false, unit: !1, retainedNodes: !3)
!151 = !DISubroutineType(types: !152)
!152 = !{!153, !27, !27}
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !5, line: 1, size: 128, align: 8, elements: !154)
!154 = !{!155, !161}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 1, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !61, size: 128, align: 8, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !61, line: 1, baseType: !95, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !61, line: 1, baseType: !137, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 64)
!162 = !DILocalVariable(name: "l", arg: 1, scope: !150, file: !24, line: 79, type: !27)
!163 = !DILocation(line: 79, column: 1, scope: !150)
!164 = !DILocation(line: 80, column: 10, scope: !165)
!165 = distinct !DILexicalBlock(scope: !150, file: !24, line: 79, column: 1)
!166 = !DILocalVariable(name: "errc", scope: !165, file: !24, line: 80, type: !31)
!167 = !DILocation(line: 80, column: 2, scope: !150)
!168 = !DILocation(line: 81, column: 3, scope: !165)
!169 = !DILocation(line: 81, column: 9, scope: !165)
!170 = !DILocation(line: 82, column: 9, scope: !165)
!171 = !DILocalVariable(name: "$ret2", scope: !150, file: !24, line: 79, type: !153)
!172 = !DILocation(line: 79, column: 28, scope: !150)
!173 = !DILocation(line: 82, column: 2, scope: !165)
!174 = distinct !DISubprogram(name: "stream.accepter..1command_line_arguments.Listener", linkageName: "command_line_arguments.Listener.accepter", scope: null, file: !24, line: 87, type: !25, isLocal: false, isDefinition: true, scopeLine: 87, isOptimized: false, unit: !1, retainedNodes: !3)
!175 = !DILocalVariable(name: "l", arg: 1, scope: !174, file: !24, line: 87, type: !27)
!176 = !DILocation(line: 87, column: 1, scope: !174)
!177 = !DILocalVariable(name: "timeout", arg: 2, scope: !174, file: !24, line: 87, type: !144)
!178 = !DILocation(line: 87, column: 29, scope: !174)
!179 = !DILocalVariable(name: "errc", scope: !180, file: !24, line: 88, type: !31)
!180 = distinct !DILexicalBlock(scope: !174, file: !24, line: 87, column: 1)
!181 = !DILocation(line: 88, column: 6, scope: !174)
!182 = !DILocalVariable(name: "errv", scope: !180, file: !24, line: 89, type: !153)
!183 = !DILocation(line: 89, column: 6, scope: !174)
!184 = !DILocation(line: 94, column: 18, scope: !180)
!185 = !DILocation(line: 94, column: 3, scope: !180)
!186 = !DILocation(line: 96, column: 3, scope: !180)
!187 = !DILocation(line: 93, column: 3, scope: !180)
!188 = !DILocation(line: 98, column: 30, scope: !180)
!189 = !DILocation(line: 98, column: 35, scope: !180)
!190 = !DILocation(line: 98, column: 5, scope: !180)
!191 = !DILocation(line: 98, column: 12, scope: !180)
!192 = !DILocation(line: 99, column: 21, scope: !193)
!193 = distinct !DILexicalBlock(scope: !180, file: !24, line: 99, column: 4)
!194 = !DILocation(line: 99, column: 28, scope: !193)
!195 = !DILocalVariable(name: "err", scope: !193, file: !24, line: 99, type: !153)
!196 = !DILocation(line: 99, column: 7, scope: !180)
!197 = !DILocation(line: 99, column: 46, scope: !193)
!198 = !DILocation(line: 92, column: 11, scope: !180)
!199 = !DILocation(line: 92, column: 26, scope: !180)
!200 = !DILocalVariable(name: "conn", scope: !193, file: !24, line: 99, type: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "TCPConn", file: !24, line: 31, size: 64, align: 8, elements: !203)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "conn", file: !24, line: 31, baseType: !205, size: 64, align: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: ".net.conn", file: !24, line: 31, size: 64, align: 8, elements: !36)
!206 = !DILocation(line: 100, column: 13, scope: !207)
!207 = distinct !DILexicalBlock(scope: !193, file: !24, line: 99, column: 53)
!208 = !DILocalVariable(name: "strm", scope: !207, file: !24, line: 100, type: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stream", file: !24, line: 47, size: 256, align: 8, elements: !211)
!211 = !{!212, !213, !261, !314}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "socket", file: !24, line: 48, baseType: !201, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "buffers", file: !24, line: 49, baseType: !214, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriter", file: !24, line: 28, size: 128, align: 8, elements: !216)
!216 = !{!217, !246}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Reader", file: !24, line: 28, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !24, line: 28, size: 704, align: 8, elements: !220)
!220 = !{!221, !225, !241, !242, !243, !244, !245}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !24, line: 28, baseType: !222, size: 192, align: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !61, size: 192, align: 8, elements: !223)
!223 = !{!224, !72, !73}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !61, line: 1, baseType: !68, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "rd", file: !24, line: 28, baseType: !226, size: 128, align: 64, offset: 192)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !24, line: 28, size: 128, align: 8, elements: !227)
!227 = !{!228, !141}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 28, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !61, size: 128, align: 8, elements: !231)
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !61, line: 28, baseType: !95, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !61, line: 28, baseType: !234, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!237, !9, !222}
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !61, size: 192, align: 8, elements: !238)
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !61, line: 28, baseType: !53, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !61, line: 28, baseType: !153, size: 128, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !24, line: 28, baseType: !53, size: 64, align: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !24, line: 28, baseType: !53, size: 64, align: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !24, line: 28, baseType: !153, size: 128, align: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "lastByte", file: !24, line: 28, baseType: !53, size: 64, align: 64, offset: 576)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "lastRuneSize", file: !24, line: 28, baseType: !53, size: 64, align: 64, offset: 640)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Writer", file: !24, line: 28, baseType: !247, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !24, line: 28, size: 512, align: 8, elements: !249)
!249 = !{!250, !251, !252, !253}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !24, line: 28, baseType: !153, size: 128, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !24, line: 28, baseType: !222, size: 192, align: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !24, line: 28, baseType: !53, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "wr", file: !24, line: 28, baseType: !254, size: 128, align: 64, offset: 384)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !24, line: 28, size: 128, align: 8, elements: !255)
!255 = !{!256, !141}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 28, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !61, size: 128, align: 8, elements: !259)
!259 = !{!232, !260}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !61, line: 28, baseType: !234, size: 64, align: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", file: !24, line: 50, baseType: !262, size: 64, align: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "Encoder", file: !24, line: 29, size: 1280, align: 8, elements: !264)
!264 = !{!265, !271, !276, !290, !311, !312, !313}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !24, line: 29, baseType: !266, size: 64, align: 32)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !24, line: 29, size: 64, align: 8, elements: !267)
!267 = !{!268, !270}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !24, line: 29, baseType: !269, size: 32, align: 32)
!269 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !24, line: 29, baseType: !50, size: 32, align: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !24, line: 29, baseType: !272, size: 192, align: 64, offset: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Writer,int,int}", file: !61, size: 192, align: 8, elements: !273)
!273 = !{!274, !72, !73}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !61, line: 1, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "sent", file: !24, line: 29, baseType: !277, size: 64, align: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !5, line: 1, size: 384, align: 8, elements: !279)
!279 = !{!280, !281, !282, !283, !285, !286, !287, !288, !289}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !5, line: 1, baseType: !53, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !5, line: 1, baseType: !69, size: 8, align: 8, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !5, line: 1, baseType: !69, size: 8, align: 8, offset: 72)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !5, line: 1, baseType: !284, size: 16, align: 16, offset: 80)
!284 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !5, line: 1, baseType: !50, size: 32, align: 32, offset: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !5, line: 1, baseType: !8, size: 64, align: 64, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "countState", file: !24, line: 29, baseType: !291, size: 64, align: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.encoderState", file: !24, line: 29, size: 448, align: 8, elements: !293)
!293 = !{!294, !295, !304, !305, !306, !310}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "enc", file: !24, line: 29, baseType: !9, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !24, line: 29, baseType: !296, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.encBuffer", file: !24, line: 29, size: 704, align: 8, elements: !298)
!298 = !{!299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "data", file: !24, line: 29, baseType: !222, size: 192, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", file: !24, line: 29, baseType: !301, size: 512, align: 8, offset: 192)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 512, align: 1, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "sendZero", file: !24, line: 29, baseType: !18, size: 8, align: 8, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "fieldnum", file: !24, line: 29, baseType: !53, size: 64, align: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !24, line: 29, baseType: !307, size: 72, align: 8, offset: 256)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 72, align: 1, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 9)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !24, line: 29, baseType: !9, size: 64, align: 64, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "freeList", file: !24, line: 29, baseType: !291, size: 64, align: 64, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "byteBuf", file: !24, line: 29, baseType: !297, size: 704, align: 64, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !24, line: 29, baseType: !153, size: 128, align: 64, offset: 1152)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", file: !24, line: 51, baseType: !315, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Decoder", file: !24, line: 29, size: 1024, align: 8, elements: !317)
!317 = !{!265, !318, !319, !323, !324, !325, !326, !335, !336}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !24, line: 29, baseType: !226, size: 128, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !24, line: 29, baseType: !320, size: 256, align: 64, offset: 192)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.decBuffer", file: !24, line: 29, size: 256, align: 8, elements: !321)
!321 = !{!299, !322}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !24, line: 29, baseType: !53, size: 64, align: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "wireType", file: !24, line: 29, baseType: !277, size: 64, align: 64, offset: 448)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "decoderCache", file: !24, line: 29, baseType: !277, size: 64, align: 64, offset: 512)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ignorerCache", file: !24, line: 29, baseType: !277, size: 64, align: 64, offset: 576)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "freeList", file: !24, line: 29, baseType: !327, size: 64, align: 64, offset: 640)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.decoderState", file: !24, line: 29, size: 256, align: 8, elements: !329)
!329 = !{!330, !331, !333, !334}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "dec", file: !24, line: 29, baseType: !9, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !24, line: 29, baseType: !332, size: 64, align: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "fieldnum", file: !24, line: 29, baseType: !53, size: 64, align: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !24, line: 29, baseType: !9, size: 64, align: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "countBuf", file: !24, line: 29, baseType: !222, size: 192, align: 64, offset: 704)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !24, line: 29, baseType: !153, size: 128, align: 64, offset: 896)
!337 = !DILocation(line: 100, column: 5, scope: !193)
!338 = !DILocation(line: 101, column: 5, scope: !207)
!339 = !DILocation(line: 102, column: 11, scope: !207)
!340 = !DILocation(line: 102, column: 5, scope: !207)
!341 = !DILocation(line: 104, column: 17, scope: !207)
!342 = !DILocation(line: 104, column: 5, scope: !207)
!343 = !DILocation(line: 105, column: 10, scope: !207)
!344 = !DILocation(line: 106, column: 10, scope: !207)
!345 = !DILocation(line: 108, column: 15, scope: !193)
!346 = !DILocation(line: 108, column: 18, scope: !193)
!347 = !DILocation(line: 108, column: 30, scope: !193)
!348 = !DILocation(line: 108, column: 14, scope: !193)
!349 = !DILocation(line: 109, column: 60, scope: !193)
!350 = !DILocation(line: 109, column: 9, scope: !193)
!351 = !DILocation(line: 110, column: 10, scope: !193)
!352 = !DILocation(line: 115, column: 9, scope: !180)
!353 = !DILocation(line: 115, column: 2, scope: !180)
!354 = !DILocation(line: 116, column: 13, scope: !355)
!355 = distinct !DILexicalBlock(scope: !180, file: !24, line: 116, column: 2)
!356 = !DILocation(line: 116, column: 20, scope: !355)
!357 = !DILocalVariable(name: "err", scope: !355, file: !24, line: 116, type: !153)
!358 = !DILocation(line: 116, column: 5, scope: !180)
!359 = !DILocation(line: 121, column: 13, scope: !180)
!360 = !DILocation(line: 121, column: 10, scope: !180)
!361 = !DILocation(line: 123, column: 7, scope: !180)
!362 = distinct !DISubprogram(name: "stream.Close..1command_line_arguments.Stream", linkageName: "command_line_arguments.Stream.Close", scope: null, file: !24, line: 184, type: !363, isLocal: false, isDefinition: true, scopeLine: 184, isOptimized: false, unit: !1, retainedNodes: !3)
!363 = !DISubroutineType(types: !364)
!364 = !{!153, !209, !209}
!365 = !DILocalVariable(name: "s", arg: 1, scope: !362, file: !24, line: 184, type: !209)
!366 = !DILocation(line: 184, column: 1, scope: !362)
!367 = !DILocation(line: 185, column: 10, scope: !362)
!368 = !DILocation(line: 185, column: 17, scope: !362)
!369 = !DILocation(line: 185, column: 2, scope: !362)
!370 = distinct !DISubprogram(name: "stream.Flush..1command_line_arguments.Stream", linkageName: "command_line_arguments.Stream.Flush", scope: null, file: !24, line: 165, type: !363, isLocal: false, isDefinition: true, scopeLine: 165, isOptimized: false, unit: !1, retainedNodes: !3)
!371 = !DILocalVariable(name: "s", arg: 1, scope: !370, file: !24, line: 165, type: !209)
!372 = !DILocation(line: 165, column: 1, scope: !370)
!373 = !DILocation(line: 166, column: 13, scope: !374)
!374 = distinct !DILexicalBlock(scope: !370, file: !24, line: 166, column: 2)
!375 = !DILocation(line: 166, column: 21, scope: !374)
!376 = !DILocalVariable(name: "err", scope: !374, file: !24, line: 166, type: !153)
!377 = !DILocation(line: 166, column: 5, scope: !370)
!378 = !DILocation(line: 166, column: 35, scope: !374)
!379 = !DILocalVariable(name: "$ret8", scope: !370, file: !24, line: 165, type: !153)
!380 = !DILocation(line: 165, column: 26, scope: !370)
!381 = !DILocation(line: 170, column: 2, scope: !370)
!382 = !DILocation(line: 167, column: 4, scope: !374)
!383 = !DILocation(line: 167, column: 11, scope: !374)
!384 = !DILocation(line: 168, column: 3, scope: !374)
!385 = distinct !DISubprogram(name: "stream.Recv..1command_line_arguments.Stream", linkageName: "command_line_arguments.Stream.Recv", scope: null, file: !24, line: 175, type: !386, isLocal: false, isDefinition: true, scopeLine: 175, isOptimized: false, unit: !1, retainedNodes: !3)
!386 = !DISubroutineType(types: !387)
!387 = !{!153, !209, !209, !388}
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !61, size: 128, align: 8, elements: !389)
!389 = !{!159, !390}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !61, line: 1, baseType: !9, size: 64, align: 64, offset: 64)
!391 = !DILocalVariable(name: "s", arg: 1, scope: !385, file: !24, line: 175, type: !209)
!392 = !DILocation(line: 175, column: 1, scope: !385)
!393 = !DILocalVariable(name: "data", arg: 2, scope: !385, file: !24, line: 175, type: !388)
!394 = !DILocation(line: 175, column: 23, scope: !385)
!395 = !DILocation(line: 176, column: 13, scope: !396)
!396 = distinct !DILexicalBlock(scope: !385, file: !24, line: 176, column: 2)
!397 = !DILocation(line: 176, column: 21, scope: !396)
!398 = !DILocalVariable(name: "err", scope: !396, file: !24, line: 176, type: !153)
!399 = !DILocation(line: 176, column: 5, scope: !385)
!400 = !DILocation(line: 176, column: 40, scope: !396)
!401 = !DILocalVariable(name: "$ret9", scope: !385, file: !24, line: 175, type: !153)
!402 = !DILocation(line: 175, column: 41, scope: !385)
!403 = !DILocation(line: 180, column: 2, scope: !385)
!404 = !DILocation(line: 177, column: 4, scope: !396)
!405 = !DILocation(line: 177, column: 11, scope: !396)
!406 = !DILocation(line: 178, column: 3, scope: !396)
!407 = distinct !DISubprogram(name: "stream.Send..1command_line_arguments.Stream", linkageName: "command_line_arguments.Stream.Send", scope: null, file: !24, line: 155, type: !386, isLocal: false, isDefinition: true, scopeLine: 155, isOptimized: false, unit: !1, retainedNodes: !3)
!408 = !DILocalVariable(name: "s", arg: 1, scope: !407, file: !24, line: 155, type: !209)
!409 = !DILocation(line: 155, column: 1, scope: !407)
!410 = !DILocalVariable(name: "data", arg: 2, scope: !407, file: !24, line: 155, type: !388)
!411 = !DILocation(line: 155, column: 23, scope: !407)
!412 = !DILocation(line: 156, column: 13, scope: !413)
!413 = distinct !DILexicalBlock(scope: !407, file: !24, line: 156, column: 2)
!414 = !DILocation(line: 156, column: 21, scope: !413)
!415 = !DILocalVariable(name: "err", scope: !413, file: !24, line: 156, type: !153)
!416 = !DILocation(line: 156, column: 5, scope: !407)
!417 = !DILocation(line: 156, column: 40, scope: !413)
!418 = !DILocalVariable(name: "$ret7", scope: !407, file: !24, line: 155, type: !153)
!419 = !DILocation(line: 155, column: 41, scope: !407)
!420 = !DILocation(line: 160, column: 2, scope: !407)
!421 = !DILocation(line: 157, column: 4, scope: !413)
!422 = !DILocation(line: 157, column: 11, scope: !413)
!423 = !DILocation(line: 158, column: 3, scope: !413)
!424 = distinct !DISubprogram(name: "stream.Sock..1command_line_arguments.Stream", linkageName: "command_line_arguments.Stream.Sock", scope: null, file: !24, line: 149, type: !425, isLocal: false, isDefinition: true, scopeLine: 149, isOptimized: false, unit: !1, retainedNodes: !3)
!425 = !DISubroutineType(types: !426)
!426 = !{!201, !209, !209}
!427 = !DILocalVariable(name: "s", arg: 1, scope: !424, file: !24, line: 149, type: !209)
!428 = !DILocation(line: 149, column: 1, scope: !424)
!429 = !DILocalVariable(name: "$ret6", scope: !424, file: !24, line: 149, type: !201)
!430 = !DILocation(line: 149, column: 25, scope: !424)
!431 = !DILocation(line: 150, column: 10, scope: !424)
!432 = !DILocation(line: 150, column: 2, scope: !424)
!433 = distinct !DISubprogram(name: "stream.command_line_arguments.Stream..hash", linkageName: "command_line_arguments.command_line_arguments.Stream..hash", scope: null, file: !5, line: 1, type: !6, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!434 = !DILocalVariable(name: "key", arg: 1, scope: !433, file: !5, line: 1, type: !9)
!435 = !DILocation(line: 1, column: 1, scope: !433)
!436 = !DILocalVariable(name: "seed", arg: 2, scope: !433, file: !5, line: 1, type: !8)
!437 = !DILocalVariable(name: "$ret13", scope: !433, file: !5, line: 1, type: !8)
!438 = distinct !DISubprogram(name: "stream.command_line_arguments.Stream..eq", linkageName: "command_line_arguments.command_line_arguments.Stream..eq", scope: null, file: !5, line: 1, type: !16, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!439 = !DILocalVariable(name: "key1", arg: 1, scope: !438, file: !5, line: 1, type: !9)
!440 = !DILocation(line: 1, column: 1, scope: !438)
!441 = !DILocalVariable(name: "key2", arg: 2, scope: !438, file: !5, line: 1, type: !9)
!442 = !DILocalVariable(name: "$ret14", scope: !438, file: !5, line: 1, type: !18)
!443 = distinct !DISubprogram(name: "stream.Listen", linkageName: "command_line_arguments.Listen", scope: null, file: !24, line: 56, type: !444, isLocal: false, isDefinition: true, scopeLine: 56, isOptimized: false, unit: !1, retainedNodes: !3)
!444 = !DISubroutineType(types: !445)
!445 = !{!446, !450}
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Listener,error}", file: !61, size: 192, align: 8, elements: !447)
!447 = !{!448, !449}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !61, line: 56, baseType: !27, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !61, line: 56, baseType: !153, size: 128, align: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "TCPAddr", file: !24, line: 31, size: 384, align: 8, elements: !452)
!452 = !{!453, !459, !460}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !24, line: 31, baseType: !454, size: 192, align: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !24, line: 31, size: 192, align: 8, elements: !455)
!455 = !{!456, !457, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !68, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !24, line: 1, baseType: !53, size: 64, align: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !24, line: 1, baseType: !53, size: 64, align: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Port", file: !24, line: 31, baseType: !53, size: 64, align: 64, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Zone", file: !24, line: 31, baseType: !83, size: 128, align: 64, offset: 256)
!461 = !DILocalVariable(name: "addr", arg: 1, scope: !443, file: !24, line: 56, type: !450)
!462 = !DILocation(line: 56, column: 13, scope: !443)
!463 = !DILocalVariable(name: "$ret0", scope: !443, file: !24, line: 56, type: !27)
!464 = !DILocation(line: 56, column: 33, scope: !443)
!465 = !DILocation(line: 58, column: 19, scope: !466)
!466 = distinct !DILexicalBlock(scope: !443, file: !24, line: 56, column: 1)
!467 = !DILocalVariable(name: "sock", scope: !466, file: !24, line: 58, type: !34)
!468 = !DILocation(line: 58, column: 2, scope: !443)
!469 = !DILocalVariable(name: "err", scope: !466, file: !24, line: 58, type: !153)
!470 = !DILocation(line: 59, column: 9, scope: !466)
!471 = !DILocalVariable(name: "$ret1", scope: !443, file: !24, line: 56, type: !153)
!472 = !DILocation(line: 56, column: 44, scope: !443)
!473 = !DILocation(line: 60, column: 3, scope: !466)
!474 = !DILocation(line: 62, column: 18, scope: !466)
!475 = !DILocation(line: 62, column: 25, scope: !466)
!476 = !DILocation(line: 62, column: 6, scope: !466)
!477 = !DILocation(line: 62, column: 40, scope: !466)
!478 = !DILocation(line: 62, column: 12, scope: !466)
!479 = !DILocation(line: 67, column: 11, scope: !466)
!480 = !DILocation(line: 68, column: 11, scope: !466)
!481 = !DILocation(line: 65, column: 9, scope: !466)
!482 = !DILocation(line: 65, column: 10, scope: !466)
!483 = !DILocation(line: 65, column: 2, scope: !466)
!484 = distinct !DISubprogram(name: "stream.command_line_arguments..thunk0", scope: null, file: !24, line: 75, type: !485, isLocal: true, isDefinition: true, scopeLine: 75, isOptimized: false, unit: !1, retainedNodes: !3)
!485 = !DISubroutineType(types: !486)
!486 = !{!10, !487}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Listener,Duration}", file: !61, size: 128, align: 8, elements: !489)
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !61, line: 75, baseType: !27, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "a1", file: !61, line: 75, baseType: !144, size: 64, align: 64, offset: 64)
!492 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !484, file: !24, line: 75, type: !487)
!493 = !DILocation(line: 75, column: 2, scope: !484)
!494 = distinct !DISubprogram(name: "stream.newStream", scope: null, file: !24, line: 127, type: !495, isLocal: true, isDefinition: true, scopeLine: 127, isOptimized: false, unit: !1, retainedNodes: !3)
!495 = !DISubroutineType(types: !496)
!496 = !{!209, !201}
!497 = !DILocalVariable(name: "sock", arg: 1, scope: !494, file: !24, line: 127, type: !201)
!498 = !DILocation(line: 127, column: 16, scope: !494)
!499 = !DILocalVariable(name: "$ret3", scope: !494, file: !24, line: 127, type: !209)
!500 = !DILocation(line: 127, column: 35, scope: !494)
!501 = !DILocation(line: 128, column: 28, scope: !502)
!502 = distinct !DILexicalBlock(scope: !494, file: !24, line: 127, column: 1)
!503 = !DILocation(line: 128, column: 18, scope: !502)
!504 = !DILocalVariable(name: "reader", scope: !502, file: !24, line: 128, type: !218)
!505 = !DILocation(line: 128, column: 2, scope: !494)
!506 = !DILocation(line: 129, column: 18, scope: !502)
!507 = !DILocalVariable(name: "writer", scope: !502, file: !24, line: 129, type: !247)
!508 = !DILocation(line: 129, column: 2, scope: !494)
!509 = !DILocation(line: 133, column: 18, scope: !502)
!510 = !DILocation(line: 134, column: 27, scope: !502)
!511 = !DILocation(line: 134, column: 16, scope: !502)
!512 = !DILocation(line: 135, column: 27, scope: !502)
!513 = !DILocation(line: 135, column: 16, scope: !502)
!514 = !DILocation(line: 131, column: 9, scope: !502)
!515 = !DILocation(line: 131, column: 10, scope: !502)
!516 = !DILocation(line: 131, column: 2, scope: !502)
!517 = distinct !DISubprogram(name: "stream.Dial", linkageName: "command_line_arguments.Dial", scope: null, file: !24, line: 140, type: !518, isLocal: false, isDefinition: true, scopeLine: 140, isOptimized: false, unit: !1, retainedNodes: !3)
!518 = !DISubroutineType(types: !519)
!519 = !{!520, !83, !144}
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Stream,error}", file: !61, size: 192, align: 8, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !61, line: 140, baseType: !209, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !61, line: 140, baseType: !153, size: 128, align: 64, offset: 64)
!524 = !DILocalVariable(name: "address", arg: 1, scope: !517, file: !24, line: 140, type: !83)
!525 = !DILocation(line: 140, column: 11, scope: !517)
!526 = !DILocalVariable(name: "timeout", arg: 2, scope: !517, file: !24, line: 140, type: !144)
!527 = !DILocation(line: 140, column: 27, scope: !517)
!528 = !DILocalVariable(name: "$ret4", scope: !517, file: !24, line: 140, type: !209)
!529 = !DILocation(line: 140, column: 51, scope: !517)
!530 = !DILocation(line: 141, column: 22, scope: !531)
!531 = distinct !DILexicalBlock(scope: !517, file: !24, line: 141, column: 2)
!532 = !DILocalVariable(name: "sock", scope: !531, file: !24, line: 141, type: !533)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !24, line: 31, size: 128, align: 8, elements: !534)
!534 = !{!535, !141}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 31, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)Addr,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void)Addr,*func(*void,Time)error,*func(*void,Time)error,*func(*void,Time)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !61, size: 576, align: 8, elements: !538)
!538 = !{!94, !539, !543, !547, !555, !556, !593, !594, !595}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !61, line: 31, baseType: !540, size: 64, align: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!153, !9}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "LocalAddr", file: !61, line: 31, baseType: !544, size: 64, align: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!88, !9}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !61, line: 31, baseType: !548, size: 64, align: 64, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!551, !9, !222}
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !61, size: 192, align: 8, elements: !552)
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !61, line: 31, baseType: !53, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !61, line: 31, baseType: !153, size: 128, align: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !61, line: 31, baseType: !544, size: 64, align: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "SetDeadline", file: !61, line: 31, baseType: !557, size: 64, align: 64, offset: 320)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!153, !9, !560}
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !24, line: 30, size: 192, align: 8, elements: !561)
!561 = !{!562, !563, !565}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !24, line: 30, baseType: !48, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !24, line: 30, baseType: !564, size: 64, align: 64, offset: 64)
!564 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !24, line: 30, baseType: !566, size: 64, align: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !24, line: 30, size: 704, align: 8, elements: !568)
!568 = !{!569, !570, !579, !590, !591, !592}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !24, line: 30, baseType: !83, size: 128, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !24, line: 30, baseType: !571, size: 192, align: 64, offset: 128)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !61, size: 192, align: 8, elements: !572)
!572 = !{!573, !72, !73}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !61, line: 1, baseType: !574, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !24, line: 30, size: 256, align: 8, elements: !576)
!576 = !{!569, !577, !578}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !24, line: 30, baseType: !53, size: 64, align: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !24, line: 30, baseType: !18, size: 8, align: 8, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !24, line: 30, baseType: !580, size: 192, align: 64, offset: 320)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !61, size: 192, align: 8, elements: !581)
!581 = !{!582, !72, !73}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !61, line: 1, baseType: !583, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !24, line: 30, size: 128, align: 8, elements: !585)
!585 = !{!586, !587, !588, !589}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !24, line: 30, baseType: !564, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !24, line: 30, baseType: !69, size: 8, align: 8, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !24, line: 30, baseType: !18, size: 8, align: 8, offset: 72)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !24, line: 30, baseType: !18, size: 8, align: 8, offset: 80)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !24, line: 30, baseType: !564, size: 64, align: 64, offset: 512)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !24, line: 30, baseType: !564, size: 64, align: 64, offset: 576)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !24, line: 30, baseType: !574, size: 64, align: 64, offset: 640)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "SetReadDeadline", file: !61, line: 31, baseType: !557, size: 64, align: 64, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "SetWriteDeadline", file: !61, line: 31, baseType: !557, size: 64, align: 64, offset: 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !61, line: 31, baseType: !548, size: 64, align: 64, offset: 512)
!596 = !DILocation(line: 141, column: 5, scope: !517)
!597 = !DILocalVariable(name: "err", scope: !531, file: !24, line: 141, type: !153)
!598 = !DILocation(line: 141, column: 64, scope: !531)
!599 = !DILocalVariable(name: "$ret5", scope: !517, file: !24, line: 140, type: !153)
!600 = !DILocation(line: 140, column: 60, scope: !517)
!601 = !DILocation(line: 142, column: 3, scope: !531)
!602 = !DILocation(line: 144, column: 20, scope: !531)
!603 = !DILocation(line: 144, column: 24, scope: !531)
!604 = !DILocation(line: 144, column: 10, scope: !531)
!605 = !DILocation(line: 144, column: 3, scope: !531)
!606 = distinct !DISubprogram(name: "stream.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !24, line: 25, type: !607, isLocal: false, isDefinition: true, scopeLine: 25, isOptimized: false, unit: !1, retainedNodes: !3)
!607 = !DISubroutineType(types: !608)
!608 = !{!10}
!609 = !DILocation(line: 1, column: 1, scope: !610)
!610 = !DILexicalBlockFile(scope: !606, file: !5, discriminator: 0)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "stream"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "command-line-arguments"
	.ascii ";\n"
	.ascii "import "
	.ascii "bufio"
	.ascii " "
	.ascii "bufio"
	.ascii " \""
	.ascii "bufio"
	.ascii "\";\n"
	.ascii "import "
	.ascii "gob"
	.ascii " "
	.ascii "encoding/gob"
	.ascii " \""
	.ascii "encoding/gob"
	.ascii "\";\n"
	.ascii "import "
	.ascii "log"
	.ascii " "
	.ascii "log"
	.ascii " \""
	.ascii "log"
	.ascii "\";\n"
	.ascii "import "
	.ascii "net"
	.ascii " "
	.ascii "net"
	.ascii " \""
	.ascii "net"
	.ascii "\";\n"
	.ascii "import "
	.ascii "time"
	.ascii " "
	.ascii "time"
	.ascii " \""
	.ascii "time"
	.ascii "\";\n"
	.ascii "init"
	.ascii " "
	.ascii "bufio"
	.ascii " "
	.ascii "bufio..import"
	.ascii " "
	.ascii "bytes"
	.ascii " "
	.ascii "bytes..import"
	.ascii " "
	.ascii "context"
	.ascii " "
	.ascii "context..import"
	.ascii " "
	.ascii "binary"
	.ascii " "
	.ascii "encoding_binary..import"
	.ascii " "
	.ascii "gob"
	.ascii " "
	.ascii "encoding_gob..import"
	.ascii " "
	.ascii "fmt"
	.ascii " "
	.ascii "fmt..import"
	.ascii " "
	.ascii "poll"
	.ascii " "
	.ascii "internal_poll..import"
	.ascii " "
	.ascii "testlog"
	.ascii " "
	.ascii "internal_testlog..import"
	.ascii " "
	.ascii "io"
	.ascii " "
	.ascii "io..import"
	.ascii " "
	.ascii "log"
	.ascii " "
	.ascii "log..import"
	.ascii " "
	.ascii "rand"
	.ascii " "
	.ascii "math_rand..import"
	.ascii " "
	.ascii "net"
	.ascii " "
	.ascii "net..import"
	.ascii " "
	.ascii "os"
	.ascii " "
	.ascii "os..import"
	.ascii " "
	.ascii "reflect"
	.ascii " "
	.ascii "reflect..import"
	.ascii " "
	.ascii "runtime"
	.ascii " "
	.ascii "runtime..import"
	.ascii " "
	.ascii "sys"
	.ascii " "
	.ascii "runtime_internal_sys..import"
	.ascii " "
	.ascii "strconv"
	.ascii " "
	.ascii "strconv..import"
	.ascii " "
	.ascii "sync"
	.ascii " "
	.ascii "sync..import"
	.ascii " "
	.ascii "syscall"
	.ascii " "
	.ascii "syscall..import"
	.ascii " "
	.ascii "time"
	.ascii " "
	.ascii "time..import"
	.ascii " "
	.ascii "unicode"
	.ascii " "
	.ascii "unicode..import"
	.ascii ";\n"
	.ascii "init_graph"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "8"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "14"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "15"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "17"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "20"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "8"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "14"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "15"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "17"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "20"
	.ascii " "
	.ascii "2"
	.ascii " "
	.ascii "5"
	.ascii " "
	.ascii "2"
	.ascii " "
	.ascii "6"
	.ascii " "
	.ascii "2"
	.ascii " "
