; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22docker\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./docker.go", directory: "/home/wangcong/go_path/src/github.com/project-iris/iris/test/docker")
!3 = !{}
!4 = !{!5, !74, !76}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "os.Stdout", linkageName: "os.Stdout", scope: !1, file: !7, line: 27, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "docker.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !7, line: 27, size: 64, align: 8, elements: !10)
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !7, line: 27, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !7, line: 27, size: 640, align: 8, elements: !14)
!14 = !{!15, !55, !61, !72, !73}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !7, line: 27, baseType: !16, size: 384, align: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !7, line: 27, size: 384, align: 8, elements: !17)
!17 = !{!18, !26, !28, !33, !49, !50, !52, !53, !54}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !7, line: 27, baseType: !19, size: 128, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !7, line: 27, size: 128, align: 8, elements: !20)
!20 = !{!21, !23, !25}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 27, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !7, line: 27, baseType: !24, size: 32, align: 32, offset: 64)
!24 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !7, line: 27, baseType: !24, size: 32, align: 32, offset: 96)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !7, line: 27, baseType: !27, size: 64, align: 64, offset: 128)
!27 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !7, line: 27, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !7, line: 27, size: 64, align: 8, elements: !30)
!30 = !{!31}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !7, line: 27, baseType: !32, size: 64, align: 64)
!32 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !7, line: 27, baseType: !34, size: 64, align: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !36, size: 192, align: 8, elements: !37)
!36 = !DIFile(filename: "", directory: "")
!37 = !{!38, !47, !48}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !7, line: 27, size: 128, align: 8, elements: !41)
!41 = !{!42, !45}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !7, line: 27, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !7, line: 27, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !36, line: 1, baseType: !27, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !36, line: 1, baseType: !27, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !7, line: 27, baseType: !24, size: 32, align: 32, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !7, line: 27, baseType: !51, size: 8, align: 8, offset: 352)
!51 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !7, line: 27, baseType: !51, size: 8, align: 8, offset: 360)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !7, line: 27, baseType: !51, size: 8, align: 8, offset: 368)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !7, line: 27, baseType: !51, size: 8, align: 8, offset: 376)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 27, baseType: !56, size: 128, align: 64, offset: 384)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !57, line: 1, size: 128, align: 8, elements: !58)
!57 = !DIFile(filename: "<built-in>", directory: "")
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !57, line: 1, baseType: !43, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !57, line: 1, baseType: !27, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !7, line: 27, baseType: !62, size: 64, align: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !7, line: 27, size: 256, align: 8, elements: !64)
!64 = !{!65, !69}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 27, baseType: !66, size: 192, align: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !36, size: 192, align: 8, elements: !67)
!67 = !{!68, !47, !48}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !43, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !7, line: 27, baseType: !70, size: 64, align: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !7, line: 27, align: 8, elements: !3)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !7, line: 27, baseType: !51, size: 8, align: 8, offset: 576)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !7, line: 27, baseType: !51, size: 8, align: 8, offset: 584)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "os.Stderr", linkageName: "os.Stderr", scope: !1, file: !7, line: 27, type: !8, isLocal: false, isDefinition: true)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !57, line: 1, type: !24, isLocal: false, isDefinition: true)
!78 = distinct !DISubprogram(name: "docker.CheckInstallation", linkageName: "command_line_arguments.CheckInstallation", scope: null, file: !7, line: 36, type: !79, isLocal: false, isDefinition: true, scopeLine: 36, isOptimized: false, unit: !1, retainedNodes: !3)
!79 = !DISubroutineType(types: !80)
!80 = !{!81}
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !57, line: 1, size: 128, align: 8, elements: !82)
!82 = !{!83, !139}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !57, line: 1, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !36, size: 128, align: 8, elements: !86)
!86 = !{!87, !135}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !36, line: 1, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !57, line: 1, size: 576, align: 8, elements: !90)
!90 = !{!91, !92, !93, !94, !95, !96, !97, !107, !115, !116, !118, !134}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !57, line: 1, baseType: !32, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !57, line: 1, baseType: !32, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !57, line: 1, baseType: !24, size: 32, align: 32, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !57, line: 1, baseType: !44, size: 8, align: 8, offset: 160)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !57, line: 1, baseType: !44, size: 8, align: 8, offset: 168)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !57, line: 1, baseType: !44, size: 8, align: 8, offset: 176)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !57, line: 1, baseType: !98, size: 64, align: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !57, line: 1, size: 64, align: 8, elements: !100)
!100 = !{!101}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !57, line: 1, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!32, !105, !32}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIBasicType(name: "void")
!107 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !57, line: 1, baseType: !108, size: 64, align: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !57, line: 1, size: 64, align: 8, elements: !110)
!110 = !{!111}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !57, line: 1, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!51, !105, !105}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !57, line: 1, baseType: !43, size: 64, align: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !57, line: 1, baseType: !117, size: 64, align: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !57, line: 1, baseType: !119, size: 64, align: 64, offset: 448)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !57, line: 1, size: 320, align: 8, elements: !121)
!121 = !{!122, !123, !124}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !57, line: 1, baseType: !117, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !57, line: 1, baseType: !117, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !57, line: 1, baseType: !125, size: 192, align: 64, offset: 128)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !36, size: 192, align: 8, elements: !126)
!126 = !{!127, !47, !48}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !57, line: 1, size: 320, align: 8, elements: !130)
!130 = !{!122, !123, !131, !132, !133}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !57, line: 1, baseType: !105, size: 64, align: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !57, line: 1, baseType: !105, size: 64, align: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !57, line: 1, baseType: !105, size: 64, align: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !57, line: 1, baseType: !105, size: 64, align: 64, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !36, line: 1, baseType: !136, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!56, !105}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !57, line: 1, baseType: !105, size: 64, align: 64, offset: 64)
!140 = !DILocation(line: 37, column: 17, scope: !141)
!141 = distinct !DILexicalBlock(scope: !78, file: !7, line: 36, column: 1)
!142 = !DILocalVariable(name: "err", scope: !141, file: !7, line: 37, type: !81)
!143 = !DILocation(line: 37, column: 2, scope: !78)
!144 = !DILocalVariable(name: "$ret0", scope: !78, file: !7, line: 36, type: !81)
!145 = !DILocation(line: 36, column: 26, scope: !78)
!146 = !DILocation(line: 38, column: 2, scope: !141)
!147 = distinct !DISubprogram(name: "docker.CheckImage", linkageName: "command_line_arguments.CheckImage", scope: null, file: !7, line: 42, type: !148, isLocal: false, isDefinition: true, scopeLine: 42, isOptimized: false, unit: !1, retainedNodes: !3)
!148 = !DISubroutineType(types: !149)
!149 = !{!150, !56}
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,error}", file: !36, size: 192, align: 8, elements: !151)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !36, line: 42, baseType: !51, size: 8, align: 8)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !36, line: 42, baseType: !81, size: 128, align: 64, offset: 64)
!154 = !DILocalVariable(name: "image", arg: 1, scope: !147, file: !7, line: 42, type: !56)
!155 = !DILocation(line: 42, column: 17, scope: !147)
!156 = !DILocalVariable(name: "$ret1", scope: !147, file: !7, line: 42, type: !51)
!157 = !DILocation(line: 42, column: 32, scope: !147)
!158 = !DILocation(line: 43, column: 19, scope: !159)
!159 = distinct !DILexicalBlock(scope: !147, file: !7, line: 42, column: 1)
!160 = !DILocation(line: 43, column: 58, scope: !159)
!161 = !DILocalVariable(name: "err", scope: !159, file: !7, line: 43, type: !81)
!162 = !DILocation(line: 43, column: 2, scope: !147)
!163 = !DILocation(line: 44, column: 9, scope: !159)
!164 = !DILocalVariable(name: "$ret2", scope: !147, file: !7, line: 42, type: !81)
!165 = !DILocation(line: 42, column: 38, scope: !147)
!166 = !DILocation(line: 45, column: 3, scope: !159)
!167 = !DILocation(line: 47, column: 35, scope: !159)
!168 = !DILocalVariable(name: "out", scope: !159, file: !7, line: 43, type: !66)
!169 = !DILocation(line: 47, column: 15, scope: !159)
!170 = !DILocation(line: 47, column: 2, scope: !159)
!171 = distinct !DISubprogram(name: "docker.PullImage", linkageName: "command_line_arguments.PullImage", scope: null, file: !7, line: 51, type: !172, isLocal: false, isDefinition: true, scopeLine: 51, isOptimized: false, unit: !1, retainedNodes: !3)
!172 = !DISubroutineType(types: !173)
!173 = !{!81, !56}
!174 = !DILocalVariable(name: "image", arg: 1, scope: !171, file: !7, line: 51, type: !56)
!175 = !DILocation(line: 51, column: 16, scope: !171)
!176 = !DILocation(line: 52, column: 14, scope: !177)
!177 = distinct !DILexicalBlock(scope: !171, file: !7, line: 51, column: 1)
!178 = !DILocalVariable(name: "cmd", scope: !177, file: !7, line: 52, type: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cmd", file: !7, line: 28, size: 2624, align: 8, elements: !181)
!181 = !{!182, !183, !187, !188, !189, !206, !214, !215, !220, !266, !286, !320, !385, !386, !387, !388, !400, !401, !411, !412}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !7, line: 28, baseType: !56, size: 128, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Args", file: !7, line: 28, baseType: !184, size: 192, align: 64, offset: 128)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !36, size: 192, align: 8, elements: !185)
!185 = !{!186, !47, !48}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !117, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Env", file: !7, line: 28, baseType: !184, size: 192, align: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Dir", file: !7, line: 28, baseType: !56, size: 128, align: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Stdin", file: !7, line: 28, baseType: !190, size: 128, align: 64, offset: 640)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !7, line: 23, size: 128, align: 8, elements: !191)
!191 = !{!192, !205}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 23, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !36, size: 128, align: 8, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !36, line: 23, baseType: !88, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !36, line: 23, baseType: !198, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!201, !105, !66}
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !36, size: 192, align: 8, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !36, line: 23, baseType: !27, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !36, line: 23, baseType: !81, size: 128, align: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !105, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Stdout", file: !7, line: 28, baseType: !207, size: 128, align: 64, offset: 768)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !7, line: 23, size: 128, align: 8, elements: !208)
!208 = !{!209, !205}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 23, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !36, size: 128, align: 8, elements: !212)
!212 = !{!196, !213}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !36, line: 23, baseType: !198, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Stderr", file: !7, line: 28, baseType: !207, size: 128, align: 64, offset: 896)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraFiles", file: !7, line: 28, baseType: !216, size: 192, align: 64, offset: 1024)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**File,int,int}", file: !36, size: 192, align: 8, elements: !217)
!217 = !{!218, !47, !48}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "SysProcAttr", file: !7, line: 28, baseType: !221, size: 64, align: 64, offset: 1216)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "SysProcAttr", file: !7, line: 27, size: 1280, align: 8, elements: !223)
!223 = !{!224, !225, !237, !238, !239, !240, !241, !242, !243, !244, !245, !247, !248, !249, !259, !260, !261}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Chroot", file: !7, line: 27, baseType: !56, size: 128, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Credential", file: !7, line: 27, baseType: !226, size: 64, align: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Credential", file: !7, line: 27, size: 320, align: 8, elements: !228)
!228 = !{!229, !230, !231, !236}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Uid", file: !7, line: 27, baseType: !24, size: 32, align: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Gid", file: !7, line: 27, baseType: !24, size: 32, align: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Groups", file: !7, line: 27, baseType: !232, size: 192, align: 64, offset: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint32,int,int}", file: !36, size: 192, align: 8, elements: !233)
!233 = !{!234, !47, !48}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "NoSetGroups", file: !7, line: 27, baseType: !51, size: 8, align: 8, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Ptrace", file: !7, line: 27, baseType: !51, size: 8, align: 8, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Setsid", file: !7, line: 27, baseType: !51, size: 8, align: 8, offset: 200)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "Setpgid", file: !7, line: 27, baseType: !51, size: 8, align: 8, offset: 208)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Setctty", file: !7, line: 27, baseType: !51, size: 8, align: 8, offset: 216)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Noctty", file: !7, line: 27, baseType: !51, size: 8, align: 8, offset: 224)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Ctty", file: !7, line: 27, baseType: !27, size: 64, align: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Foreground", file: !7, line: 27, baseType: !51, size: 8, align: 8, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Pgid", file: !7, line: 27, baseType: !27, size: 64, align: 64, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Pdeathsig", file: !7, line: 27, baseType: !246, size: 64, align: 64, offset: 448)
!246 = !DIBasicType(name: "Signal", size: 64, encoding: DW_ATE_signed)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Cloneflags", file: !7, line: 27, baseType: !32, size: 64, align: 64, offset: 512)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Unshareflags", file: !7, line: 27, baseType: !32, size: 64, align: 64, offset: 576)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "UidMappings", file: !7, line: 27, baseType: !250, size: 192, align: 64, offset: 640)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*SysProcIDMap,int,int}", file: !36, size: 192, align: 8, elements: !251)
!251 = !{!252, !47, !48}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "SysProcIDMap", file: !7, line: 27, size: 192, align: 8, elements: !255)
!255 = !{!256, !257, !258}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ContainerID", file: !7, line: 27, baseType: !27, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "HostID", file: !7, line: 27, baseType: !27, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !7, line: 27, baseType: !27, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "GidMappings", file: !7, line: 27, baseType: !250, size: 192, align: 64, offset: 832)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "GidMappingsEnableSetgroups", file: !7, line: 27, baseType: !51, size: 8, align: 8, offset: 1024)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "AmbientCaps", file: !7, line: 27, baseType: !262, size: 192, align: 64, offset: 1088)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !36, size: 192, align: 8, elements: !263)
!263 = !{!264, !47, !48}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Process", file: !7, line: 28, baseType: !267, size: 64, align: 64, offset: 1280)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "Process", file: !7, line: 27, size: 384, align: 8, elements: !269)
!269 = !{!270, !271, !272, !273}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Pid", file: !7, line: 27, baseType: !27, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "handle", file: !7, line: 27, baseType: !32, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "isdone", file: !7, line: 27, baseType: !24, size: 32, align: 32, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "sigMu", file: !7, line: 27, baseType: !274, size: 192, align: 32, offset: 160)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !7, line: 27, size: 192, align: 8, elements: !275)
!275 = !{!276, !282, !283, !284, !285}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !7, line: 27, baseType: !277, size: 64, align: 32)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 27, size: 64, align: 8, elements: !278)
!278 = !{!279, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 27, baseType: !280, size: 32, align: 32)
!280 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 27, baseType: !24, size: 32, align: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !7, line: 27, baseType: !24, size: 32, align: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !7, line: 27, baseType: !24, size: 32, align: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !7, line: 27, baseType: !280, size: 32, align: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !7, line: 27, baseType: !280, size: 32, align: 32, offset: 160)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessState", file: !7, line: 28, baseType: !287, size: 64, align: 64, offset: 1344)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProcessState", file: !7, line: 27, size: 192, align: 8, elements: !289)
!289 = !{!290, !291, !293}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pid", file: !7, line: 27, baseType: !27, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !7, line: 27, baseType: !292, size: 32, align: 32, offset: 64)
!292 = !DIBasicType(name: "WaitStatus", size: 32, encoding: DW_ATE_unsigned)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "rusage", file: !7, line: 27, baseType: !294, size: 64, align: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rusage", file: !7, line: 27, size: 1152, align: 8, elements: !296)
!296 = !{!297, !304, !305, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Utime", file: !7, line: 27, baseType: !298, size: 128, align: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timeval", file: !7, line: 27, size: 128, align: 8, elements: !299)
!299 = !{!300, !302}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Sec", file: !7, line: 27, baseType: !301, size: 64, align: 64)
!301 = !DIBasicType(name: "Timeval_sec_t", size: 64, encoding: DW_ATE_signed)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Usec", file: !7, line: 27, baseType: !303, size: 64, align: 64, offset: 64)
!303 = !DIBasicType(name: "Timeval_usec_t", size: 64, encoding: DW_ATE_signed)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Stime", file: !7, line: 27, baseType: !298, size: 128, align: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Maxrss", file: !7, line: 27, baseType: !306, size: 64, align: 64, offset: 256)
!306 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Ixrss", file: !7, line: 27, baseType: !306, size: 64, align: 64, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Idrss", file: !7, line: 27, baseType: !306, size: 64, align: 64, offset: 384)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Isrss", file: !7, line: 27, baseType: !306, size: 64, align: 64, offset: 448)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Minflt", file: !7, line: 27, baseType: !306, size: 64, align: 64, offset: 512)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Majflt", file: !7, line: 27, baseType: !306, size: 64, align: 64, offset: 576)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Nswap", file: !7, line: 27, baseType: !306, size: 64, align: 64, offset: 640)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Inblock", file: !7, line: 27, baseType: !306, size: 64, align: 64, offset: 704)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Oublock", file: !7, line: 27, baseType: !306, size: 64, align: 64, offset: 768)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Msgsnd", file: !7, line: 27, baseType: !306, size: 64, align: 64, offset: 832)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Msgrcv", file: !7, line: 27, baseType: !306, size: 64, align: 64, offset: 896)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Nsignals", file: !7, line: 27, baseType: !306, size: 64, align: 64, offset: 960)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Nvcsw", file: !7, line: 27, baseType: !306, size: 64, align: 64, offset: 1024)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Nivcsw", file: !7, line: 27, baseType: !306, size: 64, align: 64, offset: 1088)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !7, line: 28, baseType: !321, size: 128, align: 64, offset: 1408)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !7, line: 28, size: 128, align: 8, elements: !322)
!322 = !{!323, !205}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 28, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,Token)Token}", file: !36, size: 320, align: 8, elements: !326)
!326 = !{!327, !328, !368, !374, !378}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !36, line: 28, baseType: !88, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !36, line: 28, baseType: !329, size: 64, align: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!332, !105}
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !36, size: 256, align: 8, elements: !333)
!333 = !{!334, !367}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !36, line: 28, baseType: !335, size: 192, align: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 27, size: 192, align: 8, elements: !336)
!336 = !{!337, !338, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 27, baseType: !22, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 27, baseType: !306, size: 64, align: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 27, baseType: !340, size: 64, align: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 27, size: 704, align: 8, elements: !342)
!342 = !{!343, !344, !353, !364, !365, !366}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 27, baseType: !56, size: 128, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 27, baseType: !345, size: 192, align: 64, offset: 128)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !36, size: 192, align: 8, elements: !346)
!346 = !{!347, !47, !48}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 27, size: 256, align: 8, elements: !350)
!350 = !{!343, !351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 27, baseType: !27, size: 64, align: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 27, baseType: !51, size: 8, align: 8, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 27, baseType: !354, size: 192, align: 64, offset: 320)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !36, size: 192, align: 8, elements: !355)
!355 = !{!356, !47, !48}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 27, size: 128, align: 8, elements: !359)
!359 = !{!360, !361, !362, !363}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 27, baseType: !306, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 27, baseType: !44, size: 8, align: 8, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 27, baseType: !51, size: 8, align: 8, offset: 72)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 27, baseType: !51, size: 8, align: 8, offset: 80)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 27, baseType: !306, size: 64, align: 64, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 27, baseType: !306, size: 64, align: 64, offset: 576)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 27, baseType: !348, size: 64, align: 64, offset: 640)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !36, line: 28, baseType: !51, size: 8, align: 8, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !36, line: 28, baseType: !369, size: 64, align: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!372, !105}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !57, line: 1, align: 8, elements: !3)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !36, line: 28, baseType: !375, size: 64, align: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!81, !105}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !36, line: 28, baseType: !379, size: 64, align: 64, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!382, !105, !382}
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "Token", file: !7, line: 24, size: 128, align: 8, elements: !383)
!383 = !{!384, !205}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !7, line: 1, baseType: !88, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "lookPathErr", file: !7, line: 28, baseType: !81, size: 128, align: 64, offset: 1536)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "finished", file: !7, line: 28, baseType: !51, size: 8, align: 8, offset: 1664)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "childFiles", file: !7, line: 28, baseType: !216, size: 192, align: 64, offset: 1728)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "closeAfterStart", file: !7, line: 28, baseType: !389, size: 192, align: 64, offset: 1920)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Closer,int,int}", file: !36, size: 192, align: 8, elements: !390)
!390 = !{!391, !47, !48}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "Closer", file: !7, line: 28, size: 128, align: 8, elements: !394)
!394 = !{!395, !205}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 28, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error}", file: !36, size: 128, align: 8, elements: !398)
!398 = !{!327, !399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !36, line: 28, baseType: !375, size: 64, align: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "closeAfterWait", file: !7, line: 28, baseType: !389, size: 192, align: 64, offset: 2112)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "goroutine", file: !7, line: 28, baseType: !402, size: 192, align: 64, offset: 2304)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**__go_descriptor,int,int}", file: !36, size: 192, align: 8, elements: !403)
!403 = !{!404, !47, !48}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 28, size: 64, align: 8, elements: !408)
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 28, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "errch", file: !7, line: 28, baseType: !372, size: 64, align: 64, offset: 2496)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "waitDone", file: !7, line: 28, baseType: !372, size: 64, align: 64, offset: 2560)
!413 = !DILocation(line: 52, column: 2, scope: !171)
!414 = !DILocation(line: 53, column: 30, scope: !177)
!415 = !DILocation(line: 53, column: 25, scope: !177)
!416 = !DILocation(line: 53, column: 41, scope: !177)
!417 = !DILocation(line: 53, column: 5, scope: !177)
!418 = !DILocation(line: 53, column: 17, scope: !177)
!419 = !DILocation(line: 55, column: 12, scope: !177)
!420 = !DILocation(line: 55, column: 2, scope: !177)
!421 = distinct !DISubprogram(name: "docker.StartContainer", linkageName: "command_line_arguments.StartContainer", scope: null, file: !7, line: 59, type: !422, isLocal: false, isDefinition: true, scopeLine: 59, isOptimized: false, unit: !1, retainedNodes: !3)
!422 = !DISubroutineType(types: !423)
!423 = !{!424, !184, !56, !184}
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !36, size: 256, align: 8, elements: !425)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !36, line: 28, baseType: !56, size: 128, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !36, line: 28, baseType: !81, size: 128, align: 64, offset: 128)
!428 = !DILocalVariable(name: "params", arg: 3, scope: !421, file: !7, line: 59, type: !184)
!429 = !DILocation(line: 59, column: 50, scope: !421)
!430 = !DILocalVariable(name: "args", arg: 1, scope: !421, file: !7, line: 59, type: !184)
!431 = !DILocation(line: 59, column: 21, scope: !421)
!432 = !DILocalVariable(name: "image", arg: 2, scope: !421, file: !7, line: 59, type: !56)
!433 = !DILocation(line: 59, column: 36, scope: !421)
!434 = !DILocation(line: 60, column: 19, scope: !435)
!435 = distinct !DILexicalBlock(scope: !421, file: !7, line: 59, column: 1)
!436 = !DILocation(line: 60, column: 12, scope: !435)
!437 = !DILocation(line: 61, column: 20, scope: !435)
!438 = !DILocation(line: 61, column: 13, scope: !435)
!439 = !DILocation(line: 63, column: 35, scope: !435)
!440 = !DILocation(line: 63, column: 19, scope: !435)
!441 = !DILocation(line: 63, column: 65, scope: !435)
!442 = !DILocalVariable(name: "err", scope: !435, file: !7, line: 63, type: !81)
!443 = !DILocation(line: 63, column: 2, scope: !421)
!444 = !DILocation(line: 64, column: 9, scope: !435)
!445 = !DILocalVariable(name: "$ret4", scope: !421, file: !7, line: 59, type: !56)
!446 = !DILocation(line: 59, column: 69, scope: !421)
!447 = !DILocalVariable(name: "$ret5", scope: !421, file: !7, line: 59, type: !81)
!448 = !DILocation(line: 59, column: 77, scope: !421)
!449 = !DILocation(line: 65, column: 3, scope: !435)
!450 = !DILocation(line: 67, column: 27, scope: !435)
!451 = !DILocation(line: 67, column: 17, scope: !435)
!452 = !DILocation(line: 67, column: 2, scope: !435)
!453 = distinct !DISubprogram(name: "docker.CloseContainer", linkageName: "command_line_arguments.CloseContainer", scope: null, file: !7, line: 71, type: !172, isLocal: false, isDefinition: true, scopeLine: 71, isOptimized: false, unit: !1, retainedNodes: !3)
!454 = !DILocalVariable(name: "container", arg: 1, scope: !453, file: !7, line: 71, type: !56)
!455 = !DILocation(line: 71, column: 21, scope: !453)
!456 = !DILocation(line: 72, column: 14, scope: !453)
!457 = !DILocation(line: 72, column: 52, scope: !453)
!458 = !DILocation(line: 72, column: 2, scope: !453)
!459 = distinct !DISubprogram(name: "docker.FetchIPAddress", linkageName: "command_line_arguments.FetchIPAddress", scope: null, file: !7, line: 76, type: !460, isLocal: false, isDefinition: true, scopeLine: 76, isOptimized: false, unit: !1, retainedNodes: !3)
!460 = !DISubroutineType(types: !461)
!461 = !{!424, !56}
!462 = !DILocalVariable(name: "container", arg: 1, scope: !459, file: !7, line: 76, type: !56)
!463 = !DILocation(line: 76, column: 21, scope: !459)
!464 = !DILocation(line: 85, column: 19, scope: !465)
!465 = distinct !DILexicalBlock(scope: !459, file: !7, line: 76, column: 1)
!466 = !DILocation(line: 85, column: 56, scope: !465)
!467 = !DILocalVariable(name: "err", scope: !465, file: !7, line: 85, type: !81)
!468 = !DILocation(line: 85, column: 2, scope: !459)
!469 = !DILocation(line: 86, column: 9, scope: !465)
!470 = !DILocalVariable(name: "$ret7", scope: !459, file: !7, line: 76, type: !56)
!471 = !DILocation(line: 76, column: 40, scope: !459)
!472 = !DILocation(line: 87, column: 3, scope: !465)
!473 = !DILocalVariable(name: "$ret8", scope: !459, file: !7, line: 76, type: !81)
!474 = !DILocation(line: 76, column: 48, scope: !459)
!475 = !DILocation(line: 89, column: 6, scope: !465)
!476 = !DILocalVariable(name: "containers", scope: !465, file: !7, line: 89, type: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.command-line-arguments.containerSettings,int,int}", file: !36, size: 192, align: 8, elements: !479)
!479 = !{!480, !47, !48}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !481, size: 64, align: 64)
