; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22rand\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/rand\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/rand\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22rsa\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/rsa\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/rsa\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./acme.go", directory: "/home/wangcong/go_path/src/github.com/kelseyhightower/kube-cert-manager")
!3 = !{}
!4 = !{!5, !9, !12, !86, !88, !482, !492, !509, !511, !513, !515, !517, !520, !523, !525, !527}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "main.certExpiry", linkageName: "main.certExpiry", scope: !1, file: !7, line: 31, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "acme.go", directory: ".")
!8 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "main.certBundle", linkageName: "main.certBundle", scope: !1, file: !7, line: 32, type: !11, isLocal: true, isDefinition: true)
!11 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "main.ErrNotFound", linkageName: "main.ErrNotFound", scope: !1, file: !7, line: 36, type: !14, isLocal: false, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !15, line: 1, size: 128, align: 8, elements: !16)
!15 = !DIFile(filename: "<built-in>", directory: "")
!16 = !{!17, !85}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !15, line: 1, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !20, size: 128, align: 8, elements: !21)
!20 = !DIFile(filename: "", directory: "")
!21 = !{!22, !81}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !20, line: 1, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !15, line: 1, size: 576, align: 8, elements: !25)
!25 = !{!26, !28, !29, !31, !33, !34, !35, !45, !53, !55, !62, !80}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !15, line: 1, baseType: !27, size: 64, align: 64)
!27 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !15, line: 1, baseType: !27, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !15, line: 1, baseType: !30, size: 32, align: 32, offset: 128)
!30 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !15, line: 1, baseType: !32, size: 8, align: 8, offset: 160)
!32 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !15, line: 1, baseType: !32, size: 8, align: 8, offset: 168)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !15, line: 1, baseType: !32, size: 8, align: 8, offset: 176)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !15, line: 1, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !15, line: 1, size: 64, align: 8, elements: !38)
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !15, line: 1, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!27, !43, !27}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "void")
!45 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !15, line: 1, baseType: !46, size: 64, align: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !15, line: 1, size: 64, align: 8, elements: !48)
!48 = !{!49}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !15, line: 1, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!11, !43, !43}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !15, line: 1, baseType: !54, size: 64, align: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !15, line: 1, baseType: !56, size: 64, align: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !15, line: 1, size: 128, align: 8, elements: !58)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !15, line: 1, baseType: !54, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !15, line: 1, baseType: !61, size: 64, align: 64, offset: 64)
!61 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !15, line: 1, baseType: !63, size: 64, align: 64, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !15, line: 1, size: 320, align: 8, elements: !65)
!65 = !{!66, !67, !68}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !15, line: 1, baseType: !56, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !15, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !15, line: 1, baseType: !69, size: 192, align: 64, offset: 128)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !20, size: 192, align: 8, elements: !70)
!70 = !{!71, !78, !79}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !15, line: 1, size: 320, align: 8, elements: !74)
!74 = !{!66, !67, !75, !76, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !15, line: 1, baseType: !43, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !15, line: 1, baseType: !43, size: 64, align: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !15, line: 1, baseType: !43, size: 64, align: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !20, line: 1, baseType: !61, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !20, line: 1, baseType: !61, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !15, line: 1, baseType: !43, size: 64, align: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !20, line: 1, baseType: !82, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!57, !43}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !15, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !15, line: 1, type: !30, isLocal: false, isDefinition: true)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "main.httpClient", linkageName: "main.httpClient", scope: !1, file: !90, line: 22, type: !91, isLocal: true, isDefinition: true)
!90 = !DIFile(filename: "http.go", directory: ".")
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Client", file: !7, line: 27, size: 384, align: 8, elements: !92)
!92 = !{!93, !436, !448, !481}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Transport", file: !7, line: 27, baseType: !94, size: 128, align: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "RoundTripper", file: !7, line: 27, size: 128, align: 8, elements: !95)
!95 = !{!96, !152}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 27, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*Request)struct{*Response,error}}", file: !20, size: 128, align: 8, elements: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !20, line: 27, baseType: !23, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "RoundTrip", file: !20, line: 27, baseType: !102, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!105, !43, !163}
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Response,error}", file: !20, size: 192, align: 8, elements: !106)
!106 = !{!107, !435}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 27, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !7, line: 27, size: 1152, align: 8, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !116, !130, !153, !155, !159, !160, !161, !162, !434}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !7, line: 27, baseType: !57, size: 128, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "StatusCode", file: !7, line: 27, baseType: !61, size: 64, align: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Proto", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMajor", file: !7, line: 27, baseType: !61, size: 64, align: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMinor", file: !7, line: 27, baseType: !61, size: 64, align: 64, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !7, line: 27, baseType: !117, size: 64, align: 64, offset: 448)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !15, line: 1, size: 384, align: 8, elements: !119)
!119 = !{!120, !121, !122, !123, !125, !126, !127, !128, !129}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !15, line: 1, baseType: !61, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !15, line: 1, baseType: !32, size: 8, align: 8, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !15, line: 1, baseType: !32, size: 8, align: 8, offset: 72)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !15, line: 1, baseType: !124, size: 16, align: 16, offset: 80)
!124 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !15, line: 1, baseType: !30, size: 32, align: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !15, line: 1, baseType: !43, size: 64, align: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !15, line: 1, baseType: !43, size: 64, align: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !15, line: 1, baseType: !27, size: 64, align: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !15, line: 1, baseType: !43, size: 64, align: 64, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !7, line: 27, baseType: !131, size: 128, align: 64, offset: 512)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !7, line: 27, size: 128, align: 8, elements: !132)
!132 = !{!133, !152}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 27, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !20, size: 192, align: 8, elements: !136)
!136 = !{!100, !137, !141}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !20, line: 27, baseType: !138, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!14, !43}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !20, line: 27, baseType: !142, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !43, !149}
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !20, size: 192, align: 8, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !20, line: 14, baseType: !61, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !20, line: 14, baseType: !14, size: 128, align: 64, offset: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !20, size: 192, align: 8, elements: !150)
!150 = !{!151, !78, !79}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !54, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !7, line: 27, baseType: !154, size: 64, align: 64, offset: 640)
!154 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !7, line: 27, baseType: !156, size: 192, align: 64, offset: 704)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !20, size: 192, align: 8, elements: !157)
!157 = !{!158, !78, !79}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !56, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !7, line: 27, baseType: !11, size: 8, align: 8, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Uncompressed", file: !7, line: 27, baseType: !11, size: 8, align: 8, offset: 904)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !7, line: 27, baseType: !117, size: 64, align: 64, offset: 960)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Request", file: !7, line: 27, baseType: !163, size: 64, align: 64, offset: 1024)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !7, line: 27, size: 1984, align: 8, elements: !165)
!165 = !{!166, !167, !113, !114, !115, !116, !130, !186, !198, !199, !200, !201, !202, !203, !204, !210, !211, !212, !213, !405, !408, !409}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !7, line: 27, baseType: !57, size: 128, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !7, line: 27, baseType: !168, size: 64, align: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !7, line: 18, size: 1024, align: 8, elements: !170)
!170 = !{!171, !172, !173, !180, !181, !182, !183, !184, !185}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !7, line: 18, baseType: !57, size: 128, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !7, line: 18, baseType: !57, size: 128, align: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !7, line: 18, baseType: !174, size: 64, align: 64, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !7, line: 18, size: 320, align: 8, elements: !176)
!176 = !{!177, !178, !179}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !7, line: 18, baseType: !57, size: 128, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !7, line: 18, baseType: !57, size: 128, align: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !7, line: 18, baseType: !11, size: 8, align: 8, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !7, line: 18, baseType: !57, size: 128, align: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !7, line: 18, baseType: !57, size: 128, align: 64, offset: 448)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !7, line: 18, baseType: !57, size: 128, align: 64, offset: 576)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !7, line: 18, baseType: !11, size: 8, align: 8, offset: 704)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !7, line: 18, baseType: !57, size: 128, align: 64, offset: 768)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !7, line: 18, baseType: !57, size: 128, align: 64, offset: 896)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !7, line: 27, baseType: !187, size: 64, align: 64, offset: 640)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 27, size: 64, align: 8, elements: !189)
!189 = !{!190}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 27, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!194}
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !20, size: 256, align: 8, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 27, baseType: !131, size: 128, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 27, baseType: !14, size: 128, align: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !7, line: 27, baseType: !154, size: 64, align: 64, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !7, line: 27, baseType: !156, size: 192, align: 64, offset: 768)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !7, line: 27, baseType: !11, size: 8, align: 8, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 1024)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Form", file: !7, line: 27, baseType: !117, size: 64, align: 64, offset: 1152)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "PostForm", file: !7, line: 27, baseType: !117, size: 64, align: 64, offset: 1216)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "MultipartForm", file: !7, line: 27, baseType: !205, size: 64, align: 64, offset: 1280)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", file: !7, line: 27, size: 128, align: 8, elements: !207)
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 27, baseType: !117, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !7, line: 27, baseType: !117, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !7, line: 27, baseType: !117, size: 64, align: 64, offset: 1344)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 1408)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "RequestURI", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 1536)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !7, line: 27, baseType: !214, size: 64, align: 64, offset: 1664)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionState", file: !7, line: 27, size: 1344, align: 8, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !393, !398, !403, !404}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !7, line: 27, baseType: !124, size: 16, align: 16)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "HandshakeComplete", file: !7, line: 27, baseType: !11, size: 8, align: 8, offset: 16)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "DidResume", file: !7, line: 27, baseType: !11, size: 8, align: 8, offset: 24)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuite", file: !7, line: 27, baseType: !124, size: 16, align: 16, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocol", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocolIsMutual", file: !7, line: 27, baseType: !11, size: 8, align: 8, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "PeerCertificates", file: !7, line: 27, baseType: !225, size: 192, align: 64, offset: 384)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !20, size: 192, align: 8, elements: !226)
!226 = !{!227, !78, !79}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !7, line: 18, size: 10624, align: 8, elements: !231)
!231 = !{!232, !233, !234, !235, !236, !237, !238, !240, !242, !248, !249, !262, !288, !289, !323, !324, !326, !336, !337, !342, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !367, !372, !373, !374, !375, !386, !387, !388, !389, !390, !391, !392}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !7, line: 18, baseType: !149, size: 192, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !7, line: 18, baseType: !149, size: 192, align: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !7, line: 18, baseType: !149, size: 192, align: 64, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !7, line: 18, baseType: !149, size: 192, align: 64, offset: 576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !7, line: 18, baseType: !149, size: 192, align: 64, offset: 768)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !7, line: 18, baseType: !149, size: 192, align: 64, offset: 960)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !7, line: 18, baseType: !239, size: 64, align: 64, offset: 1152)
!239 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !7, line: 18, baseType: !241, size: 64, align: 64, offset: 1216)
!241 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !7, line: 18, baseType: !243, size: 128, align: 64, offset: 1280)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "Token", file: !244, line: 16, size: 128, align: 8, elements: !245)
!244 = !DIFile(filename: "kubernetes.go", directory: ".")
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !244, line: 1, baseType: !23, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !244, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !7, line: 18, baseType: !61, size: 64, align: 64, offset: 1408)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !7, line: 18, baseType: !250, size: 64, align: 64, offset: 1472)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !7, line: 16, size: 256, align: 8, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !7, line: 16, baseType: !11, size: 8, align: 8)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !7, line: 16, baseType: !255, size: 192, align: 64, offset: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !7, line: 16, size: 192, align: 8, elements: !256)
!256 = !{!257, !260, !261}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !7, line: 1, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !7, line: 1, baseType: !61, size: 64, align: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !7, line: 1, baseType: !61, size: 64, align: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !7, line: 18, baseType: !263, size: 1984, align: 64, offset: 1536)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !7, line: 18, size: 1984, align: 8, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !287}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !7, line: 18, baseType: !156, size: 192, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !7, line: 18, baseType: !156, size: 192, align: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !7, line: 18, baseType: !156, size: 192, align: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !7, line: 18, baseType: !156, size: 192, align: 64, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !7, line: 18, baseType: !156, size: 192, align: 64, offset: 768)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !7, line: 18, baseType: !156, size: 192, align: 64, offset: 960)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !7, line: 18, baseType: !156, size: 192, align: 64, offset: 1152)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !7, line: 18, baseType: !57, size: 128, align: 64, offset: 1344)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !7, line: 18, baseType: !57, size: 128, align: 64, offset: 1472)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !7, line: 18, baseType: !275, size: 192, align: 64, offset: 1600)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !20, size: 192, align: 8, elements: !276)
!276 = !{!277, !78, !79}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !7, line: 18, size: 320, align: 8, elements: !280)
!280 = !{!281, !286}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !7, line: 18, baseType: !282, size: 192, align: 64)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !7, line: 18, size: 192, align: 8, elements: !283)
!283 = !{!284, !260, !261}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !7, line: 1, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 18, baseType: !243, size: 128, align: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !7, line: 18, baseType: !275, size: 192, align: 64, offset: 1792)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !7, line: 18, baseType: !263, size: 1984, align: 64, offset: 3520)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !7, line: 18, baseType: !290, size: 192, align: 64, offset: 5504)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 15, size: 192, align: 8, elements: !291)
!291 = !{!292, !294, !295}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 15, baseType: !293, size: 64, align: 64)
!293 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 15, baseType: !154, size: 64, align: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 15, baseType: !296, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 15, size: 704, align: 8, elements: !298)
!298 = !{!299, !300, !309, !320, !321, !322}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 15, baseType: !57, size: 128, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 15, baseType: !301, size: 192, align: 64, offset: 128)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !20, size: 192, align: 8, elements: !302)
!302 = !{!303, !78, !79}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 15, size: 256, align: 8, elements: !306)
!306 = !{!299, !307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 15, baseType: !61, size: 64, align: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 15, baseType: !11, size: 8, align: 8, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 15, baseType: !310, size: 192, align: 64, offset: 320)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !20, size: 192, align: 8, elements: !311)
!311 = !{!312, !78, !79}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 15, size: 128, align: 8, elements: !315)
!315 = !{!316, !317, !318, !319}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 15, baseType: !154, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 15, baseType: !32, size: 8, align: 8, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 15, baseType: !11, size: 8, align: 8, offset: 72)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 15, baseType: !11, size: 8, align: 8, offset: 80)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 15, baseType: !154, size: 64, align: 64, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 15, baseType: !154, size: 64, align: 64, offset: 576)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 15, baseType: !304, size: 64, align: 64, offset: 640)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !7, line: 18, baseType: !290, size: 192, align: 64, offset: 5696)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !7, line: 18, baseType: !325, size: 64, align: 64, offset: 5888)
!325 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !7, line: 18, baseType: !327, size: 192, align: 64, offset: 5952)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !20, size: 192, align: 8, elements: !328)
!328 = !{!329, !78, !79}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !7, line: 18, size: 448, align: 8, elements: !332)
!332 = !{!333, !334, !335}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !7, line: 18, baseType: !282, size: 192, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !7, line: 18, baseType: !11, size: 8, align: 8, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 18, baseType: !149, size: 192, align: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !7, line: 18, baseType: !327, size: 192, align: 64, offset: 6144)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !7, line: 18, baseType: !338, size: 192, align: 64, offset: 6336)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !20, size: 192, align: 8, elements: !339)
!339 = !{!340, !78, !79}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !7, line: 18, baseType: !343, size: 192, align: 64, offset: 6528)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !20, size: 192, align: 8, elements: !344)
!344 = !{!345, !78, !79}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !7, line: 18, baseType: !338, size: 192, align: 64, offset: 6720)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !7, line: 18, baseType: !11, size: 8, align: 8, offset: 6912)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !7, line: 18, baseType: !11, size: 8, align: 8, offset: 6920)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !7, line: 18, baseType: !61, size: 64, align: 64, offset: 6976)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !7, line: 18, baseType: !11, size: 8, align: 8, offset: 7040)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !7, line: 18, baseType: !149, size: 192, align: 64, offset: 7104)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !7, line: 18, baseType: !149, size: 192, align: 64, offset: 7296)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !7, line: 18, baseType: !156, size: 192, align: 64, offset: 7488)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !7, line: 18, baseType: !156, size: 192, align: 64, offset: 7680)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !7, line: 18, baseType: !156, size: 192, align: 64, offset: 7872)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !7, line: 18, baseType: !156, size: 192, align: 64, offset: 8064)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !7, line: 18, baseType: !360, size: 192, align: 64, offset: 8256)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !20, size: 192, align: 8, elements: !361)
!361 = !{!362, !78, !79}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !7, line: 18, size: 192, align: 8, elements: !365)
!365 = !{!366, !260, !261}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !7, line: 1, baseType: !54, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !7, line: 18, baseType: !368, size: 192, align: 64, offset: 8448)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !20, size: 192, align: 8, elements: !369)
!369 = !{!370, !78, !79}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !7, line: 18, baseType: !11, size: 8, align: 8, offset: 8640)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !7, line: 18, baseType: !156, size: 192, align: 64, offset: 8704)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !7, line: 18, baseType: !156, size: 192, align: 64, offset: 8896)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !7, line: 18, baseType: !376, size: 192, align: 64, offset: 9088)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !20, size: 192, align: 8, elements: !377)
!377 = !{!378, !78, !79}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !7, line: 18, size: 384, align: 8, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !7, line: 18, baseType: !364, size: 192, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !7, line: 18, baseType: !385, size: 192, align: 64, offset: 192)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !7, line: 18, size: 192, align: 8, elements: !365)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !7, line: 18, baseType: !376, size: 192, align: 64, offset: 9280)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !7, line: 18, baseType: !156, size: 192, align: 64, offset: 9472)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !7, line: 18, baseType: !156, size: 192, align: 64, offset: 9664)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !7, line: 18, baseType: !156, size: 192, align: 64, offset: 9856)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !7, line: 18, baseType: !156, size: 192, align: 64, offset: 10048)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !7, line: 18, baseType: !156, size: 192, align: 64, offset: 10240)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !7, line: 18, baseType: !338, size: 192, align: 64, offset: 10432)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "VerifiedChains", file: !7, line: 27, baseType: !394, size: 192, align: 64, offset: 576)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !20, size: 192, align: 8, elements: !395)
!395 = !{!396, !78, !79}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !7, line: 27, baseType: !399, size: 192, align: 64, offset: 768)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !20, size: 192, align: 8, elements: !400)
!400 = !{!401, !78, !79}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPResponse", file: !7, line: 27, baseType: !149, size: 192, align: 64, offset: 960)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "TLSUnique", file: !7, line: 27, baseType: !149, size: 192, align: 64, offset: 1152)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", file: !7, line: 27, baseType: !406, size: 64, align: 64, offset: 1728)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !15, line: 1, align: 8, elements: !3)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !7, line: 27, baseType: !43, size: 64, align: 64, offset: 1792)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !7, line: 27, baseType: !410, size: 128, align: 64, offset: 1856)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !7, line: 15, size: 128, align: 8, elements: !411)
!411 = !{!412, !152}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 15, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,Token)Token}", file: !20, size: 320, align: 8, elements: !415)
!415 = !{!416, !417, !425, !429, !430}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !20, line: 15, baseType: !23, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !20, line: 15, baseType: !418, size: 64, align: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!421, !43}
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !20, size: 256, align: 8, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !20, line: 15, baseType: !290, size: 192, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !20, line: 15, baseType: !11, size: 8, align: 8, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !20, line: 15, baseType: !426, size: 64, align: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!406, !43}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !20, line: 15, baseType: !138, size: 64, align: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !20, line: 15, baseType: !431, size: 64, align: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!243, !43, !243}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !7, line: 27, baseType: !214, size: 64, align: 64, offset: 1088)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 27, baseType: !14, size: 128, align: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "CheckRedirect", file: !7, line: 27, baseType: !437, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 27, size: 64, align: 8, elements: !439)
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 27, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!14, !163, !444}
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Request,int,int}", file: !20, size: 192, align: 8, elements: !445)
!445 = !{!446, !78, !79}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Jar", file: !7, line: 27, baseType: !449, size: 128, align: 64, offset: 192)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "CookieJar", file: !7, line: 27, size: 128, align: 8, elements: !450)
!450 = !{!451, !152}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 27, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*URL)struct{**Cookie,int,int},*func(*void,*URL,struct{**Cookie,int,int})void}", file: !20, size: 192, align: 8, elements: !454)
!454 = !{!100, !455, !477}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Cookies", file: !20, line: 27, baseType: !456, size: 64, align: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!459, !43, !168}
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Cookie,int,int}", file: !20, size: 192, align: 8, elements: !460)
!460 = !{!461, !78, !79}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cookie", file: !7, line: 27, size: 1280, align: 8, elements: !465)
!465 = !{!466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !7, line: 27, baseType: !57, size: 128, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "Domain", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Expires", file: !7, line: 27, baseType: !290, size: 192, align: 64, offset: 512)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "RawExpires", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 704)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "MaxAge", file: !7, line: 27, baseType: !61, size: 64, align: 64, offset: 832)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Secure", file: !7, line: 27, baseType: !11, size: 8, align: 8, offset: 896)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "HttpOnly", file: !7, line: 27, baseType: !11, size: 8, align: 8, offset: 904)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 960)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "Unparsed", file: !7, line: 27, baseType: !156, size: 192, align: 64, offset: 1088)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "SetCookies", file: !20, line: 27, baseType: !478, size: 64, align: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!44, !43, !168, !459}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Timeout", file: !7, line: 27, baseType: !8, size: 64, align: 64, offset: 320)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "crypto_rand.Reader", linkageName: "crypto_rand.Reader", scope: !1, file: !7, line: 16, type: !484, isLocal: false, isDefinition: true)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !7, line: 14, size: 128, align: 8, elements: !485)
!485 = !{!486, !152}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 14, baseType: !487, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !20, size: 128, align: 8, elements: !489)
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !20, line: 14, baseType: !23, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !20, line: 14, baseType: !142, size: 64, align: 64, offset: 64)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "encoding_base64.URLEncoding", linkageName: "encoding_base64.URLEncoding", scope: !1, file: !494, line: 16, type: !495, isLocal: false, isDefinition: true)
!494 = !DIFile(filename: "dns.go", directory: ".")
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "Encoding", file: !494, line: 16, size: 2624, align: 8, elements: !497)
!497 = !{!498, !502, !506, !508}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "encode", file: !494, line: 16, baseType: !499, size: 512, align: 8)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 512, align: 1, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "decodeMap", file: !494, line: 16, baseType: !503, size: 2048, align: 8, offset: 512)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2048, align: 1, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "padChar", file: !494, line: 16, baseType: !507, size: 32, align: 32, offset: 2560)
!507 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "strict", file: !494, line: 16, baseType: !11, size: 8, align: 8, offset: 2592)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "main.apiHost", linkageName: "main.apiHost", scope: !1, file: !244, line: 26, type: !57, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "main.certificatesEndpoint", linkageName: "main.certificatesEndpoint", scope: !1, file: !244, line: 27, type: !57, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "main.certificatesWatchEndpoint", linkageName: "main.certificatesWatchEndpoint", scope: !1, file: !244, line: 28, type: !57, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "encoding_base64.StdEncoding", linkageName: "encoding_base64.StdEncoding", scope: !1, file: !494, line: 16, type: !495, isLocal: false, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "net_http.DefaultClient", linkageName: "net_http.DefaultClient", scope: !1, file: !90, line: 16, type: !519, isLocal: false, isDefinition: true)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "main.dataDir", linkageName: "main.dataDir", scope: !1, file: !522, line: 29, type: !57, isLocal: true, isDefinition: true)
!522 = !DIFile(filename: "main.go", directory: ".")
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "main.discoveryURL", linkageName: "main.discoveryURL", scope: !1, file: !522, line: 30, type: !57, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "main.syncInterval", linkageName: "main.syncInterval", scope: !1, file: !522, line: 31, type: !61, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "main.processorLock", linkageName: "main.processorLock", scope: !1, file: !529, line: 27, type: !530, isLocal: true, isDefinition: true)
!529 = !DIFile(filename: "processor.go", directory: ".")
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 20, size: 64, align: 8, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 20, baseType: !507, size: 32, align: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 20, baseType: !30, size: 32, align: 32, offset: 32)
!535 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !7, line: 11, type: !536, isLocal: false, isDefinition: true, scopeLine: 11, isOptimized: false, unit: !1, retainedNodes: !3)
!536 = !DISubroutineType(types: !537)
!537 = !{!44}
!538 = !DILocation(line: 1, column: 1, scope: !539)
!539 = !DILexicalBlockFile(scope: !535, file: !15, discriminator: 0)
!540 = !DILocation(line: 36, column: 23, scope: !541)
!541 = !DILexicalBlockFile(scope: !535, file: !7, discriminator: 0)
!542 = !DILocation(line: 36, column: 2, scope: !541)
!543 = !DILocation(line: 27, column: 21, scope: !544)
!544 = !DILexicalBlockFile(scope: !535, file: !529, discriminator: 0)
!545 = !DILocation(line: 27, column: 5, scope: !544)
!546 = !DILocation(line: 24, column: 1, scope: !547)
!547 = !DILexicalBlockFile(scope: !535, file: !90, discriminator: 0)
!548 = distinct !DISubprogram(name: "main.Accept..1main.ACMEClient", linkageName: "main.ACMEClient.Accept", scope: null, file: !7, line: 91, type: !549, isLocal: false, isDefinition: true, scopeLine: 91, isOptimized: false, unit: !1, retainedNodes: !3)
!549 = !DISubroutineType(types: !550)
!550 = !{!14, !551, !551, !607, !621}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "ACMEClient", file: !7, line: 49, size: 576, align: 8, elements: !553)
!553 = !{!554}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Client", file: !7, line: 50, baseType: !555, size: 576, align: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "Client", file: !7, line: 27, size: 576, align: 8, elements: !556)
!556 = !{!557, !591, !592, !593, !594, !605, !606}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !7, line: 27, baseType: !558, size: 128, align: 64)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "Signer", file: !7, line: 27, size: 128, align: 8, elements: !559)
!559 = !{!560, !152}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 27, baseType: !561, size: 64, align: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)PublicKey,*func(*void,Reader,struct{*uint8,int,int},SignerOpts)struct{struct{*uint8,int,int},error}}", file: !20, size: 192, align: 8, elements: !563)
!563 = !{!100, !564, !571}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Public", file: !20, line: 27, baseType: !565, size: 64, align: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!568, !43}
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "PublicKey", file: !7, line: 17, size: 128, align: 8, elements: !569)
!569 = !{!570, !152}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !7, line: 1, baseType: !23, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Sign", file: !20, line: 27, baseType: !572, size: 64, align: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!575, !43, !484, !149, !579}
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !20, size: 320, align: 8, elements: !576)
!576 = !{!577, !578}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "signature", file: !20, line: 27, baseType: !149, size: 192, align: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !20, line: 27, baseType: !14, size: 128, align: 64, offset: 192)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "SignerOpts", file: !7, line: 17, size: 128, align: 8, elements: !580)
!580 = !{!581, !152}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 17, baseType: !582, size: 64, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Hash}", file: !20, size: 128, align: 8, elements: !584)
!584 = !{!585, !586}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !20, line: 17, baseType: !23, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "HashFunc", file: !20, line: 17, baseType: !587, size: 64, align: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!590, !43}
!590 = !DIBasicType(name: "Hash", size: 64, encoding: DW_ATE_unsigned)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "HTTPClient", file: !7, line: 27, baseType: !519, size: 64, align: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "DirectoryURL", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "dirMu", file: !7, line: 27, baseType: !531, size: 64, align: 32, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !7, line: 27, baseType: !595, size: 64, align: 64, offset: 384)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "Directory", file: !7, line: 27, size: 960, align: 8, elements: !597)
!597 = !{!598, !599, !600, !601, !602, !603, !604}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "RegURL", file: !7, line: 27, baseType: !57, size: 128, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "AuthzURL", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "CertURL", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "RevokeURL", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 384)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Terms", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Website", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 640)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "CAA", file: !7, line: 27, baseType: !156, size: 192, align: 64, offset: 768)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "noncesMu", file: !7, line: 27, baseType: !531, size: 64, align: 32, offset: 448)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "nonces", file: !7, line: 27, baseType: !117, size: 64, align: 64, offset: 512)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "Authorization", file: !7, line: 27, size: 896, align: 8, elements: !609)
!609 = !{!610, !611, !612, !616, !628}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "URI", file: !7, line: 27, baseType: !57, size: 128, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Identifier", file: !7, line: 27, baseType: !613, size: 256, align: 64, offset: 256)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "AuthzID", file: !7, line: 27, size: 256, align: 8, elements: !614)
!614 = !{!615, !467}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !7, line: 27, baseType: !57, size: 128, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Challenges", file: !7, line: 27, baseType: !617, size: 192, align: 64, offset: 512)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Challenge,int,int}", file: !20, size: 192, align: 8, elements: !618)
!618 = !{!619, !78, !79}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !620, size: 64, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "Challenge", file: !7, line: 27, size: 640, align: 8, elements: !623)
!623 = !{!615, !624, !625, !626, !627}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "URI", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Token", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !7, line: 27, baseType: !14, size: 128, align: 64, offset: 512)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Combinations", file: !7, line: 27, baseType: !629, size: 192, align: 64, offset: 704)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*int,int,int},int,int}", file: !20, size: 192, align: 8, elements: !630)
!630 = !{!631, !78, !79}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !632, size: 64, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !20, size: 192, align: 8, elements: !634)
!634 = !{!635, !78, !79}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !285, size: 64, align: 64)
!636 = !DILocalVariable(name: "c", arg: 1, scope: !548, file: !7, line: 91, type: !551)
!637 = !DILocation(line: 91, column: 1, scope: !548)
!638 = !DILocalVariable(name: "authorization", arg: 2, scope: !548, file: !7, line: 91, type: !607)
!639 = !DILocation(line: 91, column: 29, scope: !548)
!640 = !DILocalVariable(name: "challenge", arg: 3, scope: !548, file: !7, line: 91, type: !621)
!641 = !DILocation(line: 91, column: 64, scope: !548)
!642 = !DILocation(line: 92, column: 39, scope: !643)
!643 = distinct !DILexicalBlock(scope: !548, file: !7, line: 92, column: 2)
!644 = !DILocation(line: 92, column: 16, scope: !643)
!645 = !DILocation(line: 92, column: 23, scope: !643)
!646 = !DILocalVariable(name: "sink$1", scope: !643, file: !7, line: 92, type: !621)
!647 = !DILocation(line: 92, column: 5, scope: !548)
!648 = !DILocalVariable(name: "err", scope: !643, file: !7, line: 92, type: !14)
!649 = !DILocation(line: 92, column: 69, scope: !643)
!650 = !DILocation(line: 97, column: 52, scope: !651)
!651 = distinct !DILexicalBlock(scope: !548, file: !7, line: 96, column: 6)
!652 = !DILocation(line: 97, column: 79, scope: !651)
!653 = !DILocation(line: 97, column: 26, scope: !651)
!654 = !DILocalVariable(name: "err", scope: !651, file: !7, line: 97, type: !14)
!655 = !DILocation(line: 97, column: 3, scope: !548)
!656 = !DILocation(line: 98, column: 10, scope: !651)
!657 = !DILocalVariable(name: "authorization", scope: !651, file: !7, line: 97, type: !607)
!658 = !DILocation(line: 93, column: 3, scope: !643)
!659 = !DILocalVariable(name: "$ret7", scope: !548, file: !7, line: 91, type: !14)
!660 = !DILocation(line: 91, column: 91, scope: !548)
!661 = !DILocation(line: 99, column: 4, scope: !651)
!662 = !DILocation(line: 102, column: 19, scope: !651)
!663 = !DILocation(line: 102, column: 27, scope: !651)
!664 = !DILocation(line: 103, column: 15, scope: !651)
!665 = !DILocation(line: 103, column: 4, scope: !651)
!666 = !DILocation(line: 105, column: 27, scope: !651)
!667 = !DILocation(line: 106, column: 9, scope: !651)
!668 = !DILocation(line: 111, column: 2, scope: !548)
!669 = distinct !DISubprogram(name: "main.Authorize..1main.ACMEClient", linkageName: "main.ACMEClient.Authorize", scope: null, file: !7, line: 72, type: !670, isLocal: false, isDefinition: true, scopeLine: 72, isOptimized: false, unit: !1, retainedNodes: !3)
!670 = !DISubroutineType(types: !671)
!671 = !{!672, !551, !551, !57}
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Authorization,*Challenge,error}", file: !20, size: 256, align: 8, elements: !673)
!673 = !{!674, !675, !676}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 72, baseType: !607, size: 64, align: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 72, baseType: !621, size: 64, align: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 72, baseType: !14, size: 128, align: 64, offset: 128)
!677 = !DILocalVariable(name: "c", arg: 1, scope: !669, file: !7, line: 72, type: !551)
!678 = !DILocation(line: 72, column: 1, scope: !669)
!679 = !DILocalVariable(name: "domain", arg: 2, scope: !669, file: !7, line: 72, type: !57)
!680 = !DILocation(line: 72, column: 32, scope: !669)
!681 = !DILocalVariable(name: "$ret4", scope: !669, file: !7, line: 72, type: !607)
!682 = !DILocation(line: 72, column: 48, scope: !669)
!683 = !DILocalVariable(name: "$ret5", scope: !669, file: !7, line: 72, type: !621)
!684 = !DILocation(line: 72, column: 69, scope: !669)
!685 = !DILocation(line: 73, column: 51, scope: !686)
!686 = distinct !DILexicalBlock(scope: !669, file: !7, line: 72, column: 1)
!687 = !DILocation(line: 73, column: 25, scope: !686)
!688 = !DILocation(line: 73, column: 32, scope: !686)
!689 = !DILocalVariable(name: "authorization", scope: !686, file: !7, line: 73, type: !607)
!690 = !DILocation(line: 73, column: 2, scope: !669)
!691 = !DILocalVariable(name: "err", scope: !686, file: !7, line: 73, type: !14)
!692 = !DILocation(line: 74, column: 9, scope: !686)
!693 = !DILocation(line: 75, column: 3, scope: !686)
!694 = !DILocalVariable(name: "$ret6", scope: !669, file: !7, line: 72, type: !14)
!695 = !DILocation(line: 72, column: 86, scope: !669)
!696 = !DILocalVariable(name: "challenge", scope: !686, file: !7, line: 78, type: !621)
!697 = !DILocation(line: 78, column: 6, scope: !669)
!698 = !DILocalVariable(name: "c", scope: !699, file: !7, line: 79, type: !621)
!699 = distinct !DILexicalBlock(scope: !686, file: !7, line: 79, column: 2)
!700 = !DILocation(line: 79, column: 6, scope: !686)
!701 = !DILocation(line: 79, column: 33, scope: !699)
!702 = !DILocation(line: 79, column: 2, scope: !699)
!703 = !DILocation(line: 80, column: 7, scope: !699)
!704 = !DILocation(line: 80, column: 13, scope: !699)
!705 = !DILocation(line: 86, column: 27, scope: !686)
!706 = !DILocation(line: 86, column: 3, scope: !686)
!707 = !DILocation(line: 88, column: 2, scope: !686)
!708 = distinct !DISubprogram(name: "main.CreateCert..1main.ACMEClient", linkageName: "main.ACMEClient.CreateCert", scope: null, file: !7, line: 114, type: !709, isLocal: false, isDefinition: true, scopeLine: 114, isOptimized: false, unit: !1, retainedNodes: !3)
!709 = !DISubroutineType(types: !710)
!710 = !{!711, !551, !551, !57, !716}
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},string,error}", file: !20, size: 448, align: 8, elements: !712)
!712 = !{!713, !714, !715}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 114, baseType: !149, size: 192, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 114, baseType: !57, size: 128, align: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 114, baseType: !14, size: 128, align: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !7, line: 17, size: 768, align: 8, elements: !718)
!718 = !{!719, !724, !725, !730}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !7, line: 17, baseType: !720, size: 128, align: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "PublicKey", file: !7, line: 17, size: 128, align: 8, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "N", file: !7, line: 17, baseType: !250, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "E", file: !7, line: 17, baseType: !61, size: 64, align: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "D", file: !7, line: 17, baseType: !250, size: 64, align: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "Primes", file: !7, line: 17, baseType: !726, size: 192, align: 64, offset: 192)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Int,int,int}", file: !20, size: 192, align: 8, elements: !727)
!727 = !{!728, !78, !79}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !729, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Precomputed", file: !7, line: 17, baseType: !731, size: 384, align: 64, offset: 384)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrecomputedValues", file: !7, line: 17, size: 384, align: 8, elements: !732)
!732 = !{!733, !734, !735, !736}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Dp", file: !7, line: 17, baseType: !250, size: 64, align: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Dq", file: !7, line: 17, baseType: !250, size: 64, align: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "Qinv", file: !7, line: 17, baseType: !250, size: 64, align: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "CRTValues", file: !7, line: 17, baseType: !737, size: 192, align: 64, offset: 192)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*CRTValue,int,int}", file: !20, size: 192, align: 8, elements: !738)
!738 = !{!739, !78, !79}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !740, size: 64, align: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "CRTValue", file: !7, line: 17, size: 192, align: 8, elements: !742)
!742 = !{!743, !744, !745}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Exp", file: !7, line: 17, baseType: !250, size: 64, align: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "Coeff", file: !7, line: 17, baseType: !250, size: 64, align: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "R", file: !7, line: 17, baseType: !250, size: 64, align: 64, offset: 128)
!746 = !DILocalVariable(name: "c", arg: 1, scope: !708, file: !7, line: 114, type: !551)
!747 = !DILocation(line: 114, column: 1, scope: !708)
!748 = !DILocalVariable(name: "domain", arg: 2, scope: !708, file: !7, line: 114, type: !57)
!749 = !DILocation(line: 114, column: 33, scope: !708)
!750 = !DILocalVariable(name: "key", arg: 3, scope: !708, file: !7, line: 114, type: !716)
!751 = !DILocation(line: 114, column: 48, scope: !708)
!752 = !DILocation(line: 115, column: 15, scope: !753)
!753 = distinct !DILexicalBlock(scope: !708, file: !7, line: 114, column: 1)
!754 = !DILocalVariable(name: "req", scope: !753, file: !7, line: 115, type: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertificateRequest", file: !7, line: 18, size: 4608, align: 8, elements: !757)
!757 = !{!232, !758, !234, !235, !759, !760, !761, !762, !763, !764, !765, !777, !778, !779, !780, !781, !782}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificateRequest", file: !7, line: 18, baseType: !149, size: 192, align: 64, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !7, line: 18, baseType: !61, size: 64, align: 64, offset: 768)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !7, line: 18, baseType: !149, size: 192, align: 64, offset: 832)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !7, line: 18, baseType: !239, size: 64, align: 64, offset: 1024)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !7, line: 18, baseType: !241, size: 64, align: 64, offset: 1088)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !7, line: 18, baseType: !243, size: 128, align: 64, offset: 1152)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !7, line: 18, baseType: !263, size: 1984, align: 64, offset: 1280)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", file: !7, line: 18, baseType: !766, size: 192, align: 64, offset: 3264)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValueSET,int,int}", file: !20, size: 192, align: 8, elements: !767)
!767 = !{!768, !78, !79}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !769, size: 64, align: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValueSET", file: !7, line: 18, size: 384, align: 8, elements: !771)
!771 = !{!281, !772}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 18, baseType: !773, size: 192, align: 64, offset: 192)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*AttributeTypeAndValue,int,int},int,int}", file: !20, size: 192, align: 8, elements: !774)
!774 = !{!775, !78, !79}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !776, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !7, line: 18, baseType: !327, size: 192, align: 64, offset: 3456)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !7, line: 18, baseType: !327, size: 192, align: 64, offset: 3648)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !7, line: 18, baseType: !156, size: 192, align: 64, offset: 3840)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !7, line: 18, baseType: !156, size: 192, align: 64, offset: 4032)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !7, line: 18, baseType: !360, size: 192, align: 64, offset: 4224)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !7, line: 18, baseType: !368, size: 192, align: 64, offset: 4416)
!783 = !DILocation(line: 115, column: 2, scope: !708)
!784 = !DILocation(line: 118, column: 62, scope: !753)
!785 = !DILocation(line: 118, column: 19, scope: !753)
!786 = !DILocalVariable(name: "err", scope: !753, file: !7, line: 118, type: !14)
!787 = !DILocation(line: 118, column: 2, scope: !708)
!788 = !DILocation(line: 119, column: 9, scope: !753)
!789 = !DILocalVariable(name: "$ret9", scope: !708, file: !7, line: 114, type: !57)
!790 = !DILocation(line: 114, column: 78, scope: !708)
!791 = !DILocalVariable(name: "$ret10", scope: !708, file: !7, line: 114, type: !14)
!792 = !DILocation(line: 114, column: 86, scope: !708)
!793 = !DILocation(line: 120, column: 3, scope: !753)
!794 = !DILocation(line: 123, column: 52, scope: !753)
!795 = !DILocation(line: 123, column: 25, scope: !753)
!796 = !DILocalVariable(name: "csr", scope: !753, file: !7, line: 118, type: !149)
!797 = !DILocation(line: 123, column: 32, scope: !753)
!798 = !DILocalVariable(name: "cert", scope: !753, file: !7, line: 123, type: !399)
!799 = !DILocation(line: 123, column: 2, scope: !708)
!800 = !DILocalVariable(name: "certURL", scope: !753, file: !7, line: 123, type: !57)
!801 = !DILocation(line: 124, column: 9, scope: !753)
!802 = !DILocation(line: 125, column: 3, scope: !753)
!803 = !DILocation(line: 128, column: 10, scope: !753)
!804 = !DILocation(line: 129, column: 42, scope: !753)
!805 = !DILocation(line: 129, column: 23, scope: !753)
!806 = !DILocation(line: 130, column: 10, scope: !753)
!807 = !DILocation(line: 136, column: 2, scope: !808)
!808 = distinct !DILexicalBlock(scope: !753, file: !7, line: 136, column: 2)
!809 = !DILocation(line: 131, column: 4, scope: !753)
!810 = !DILocation(line: 137, column: 31, scope: !808)
!811 = !DILocation(line: 137, column: 11, scope: !808)
!812 = !DILocation(line: 138, column: 20, scope: !808)
!813 = !DILocation(line: 138, column: 18, scope: !808)
!814 = !DILocation(line: 141, column: 2, scope: !753)
!815 = distinct !DISubprogram(name: "main.DNS01ChallengeRecord..stub..1main.ACMEClient", linkageName: "main.ACMEClient.DNS01ChallengeRecord..stub", scope: null, file: !7, line: 27, type: !816, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!816 = !DISubroutineType(types: !817)
!817 = !{!818, !551, !551, !57}
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !20, size: 256, align: 8, elements: !819)
!819 = !{!820, !197}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 27, baseType: !57, size: 128, align: 64)
!821 = !DILocalVariable(name: "$this0", arg: 1, scope: !815, file: !7, line: 27, type: !551)
!822 = !DILocation(line: 27, column: 26, scope: !815)
!823 = !DILocalVariable(name: "$p1", arg: 2, scope: !815, file: !7, line: 27, type: !57)
!824 = !DILocation(line: 49, column: 6, scope: !815)
!825 = distinct !DISubprogram(name: "main.Discover..stub..1main.ACMEClient", linkageName: "main.ACMEClient.Discover..stub", scope: null, file: !7, line: 27, type: !826, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!826 = !DISubroutineType(types: !827)
!827 = !{!828, !551, !551, !410}
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Directory,error}", file: !20, size: 1088, align: 8, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 27, baseType: !596, size: 960, align: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 27, baseType: !14, size: 128, align: 64, offset: 960)
!832 = !DILocalVariable(name: "$this2", arg: 1, scope: !825, file: !7, line: 27, type: !551)
!833 = !DILocation(line: 27, column: 26, scope: !825)
!834 = !DILocalVariable(name: "$p3", arg: 2, scope: !825, file: !7, line: 27, type: !410)
!835 = !DILocation(line: 49, column: 6, scope: !825)
!836 = distinct !DISubprogram(name: "main.FetchCert..stub..1main.ACMEClient", linkageName: "main.ACMEClient.FetchCert..stub", scope: null, file: !7, line: 27, type: !837, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!837 = !DISubroutineType(types: !838)
!838 = !{!839, !551, !551, !410, !57, !11}
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*struct{*uint8,int,int},int,int},error}", file: !20, size: 320, align: 8, elements: !840)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 27, baseType: !399, size: 192, align: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 27, baseType: !14, size: 128, align: 64, offset: 192)
!843 = !DILocalVariable(name: "$this51", arg: 1, scope: !836, file: !7, line: 27, type: !551)
!844 = !DILocation(line: 27, column: 26, scope: !836)
!845 = !DILocalVariable(name: "$p52", arg: 2, scope: !836, file: !7, line: 27, type: !410)
!846 = !DILocalVariable(name: "$p53", arg: 3, scope: !836, file: !7, line: 27, type: !57)
!847 = !DILocalVariable(name: "$p54", arg: 4, scope: !836, file: !7, line: 27, type: !11)
!848 = !DILocation(line: 49, column: 6, scope: !836)
!849 = distinct !DISubprogram(name: "main.GetAuthorization..stub..1main.ACMEClient", linkageName: "main.ACMEClient.GetAuthorization..stub", scope: null, file: !7, line: 27, type: !850, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!850 = !DISubroutineType(types: !851)
!851 = !{!852, !551, !551, !410, !57}
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Authorization,error}", file: !20, size: 192, align: 8, elements: !853)
!853 = !{!854, !435}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 27, baseType: !607, size: 64, align: 64)
!855 = !DILocalVariable(name: "$this55", arg: 1, scope: !849, file: !7, line: 27, type: !551)
!856 = !DILocation(line: 27, column: 26, scope: !849)
!857 = !DILocalVariable(name: "$p56", arg: 2, scope: !849, file: !7, line: 27, type: !410)
!858 = !DILocalVariable(name: "$p57", arg: 3, scope: !849, file: !7, line: 27, type: !57)
!859 = !DILocalVariable(name: "$ret76", scope: !849, file: !7, line: 27, type: !607)
!860 = !DILocation(line: 49, column: 6, scope: !849)
!861 = distinct !DISubprogram(name: "main.GetChallenge..stub..1main.ACMEClient", linkageName: "main.ACMEClient.GetChallenge..stub", scope: null, file: !7, line: 27, type: !862, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!862 = !DISubroutineType(types: !863)
!863 = !{!864, !551, !551, !410, !57}
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Challenge,error}", file: !20, size: 192, align: 8, elements: !865)
!865 = !{!866, !435}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 27, baseType: !621, size: 64, align: 64)
!867 = !DILocalVariable(name: "$this72", arg: 1, scope: !861, file: !7, line: 27, type: !551)
!868 = !DILocation(line: 27, column: 26, scope: !861)
!869 = !DILocalVariable(name: "$p73", arg: 2, scope: !861, file: !7, line: 27, type: !410)
!870 = !DILocalVariable(name: "$p74", arg: 3, scope: !861, file: !7, line: 27, type: !57)
!871 = !DILocalVariable(name: "$ret87", scope: !861, file: !7, line: 27, type: !621)
!872 = !DILocation(line: 49, column: 6, scope: !861)
!873 = distinct !DISubprogram(name: "main.GetReg..stub..1main.ACMEClient", linkageName: "main.ACMEClient.GetReg..stub", scope: null, file: !7, line: 27, type: !874, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!874 = !DISubroutineType(types: !875)
!875 = !{!876, !551, !551, !410, !57}
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Account,error}", file: !20, size: 192, align: 8, elements: !877)
!877 = !{!878, !435}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 27, baseType: !879, size: 64, align: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "Account", file: !7, line: 27, size: 960, align: 8, elements: !881)
!881 = !{!610, !882, !883, !884, !885, !886, !887}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "Contact", file: !7, line: 27, baseType: !156, size: 192, align: 64, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "AgreedTerms", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 320)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentTerms", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 448)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "Authz", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 576)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "Authorizations", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 704)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Certificates", file: !7, line: 27, baseType: !57, size: 128, align: 64, offset: 832)
!888 = !DILocalVariable(name: "$this42", arg: 1, scope: !873, file: !7, line: 27, type: !551)
!889 = !DILocation(line: 27, column: 26, scope: !873)
!890 = !DILocalVariable(name: "$p43", arg: 2, scope: !873, file: !7, line: 27, type: !410)
!891 = !DILocalVariable(name: "$p44", arg: 3, scope: !873, file: !7, line: 27, type: !57)
!892 = !DILocalVariable(name: "$ret69", scope: !873, file: !7, line: 27, type: !879)
!893 = !DILocation(line: 49, column: 6, scope: !873)
!894 = distinct !DISubprogram(name: "main.HTTP01ChallengePath..stub..1main.ACMEClient", linkageName: "main.ACMEClient.HTTP01ChallengePath..stub", scope: null, file: !7, line: 27, type: !895, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!895 = !DISubroutineType(types: !896)
!896 = !{!57, !551, !551, !57}
!897 = !DILocalVariable(name: "$this13", arg: 1, scope: !894, file: !7, line: 27, type: !551)
!898 = !DILocation(line: 27, column: 26, scope: !894)
!899 = !DILocalVariable(name: "$p14", arg: 2, scope: !894, file: !7, line: 27, type: !57)
!900 = !DILocation(line: 49, column: 6, scope: !894)
!901 = distinct !DISubprogram(name: "main.HTTP01ChallengeResponse..stub..1main.ACMEClient", linkageName: "main.ACMEClient.HTTP01ChallengeResponse..stub", scope: null, file: !7, line: 27, type: !816, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!902 = !DILocalVariable(name: "$this30", arg: 1, scope: !901, file: !7, line: 27, type: !551)
!903 = !DILocation(line: 27, column: 26, scope: !901)
!904 = !DILocalVariable(name: "$p31", arg: 2, scope: !901, file: !7, line: 27, type: !57)
!905 = !DILocation(line: 49, column: 6, scope: !901)
!906 = distinct !DISubprogram(name: "main.Register..1main.ACMEClient", linkageName: "main.ACMEClient.Register", scope: null, file: !7, line: 68, type: !907, isLocal: false, isDefinition: true, scopeLine: 68, isOptimized: false, unit: !1, retainedNodes: !3)
!907 = !DISubroutineType(types: !908)
!908 = !{!876, !551, !551, !879}
!909 = !DILocalVariable(name: "c", arg: 1, scope: !906, file: !7, line: 68, type: !551)
!910 = !DILocation(line: 68, column: 1, scope: !906)
!911 = !DILocalVariable(name: "account", arg: 2, scope: !906, file: !7, line: 68, type: !879)
!912 = !DILocation(line: 68, column: 31, scope: !906)
!913 = !DILocalVariable(name: "$ret2", scope: !906, file: !7, line: 68, type: !879)
!914 = !DILocation(line: 68, column: 55, scope: !906)
!915 = !DILocation(line: 69, column: 35, scope: !906)
!916 = !DILocation(line: 69, column: 10, scope: !906)
!917 = !DILocation(line: 69, column: 17, scope: !906)
!918 = !DILocation(line: 69, column: 2, scope: !906)
!919 = distinct !DISubprogram(name: "main.RenewCert..1main.ACMEClient", linkageName: "main.ACMEClient.RenewCert", scope: null, file: !7, line: 144, type: !920, isLocal: false, isDefinition: true, scopeLine: 144, isOptimized: false, unit: !1, retainedNodes: !3)
!920 = !DISubroutineType(types: !921)
!921 = !{!922, !551, !551, !57}
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !20, size: 320, align: 8, elements: !923)
!923 = !{!924, !842}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 27, baseType: !149, size: 192, align: 64)
!925 = !DILocalVariable(name: "c", arg: 1, scope: !919, file: !7, line: 144, type: !551)
!926 = !DILocation(line: 144, column: 1, scope: !919)
!927 = !DILocalVariable(name: "certURL", arg: 2, scope: !919, file: !7, line: 144, type: !57)
!928 = !DILocation(line: 144, column: 32, scope: !919)
!929 = !DILocation(line: 145, column: 42, scope: !930)
!930 = distinct !DILexicalBlock(scope: !919, file: !7, line: 144, column: 1)
!931 = !DILocation(line: 145, column: 16, scope: !930)
!932 = !DILocation(line: 145, column: 23, scope: !930)
!933 = !DILocalVariable(name: "cert", scope: !930, file: !7, line: 145, type: !399)
!934 = !DILocation(line: 145, column: 2, scope: !919)
!935 = !DILocalVariable(name: "err", scope: !930, file: !7, line: 145, type: !14)
!936 = !DILocation(line: 146, column: 9, scope: !930)
!937 = !DILocalVariable(name: "$ret12", scope: !919, file: !7, line: 144, type: !14)
!938 = !DILocation(line: 144, column: 57, scope: !919)
!939 = !DILocation(line: 147, column: 3, scope: !930)
!940 = !DILocation(line: 150, column: 2, scope: !941)
!941 = distinct !DILexicalBlock(scope: !930, file: !7, line: 150, column: 2)
!942 = !DILocation(line: 151, column: 31, scope: !941)
!943 = !DILocation(line: 151, column: 11, scope: !941)
!944 = !DILocation(line: 152, column: 20, scope: !941)
!945 = !DILocation(line: 152, column: 18, scope: !941)
!946 = !DILocation(line: 154, column: 2, scope: !930)
!947 = distinct !DISubprogram(name: "main.RevokeAuthorization..stub..1main.ACMEClient", linkageName: "main.ACMEClient.RevokeAuthorization..stub", scope: null, file: !7, line: 27, type: !948, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!948 = !DISubroutineType(types: !949)
!949 = !{!14, !551, !551, !410, !57}
!950 = !DILocalVariable(name: "$this10", arg: 1, scope: !947, file: !7, line: 27, type: !551)
!951 = !DILocation(line: 27, column: 26, scope: !947)
!952 = !DILocalVariable(name: "$p11", arg: 2, scope: !947, file: !7, line: 27, type: !410)
!953 = !DILocalVariable(name: "$p12", arg: 3, scope: !947, file: !7, line: 27, type: !57)
!954 = !DILocation(line: 49, column: 6, scope: !947)
!955 = distinct !DISubprogram(name: "main.RevokeCert..stub..1main.ACMEClient", linkageName: "main.ACMEClient.RevokeCert..stub", scope: null, file: !7, line: 27, type: !956, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!956 = !DISubroutineType(types: !957)
!957 = !{!14, !551, !551, !410, !558, !149, !958}
!958 = !DIBasicType(name: "CRLReasonCode", size: 64, encoding: DW_ATE_signed)
!959 = !DILocalVariable(name: "$p18", arg: 4, scope: !955, file: !7, line: 27, type: !149)
!960 = !DILocation(line: 27, column: 26, scope: !955)
!961 = !DILocalVariable(name: "$this15", arg: 1, scope: !955, file: !7, line: 27, type: !551)
!962 = !DILocalVariable(name: "$p16", arg: 2, scope: !955, file: !7, line: 27, type: !410)
!963 = !DILocalVariable(name: "$p17", arg: 3, scope: !955, file: !7, line: 27, type: !558)
!964 = !DILocalVariable(name: "$p19", arg: 5, scope: !955, file: !7, line: 27, type: !958)
!965 = !DILocation(line: 49, column: 6, scope: !955)
!966 = distinct !DISubprogram(name: "main.TLSSNI01ChallengeCert..stub..1main.ACMEClient", linkageName: "main.ACMEClient.TLSSNI01ChallengeCert..stub", scope: null, file: !7, line: 27, type: !967, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!967 = !DISubroutineType(types: !968)
!968 = !{!969, !551, !551, !57, !982}
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Certificate,string,error}", file: !20, size: 1024, align: 8, elements: !970)
!970 = !{!971, !980, !981}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 27, baseType: !972, size: 768, align: 64)
!972 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !7, line: 27, size: 768, align: 8, elements: !973)
!973 = !{!974, !975, !977, !978, !979}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "Certificate", file: !7, line: 27, baseType: !399, size: 192, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "PrivateKey", file: !7, line: 27, baseType: !976, size: 128, align: 64, offset: 192)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !7, line: 27, size: 128, align: 8, elements: !569)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPStaple", file: !7, line: 27, baseType: !149, size: 192, align: 64, offset: 320)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !7, line: 27, baseType: !399, size: 192, align: 64, offset: 512)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "Leaf", file: !7, line: 27, baseType: !229, size: 64, align: 64, offset: 704)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 27, baseType: !57, size: 128, align: 64, offset: 768)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !20, line: 27, baseType: !14, size: 128, align: 64, offset: 896)
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*CertOption,int,int}", file: !20, size: 192, align: 8, elements: !983)
!983 = !{!984, !78, !79}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !20, line: 1, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertOption", file: !7, line: 27, size: 128, align: 8, elements: !987)
!987 = !{!988, !152}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 27, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void}", file: !20, size: 128, align: 8, elements: !991)
!991 = !{!100, !992}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "privateCertOpt", file: !20, line: 27, baseType: !993, size: 64, align: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!44, !43}
!996 = !DILocalVariable(name: "$p25", arg: 3, scope: !966, file: !7, line: 27, type: !982)
!997 = !DILocation(line: 27, column: 26, scope: !966)
!998 = !DILocalVariable(name: "$this23", arg: 1, scope: !966, file: !7, line: 27, type: !551)
!999 = !DILocalVariable(name: "$p24", arg: 2, scope: !966, file: !7, line: 27, type: !57)
!1000 = !DILocation(line: 49, column: 6, scope: !966)
!1001 = distinct !DISubprogram(name: "main.TLSSNI02ChallengeCert..stub..1main.ACMEClient", linkageName: "main.ACMEClient.TLSSNI02ChallengeCert..stub", scope: null, file: !7, line: 27, type: !967, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!1002 = !DILocalVariable(name: "$p60", arg: 3, scope: !1001, file: !7, line: 27, type: !982)
!1003 = !DILocation(line: 27, column: 26, scope: !1001)
!1004 = !DILocalVariable(name: "$this58", arg: 1, scope: !1001, file: !7, line: 27, type: !551)
!1005 = !DILocalVariable(name: "$p59", arg: 2, scope: !1001, file: !7, line: 27, type: !57)
!1006 = !DILocation(line: 49, column: 6, scope: !1001)
!1007 = distinct !DISubprogram(name: "main.UpdateReg..stub..1main.ACMEClient", linkageName: "main.ACMEClient.UpdateReg..stub", scope: null, file: !7, line: 27, type: !1008, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!876, !551, !551, !410, !879}
!1010 = !DILocalVariable(name: "$this61", arg: 1, scope: !1007, file: !7, line: 27, type: !551)
!1011 = !DILocation(line: 27, column: 26, scope: !1007)
!1012 = !DILocalVariable(name: "$p62", arg: 2, scope: !1007, file: !7, line: 27, type: !410)
!1013 = !DILocalVariable(name: "$p63", arg: 3, scope: !1007, file: !7, line: 27, type: !879)
!1014 = !DILocalVariable(name: "$ret81", scope: !1007, file: !7, line: 27, type: !879)
!1015 = !DILocation(line: 49, column: 6, scope: !1007)
!1016 = distinct !DISubprogram(name: "main.WaitAuthorization..stub..1main.ACMEClient", linkageName: "main.ACMEClient.WaitAuthorization..stub", scope: null, file: !7, line: 27, type: !850, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!1017 = !DILocalVariable(name: "$this7", arg: 1, scope: !1016, file: !7, line: 27, type: !551)
!1018 = !DILocation(line: 27, column: 26, scope: !1016)
!1019 = !DILocalVariable(name: "$p8", arg: 2, scope: !1016, file: !7, line: 27, type: !410)
!1020 = !DILocalVariable(name: "$p9", arg: 3, scope: !1016, file: !7, line: 27, type: !57)
!1021 = !DILocalVariable(name: "$ret51", scope: !1016, file: !7, line: 27, type: !607)
!1022 = !DILocation(line: 49, column: 6, scope: !1016)
!1023 = distinct !DISubprogram(name: "main.github_com_kelseyhightower_kube_cert_manager_vendor_golang_org_x_crypto_acme.addNonce..stub..1main.ACMEClient", linkageName: "main.ACMEClient.github_com_kelseyhightower_kube_cert_manager_vendor_golang_org_x_crypto_acme.addNonce..stub", scope: null, file: !7, line: 27, type: !1024, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!44, !551, !551, !117}
!1026 = !DILocalVariable(name: "$this86", arg: 1, scope: !1023, file: !7, line: 27, type: !551)
!1027 = !DILocation(line: 27, column: 26, scope: !1023)
!1028 = !DILocalVariable(name: "$p87", arg: 2, scope: !1023, file: !7, line: 27, type: !117)
