; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22tls\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/tls\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/tls\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22x509\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/x509\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/x509\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./certificate-manager.go", directory: "/home/wangcong/go_path/src/github.com/kelseyhightower/kube-cert-manager/tls-app")
!3 = !{}
!4 = !{!5, !9, !19, !365, !367, !369, !371}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "main.html", linkageName: "main.html", scope: !1, file: !11, line: 11, type: !12, isLocal: true, isDefinition: true)
!11 = !DIFile(filename: "handler.go", directory: ".")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !13)
!13 = !{!14, !17}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "main.cm", linkageName: "main.cm", scope: !1, file: !21, line: 29, type: !22, isLocal: true, isDefinition: true)
!21 = !DIFile(filename: "main.go", directory: ".")
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertificateManager", file: !24, line: 21, size: 640, align: 8, elements: !25)
!24 = !DIFile(filename: "certificate-manager.go", directory: ".")
!25 = !{!26, !39, !40, !41, !298, !301}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "RWMutex", file: !24, line: 22, baseType: !27, size: 192, align: 32)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !24, line: 14, size: 192, align: 8, elements: !28)
!28 = !{!29, !35, !36, !37, !38}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !24, line: 14, baseType: !30, size: 64, align: 32)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !24, line: 14, size: 64, align: 8, elements: !31)
!31 = !{!32, !34}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !24, line: 14, baseType: !33, size: 32, align: 32)
!33 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !24, line: 14, baseType: !8, size: 32, align: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !24, line: 14, baseType: !8, size: 32, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !24, line: 14, baseType: !8, size: 32, align: 32, offset: 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !24, line: 14, baseType: !33, size: 32, align: 32, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !24, line: 14, baseType: !33, size: 32, align: 32, offset: 160)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "certFile", file: !24, line: 23, baseType: !12, size: 128, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "keyFile", file: !24, line: 24, baseType: !12, size: 128, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "certificate", file: !24, line: 25, baseType: !42, size: 64, align: 64, offset: 448)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !24, line: 14, size: 768, align: 8, elements: !44)
!44 = !{!45, !56, !110, !111, !112}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Certificate", file: !24, line: 14, baseType: !46, size: 192, align: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !47, size: 192, align: 8, elements: !48)
!47 = !DIFile(filename: "", directory: "")
!48 = !{!49, !54, !55}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !47, size: 192, align: 8, elements: !52)
!52 = !{!53, !54, !55}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !15, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !47, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !47, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "PrivateKey", file: !24, line: 14, baseType: !57, size: 128, align: 64, offset: 192)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !24, line: 14, size: 128, align: 8, elements: !58)
!58 = !{!59, !109}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !24, line: 1, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !62)
!62 = !{!63, !65, !66, !67, !68, !69, !70, !80, !89, !90, !92, !108}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !64, size: 64, align: 64)
!64 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !64, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !16, size: 8, align: 8, offset: 160)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !16, size: 8, align: 8, offset: 168)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !16, size: 8, align: 8, offset: 176)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !71, size: 64, align: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !73)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!64, !78, !64}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIBasicType(name: "void")
!80 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !81, size: 64, align: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !83)
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!88, !78, !78}
!88 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !91, size: 64, align: 64, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !93, size: 64, align: 64, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !95)
!95 = !{!96, !97, !98}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !91, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !91, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !99, size: 192, align: 64, offset: 128)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !47, size: 192, align: 8, elements: !100)
!100 = !{!101, !54, !55}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !104)
!104 = !{!96, !97, !105, !106, !107}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !78, size: 64, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !78, size: 64, align: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !78, size: 64, align: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !78, size: 64, align: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !24, line: 1, baseType: !78, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPStaple", file: !24, line: 14, baseType: !51, size: 192, align: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !24, line: 14, baseType: !46, size: 192, align: 64, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Leaf", file: !24, line: 14, baseType: !113, size: 64, align: 64, offset: 704)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !24, line: 14, size: 10624, align: 8, elements: !115)
!115 = !{!116, !117, !118, !119, !120, !121, !122, !124, !126, !131, !132, !145, !174, !175, !210, !211, !213, !223, !224, !229, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !254, !277, !278, !279, !280, !291, !292, !293, !294, !295, !296, !297}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !24, line: 14, baseType: !51, size: 192, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !24, line: 14, baseType: !51, size: 192, align: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !24, line: 14, baseType: !51, size: 192, align: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !24, line: 14, baseType: !51, size: 192, align: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !24, line: 14, baseType: !51, size: 192, align: 64, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !24, line: 14, baseType: !51, size: 192, align: 64, offset: 960)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !24, line: 14, baseType: !123, size: 64, align: 64, offset: 1152)
!123 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !24, line: 14, baseType: !125, size: 64, align: 64, offset: 1216)
!125 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !24, line: 14, baseType: !127, size: 128, align: 64, offset: 1280)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecrypterOpts", file: !11, line: 4, size: 128, align: 8, elements: !128)
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 1, baseType: !60, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !11, line: 1, baseType: !78, size: 64, align: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !24, line: 14, baseType: !18, size: 64, align: 64, offset: 1408)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !24, line: 14, baseType: !133, size: 64, align: 64, offset: 1472)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !24, line: 14, size: 256, align: 8, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !24, line: 14, baseType: !88, size: 8, align: 8)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !24, line: 14, baseType: !138, size: 192, align: 64, offset: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !24, line: 14, size: 192, align: 8, elements: !139)
!139 = !{!140, !143, !144}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !24, line: 1, baseType: !18, size: 64, align: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !24, line: 1, baseType: !18, size: 64, align: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !24, line: 14, baseType: !146, size: 1984, align: 64, offset: 1536)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !24, line: 14, size: 1984, align: 8, elements: !147)
!147 = !{!148, !152, !153, !154, !155, !156, !157, !158, !159, !160, !173}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !24, line: 14, baseType: !149, size: 192, align: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !47, size: 192, align: 8, elements: !150)
!150 = !{!151, !54, !55}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !91, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !24, line: 14, baseType: !149, size: 192, align: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !24, line: 14, baseType: !149, size: 192, align: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !24, line: 14, baseType: !149, size: 192, align: 64, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !24, line: 14, baseType: !149, size: 192, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !24, line: 14, baseType: !149, size: 192, align: 64, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !24, line: 14, baseType: !149, size: 192, align: 64, offset: 1152)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !24, line: 14, baseType: !12, size: 128, align: 64, offset: 1344)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !24, line: 14, baseType: !12, size: 128, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !24, line: 14, baseType: !161, size: 192, align: 64, offset: 1600)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !47, size: 192, align: 8, elements: !162)
!162 = !{!163, !54, !55}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !24, line: 14, size: 320, align: 8, elements: !166)
!166 = !{!167, !172}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !24, line: 14, baseType: !168, size: 192, align: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !24, line: 14, size: 192, align: 8, elements: !169)
!169 = !{!170, !143, !144}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !24, line: 14, baseType: !127, size: 128, align: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !24, line: 14, baseType: !161, size: 192, align: 64, offset: 1792)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !24, line: 14, baseType: !146, size: 1984, align: 64, offset: 3520)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !24, line: 14, baseType: !176, size: 192, align: 64, offset: 5504)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !24, line: 14, size: 192, align: 8, elements: !177)
!177 = !{!178, !180, !182}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !24, line: 14, baseType: !179, size: 64, align: 64)
!179 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !24, line: 14, baseType: !181, size: 64, align: 64, offset: 64)
!181 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !24, line: 14, baseType: !183, size: 64, align: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !24, line: 14, size: 704, align: 8, elements: !185)
!185 = !{!186, !187, !196, !207, !208, !209}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !24, line: 14, baseType: !12, size: 128, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !24, line: 14, baseType: !188, size: 192, align: 64, offset: 128)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !47, size: 192, align: 8, elements: !189)
!189 = !{!190, !54, !55}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !24, line: 14, size: 256, align: 8, elements: !193)
!193 = !{!186, !194, !195}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !24, line: 14, baseType: !18, size: 64, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !24, line: 14, baseType: !88, size: 8, align: 8, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !24, line: 14, baseType: !197, size: 192, align: 64, offset: 320)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !47, size: 192, align: 8, elements: !198)
!198 = !{!199, !54, !55}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !24, line: 14, size: 128, align: 8, elements: !202)
!202 = !{!203, !204, !205, !206}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !24, line: 14, baseType: !181, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !24, line: 14, baseType: !16, size: 8, align: 8, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !24, line: 14, baseType: !88, size: 8, align: 8, offset: 72)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !24, line: 14, baseType: !88, size: 8, align: 8, offset: 80)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !24, line: 14, baseType: !181, size: 64, align: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !24, line: 14, baseType: !181, size: 64, align: 64, offset: 576)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !24, line: 14, baseType: !191, size: 64, align: 64, offset: 640)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !24, line: 14, baseType: !176, size: 192, align: 64, offset: 5696)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !24, line: 14, baseType: !212, size: 64, align: 64, offset: 5888)
!212 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !24, line: 14, baseType: !214, size: 192, align: 64, offset: 5952)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !47, size: 192, align: 8, elements: !215)
!215 = !{!216, !54, !55}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !24, line: 14, size: 448, align: 8, elements: !219)
!219 = !{!220, !221, !222}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !24, line: 14, baseType: !168, size: 192, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !24, line: 14, baseType: !88, size: 8, align: 8, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !24, line: 14, baseType: !51, size: 192, align: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !24, line: 14, baseType: !214, size: 192, align: 64, offset: 6144)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !24, line: 14, baseType: !225, size: 192, align: 64, offset: 6336)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !47, size: 192, align: 8, elements: !226)
!226 = !{!227, !54, !55}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !24, line: 14, baseType: !230, size: 192, align: 64, offset: 6528)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !47, size: 192, align: 8, elements: !231)
!231 = !{!232, !54, !55}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !24, line: 14, baseType: !225, size: 192, align: 64, offset: 6720)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !24, line: 14, baseType: !88, size: 8, align: 8, offset: 6912)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !24, line: 14, baseType: !88, size: 8, align: 8, offset: 6920)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !24, line: 14, baseType: !18, size: 64, align: 64, offset: 6976)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !24, line: 14, baseType: !88, size: 8, align: 8, offset: 7040)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !24, line: 14, baseType: !51, size: 192, align: 64, offset: 7104)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !24, line: 14, baseType: !51, size: 192, align: 64, offset: 7296)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !24, line: 14, baseType: !149, size: 192, align: 64, offset: 7488)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !24, line: 14, baseType: !149, size: 192, align: 64, offset: 7680)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !24, line: 14, baseType: !149, size: 192, align: 64, offset: 7872)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !24, line: 14, baseType: !149, size: 192, align: 64, offset: 8064)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !24, line: 14, baseType: !247, size: 192, align: 64, offset: 8256)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !47, size: 192, align: 8, elements: !248)
!248 = !{!249, !54, !55}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !24, line: 14, size: 192, align: 8, elements: !252)
!252 = !{!253, !143, !144}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !15, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !24, line: 14, baseType: !255, size: 192, align: 64, offset: 8448)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !47, size: 192, align: 8, elements: !256)
!256 = !{!257, !54, !55}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !24, line: 14, size: 1024, align: 8, elements: !261)
!261 = !{!262, !263, !264, !271, !272, !273, !274, !275, !276}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !24, line: 14, baseType: !12, size: 128, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !24, line: 14, baseType: !12, size: 128, align: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !24, line: 14, baseType: !265, size: 64, align: 64, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !24, line: 14, size: 320, align: 8, elements: !267)
!267 = !{!268, !269, !270}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !24, line: 14, baseType: !12, size: 128, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !24, line: 14, baseType: !12, size: 128, align: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !24, line: 14, baseType: !88, size: 8, align: 8, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !24, line: 14, baseType: !12, size: 128, align: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !24, line: 14, baseType: !12, size: 128, align: 64, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !24, line: 14, baseType: !12, size: 128, align: 64, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !24, line: 14, baseType: !88, size: 8, align: 8, offset: 704)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !24, line: 14, baseType: !12, size: 128, align: 64, offset: 768)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !24, line: 14, baseType: !12, size: 128, align: 64, offset: 896)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !24, line: 14, baseType: !88, size: 8, align: 8, offset: 8640)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !24, line: 14, baseType: !149, size: 192, align: 64, offset: 8704)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !24, line: 14, baseType: !149, size: 192, align: 64, offset: 8896)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !24, line: 14, baseType: !281, size: 192, align: 64, offset: 9088)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !47, size: 192, align: 8, elements: !282)
!282 = !{!283, !54, !55}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !24, line: 14, size: 384, align: 8, elements: !287)
!287 = !{!288, !289}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !24, line: 14, baseType: !251, size: 192, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !24, line: 14, baseType: !290, size: 192, align: 64, offset: 192)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !24, line: 14, size: 192, align: 8, elements: !252)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !24, line: 14, baseType: !281, size: 192, align: 64, offset: 9280)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !24, line: 14, baseType: !149, size: 192, align: 64, offset: 9472)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !24, line: 14, baseType: !149, size: 192, align: 64, offset: 9664)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !24, line: 14, baseType: !149, size: 192, align: 64, offset: 9856)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !24, line: 14, baseType: !149, size: 192, align: 64, offset: 10048)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !24, line: 14, baseType: !149, size: 192, align: 64, offset: 10240)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !24, line: 14, baseType: !225, size: 192, align: 64, offset: 10432)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !24, line: 26, baseType: !299, size: 64, align: 64, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !7, line: 1, align: 8, elements: !3)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "watcher", file: !24, line: 27, baseType: !302, size: 64, align: 64, offset: 576)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "Watcher", file: !24, line: 18, size: 640, align: 8, elements: !304)
!304 = !{!305, !306, !307, !308, !337, !338, !348, !362, !363, !364}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Events", file: !24, line: 18, baseType: !299, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Errors", file: !24, line: 18, baseType: !299, size: 64, align: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !24, line: 18, baseType: !30, size: 64, align: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "cv", file: !24, line: 18, baseType: !309, size: 64, align: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cond", file: !24, line: 14, size: 448, align: 8, elements: !311)
!311 = !{!312, !314, !327, !335}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "noCopy", file: !24, line: 14, baseType: !313, align: 8)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: ".sync.noCopy", file: !24, line: 14, align: 8, elements: !3)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "L", file: !24, line: 14, baseType: !315, size: 128, align: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "Locker", file: !24, line: 14, size: 128, align: 8, elements: !316)
!316 = !{!317, !109}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void}", file: !47, size: 192, align: 8, elements: !320)
!320 = !{!321, !322, !326}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !47, line: 14, baseType: !60, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", file: !47, line: 14, baseType: !323, size: 64, align: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!79, !78}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Unlock", file: !47, line: 14, baseType: !323, size: 64, align: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "notify", file: !24, line: 14, baseType: !328, size: 256, align: 64, offset: 128)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: ".sync.notifyList", file: !24, line: 14, size: 256, align: 8, elements: !329)
!329 = !{!330, !331, !332, !333, !334}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "wait", file: !24, line: 14, baseType: !8, size: 32, align: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "notify", file: !24, line: 14, baseType: !8, size: 32, align: 32, offset: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !24, line: 14, baseType: !64, size: 64, align: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !24, line: 14, baseType: !78, size: 64, align: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !24, line: 14, baseType: !78, size: 64, align: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "checker", file: !24, line: 14, baseType: !336, size: 64, align: 64, offset: 384)
!336 = !DIBasicType(name: ".sync.copyChecker", size: 64, encoding: DW_ATE_unsigned)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "fd", file: !24, line: 18, baseType: !18, size: 64, align: 64, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "poller", file: !24, line: 18, baseType: !339, size: 64, align: 64, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: ".github.com/kelseyhightower/kube-cert-manager/tls-app/vendor/github.com/fsnotify/fsnotify.fdPoller", file: !24, line: 18, size: 256, align: 8, elements: !341)
!341 = !{!342, !343, !344}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "fd", file: !24, line: 18, baseType: !18, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "epfd", file: !24, line: 18, baseType: !18, size: 64, align: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", file: !24, line: 18, baseType: !345, size: 128, align: 64, offset: 128)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 128, align: 8, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 2)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "watches", file: !24, line: 18, baseType: !349, size: 64, align: 64, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !351)
!351 = !{!352, !353, !354, !355, !357, !358, !359, !360, !361}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !18, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !16, size: 8, align: 8, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !16, size: 8, align: 8, offset: 72)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !356, size: 16, align: 16, offset: 80)
!356 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !78, size: 64, align: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !78, size: 64, align: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !64, size: 64, align: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !78, size: 64, align: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "paths", file: !24, line: 18, baseType: !349, size: 64, align: 64, offset: 448)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "done", file: !24, line: 18, baseType: !299, size: 64, align: 64, offset: 512)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "doneResp", file: !24, line: 18, baseType: !299, size: 64, align: 64, offset: 576)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "main.hostname", linkageName: "main.hostname", scope: !1, file: !21, line: 28, type: !12, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "main.httpAddr", linkageName: "main.httpAddr", scope: !1, file: !21, line: 22, type: !12, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "main.tlsCert", linkageName: "main.tlsCert", scope: !1, file: !21, line: 23, type: !12, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "main.tlsKey", linkageName: "main.tlsKey", scope: !1, file: !21, line: 24, type: !12, isLocal: true, isDefinition: true)
!373 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !24, line: 11, type: !374, isLocal: false, isDefinition: true, scopeLine: 11, isOptimized: false, unit: !1, retainedNodes: !3)
!374 = !DISubroutineType(types: !375)
!375 = !{!79}
!376 = !DILocation(line: 1, column: 1, scope: !377)
!377 = !DILexicalBlockFile(scope: !373, file: !7, discriminator: 0)
!378 = distinct !DISubprogram(name: "main.main.CertificateManager..hash", linkageName: "main.main.CertificateManager..hash", scope: null, file: !7, line: 1, type: !76, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!379 = !DILocalVariable(name: "key", arg: 1, scope: !378, file: !7, line: 1, type: !78)
!380 = !DILocation(line: 1, column: 1, scope: !378)
!381 = !DILocalVariable(name: "seed", arg: 2, scope: !378, file: !7, line: 1, type: !64)
!382 = !DILocalVariable(name: "$ret11", scope: !378, file: !7, line: 1, type: !64)
!383 = distinct !DISubprogram(name: "main.main.CertificateManager..eq", linkageName: "main.main.CertificateManager..eq", scope: null, file: !7, line: 1, type: !86, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!384 = !DILocalVariable(name: "key1", arg: 1, scope: !383, file: !7, line: 1, type: !78)
!385 = !DILocation(line: 1, column: 1, scope: !383)
!386 = !DILocalVariable(name: "key2", arg: 2, scope: !383, file: !7, line: 1, type: !78)
!387 = !DILocalVariable(name: "$ret12", scope: !383, file: !7, line: 1, type: !88)
!388 = distinct !DISubprogram(name: "main.GetCertificate..1main.CertificateManager", linkageName: "main.CertificateManager.GetCertificate", scope: null, file: !24, line: 46, type: !389, isLocal: false, isDefinition: true, scopeLine: 46, isOptimized: false, unit: !1, retainedNodes: !3)
!389 = !DISubroutineType(types: !390)
!390 = !{!391, !22, !22, !407}
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,error}", file: !47, size: 192, align: 8, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !47, line: 14, baseType: !42, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !47, line: 14, baseType: !395, size: 128, align: 64, offset: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !396)
!396 = !{!397, !406}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !47, size: 128, align: 8, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !47, line: 1, baseType: !60, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !47, line: 1, baseType: !403, size: 64, align: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!12, !78}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !78, size: 64, align: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientHelloInfo", file: !24, line: 14, size: 1408, align: 8, elements: !409)
!409 = !{!410, !415, !416, !422, !423, !429, !430, !431}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuites", file: !24, line: 14, baseType: !411, size: 192, align: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint16,int,int}", file: !47, size: 192, align: 8, elements: !412)
!412 = !{!413, !54, !55}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !414, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !24, line: 14, baseType: !12, size: 128, align: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedCurves", file: !24, line: 14, baseType: !417, size: 192, align: 64, offset: 320)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*CurveID,int,int}", file: !47, size: 192, align: 8, elements: !418)
!418 = !{!419, !54, !55}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIBasicType(name: "CurveID", size: 16, encoding: DW_ATE_unsigned)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedPoints", file: !24, line: 14, baseType: !51, size: 192, align: 64, offset: 512)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureSchemes", file: !24, line: 14, baseType: !424, size: 192, align: 64, offset: 704)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*SignatureScheme,int,int}", file: !47, size: 192, align: 8, elements: !425)
!425 = !{!426, !54, !55}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIBasicType(name: "SignatureScheme", size: 16, encoding: DW_ATE_unsigned)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedProtos", file: !24, line: 14, baseType: !149, size: 192, align: 64, offset: 896)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedVersions", file: !24, line: 14, baseType: !411, size: 192, align: 64, offset: 1088)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Conn", file: !24, line: 14, baseType: !432, size: 128, align: 64, offset: 1280)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !24, line: 14, size: 128, align: 8, elements: !433)
!433 = !{!434, !109}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)Addr,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void)Addr,*func(*void,Time)error,*func(*void,Time)error,*func(*void,Time)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !47, size: 576, align: 8, elements: !437)
!437 = !{!321, !438, !442, !454, !462, !463, !467, !468, !469}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !47, line: 14, baseType: !439, size: 64, align: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!395, !78}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "LocalAddr", file: !47, line: 14, baseType: !443, size: 64, align: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!446, !78}
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "Addr", file: !24, line: 14, size: 128, align: 8, elements: !447)
!447 = !{!448, !109}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)string}", file: !47, size: 192, align: 8, elements: !451)
!451 = !{!321, !452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Network", file: !47, line: 14, baseType: !403, size: 64, align: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !47, line: 14, baseType: !403, size: 64, align: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !47, line: 14, baseType: !455, size: 64, align: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!458, !78, !51}
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !47, size: 192, align: 8, elements: !459)
!459 = !{!460, !461}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !47, line: 14, baseType: !18, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !47, line: 14, baseType: !395, size: 128, align: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !47, line: 14, baseType: !443, size: 64, align: 64, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "SetDeadline", file: !47, line: 14, baseType: !464, size: 64, align: 64, offset: 320)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!395, !78, !176}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "SetReadDeadline", file: !47, line: 14, baseType: !464, size: 64, align: 64, offset: 384)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "SetWriteDeadline", file: !47, line: 14, baseType: !464, size: 64, align: 64, offset: 448)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !47, line: 14, baseType: !455, size: 64, align: 64, offset: 512)
!470 = !DILocalVariable(name: "cm", arg: 1, scope: !388, file: !24, line: 46, type: !22)
!471 = !DILocation(line: 46, column: 1, scope: !388)
!472 = !DILocalVariable(name: "clientHello", arg: 2, scope: !388, file: !24, line: 46, type: !407)
!473 = !DILocation(line: 46, column: 46, scope: !388)
!474 = !DILocalVariable(name: "$ret2", scope: !388, file: !24, line: 46, type: !42)
!475 = !DILocation(line: 46, column: 81, scope: !388)
!476 = !DILocation(line: 47, column: 4, scope: !388)
!477 = !DILocation(line: 50, column: 1, scope: !388)
!478 = !DILocation(line: 48, column: 2, scope: !388)
!479 = !DILocation(line: 49, column: 11, scope: !388)
!480 = !DILocation(line: 49, column: 2, scope: !388)
!481 = distinct !DISubprogram(name: "main.Lock..stub..1main.CertificateManager", linkageName: "main.CertificateManager.Lock..stub", scope: null, file: !24, line: 14, type: !482, isLocal: false, isDefinition: true, scopeLine: 14, isOptimized: false, unit: !1, retainedNodes: !3)
!482 = !DISubroutineType(types: !483)
!483 = !{!79, !22, !22}
!484 = !DILocalVariable(name: "$this3", arg: 1, scope: !481, file: !24, line: 14, type: !22)
!485 = !DILocation(line: 14, column: 12, scope: !481)
!486 = !DILocation(line: 21, column: 6, scope: !481)
!487 = distinct !DISubprogram(name: "main.RLock..stub..1main.CertificateManager", linkageName: "main.CertificateManager.RLock..stub", scope: null, file: !24, line: 14, type: !482, isLocal: false, isDefinition: true, scopeLine: 14, isOptimized: false, unit: !1, retainedNodes: !3)
!488 = !DILocalVariable(name: "$this0", arg: 1, scope: !487, file: !24, line: 14, type: !22)
!489 = !DILocation(line: 14, column: 12, scope: !487)
!490 = !DILocation(line: 21, column: 6, scope: !487)
!491 = distinct !DISubprogram(name: "main.RLocker..stub..1main.CertificateManager", linkageName: "main.CertificateManager.RLocker..stub", scope: null, file: !24, line: 14, type: !492, isLocal: false, isDefinition: true, scopeLine: 14, isOptimized: false, unit: !1, retainedNodes: !3)
!492 = !DISubroutineType(types: !493)
!493 = !{!315, !22, !22}
!494 = !DILocalVariable(name: "$this1", arg: 1, scope: !491, file: !24, line: 14, type: !22)
!495 = !DILocation(line: 14, column: 12, scope: !491)
!496 = !DILocation(line: 21, column: 6, scope: !491)
!497 = distinct !DISubprogram(name: "main.RUnlock..stub..1main.CertificateManager", linkageName: "main.CertificateManager.RUnlock..stub", scope: null, file: !24, line: 14, type: !482, isLocal: false, isDefinition: true, scopeLine: 14, isOptimized: false, unit: !1, retainedNodes: !3)
!498 = !DILocalVariable(name: "$this4", arg: 1, scope: !497, file: !24, line: 14, type: !22)
!499 = !DILocation(line: 14, column: 12, scope: !497)
!500 = !DILocation(line: 21, column: 6, scope: !497)
!501 = distinct !DISubprogram(name: "main.Unlock..stub..1main.CertificateManager", linkageName: "main.CertificateManager.Unlock..stub", scope: null, file: !24, line: 14, type: !482, isLocal: false, isDefinition: true, scopeLine: 14, isOptimized: false, unit: !1, retainedNodes: !3)
!502 = !DILocalVariable(name: "$this2", arg: 1, scope: !501, file: !24, line: 14, type: !22)
!503 = !DILocation(line: 14, column: 12, scope: !501)
!504 = !DILocation(line: 21, column: 6, scope: !501)
!505 = distinct !DISubprogram(name: "main.newWatcher..1main.CertificateManager", linkageName: "main.CertificateManager.newWatcher", scope: null, file: !24, line: 90, type: !506, isLocal: false, isDefinition: true, scopeLine: 90, isOptimized: false, unit: !1, retainedNodes: !3)
!506 = !DISubroutineType(types: !507)
!507 = !{!395, !22, !22}
!508 = !DILocalVariable(name: "cm", arg: 1, scope: !505, file: !24, line: 90, type: !22)
!509 = !DILocation(line: 90, column: 1, scope: !505)
!510 = !DILocation(line: 92, column: 29, scope: !511)
!511 = distinct !DILexicalBlock(scope: !505, file: !24, line: 90, column: 1)
!512 = !DILocation(line: 92, column: 4, scope: !511)
!513 = !DILocation(line: 92, column: 18, scope: !511)
!514 = !DILocalVariable(name: "err", scope: !511, file: !24, line: 91, type: !395)
!515 = !DILocation(line: 91, column: 6, scope: !505)
!516 = !DILocation(line: 93, column: 9, scope: !511)
!517 = !DILocalVariable(name: "$ret6", scope: !505, file: !24, line: 90, type: !395)
!518 = !DILocation(line: 90, column: 44, scope: !505)
!519 = !DILocation(line: 94, column: 3, scope: !511)
!520 = !DILocation(line: 96, column: 10, scope: !511)
!521 = !DILocation(line: 96, column: 25, scope: !511)
!522 = !DILocation(line: 96, column: 18, scope: !511)
!523 = !DILocation(line: 97, column: 9, scope: !511)
!524 = !DILocation(line: 98, column: 3, scope: !511)
!525 = !DILocation(line: 100, column: 11, scope: !511)
!526 = !DILocation(line: 100, column: 26, scope: !511)
!527 = !DILocation(line: 100, column: 19, scope: !511)
!528 = !DILocation(line: 100, column: 2, scope: !511)
!529 = distinct !DISubprogram(name: "main.resetWatcher..1main.CertificateManager", linkageName: "main.CertificateManager.resetWatcher", scope: null, file: !24, line: 103, type: !506, isLocal: false, isDefinition: true, scopeLine: 103, isOptimized: false, unit: !1, retainedNodes: !3)
!530 = !DILocalVariable(name: "cm", arg: 1, scope: !529, file: !24, line: 103, type: !22)
!531 = !DILocation(line: 103, column: 1, scope: !529)
!532 = !DILocation(line: 104, column: 11, scope: !533)
!533 = distinct !DILexicalBlock(scope: !529, file: !24, line: 103, column: 1)
!534 = !DILocation(line: 104, column: 19, scope: !533)
!535 = !DILocalVariable(name: "err", scope: !533, file: !24, line: 104, type: !395)
!536 = !DILocation(line: 104, column: 2, scope: !529)
!537 = !DILocation(line: 105, column: 9, scope: !533)
!538 = !DILocalVariable(name: "$ret7", scope: !529, file: !24, line: 103, type: !395)
!539 = !DILocation(line: 103, column: 46, scope: !529)
!540 = !DILocation(line: 106, column: 3, scope: !533)
!541 = !DILocation(line: 108, column: 11, scope: !533)
!542 = !DILocation(line: 108, column: 2, scope: !533)
!543 = distinct !DISubprogram(name: "main.setCertificate..1main.CertificateManager", linkageName: "main.CertificateManager.setCertificate", scope: null, file: !24, line: 52, type: !506, isLocal: false, isDefinition: true, scopeLine: 52, isOptimized: false, unit: !1, retainedNodes: !3)
!544 = !DILocalVariable(name: "cm", arg: 1, scope: !543, file: !24, line: 52, type: !22)
!545 = !DILocation(line: 52, column: 1, scope: !543)
!546 = !DILocation(line: 53, column: 6, scope: !547)
!547 = distinct !DILexicalBlock(scope: !543, file: !24, line: 52, column: 1)
!548 = !DILocation(line: 54, column: 34, scope: !547)
!549 = !DILocation(line: 54, column: 47, scope: !547)
!550 = !DILocation(line: 54, column: 16, scope: !547)
!551 = !DILocation(line: 54, column: 2, scope: !547)
!552 = !DILocalVariable(name: "c", scope: !547, file: !24, line: 54, type: !42)
!553 = !DILocation(line: 54, column: 2, scope: !543)
!554 = !DILocalVariable(name: "err", scope: !547, file: !24, line: 54, type: !395)
!555 = !DILocation(line: 55, column: 9, scope: !547)
!556 = !DILocation(line: 56, column: 3, scope: !547)
!557 = !DILocalVariable(name: "$ret4", scope: !543, file: !24, line: 52, type: !395)
!558 = !DILocation(line: 52, column: 48, scope: !543)
!559 = !DILocation(line: 14, column: 12, scope: !481, inlinedAt: !560)
!560 = distinct !DILocation(line: 58, column: 4, scope: !547)
!561 = !DILocation(line: 21, column: 6, scope: !481, inlinedAt: !560)
!562 = !DILocation(line: 59, column: 4, scope: !547)
!563 = !DILocation(line: 59, column: 17, scope: !547)
!564 = !DILocation(line: 14, column: 12, scope: !501, inlinedAt: !565)
!565 = distinct !DILocation(line: 60, column: 4, scope: !547)
!566 = !DILocation(line: 21, column: 6, scope: !501, inlinedAt: !565)
!567 = !DILocation(line: 61, column: 2, scope: !547)
!568 = distinct !DISubprogram(name: "main.watchCertificate..1main.CertificateManager", linkageName: "main.CertificateManager.watchCertificate", scope: null, file: !24, line: 64, type: !506, isLocal: false, isDefinition: true, scopeLine: 64, isOptimized: false, unit: !1, retainedNodes: !3)
!569 = !DILocalVariable(name: "cm", arg: 1, scope: !568, file: !24, line: 64, type: !22)
!570 = !DILocation(line: 64, column: 1, scope: !568)
!571 = !DILocation(line: 65, column: 6, scope: !572)
!572 = distinct !DILexicalBlock(scope: !568, file: !24, line: 64, column: 1)
!573 = !DILocation(line: 66, column: 11, scope: !572)
!574 = !DILocalVariable(name: "err", scope: !572, file: !24, line: 66, type: !395)
!575 = !DILocation(line: 66, column: 2, scope: !568)
!576 = !DILocation(line: 67, column: 9, scope: !572)
!577 = !DILocation(line: 72, column: 3, scope: !572)
!578 = !DILocation(line: 73, column: 12, scope: !572)
!579 = !DILocation(line: 73, column: 20, scope: !572)
!580 = !DILocalVariable(name: "$ret5", scope: !568, file: !24, line: 64, type: !395)
!581 = !DILocation(line: 64, column: 50, scope: !568)
!582 = !DILocation(line: 68, column: 3, scope: !572)
!583 = !DILocation(line: 73, column: 3, scope: !572)
!584 = !DILocation(line: 84, column: 19, scope: !572)
!585 = !DILocation(line: 84, column: 27, scope: !572)
!586 = !DILocation(line: 84, column: 3, scope: !572)
!587 = !DILocation(line: 74, column: 8, scope: !588)
!588 = distinct !DILexicalBlock(scope: !572, file: !24, line: 74, column: 4)
!589 = !DILocation(line: 75, column: 13, scope: !588)
!590 = !DILocalVariable(name: "err", scope: !588, file: !24, line: 75, type: !395)
!591 = !DILocation(line: 75, column: 4, scope: !572)
!592 = !DILocation(line: 76, column: 11, scope: !588)
!593 = !DILocation(line: 85, column: 6, scope: !594)
!594 = distinct !DILexicalBlock(scope: !572, file: !24, line: 85, column: 4)
!595 = !DILocation(line: 85, column: 13, scope: !594)
!596 = !DILocation(line: 77, column: 7, scope: !588)
!597 = !DILocation(line: 77, column: 14, scope: !588)
!598 = !DILocation(line: 79, column: 8, scope: !588)
!599 = !DILocation(line: 80, column: 12, scope: !588)
!600 = !DILocation(line: 81, column: 11, scope: !588)
!601 = !DILocation(line: 82, column: 7, scope: !588)
!602 = !DILocation(line: 82, column: 14, scope: !588)
!603 = distinct !DISubprogram(name: "main.NewCertificateManager", linkageName: "main.NewCertificateManager", scope: null, file: !24, line: 30, type: !604, isLocal: false, isDefinition: true, scopeLine: 30, isOptimized: false, unit: !1, retainedNodes: !3)
!604 = !DISubroutineType(types: !605)
!605 = !{!606, !12, !12}
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*CertificateManager,error}", file: !47, size: 192, align: 8, elements: !607)
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !47, line: 30, baseType: !22, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !47, line: 30, baseType: !395, size: 128, align: 64, offset: 64)
!610 = !DILocalVariable(name: "certFile", arg: 1, scope: !603, file: !24, line: 30, type: !12)
!611 = !DILocation(line: 30, column: 28, scope: !603)
!612 = !DILocalVariable(name: "keyFile", arg: 2, scope: !603, file: !24, line: 30, type: !12)
!613 = !DILocation(line: 30, column: 38, scope: !603)
!614 = !DILocalVariable(name: "$ret0", scope: !603, file: !24, line: 30, type: !22)
!615 = !DILocation(line: 30, column: 55, scope: !603)
!616 = !DILocation(line: 34, column: 13, scope: !617)
!617 = distinct !DILexicalBlock(scope: !603, file: !24, line: 30, column: 1)
!618 = !DILocation(line: 31, column: 8, scope: !617)
!619 = !DILocation(line: 31, column: 9, scope: !617)
!620 = !DILocalVariable(name: "cm", scope: !617, file: !24, line: 31, type: !22)
!621 = !DILocation(line: 31, column: 2, scope: !603)
!622 = !DILocation(line: 36, column: 11, scope: !617)
!623 = !DILocalVariable(name: "err", scope: !617, file: !24, line: 36, type: !395)
!624 = !DILocation(line: 36, column: 2, scope: !603)
!625 = !DILocation(line: 37, column: 9, scope: !617)
!626 = !DILocalVariable(name: "$ret1", scope: !603, file: !24, line: 30, type: !395)
!627 = !DILocation(line: 30, column: 76, scope: !603)
!628 = !DILocation(line: 38, column: 3, scope: !617)
!629 = !DILocation(line: 41, column: 2, scope: !617)
!630 = !DILocation(line: 43, column: 2, scope: !617)
!631 = distinct !DISubprogram(name: "main.main..thunk1", scope: null, file: !24, line: 41, type: !632, isLocal: true, isDefinition: true, scopeLine: 41, isOptimized: false, unit: !1, retainedNodes: !3)
!632 = !DISubroutineType(types: !633)
!633 = !{!79, !634}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*CertificateManager}", file: !47, size: 64, align: 8, elements: !636)
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !47, line: 41, baseType: !22, size: 64, align: 64)
!638 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !631, file: !24, line: 41, type: !634)
!639 = !DILocation(line: 41, column: 2, scope: !631)
!640 = distinct !DISubprogram(name: "main.main..thunk2", scope: null, file: !24, line: 48, type: !632, isLocal: true, isDefinition: true, scopeLine: 48, isOptimized: false, unit: !1, retainedNodes: !3)
!641 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !640, file: !24, line: 48, type: !634)
!642 = !DILocation(line: 48, column: 2, scope: !640)
!643 = distinct !DISubprogram(name: "main.httpHandler", scope: null, file: !11, line: 34, type: !644, isLocal: true, isDefinition: true, scopeLine: 34, isOptimized: false, unit: !1, retainedNodes: !3)
!644 = !DISubroutineType(types: !645)
!645 = !{!79, !646, !669}
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "ResponseWriter", file: !11, line: 7, size: 128, align: 8, elements: !647)
!647 = !{!648, !130}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 7, baseType: !649, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Header,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,int)void}", file: !47, size: 256, align: 8, elements: !651)
!651 = !{!652, !653, !657, !665}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !47, line: 7, baseType: !60, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !47, line: 7, baseType: !654, size: 64, align: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!349, !78}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !47, line: 7, baseType: !658, size: 64, align: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!661, !78, !51}
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !47, size: 192, align: 8, elements: !662)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !47, line: 7, baseType: !18, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !47, line: 7, baseType: !395, size: 128, align: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "WriteHeader", file: !47, line: 7, baseType: !666, size: 64, align: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!79, !78, !18}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !11, line: 7, size: 1984, align: 8, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677, !678, !687, !699, !700, !701, !702, !703, !704, !705, !711, !712, !713, !714, !738, !739, !752}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !11, line: 7, baseType: !12, size: 128, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !11, line: 7, baseType: !259, size: 64, align: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Proto", file: !11, line: 7, baseType: !12, size: 128, align: 64, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMajor", file: !11, line: 7, baseType: !18, size: 64, align: 64, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMinor", file: !11, line: 7, baseType: !18, size: 64, align: 64, offset: 384)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !11, line: 7, baseType: !349, size: 64, align: 64, offset: 448)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !11, line: 7, baseType: !679, size: 128, align: 64, offset: 512)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !11, line: 7, size: 128, align: 8, elements: !680)
!680 = !{!681, !130}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 7, baseType: !682, size: 64, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !47, size: 192, align: 8, elements: !684)
!684 = !{!652, !685, !686}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !47, line: 7, baseType: !439, size: 64, align: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !47, line: 7, baseType: !455, size: 64, align: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !11, line: 7, baseType: !688, size: 64, align: 64, offset: 640)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !11, line: 7, size: 64, align: 8, elements: !690)
!690 = !{!691}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !11, line: 7, baseType: !692, size: 64, align: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!695}
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !47, size: 256, align: 8, elements: !696)
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !47, line: 7, baseType: !679, size: 128, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !47, line: 7, baseType: !395, size: 128, align: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !11, line: 7, baseType: !181, size: 64, align: 64, offset: 704)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !11, line: 7, baseType: !149, size: 192, align: 64, offset: 768)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !11, line: 7, baseType: !88, size: 8, align: 8, offset: 960)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !11, line: 7, baseType: !12, size: 128, align: 64, offset: 1024)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Form", file: !11, line: 7, baseType: !349, size: 64, align: 64, offset: 1152)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "PostForm", file: !11, line: 7, baseType: !349, size: 64, align: 64, offset: 1216)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "MultipartForm", file: !11, line: 7, baseType: !706, size: 64, align: 64, offset: 1280)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", file: !11, line: 7, size: 128, align: 8, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !11, line: 7, baseType: !349, size: 64, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !11, line: 7, baseType: !349, size: 64, align: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !11, line: 7, baseType: !349, size: 64, align: 64, offset: 1344)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !11, line: 7, baseType: !12, size: 128, align: 64, offset: 1408)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "RequestURI", file: !11, line: 7, baseType: !12, size: 128, align: 64, offset: 1536)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !11, line: 7, baseType: !715, size: 64, align: 64, offset: 1664)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionState", file: !24, line: 14, size: 1344, align: 8, elements: !717)
!717 = !{!718, !719, !720, !721, !722, !723, !724, !725, !730, !735, !736, !737}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !24, line: 14, baseType: !356, size: 16, align: 16)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "HandshakeComplete", file: !24, line: 14, baseType: !88, size: 8, align: 8, offset: 16)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "DidResume", file: !24, line: 14, baseType: !88, size: 8, align: 8, offset: 24)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuite", file: !24, line: 14, baseType: !356, size: 16, align: 16, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocol", file: !24, line: 14, baseType: !12, size: 128, align: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocolIsMutual", file: !24, line: 14, baseType: !88, size: 8, align: 8, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !24, line: 14, baseType: !12, size: 128, align: 64, offset: 256)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "PeerCertificates", file: !24, line: 14, baseType: !726, size: 192, align: 64, offset: 384)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !47, size: 192, align: 8, elements: !727)
!727 = !{!728, !54, !55}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !729, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "VerifiedChains", file: !24, line: 14, baseType: !731, size: 192, align: 64, offset: 576)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !47, size: 192, align: 8, elements: !732)
!732 = !{!733, !54, !55}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !734, size: 64, align: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !24, line: 14, baseType: !46, size: 192, align: 64, offset: 768)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPResponse", file: !24, line: 14, baseType: !51, size: 192, align: 64, offset: 960)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "TLSUnique", file: !24, line: 14, baseType: !51, size: 192, align: 64, offset: 1152)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", file: !11, line: 7, baseType: !299, size: 64, align: 64, offset: 1728)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !11, line: 7, baseType: !740, size: 64, align: 64, offset: 1792)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !11, line: 7, size: 1152, align: 8, elements: !742)
!742 = !{!743, !744, !674, !675, !676, !677, !678, !745, !746, !747, !748, !749, !750, !751}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !11, line: 7, baseType: !12, size: 128, align: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "StatusCode", file: !11, line: 7, baseType: !18, size: 64, align: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !11, line: 7, baseType: !181, size: 64, align: 64, offset: 640)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !11, line: 7, baseType: !149, size: 192, align: 64, offset: 704)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !11, line: 7, baseType: !88, size: 8, align: 8, offset: 896)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "Uncompressed", file: !11, line: 7, baseType: !88, size: 8, align: 8, offset: 904)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !11, line: 7, baseType: !349, size: 64, align: 64, offset: 960)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Request", file: !11, line: 7, baseType: !78, size: 64, align: 64, offset: 1024)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !11, line: 7, baseType: !715, size: 64, align: 64, offset: 1088)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !11, line: 7, baseType: !753, size: 128, align: 64, offset: 1856)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !24, line: 14, size: 128, align: 8, elements: !754)
!754 = !{!755, !109}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !756, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,DecrypterOpts)DecrypterOpts}", file: !47, size: 320, align: 8, elements: !758)
!758 = !{!321, !759, !767, !771, !772}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !47, line: 14, baseType: !760, size: 64, align: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!763, !78}
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !47, size: 256, align: 8, elements: !764)
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !47, line: 14, baseType: !176, size: 192, align: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !47, line: 14, baseType: !88, size: 8, align: 8, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !47, line: 14, baseType: !768, size: 64, align: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!299, !78}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !47, line: 14, baseType: !439, size: 64, align: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !47, line: 14, baseType: !773, size: 64, align: 64, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!127, !78, !127}
!776 = !DILocalVariable(name: "w", arg: 1, scope: !643, file: !11, line: 34, type: !646)
!777 = !DILocation(line: 34, column: 18, scope: !643)
!778 = !DILocalVariable(name: "req", arg: 2, scope: !643, file: !11, line: 34, type: !669)
!779 = !DILocation(line: 34, column: 41, scope: !643)
!780 = !DILocation(line: 35, column: 37, scope: !781)
!781 = distinct !DILexicalBlock(scope: !643, file: !11, line: 34, column: 1)
!782 = !DILocation(line: 35, column: 39, scope: !781)
!783 = !DILocation(line: 35, column: 51, scope: !781)
!784 = !DILocation(line: 35, column: 63, scope: !781)
!785 = !DILocation(line: 35, column: 20, scope: !781)
!786 = !DILocalVariable(name: "cert", scope: !781, file: !11, line: 35, type: !113)
!787 = !DILocation(line: 35, column: 2, scope: !643)
!788 = !DILocalVariable(name: "err", scope: !781, file: !11, line: 35, type: !395)
!789 = !DILocation(line: 36, column: 9, scope: !781)
!790 = !DILocation(line: 40, column: 7, scope: !781)
!791 = !DILocation(line: 37, column: 15, scope: !781)
!792 = !DILocation(line: 37, column: 7, scope: !781)
!793 = !DILocation(line: 40, column: 17, scope: !781)
!794 = !DILocation(line: 40, column: 44, scope: !781)
!795 = !DILocation(line: 40, column: 53, scope: !781)
!796 = !DILocation(line: 39, column: 44, scope: !781)
!797 = !DILocation(line: 39, column: 61, scope: !781)
!798 = !DILocation(line: 39, column: 6, scope: !781)
!799 = !DILocation(line: 39, column: 14, scope: !781)
!800 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !21, line: 32, type: !374, isLocal: false, isDefinition: true, scopeLine: 32, isOptimized: false, unit: !1, retainedNodes: !3)
!801 = !DILocation(line: 33, column: 7, scope: !802)
!802 = distinct !DILexicalBlock(scope: !800, file: !21, line: 32, column: 1)
!803 = !DILocation(line: 34, column: 7, scope: !802)
!804 = !DILocation(line: 35, column: 7, scope: !802)
!805 = !DILocation(line: 36, column: 7, scope: !802)
!806 = !DILocation(line: 38, column: 6, scope: !802)
!807 = !DILocation(line: 41, column: 12, scope: !802)
!808 = !DILocation(line: 41, column: 10, scope: !802)
!809 = !DILocalVariable(name: "err", scope: !802, file: !21, line: 40, type: !395)
!810 = !DILocation(line: 40, column: 6, scope: !800)
!811 = !DILocation(line: 42, column: 9, scope: !802)
!812 = !DILocation(line: 45, column: 21, scope: !802)
!813 = !DILocation(line: 45, column: 16, scope: !802)
!814 = !DILocation(line: 43, column: 13, scope: !802)
!815 = !DILocation(line: 43, column: 7, scope: !802)
!816 = !DILocation(line: 46, column: 9, scope: !802)
!817 = !DILocation(line: 50, column: 7, scope: !802)
!818 = !DILocation(line: 52, column: 2, scope: !802)
!819 = !DILocation(line: 54, column: 22, scope: !802)
!820 = !DILocation(line: 54, column: 20, scope: !802)
!821 = !DILocation(line: 53, column: 14, scope: !802)
!822 = !DILocation(line: 53, column: 19, scope: !802)
!823 = !DILocation(line: 52, column: 17, scope: !802)
!824 = !DILocation(line: 47, column: 13, scope: !802)
!825 = !DILocation(line: 47, column: 7, scope: !802)
!826 = !DILocalVariable(name: "server", scope: !802, file: !21, line: 52, type: !827)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "Server", file: !11, line: 7, size: 1600, align: 8, elements: !829)
!829 = !{!830, !831, !842, !988, !990, !991, !992, !993, !994, !995, !1004, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", file: !11, line: 7, baseType: !12, size: 128, align: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "Handler", file: !11, line: 7, baseType: !832, size: 128, align: 64, offset: 128)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "Handler", file: !11, line: 7, size: 128, align: 8, elements: !833)
!833 = !{!834, !130}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 7, baseType: !835, size: 64, align: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,ResponseWriter,*Request)void}", file: !47, size: 128, align: 8, elements: !837)
!837 = !{!652, !838}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ServeHTTP", file: !47, line: 7, baseType: !839, size: 64, align: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!79, !78, !646, !669}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "TLSConfig", file: !11, line: 7, baseType: !843, size: 64, align: 64, offset: 256)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !24, line: 14, size: 2944, align: 8, elements: !845)
!845 = !{!846, !854, !862, !866, !867, !875, !888, !899, !907, !914, !915, !916, !918, !919, !920, !921, !922, !923, !927, !955, !956, !957, !958, !959, !961, !969, !974, !975}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "Rand", file: !24, line: 14, baseType: !847, size: 128, align: 64)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !24, line: 14, size: 128, align: 8, elements: !848)
!848 = !{!849, !109}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !850, size: 64, align: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !47, size: 128, align: 8, elements: !852)
!852 = !{!321, !853}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !47, line: 14, baseType: !455, size: 64, align: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Time", file: !24, line: 14, baseType: !855, size: 64, align: 64, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !24, line: 14, size: 64, align: 8, elements: !857)
!857 = !{!858}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !24, line: 14, baseType: !859, size: 64, align: 64)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!176}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "Certificates", file: !24, line: 14, baseType: !863, size: 192, align: 64, offset: 192)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,int,int}", file: !47, size: 192, align: 8, elements: !864)
!864 = !{!865, !54, !55}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !42, size: 64, align: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "NameToCertificate", file: !24, line: 14, baseType: !349, size: 64, align: 64, offset: 384)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "GetCertificate", file: !24, line: 14, baseType: !868, size: 64, align: 64, offset: 448)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !24, line: 14, size: 64, align: 8, elements: !870)
!870 = !{!871}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !24, line: 14, baseType: !872, size: 64, align: 64)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!391, !407}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "GetClientCertificate", file: !24, line: 14, baseType: !876, size: 64, align: 64, offset: 512)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !24, line: 14, size: 64, align: 8, elements: !878)
!878 = !{!879}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !24, line: 14, baseType: !880, size: 64, align: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!391, !883}
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertificateRequestInfo", file: !24, line: 14, size: 384, align: 8, elements: !885)
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptableCAs", file: !24, line: 14, baseType: !46, size: 192, align: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureSchemes", file: !24, line: 14, baseType: !424, size: 192, align: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "GetConfigForClient", file: !24, line: 14, baseType: !889, size: 64, align: 64, offset: 576)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !24, line: 14, size: 64, align: 8, elements: !891)
!891 = !{!892}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !24, line: 14, baseType: !893, size: 64, align: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!896, !407}
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Config,error}", file: !47, size: 192, align: 8, elements: !897)
!897 = !{!898, !394}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !47, line: 14, baseType: !78, size: 64, align: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "VerifyPeerCertificate", file: !24, line: 14, baseType: !900, size: 64, align: 64, offset: 640)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !24, line: 14, size: 64, align: 8, elements: !902)
!902 = !{!903}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !24, line: 14, baseType: !904, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!395, !46, !731}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "RootCAs", file: !24, line: 14, baseType: !908, size: 64, align: 64, offset: 704)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertPool", file: !24, line: 14, size: 320, align: 8, elements: !910)
!910 = !{!911, !912, !913}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "bySubjectKeyId", file: !24, line: 14, baseType: !349, size: 64, align: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "byName", file: !24, line: 14, baseType: !349, size: 64, align: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "certs", file: !24, line: 14, baseType: !726, size: 192, align: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "NextProtos", file: !24, line: 14, baseType: !149, size: 192, align: 64, offset: 768)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !24, line: 14, baseType: !12, size: 128, align: 64, offset: 960)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAuth", file: !24, line: 14, baseType: !917, size: 64, align: 64, offset: 1088)
!917 = !DIBasicType(name: "ClientAuthType", size: 64, encoding: DW_ATE_signed)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "ClientCAs", file: !24, line: 14, baseType: !908, size: 64, align: 64, offset: 1152)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "InsecureSkipVerify", file: !24, line: 14, baseType: !88, size: 8, align: 8, offset: 1216)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuites", file: !24, line: 14, baseType: !411, size: 192, align: 64, offset: 1280)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "PreferServerCipherSuites", file: !24, line: 14, baseType: !88, size: 8, align: 8, offset: 1472)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "SessionTicketsDisabled", file: !24, line: 14, baseType: !88, size: 8, align: 8, offset: 1480)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "SessionTicketKey", file: !24, line: 14, baseType: !924, size: 256, align: 8, offset: 1488)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 256, align: 1, elements: !925)
!925 = !{!926}
!926 = !DISubrange(count: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ClientSessionCache", file: !24, line: 14, baseType: !928, size: 128, align: 64, offset: 1792)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientSessionCache", file: !24, line: 14, size: 128, align: 8, elements: !929)
!929 = !{!930, !109}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !931, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)struct{*ClientSessionState,bool},*func(*void,string,*ClientSessionState)void}", file: !47, size: 192, align: 8, elements: !933)
!933 = !{!321, !934, !951}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !47, line: 14, baseType: !935, size: 64, align: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!938, !78, !12}
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ClientSessionState,bool}", file: !47, size: 128, align: 8, elements: !939)
!939 = !{!940, !950}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "session", file: !47, line: 14, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientSessionState", file: !24, line: 14, size: 832, align: 8, elements: !943)
!943 = !{!944, !945, !946, !947, !948, !949}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "sessionTicket", file: !24, line: 14, baseType: !51, size: 192, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "vers", file: !24, line: 14, baseType: !356, size: 16, align: 16, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "cipherSuite", file: !24, line: 14, baseType: !356, size: 16, align: 16, offset: 208)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "masterSecret", file: !24, line: 14, baseType: !51, size: 192, align: 64, offset: 256)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "serverCertificates", file: !24, line: 14, baseType: !726, size: 192, align: 64, offset: 448)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "verifiedChains", file: !24, line: 14, baseType: !731, size: 192, align: 64, offset: 640)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !47, line: 14, baseType: !88, size: 8, align: 8, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "Put", file: !47, line: 14, baseType: !952, size: 64, align: 64, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!79, !78, !12, !941}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "MinVersion", file: !24, line: 14, baseType: !356, size: 16, align: 16, offset: 1920)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "MaxVersion", file: !24, line: 14, baseType: !356, size: 16, align: 16, offset: 1936)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "CurvePreferences", file: !24, line: 14, baseType: !417, size: 192, align: 64, offset: 1984)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "DynamicRecordSizingDisabled", file: !24, line: 14, baseType: !88, size: 8, align: 8, offset: 2176)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "Renegotiation", file: !24, line: 14, baseType: !960, size: 64, align: 64, offset: 2240)
!960 = !DIBasicType(name: "RenegotiationSupport", size: 64, encoding: DW_ATE_signed)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "KeyLogWriter", file: !24, line: 14, baseType: !962, size: 128, align: 64, offset: 2304)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !24, line: 14, size: 128, align: 8, elements: !963)
!963 = !{!964, !109}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 14, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !47, size: 128, align: 8, elements: !967)
!967 = !{!321, !968}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !47, line: 14, baseType: !455, size: 64, align: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "serverInitOnce", file: !24, line: 14, baseType: !970, size: 96, align: 32, offset: 2432)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once", file: !24, line: 14, size: 96, align: 8, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !24, line: 14, baseType: !30, size: 64, align: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "done", file: !24, line: 14, baseType: !8, size: 32, align: 32, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !24, line: 14, baseType: !27, size: 192, align: 32, offset: 2528)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "sessionTicketKeys", file: !24, line: 14, baseType: !976, size: 192, align: 64, offset: 2752)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.crypto/tls.ticketKey,int,int}", file: !47, size: 192, align: 8, elements: !977)
!977 = !{!978, !54, !55}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DICompositeType(tag: DW_TAG_structure_type, name: ".crypto/tls.ticketKey", file: !24, line: 14, size: 384, align: 8, elements: !981)
!981 = !{!982, !986, !987}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "keyName", file: !24, line: 14, baseType: !983, size: 128, align: 8)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 128, align: 1, elements: !984)
!984 = !{!985}
!985 = !DISubrange(count: 16)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "aesKey", file: !24, line: 14, baseType: !983, size: 128, align: 8, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "hmacKey", file: !24, line: 14, baseType: !983, size: 128, align: 8, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "ReadTimeout", file: !11, line: 7, baseType: !989, size: 64, align: 64, offset: 320)
!989 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ReadHeaderTimeout", file: !11, line: 7, baseType: !989, size: 64, align: 64, offset: 384)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "WriteTimeout", file: !11, line: 7, baseType: !989, size: 64, align: 64, offset: 448)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "IdleTimeout", file: !11, line: 7, baseType: !989, size: 64, align: 64, offset: 512)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "MaxHeaderBytes", file: !11, line: 7, baseType: !18, size: 64, align: 64, offset: 576)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "TLSNextProto", file: !11, line: 7, baseType: !349, size: 64, align: 64, offset: 640)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ConnState", file: !11, line: 7, baseType: !996, size: 64, align: 64, offset: 704)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !11, line: 7, size: 64, align: 8, elements: !998)
!998 = !{!999}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !11, line: 7, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!79, !432, !1003}
!1003 = !DIBasicType(name: "ConnState", size: 64, encoding: DW_ATE_signed)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorLog", file: !11, line: 7, baseType: !1005, size: 64, align: 64, offset: 768)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DICompositeType(tag: DW_TAG_structure_type, name: "Logger", file: !24, line: 15, size: 576, align: 8, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1012}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !24, line: 15, baseType: !30, size: 64, align: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", file: !24, line: 15, baseType: !12, size: 128, align: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !24, line: 15, baseType: !18, size: 64, align: 64, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "out", file: !24, line: 15, baseType: !962, size: 128, align: 64, offset: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !24, line: 15, baseType: !51, size: 192, align: 64, offset: 384)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "disableKeepAlives", file: !11, line: 7, baseType: !33, size: 32, align: 32, offset: 832)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "inShutdown", file: !11, line: 7, baseType: !33, size: 32, align: 32, offset: 864)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "nextProtoOnce", file: !11, line: 7, baseType: !970, size: 96, align: 32, offset: 896)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "nextProtoErr", file: !11, line: 7, baseType: !395, size: 128, align: 64, offset: 1024)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !11, line: 7, baseType: !30, size: 64, align: 32, offset: 1152)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "listeners", file: !11, line: 7, baseType: !349, size: 64, align: 64, offset: 1216)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "activeConn", file: !11, line: 7, baseType: !349, size: 64, align: 64, offset: 1280)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "doneChan", file: !11, line: 7, baseType: !299, size: 64, align: 64, offset: 1344)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "onShutdown", file: !11, line: 7, baseType: !1022, size: 192, align: 64, offset: 1408)
!1022 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**__go_descriptor,int,int}", file: !47, size: 192, align: 8, elements: !1023)
!1023 = !{!1024, !54, !55}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !24, line: 14, size: 64, align: 8, elements: !1028)
!1028 = !{!1029}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !24, line: 14, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!1031 = !DILocation(line: 52, column: 2, scope: !800)
!1032 = !DILocation(line: 58, column: 2, scope: !802)
!1033 = !DILocalVariable(name: "errChan", scope: !802, file: !21, line: 58, type: !1034)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
