; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./graph.go", directory: "/home/wangcong/go_path/src/github.com/davecheney/gcvis")
!3 = !{}
!4 = !{!5, !54, !57, !61, !63, !66, !77, !131, !133, !138, !350, !352, !354, !356}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "main.StartTime", linkageName: "main.StartTime", scope: !1, file: !7, line: 28, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "graph.go", directory: ".")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 7, size: 192, align: 8, elements: !9)
!9 = !{!10, !12, !14}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 7, baseType: !11, size: 64, align: 64)
!11 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 7, baseType: !13, size: 64, align: 64, offset: 64)
!13 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 7, baseType: !15, size: 64, align: 64, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 7, size: 704, align: 8, elements: !17)
!17 = !{!18, !27, !40, !51, !52, !53}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 7, baseType: !19, size: 128, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !20, line: 1, size: 128, align: 8, elements: !21)
!20 = !DIFile(filename: "<built-in>", directory: "")
!21 = !{!22, !25}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !20, line: 1, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !20, line: 1, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 7, baseType: !28, size: 192, align: 64, offset: 128)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !29, size: 192, align: 8, elements: !30)
!29 = !DIFile(filename: "", directory: "")
!30 = !{!31, !38, !39}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 7, size: 256, align: 8, elements: !34)
!34 = !{!18, !35, !36}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 7, baseType: !26, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 7, baseType: !37, size: 8, align: 8, offset: 192)
!37 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !29, line: 1, baseType: !26, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !29, line: 1, baseType: !26, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 7, baseType: !41, size: 192, align: 64, offset: 320)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !29, size: 192, align: 8, elements: !42)
!42 = !{!43, !38, !39}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 7, size: 128, align: 8, elements: !46)
!46 = !{!47, !48, !49, !50}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 7, baseType: !13, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 7, baseType: !24, size: 8, align: 8, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 7, baseType: !37, size: 8, align: 8, offset: 72)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 7, baseType: !37, size: 8, align: 8, offset: 80)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 7, baseType: !13, size: 64, align: 64, offset: 512)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 7, baseType: !13, size: 64, align: 64, offset: 576)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 7, baseType: !32, size: 64, align: 64, offset: 640)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !20, line: 1, type: !56, isLocal: false, isDefinition: true)
!56 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "main.iface", linkageName: "main.iface", scope: !1, file: !59, line: 22, type: !60, isLocal: true, isDefinition: true)
!59 = !DIFile(filename: "main.go", directory: ".")
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "main.port", linkageName: "main.port", scope: !1, file: !59, line: 23, type: !60, isLocal: true, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "main.openBrowser", linkageName: "main.openBrowser", scope: !1, file: !59, line: 24, type: !65, isLocal: true, isDefinition: true)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "flag.Usage", linkageName: "flag.Usage", scope: !1, file: !59, line: 10, type: !68, isLocal: false, isDefinition: true)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !70, line: 8, size: 64, align: 8, elements: !71)
!70 = !DIFile(filename: "http_server.go", directory: ".")
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !70, line: 8, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!76}
!76 = !DIBasicType(name: "void")
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "os.Stdin", linkageName: "os.Stdin", scope: !1, file: !59, line: 14, type: !79, isLocal: false, isDefinition: true)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !70, line: 7, size: 64, align: 8, elements: !81)
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !70, line: 7, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !70, line: 7, size: 640, align: 8, elements: !85)
!85 = !{!86, !117, !118, !129, !130}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !70, line: 7, baseType: !87, size: 384, align: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !70, line: 7, size: 384, align: 8, elements: !88)
!88 = !{!89, !95, !96, !101, !112, !113, !114, !115, !116}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !70, line: 7, baseType: !90, size: 128, align: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !70, line: 7, size: 128, align: 8, elements: !91)
!91 = !{!92, !93, !94}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !70, line: 7, baseType: !11, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !70, line: 7, baseType: !56, size: 32, align: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !70, line: 7, baseType: !56, size: 32, align: 32, offset: 96)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !70, line: 7, baseType: !26, size: 64, align: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !70, line: 7, baseType: !97, size: 64, align: 64, offset: 192)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !70, line: 7, size: 64, align: 8, elements: !98)
!98 = !{!99}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !70, line: 7, baseType: !100, size: 64, align: 64)
!100 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !70, line: 7, baseType: !102, size: 64, align: 64, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !29, size: 192, align: 8, elements: !104)
!104 = !{!105, !38, !39}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !70, line: 7, size: 128, align: 8, elements: !108)
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !70, line: 7, baseType: !23, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !70, line: 7, baseType: !111, size: 64, align: 64, offset: 64)
!111 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !70, line: 7, baseType: !56, size: 32, align: 32, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !70, line: 7, baseType: !37, size: 8, align: 8, offset: 352)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !70, line: 7, baseType: !37, size: 8, align: 8, offset: 360)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !70, line: 7, baseType: !37, size: 8, align: 8, offset: 368)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !70, line: 7, baseType: !37, size: 8, align: 8, offset: 376)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !70, line: 7, baseType: !19, size: 128, align: 64, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !70, line: 7, baseType: !119, size: 64, align: 64, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !70, line: 7, size: 256, align: 8, elements: !121)
!121 = !{!122, !126}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !70, line: 7, baseType: !123, size: 192, align: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !29, size: 192, align: 8, elements: !124)
!124 = !{!125, !38, !39}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !23, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !70, line: 7, baseType: !127, size: 64, align: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !70, line: 7, align: 8, elements: !3)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !70, line: 7, baseType: !37, size: 8, align: 8, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !70, line: 7, baseType: !37, size: 8, align: 8, offset: 584)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "os.Stderr", linkageName: "os.Stderr", scope: !1, file: !59, line: 14, type: !79, isLocal: false, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "os.Args", linkageName: "os.Args", scope: !1, file: !59, line: 14, type: !135, isLocal: false, isDefinition: true)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !29, size: 192, align: 8, elements: !136)
!136 = !{!137, !38, !39}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !60, size: 64, align: 64)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "main.gcrego14", linkageName: "main.gcrego14", scope: !1, file: !140, line: 19, type: !141, isLocal: true, isDefinition: true)
!140 = !DIFile(filename: "parser.go", directory: ".")
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Regexp", file: !140, line: 6, size: 1280, align: 8, elements: !143)
!143 = !{!144, !198, !203}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "regexpRO", file: !140, line: 6, baseType: !145, size: 1024, align: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.regexpRO", file: !140, line: 6, size: 1024, align: 8, elements: !146)
!146 = !{!147, !148, !171, !188, !189, !190, !191, !192, !193, !195, !196, !197}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "expr", file: !140, line: 6, baseType: !19, size: 128, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "prog", file: !140, line: 6, baseType: !149, size: 64, align: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "Prog", file: !140, line: 6, size: 320, align: 8, elements: !151)
!151 = !{!152, !169, !170}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Inst", file: !140, line: 6, baseType: !153, size: 192, align: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Inst,int,int}", file: !29, size: 192, align: 8, elements: !154)
!154 = !{!155, !38, !39}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inst", file: !140, line: 6, size: 320, align: 8, elements: !158)
!158 = !{!159, !161, !162, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Op", file: !140, line: 6, baseType: !160, size: 8, align: 8)
!160 = !DIBasicType(name: "InstOp", size: 8, encoding: DW_ATE_unsigned)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !140, line: 6, baseType: !56, size: 32, align: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Arg", file: !140, line: 6, baseType: !56, size: 32, align: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Rune", file: !140, line: 6, baseType: !164, size: 192, align: 64, offset: 128)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int32,int,int}", file: !29, size: 192, align: 8, elements: !165)
!165 = !{!166, !38, !39}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Start", file: !140, line: 6, baseType: !26, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "NumCap", file: !140, line: 6, baseType: !26, size: 64, align: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "onepass", file: !140, line: 6, baseType: !172, size: 64, align: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.onePassProg", file: !140, line: 6, size: 320, align: 8, elements: !174)
!174 = !{!175, !169, !170}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Inst", file: !140, line: 6, baseType: !176, size: 192, align: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.regexp.onePassInst,int,int}", file: !29, size: 192, align: 8, elements: !177)
!177 = !{!178, !38, !39}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.onePassInst", file: !140, line: 6, size: 512, align: 8, elements: !181)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Inst", file: !140, line: 6, baseType: !157, size: 320, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !140, line: 6, baseType: !184, size: 192, align: 64, offset: 320)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint32,int,int}", file: !29, size: 192, align: 8, elements: !185)
!185 = !{!186, !38, !39}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", file: !140, line: 6, baseType: !19, size: 128, align: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "prefixBytes", file: !140, line: 6, baseType: !123, size: 192, align: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "prefixComplete", file: !140, line: 6, baseType: !37, size: 8, align: 8, offset: 576)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "prefixRune", file: !140, line: 6, baseType: !168, size: 32, align: 32, offset: 608)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "prefixEnd", file: !140, line: 6, baseType: !56, size: 32, align: 32, offset: 640)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "cond", file: !140, line: 6, baseType: !194, size: 8, align: 8, offset: 672)
!194 = !DIBasicType(name: "EmptyOp", size: 8, encoding: DW_ATE_unsigned)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "numSubexp", file: !140, line: 6, baseType: !26, size: 64, align: 64, offset: 704)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "subexpNames", file: !140, line: 6, baseType: !135, size: 192, align: 64, offset: 768)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "longest", file: !140, line: 6, baseType: !37, size: 8, align: 8, offset: 960)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !140, line: 6, baseType: !199, size: 64, align: 32, offset: 1024)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 4, size: 64, align: 8, elements: !200)
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 4, baseType: !168, size: 32, align: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 4, baseType: !56, size: 32, align: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "machine", file: !140, line: 6, baseType: !204, size: 192, align: 64, offset: 1088)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**.regexp.machine,int,int}", file: !29, size: 192, align: 8, elements: !205)
!205 = !{!206, !38, !39}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.machine", file: !140, line: 6, size: 2112, align: 8, elements: !210)
!210 = !{!211, !213, !214, !215, !216, !238, !255, !256, !261, !262, !263, !267, !271}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "re", file: !140, line: 6, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !140, line: 6, baseType: !149, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "op", file: !140, line: 6, baseType: !172, size: 64, align: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "maxBitStateLen", file: !140, line: 6, baseType: !26, size: 64, align: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !140, line: 6, baseType: !217, size: 64, align: 64, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.bitState", file: !140, line: 6, size: 704, align: 8, elements: !219)
!219 = !{!220, !221, !222, !227, !237}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "prog", file: !140, line: 6, baseType: !149, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "end", file: !140, line: 6, baseType: !26, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "cap", file: !140, line: 6, baseType: !223, size: 192, align: 64, offset: 128)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !29, size: 192, align: 8, elements: !224)
!224 = !{!225, !38, !39}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", file: !140, line: 6, baseType: !228, size: 192, align: 64, offset: 320)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.regexp.job,int,int}", file: !29, size: 192, align: 8, elements: !229)
!229 = !{!230, !38, !39}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.job", file: !140, line: 6, size: 128, align: 8, elements: !233)
!233 = !{!234, !235, !236}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !140, line: 6, baseType: !56, size: 32, align: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !140, line: 6, baseType: !37, size: 8, align: 8, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "pos", file: !140, line: 6, baseType: !26, size: 64, align: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "visited", file: !140, line: 6, baseType: !184, size: 192, align: 64, offset: 512)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "q0", file: !140, line: 6, baseType: !239, size: 384, align: 64, offset: 320)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.queue", file: !140, line: 6, size: 384, align: 8, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "sparse", file: !140, line: 6, baseType: !184, size: 192, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "dense", file: !140, line: 6, baseType: !243, size: 192, align: 64, offset: 192)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.regexp.entry,int,int}", file: !29, size: 192, align: 8, elements: !244)
!244 = !{!245, !38, !39}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.entry", file: !140, line: 6, size: 128, align: 8, elements: !248)
!248 = !{!234, !249}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "t", file: !140, line: 6, baseType: !250, size: 64, align: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.thread", file: !140, line: 6, size: 256, align: 8, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "inst", file: !140, line: 6, baseType: !156, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "cap", file: !140, line: 6, baseType: !223, size: 192, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "q1", file: !140, line: 6, baseType: !239, size: 384, align: 64, offset: 704)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "pool", file: !140, line: 6, baseType: !257, size: 192, align: 64, offset: 1088)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**.regexp.thread,int,int}", file: !29, size: 192, align: 8, elements: !258)
!258 = !{!259, !38, !39}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "matched", file: !140, line: 6, baseType: !37, size: 8, align: 8, offset: 1280)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "matchcap", file: !140, line: 6, baseType: !223, size: 192, align: 64, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "inputBytes", file: !140, line: 6, baseType: !264, size: 192, align: 64, offset: 1536)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.inputBytes", file: !140, line: 6, size: 192, align: 8, elements: !265)
!265 = !{!266}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "str", file: !140, line: 6, baseType: !123, size: 192, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "inputString", file: !140, line: 6, baseType: !268, size: 128, align: 64, offset: 1728)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.inputString", file: !140, line: 6, size: 128, align: 8, elements: !269)
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "str", file: !140, line: 6, baseType: !19, size: 128, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "inputReader", file: !140, line: 6, baseType: !272, size: 256, align: 64, offset: 1856)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.inputReader", file: !140, line: 6, size: 256, align: 8, elements: !273)
!273 = !{!274, !348, !349}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !140, line: 6, baseType: !275, size: 128, align: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "RuneReader", file: !7, line: 5, size: 128, align: 8, elements: !276)
!276 = !{!277, !347}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 5, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{int32,int,error}}", file: !29, size: 128, align: 8, elements: !280)
!280 = !{!281, !326}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !29, line: 5, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !20, line: 1, size: 576, align: 8, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !290, !291, !299, !307, !308, !309, !325}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !20, line: 1, baseType: !100, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !20, line: 1, baseType: !100, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !20, line: 1, baseType: !56, size: 32, align: 32, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !20, line: 1, baseType: !24, size: 8, align: 8, offset: 160)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !20, line: 1, baseType: !24, size: 8, align: 8, offset: 168)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !20, line: 1, baseType: !24, size: 8, align: 8, offset: 176)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !20, line: 1, baseType: !292, size: 64, align: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !20, line: 1, size: 64, align: 8, elements: !294)
!294 = !{!295}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !20, line: 1, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!100, !212, !100}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !20, line: 1, baseType: !300, size: 64, align: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !20, line: 1, size: 64, align: 8, elements: !302)
!302 = !{!303}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !20, line: 1, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!37, !212, !212}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !20, line: 1, baseType: !23, size: 64, align: 64, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !20, line: 1, baseType: !60, size: 64, align: 64, offset: 384)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !20, line: 1, baseType: !310, size: 64, align: 64, offset: 448)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !20, line: 1, size: 320, align: 8, elements: !312)
!312 = !{!313, !314, !315}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !20, line: 1, baseType: !60, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !20, line: 1, baseType: !60, size: 64, align: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !20, line: 1, baseType: !316, size: 192, align: 64, offset: 128)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !29, size: 192, align: 8, elements: !317)
!317 = !{!318, !38, !39}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !20, line: 1, size: 320, align: 8, elements: !321)
!321 = !{!313, !314, !322, !323, !324}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !20, line: 1, baseType: !212, size: 64, align: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !20, line: 1, baseType: !212, size: 64, align: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !20, line: 1, baseType: !212, size: 64, align: 64, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !20, line: 1, baseType: !212, size: 64, align: 64, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ReadRune", file: !29, line: 5, baseType: !327, size: 64, align: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!330, !212}
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int32,int,error}", file: !29, size: 256, align: 8, elements: !331)
!331 = !{!332, !333, !334}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !29, line: 5, baseType: !168, size: 32, align: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !29, line: 5, baseType: !26, size: 64, align: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !29, line: 5, baseType: !335, size: 128, align: 64, offset: 128)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !20, line: 1, size: 128, align: 8, elements: !336)
!336 = !{!337, !346}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !20, line: 1, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !29, size: 128, align: 8, elements: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !29, line: 1, baseType: !282, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !29, line: 1, baseType: !343, size: 64, align: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!19, !212}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !20, line: 1, baseType: !212, size: 64, align: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !212, size: 64, align: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "atEOT", file: !140, line: 6, baseType: !37, size: 8, align: 8, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "pos", file: !140, line: 6, baseType: !26, size: 64, align: 64, offset: 192)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "main.gcrego15", linkageName: "main.gcrego15", scope: !1, file: !140, line: 20, type: !141, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "main.gcrego16", linkageName: "main.gcrego16", scope: !1, file: !140, line: 21, type: !141, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "main.scvgre", linkageName: "main.scvgre", scope: !1, file: !140, line: 22, type: !141, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "os.Stdout", linkageName: "os.Stdout", scope: !1, file: !59, line: 14, type: !79, isLocal: false, isDefinition: true)
!358 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !7, line: 1, type: !74, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!359 = !DILocation(line: 1, column: 1, scope: !360)
!360 = !DILexicalBlockFile(scope: !358, file: !20, discriminator: 0)
!361 = !DILocation(line: 28, column: 22, scope: !362)
!362 = !DILexicalBlockFile(scope: !358, file: !7, discriminator: 0)
!363 = !DILocation(line: 28, column: 5, scope: !362)
!364 = !DILocation(line: 22, column: 18, scope: !365)
!365 = !DILexicalBlockFile(scope: !358, file: !59, discriminator: 0)
!366 = !DILocation(line: 22, column: 5, scope: !365)
!367 = !DILocation(line: 23, column: 17, scope: !365)
!368 = !DILocation(line: 23, column: 5, scope: !365)
!369 = !DILocation(line: 24, column: 24, scope: !365)
!370 = !DILocation(line: 24, column: 5, scope: !365)
!371 = !DILocation(line: 19, column: 20, scope: !372)
!372 = !DILexicalBlockFile(scope: !358, file: !140, discriminator: 0)
!373 = !DILocation(line: 19, column: 2, scope: !372)
!374 = !DILocation(line: 20, column: 20, scope: !372)
!375 = !DILocation(line: 20, column: 2, scope: !372)
!376 = !DILocation(line: 21, column: 20, scope: !372)
!377 = !DILocation(line: 21, column: 2, scope: !372)
!378 = !DILocation(line: 22, column: 20, scope: !372)
!379 = !DILocation(line: 22, column: 2, scope: !372)
!380 = distinct !DISubprogram(name: "main.main.graphPoints..hash", linkageName: "main.main.graphPoints..hash", scope: null, file: !20, line: 1, type: !297, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!381 = !DILocalVariable(name: "key", arg: 1, scope: !380, file: !20, line: 1, type: !212)
!382 = !DILocation(line: 1, column: 1, scope: !380)
!383 = !DILocalVariable(name: "seed", arg: 2, scope: !380, file: !20, line: 1, type: !100)
!384 = !DILocalVariable(name: "$ret19", scope: !380, file: !20, line: 1, type: !100)
!385 = distinct !DISubprogram(name: "main.main.graphPoints..eq", linkageName: "main.main.graphPoints..eq", scope: null, file: !20, line: 1, type: !305, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!386 = !DILocalVariable(name: "key1", arg: 1, scope: !385, file: !20, line: 1, type: !212)
!387 = !DILocation(line: 1, column: 1, scope: !385)
!388 = !DILocalVariable(name: "key2", arg: 2, scope: !385, file: !20, line: 1, type: !212)
!389 = !DILocalVariable(name: "$ret20", scope: !385, file: !20, line: 1, type: !37)
!390 = distinct !DISubprogram(name: "main.main.gctrace..hash", linkageName: "main.main.gctrace..hash", scope: null, file: !20, line: 1, type: !297, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!391 = !DILocalVariable(name: "key", arg: 1, scope: !390, file: !20, line: 1, type: !212)
!392 = !DILocation(line: 1, column: 1, scope: !390)
!393 = !DILocalVariable(name: "seed", arg: 2, scope: !390, file: !20, line: 1, type: !100)
!394 = !DILocalVariable(name: "$ret23", scope: !390, file: !20, line: 1, type: !100)
!395 = distinct !DISubprogram(name: "main.main.gctrace..eq", linkageName: "main.main.gctrace..eq", scope: null, file: !20, line: 1, type: !305, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!396 = !DILocalVariable(name: "key1", arg: 1, scope: !395, file: !20, line: 1, type: !212)
!397 = !DILocation(line: 1, column: 1, scope: !395)
!398 = !DILocalVariable(name: "key2", arg: 2, scope: !395, file: !20, line: 1, type: !212)
!399 = !DILocalVariable(name: "$ret24", scope: !395, file: !20, line: 1, type: !37)
!400 = distinct !DISubprogram(name: "main.AddGCTraceGraphPoint..1main.Graph", linkageName: "main.Graph.AddGCTraceGraphPoint", scope: null, file: !7, line: 63, type: !401, isLocal: false, isDefinition: true, scopeLine: 63, isOptimized: false, unit: !1, retainedNodes: !3)
!401 = !DISubroutineType(types: !402)
!402 = !{!76, !403, !403, !570}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "Graph", file: !7, line: 12, size: 3072, align: 8, elements: !405)
!405 = !{!406, !407, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !569}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "Title", file: !7, line: 13, baseType: !19, size: 128, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "HeapUse", file: !7, line: 14, baseType: !408, size: 192, align: 64, offset: 128)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.main.graphPoints,int,int}", file: !29, size: 192, align: 8, elements: !409)
!409 = !{!410, !38, !39}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 128, align: 8, elements: !414)
!413 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!414 = !{!415}
!415 = !DISubrange(count: 2)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ScvgInuse", file: !7, line: 14, baseType: !408, size: 192, align: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ScvgIdle", file: !7, line: 14, baseType: !408, size: 192, align: 64, offset: 512)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ScvgSys", file: !7, line: 15, baseType: !408, size: 192, align: 64, offset: 704)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ScvgReleased", file: !7, line: 15, baseType: !408, size: 192, align: 64, offset: 896)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ScvgConsumed", file: !7, line: 15, baseType: !408, size: 192, align: 64, offset: 1088)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "STWSclock", file: !7, line: 16, baseType: !408, size: 192, align: 64, offset: 1280)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "MASclock", file: !7, line: 17, baseType: !408, size: 192, align: 64, offset: 1472)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "STWMclock", file: !7, line: 18, baseType: !408, size: 192, align: 64, offset: 1664)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "STWScpu", file: !7, line: 19, baseType: !408, size: 192, align: 64, offset: 1856)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "MASAssistcpu", file: !7, line: 20, baseType: !408, size: 192, align: 64, offset: 2048)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "MASBGcpu", file: !7, line: 21, baseType: !408, size: 192, align: 64, offset: 2240)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "MASIdlecpu", file: !7, line: 22, baseType: !408, size: 192, align: 64, offset: 2432)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "STWMcpu", file: !7, line: 23, baseType: !408, size: 192, align: 64, offset: 2624)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Tmpl", file: !7, line: 24, baseType: !430, size: 64, align: 64, offset: 2816)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "Template", file: !7, line: 4, size: 320, align: 8, elements: !432)
!432 = !{!433, !434, !551, !552}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "escapeErr", file: !7, line: 4, baseType: !335, size: 128, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "text", file: !7, line: 4, baseType: !435, size: 64, align: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "Template", file: !7, line: 4, size: 512, align: 8, elements: !437)
!437 = !{!438, !439, !531, !507, !508}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 4, baseType: !19, size: 128, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Tree", file: !7, line: 4, baseType: !440, size: 64, align: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tree", file: !7, line: 4, size: 1984, align: 8, elements: !442)
!442 = !{!443, !444, !445, !483, !484, !502, !517, !528, !529, !530}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !7, line: 4, baseType: !19, size: 128, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ParseName", file: !7, line: 4, baseType: !19, size: 128, align: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Root", file: !7, line: 4, baseType: !446, size: 64, align: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "ListNode", file: !7, line: 4, size: 384, align: 8, elements: !448)
!448 = !{!449, !451, !453, !454}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "NodeType", file: !7, line: 4, baseType: !450, size: 64, align: 64)
!450 = !DIBasicType(name: "NodeType", size: 64, encoding: DW_ATE_signed)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "Pos", file: !7, line: 4, baseType: !452, size: 64, align: 64, offset: 64)
!452 = !DIBasicType(name: "Pos", size: 64, encoding: DW_ATE_signed)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tr", file: !7, line: 4, baseType: !212, size: 64, align: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Nodes", file: !7, line: 4, baseType: !455, size: 192, align: 64, offset: 192)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Node,int,int}", file: !29, size: 192, align: 8, elements: !456)
!456 = !{!457, !38, !39}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !7, line: 4, size: 128, align: 8, elements: !460)
!460 = !{!461, !347}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 4, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Node,*func(*void)Pos,*func(*void)string,*func(*void)NodeType,*func(*void)*Tree}", file: !29, size: 384, align: 8, elements: !464)
!464 = !{!465, !466, !470, !474, !475, !479}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !29, line: 4, baseType: !282, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Copy", file: !29, line: 4, baseType: !467, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!459, !212}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Position", file: !29, line: 4, baseType: !471, size: 64, align: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!452, !212}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !29, line: 4, baseType: !343, size: 64, align: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !29, line: 4, baseType: !476, size: 64, align: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!450, !212}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "tree", file: !29, line: 4, baseType: !480, size: 64, align: 64, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!212, !212}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "text", file: !7, line: 4, baseType: !19, size: 128, align: 64, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", file: !7, line: 4, baseType: !485, size: 192, align: 64, offset: 448)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*FuncMap,int,int}", file: !29, size: 192, align: 8, elements: !486)
!486 = !{!487, !38, !39}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !20, line: 1, size: 384, align: 8, elements: !491)
!491 = !{!492, !493, !494, !495, !497, !498, !499, !500, !501}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !20, line: 1, baseType: !26, size: 64, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !20, line: 1, baseType: !24, size: 8, align: 8, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !20, line: 1, baseType: !24, size: 8, align: 8, offset: 72)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !20, line: 1, baseType: !496, size: 16, align: 16, offset: 80)
!496 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !20, line: 1, baseType: !56, size: 32, align: 32, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !20, line: 1, baseType: !212, size: 64, align: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !20, line: 1, baseType: !212, size: 64, align: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !20, line: 1, baseType: !100, size: 64, align: 64, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !20, line: 1, baseType: !212, size: 64, align: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "lex", file: !7, line: 4, baseType: !503, size: 64, align: 64, offset: 640)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: ".text/template/parse.lexer", file: !7, line: 4, size: 896, align: 8, elements: !505)
!505 = !{!438, !506, !507, !508, !509, !510, !511, !512, !515, !516}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "input", file: !7, line: 4, baseType: !19, size: 128, align: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "leftDelim", file: !7, line: 4, baseType: !19, size: 128, align: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "rightDelim", file: !7, line: 4, baseType: !19, size: 128, align: 64, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pos", file: !7, line: 4, baseType: !452, size: 64, align: 64, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "start", file: !7, line: 4, baseType: !452, size: 64, align: 64, offset: 576)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "width", file: !7, line: 4, baseType: !452, size: 64, align: 64, offset: 640)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "items", file: !7, line: 4, baseType: !513, size: 64, align: 64, offset: 704)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !20, line: 1, align: 8, elements: !3)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "parenDepth", file: !7, line: 4, baseType: !26, size: 64, align: 64, offset: 768)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "line", file: !7, line: 4, baseType: !26, size: 64, align: 64, offset: 832)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "token", file: !7, line: 4, baseType: !518, size: 960, align: 64, offset: 704)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 960, align: 8, elements: !526)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: ".text/template/parse.item", file: !7, line: 4, size: 320, align: 8, elements: !520)
!520 = !{!521, !523, !524, !525}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 4, baseType: !522, size: 64, align: 64)
!522 = !DIBasicType(name: ".text/template/parse.itemType", size: 64, encoding: DW_ATE_signed)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pos", file: !7, line: 4, baseType: !452, size: 64, align: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "val", file: !7, line: 4, baseType: !19, size: 128, align: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "line", file: !7, line: 4, baseType: !26, size: 64, align: 64, offset: 256)
!526 = !{!527}
!527 = !DISubrange(count: 3)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "peekCount", file: !7, line: 4, baseType: !26, size: 64, align: 64, offset: 1664)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "vars", file: !7, line: 4, baseType: !135, size: 192, align: 64, offset: 1728)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "treeSet", file: !7, line: 4, baseType: !489, size: 64, align: 64, offset: 1920)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "common", file: !7, line: 4, baseType: !532, size: 64, align: 64, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: ".text/template.common", file: !7, line: 4, size: 448, align: 8, elements: !534)
!534 = !{!535, !536, !541, !549, !550}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "tmpl", file: !7, line: 4, baseType: !489, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "option", file: !7, line: 4, baseType: !537, size: 64, align: 64, offset: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: ".text/template.option", file: !7, line: 4, size: 64, align: 8, elements: !538)
!538 = !{!539}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "missingKey", file: !7, line: 4, baseType: !540, size: 64, align: 64)
!540 = !DIBasicType(name: ".text/template.missingKeyAction", size: 64, encoding: DW_ATE_signed)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "muFuncs", file: !7, line: 4, baseType: !542, size: 192, align: 32, offset: 128)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !7, line: 4, size: 192, align: 8, elements: !543)
!543 = !{!544, !545, !546, !547, !548}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !7, line: 4, baseType: !199, size: 64, align: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !7, line: 4, baseType: !56, size: 32, align: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !7, line: 4, baseType: !56, size: 32, align: 32, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !7, line: 4, baseType: !168, size: 32, align: 32, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !7, line: 4, baseType: !168, size: 32, align: 32, offset: 160)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "parseFuncs", file: !7, line: 4, baseType: !489, size: 64, align: 64, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "execFuncs", file: !7, line: 4, baseType: !489, size: 64, align: 64, offset: 384)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Tree", file: !7, line: 4, baseType: !440, size: 64, align: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "nameSpace", file: !7, line: 4, baseType: !553, size: 64, align: 64, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: ".html/template.nameSpace", file: !7, line: 4, size: 640, align: 8, elements: !555)
!555 = !{!556, !557, !558, !559}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !7, line: 4, baseType: !199, size: 64, align: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "set", file: !7, line: 4, baseType: !489, size: 64, align: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", file: !7, line: 4, baseType: !37, size: 8, align: 8, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "esc", file: !7, line: 4, baseType: !560, size: 448, align: 64, offset: 192)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: ".html/template.escaper", file: !7, line: 4, size: 448, align: 8, elements: !561)
!561 = !{!562, !563, !564, !565, !566, !567, !568}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ns", file: !7, line: 4, baseType: !212, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "output", file: !7, line: 4, baseType: !489, size: 64, align: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "derived", file: !7, line: 4, baseType: !489, size: 64, align: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "called", file: !7, line: 4, baseType: !489, size: 64, align: 64, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "actionNodeEdits", file: !7, line: 4, baseType: !489, size: 64, align: 64, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "templateNodeEdits", file: !7, line: 4, baseType: !489, size: 64, align: 64, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "textNodeEdits", file: !7, line: 4, baseType: !489, size: 64, align: 64, offset: 384)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !7, line: 25, baseType: !542, size: 192, align: 32, offset: 2880)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: ".main.gctrace", file: !572, line: 12, size: 1984, align: 8, elements: !573)
!572 = !DIFile(filename: "tracedata.go", directory: ".")
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ElapsedTime", file: !572, line: 13, baseType: !413, size: 64, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "NumGC", file: !572, line: 14, baseType: !13, size: 64, align: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Nproc", file: !572, line: 15, baseType: !13, size: 64, align: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "t1", file: !572, line: 16, baseType: !13, size: 64, align: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "t2", file: !572, line: 17, baseType: !13, size: 64, align: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "t3", file: !572, line: 18, baseType: !13, size: 64, align: 64, offset: 320)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "t4", file: !572, line: 19, baseType: !13, size: 64, align: 64, offset: 384)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Heap0", file: !572, line: 20, baseType: !13, size: 64, align: 64, offset: 448)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Heap1", file: !572, line: 21, baseType: !13, size: 64, align: 64, offset: 512)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Obj", file: !572, line: 22, baseType: !13, size: 64, align: 64, offset: 576)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "NMalloc", file: !572, line: 23, baseType: !13, size: 64, align: 64, offset: 640)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "NFree", file: !572, line: 24, baseType: !13, size: 64, align: 64, offset: 704)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "NSpan", file: !572, line: 25, baseType: !13, size: 64, align: 64, offset: 768)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "NGoRoutines", file: !572, line: 26, baseType: !13, size: 64, align: 64, offset: 832)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "NBGSweep", file: !572, line: 27, baseType: !13, size: 64, align: 64, offset: 896)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "NPauseSweep", file: !572, line: 28, baseType: !13, size: 64, align: 64, offset: 960)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "NHandoff", file: !572, line: 29, baseType: !13, size: 64, align: 64, offset: 1024)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "NHandoffCnt", file: !572, line: 30, baseType: !13, size: 64, align: 64, offset: 1088)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "NSteal", file: !572, line: 31, baseType: !13, size: 64, align: 64, offset: 1152)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "NStealCnt", file: !572, line: 32, baseType: !13, size: 64, align: 64, offset: 1216)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "NProcYield", file: !572, line: 33, baseType: !13, size: 64, align: 64, offset: 1280)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "NOsYield", file: !572, line: 34, baseType: !13, size: 64, align: 64, offset: 1344)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "NSleep", file: !572, line: 35, baseType: !13, size: 64, align: 64, offset: 1408)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "STWSclock", file: !572, line: 36, baseType: !413, size: 64, align: 64, offset: 1472)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "MASclock", file: !572, line: 37, baseType: !413, size: 64, align: 64, offset: 1536)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "STWMclock", file: !572, line: 38, baseType: !413, size: 64, align: 64, offset: 1600)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "STWScpu", file: !572, line: 39, baseType: !413, size: 64, align: 64, offset: 1664)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "MASAssistcpu", file: !572, line: 40, baseType: !413, size: 64, align: 64, offset: 1728)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "MASBGcpu", file: !572, line: 41, baseType: !413, size: 64, align: 64, offset: 1792)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "MASIdlecpu", file: !572, line: 42, baseType: !413, size: 64, align: 64, offset: 1856)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "STWMcpu", file: !572, line: 43, baseType: !413, size: 64, align: 64, offset: 1920)
!605 = !DILocalVariable(name: "g", arg: 1, scope: !400, file: !7, line: 63, type: !403)
!606 = !DILocation(line: 63, column: 1, scope: !400)
!607 = !DILocalVariable(name: "gcTrace", arg: 2, scope: !400, file: !7, line: 63, type: !570)
!608 = !DILocation(line: 63, column: 38, scope: !400)
!609 = !DILocation(line: 64, column: 3, scope: !610)
!610 = distinct !DILexicalBlock(scope: !400, file: !7, line: 63, column: 1)
!611 = !DILocation(line: 81, column: 1, scope: !400)
!612 = !DILocation(line: 64, column: 6, scope: !610)
!613 = !DILocation(line: 65, column: 9, scope: !610)
!614 = !DILocation(line: 65, column: 2, scope: !610)
!615 = !DILocalVariable(name: "elapsedTime", scope: !610, file: !7, line: 66, type: !413)
!616 = !DILocation(line: 66, column: 6, scope: !400)
!617 = !DILocation(line: 67, column: 12, scope: !610)
!618 = !DILocation(line: 67, column: 25, scope: !610)
!619 = !DILocation(line: 68, column: 22, scope: !610)
!620 = !DILocation(line: 0, scope: !610)
!621 = !DILocation(line: 68, column: 27, scope: !610)
!622 = !DILocation(line: 68, column: 42, scope: !610)
!623 = !DILocation(line: 72, column: 3, scope: !610)
!624 = !DILocation(line: 72, column: 72, scope: !610)
!625 = !DILocation(line: 72, column: 22, scope: !610)
!626 = !DILocation(line: 72, column: 57, scope: !610)
!627 = !DILocation(line: 72, column: 14, scope: !610)
!628 = !DILocation(line: 72, column: 12, scope: !610)
!629 = !DILocation(line: 73, column: 76, scope: !610)
!630 = !DILocation(line: 73, column: 3, scope: !610)
!631 = !DILocation(line: 73, column: 16, scope: !610)
!632 = !DILocation(line: 73, column: 14, scope: !610)
!633 = !DILocation(line: 74, column: 74, scope: !610)
!634 = !DILocation(line: 74, column: 3, scope: !610)
!635 = !DILocation(line: 74, column: 15, scope: !610)
!636 = !DILocation(line: 74, column: 13, scope: !610)
!637 = !DILocation(line: 75, column: 76, scope: !610)
!638 = !DILocation(line: 75, column: 3, scope: !610)
!639 = !DILocation(line: 75, column: 16, scope: !610)
!640 = !DILocation(line: 75, column: 14, scope: !610)
!641 = !DILocation(line: 76, column: 72, scope: !610)
!642 = !DILocation(line: 76, column: 3, scope: !610)
!643 = !DILocation(line: 76, column: 14, scope: !610)
!644 = !DILocation(line: 76, column: 12, scope: !610)
!645 = !DILocation(line: 77, column: 82, scope: !610)
!646 = !DILocation(line: 77, column: 3, scope: !610)
!647 = !DILocation(line: 77, column: 19, scope: !610)
!648 = !DILocation(line: 77, column: 17, scope: !610)
!649 = !DILocation(line: 78, column: 74, scope: !610)
!650 = !DILocation(line: 78, column: 3, scope: !610)
!651 = !DILocation(line: 78, column: 15, scope: !610)
!652 = !DILocation(line: 78, column: 13, scope: !610)
!653 = !DILocation(line: 79, column: 78, scope: !610)
!654 = !DILocation(line: 79, column: 3, scope: !610)
!655 = !DILocation(line: 79, column: 17, scope: !610)
!656 = !DILocation(line: 79, column: 15, scope: !610)
!657 = !DILocation(line: 80, column: 72, scope: !610)
!658 = !DILocation(line: 80, column: 3, scope: !610)
!659 = !DILocation(line: 80, column: 14, scope: !610)
!660 = !DILocation(line: 80, column: 12, scope: !610)
!661 = distinct !DISubprogram(name: "main.main.scvgtrace..hash", linkageName: "main.main.scvgtrace..hash", scope: null, file: !20, line: 1, type: !297, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!662 = !DILocalVariable(name: "key", arg: 1, scope: !661, file: !20, line: 1, type: !212)
!663 = !DILocation(line: 1, column: 1, scope: !661)
!664 = !DILocalVariable(name: "seed", arg: 2, scope: !661, file: !20, line: 1, type: !100)
!665 = !DILocalVariable(name: "$ret25", scope: !661, file: !20, line: 1, type: !100)
!666 = distinct !DISubprogram(name: "main.main.scvgtrace..eq", linkageName: "main.main.scvgtrace..eq", scope: null, file: !20, line: 1, type: !305, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!667 = !DILocalVariable(name: "key1", arg: 1, scope: !666, file: !20, line: 1, type: !212)
!668 = !DILocation(line: 1, column: 1, scope: !666)
!669 = !DILocalVariable(name: "key2", arg: 2, scope: !666, file: !20, line: 1, type: !212)
!670 = !DILocalVariable(name: "$ret26", scope: !666, file: !20, line: 1, type: !37)
!671 = distinct !DISubprogram(name: "main.AddScavengerGraphPoint..1main.Graph", linkageName: "main.Graph.AddScavengerGraphPoint", scope: null, file: !7, line: 83, type: !672, isLocal: false, isDefinition: true, scopeLine: 83, isOptimized: false, unit: !1, retainedNodes: !3)
!672 = !DISubroutineType(types: !673)
!673 = !{!76, !403, !403, !674}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: ".main.scvgtrace", file: !572, line: 3, size: 384, align: 8, elements: !676)
!676 = !{!677, !678, !679, !680, !681, !682}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ElapsedTime", file: !572, line: 4, baseType: !413, size: 64, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", file: !572, line: 5, baseType: !13, size: 64, align: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "idle", file: !572, line: 6, baseType: !13, size: 64, align: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "sys", file: !572, line: 7, baseType: !13, size: 64, align: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "released", file: !572, line: 8, baseType: !13, size: 64, align: 64, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "consumed", file: !572, line: 9, baseType: !13, size: 64, align: 64, offset: 320)
!683 = !DILocalVariable(name: "g", arg: 1, scope: !671, file: !7, line: 83, type: !403)
!684 = !DILocation(line: 83, column: 1, scope: !671)
!685 = !DILocalVariable(name: "scvg", arg: 2, scope: !671, file: !7, line: 83, type: !674)
!686 = !DILocation(line: 83, column: 40, scope: !671)
!687 = !DILocation(line: 84, column: 3, scope: !688)
!688 = distinct !DILexicalBlock(scope: !671, file: !7, line: 83, column: 1)
!689 = !DILocation(line: 97, column: 1, scope: !671)
!690 = !DILocation(line: 84, column: 6, scope: !688)
!691 = !DILocation(line: 85, column: 9, scope: !688)
!692 = !DILocation(line: 85, column: 2, scope: !688)
!693 = !DILocalVariable(name: "elapsedTime", scope: !688, file: !7, line: 86, type: !413)
!694 = !DILocation(line: 86, column: 6, scope: !671)
!695 = !DILocation(line: 87, column: 9, scope: !688)
!696 = !DILocation(line: 87, column: 22, scope: !688)
!697 = !DILocation(line: 88, column: 22, scope: !688)
!698 = !DILocation(line: 0, scope: !688)
!699 = !DILocation(line: 88, column: 27, scope: !688)
!700 = !DILocation(line: 88, column: 42, scope: !688)
!701 = !DILocation(line: 92, column: 3, scope: !688)
!702 = !DILocation(line: 92, column: 73, scope: !688)
!703 = !DILocation(line: 92, column: 24, scope: !688)
!704 = !DILocation(line: 92, column: 61, scope: !688)
!705 = !DILocation(line: 92, column: 16, scope: !688)
!706 = !DILocation(line: 92, column: 14, scope: !688)
!707 = !DILocation(line: 93, column: 71, scope: !688)
!708 = !DILocation(line: 93, column: 3, scope: !688)
!709 = !DILocation(line: 93, column: 59, scope: !688)
!710 = !DILocation(line: 93, column: 15, scope: !688)
!711 = !DILocation(line: 93, column: 13, scope: !688)
!712 = !DILocation(line: 94, column: 69, scope: !688)
!713 = !DILocation(line: 94, column: 3, scope: !688)
!714 = !DILocation(line: 94, column: 57, scope: !688)
!715 = !DILocation(line: 94, column: 14, scope: !688)
!716 = !DILocation(line: 94, column: 12, scope: !688)
!717 = !DILocation(line: 95, column: 79, scope: !688)
!718 = !DILocation(line: 95, column: 3, scope: !688)
!719 = !DILocation(line: 95, column: 67, scope: !688)
!720 = !DILocation(line: 95, column: 19, scope: !688)
!721 = !DILocation(line: 95, column: 17, scope: !688)
!722 = !DILocation(line: 96, column: 79, scope: !688)
!723 = !DILocation(line: 96, column: 3, scope: !688)
!724 = !DILocation(line: 96, column: 67, scope: !688)
!725 = !DILocation(line: 96, column: 19, scope: !688)
!726 = !DILocation(line: 96, column: 17, scope: !688)
!727 = distinct !DISubprogram(name: "main.Write..1main.Graph", linkageName: "main.Graph.Write", scope: null, file: !7, line: 57, type: !728, isLocal: false, isDefinition: true, scopeLine: 57, isOptimized: false, unit: !1, retainedNodes: !3)
!728 = !DISubroutineType(types: !729)
!729 = !{!335, !403, !403, !730}
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !7, line: 4, size: 128, align: 8, elements: !731)
!731 = !{!732, !347}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 4, baseType: !733, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !29, size: 128, align: 8, elements: !735)
!735 = !{!465, !736}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !29, line: 4, baseType: !737, size: 64, align: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!740, !212, !123}
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !29, size: 192, align: 8, elements: !741)
!741 = !{!742, !743}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !29, line: 4, baseType: !26, size: 64, align: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !29, line: 4, baseType: !335, size: 128, align: 64, offset: 64)
!744 = !DILocalVariable(name: "g", arg: 1, scope: !727, file: !7, line: 57, type: !403)
!745 = !DILocation(line: 57, column: 1, scope: !727)
!746 = !DILocalVariable(name: "w", arg: 2, scope: !727, file: !7, line: 57, type: !730)
!747 = !DILocation(line: 57, column: 23, scope: !727)
!748 = !DILocalVariable(name: "$ret1", scope: !727, file: !7, line: 57, type: !335)
!749 = !DILocation(line: 57, column: 36, scope: !727)
!750 = !DILocation(line: 58, column: 3, scope: !727)
!751 = !DILocation(line: 61, column: 1, scope: !727)
!752 = !DILocation(line: 58, column: 6, scope: !727)
!753 = !DILocation(line: 59, column: 9, scope: !727)
!754 = !DILocation(line: 59, column: 2, scope: !727)
!755 = !DILocation(line: 60, column: 10, scope: !727)
!756 = !DILocation(line: 60, column: 27, scope: !727)
!757 = !DILocation(line: 60, column: 15, scope: !727)
!758 = !DILocation(line: 60, column: 2, scope: !727)
!759 = distinct !DISubprogram(name: "main.setTmpl..1main.Graph", linkageName: "main.Graph.setTmpl", scope: null, file: !7, line: 53, type: !760, isLocal: false, isDefinition: true, scopeLine: 53, isOptimized: false, unit: !1, retainedNodes: !3)
!760 = !DISubroutineType(types: !761)
!761 = !{!76, !403, !403, !19}
!762 = !DILocalVariable(name: "g", arg: 1, scope: !759, file: !7, line: 53, type: !403)
!763 = !DILocation(line: 53, column: 1, scope: !759)
!764 = !DILocalVariable(name: "tmplStr", arg: 2, scope: !759, file: !7, line: 53, type: !19)
!765 = !DILocation(line: 53, column: 25, scope: !759)
!766 = !DILocation(line: 54, column: 34, scope: !759)
!767 = !DILocation(line: 54, column: 44, scope: !759)
!768 = !DILocation(line: 54, column: 20, scope: !759)
!769 = !DILocation(line: 54, column: 3, scope: !759)
!770 = !DILocation(line: 54, column: 9, scope: !759)
!771 = distinct !DISubprogram(name: "main.NewGraph", linkageName: "main.NewGraph", scope: null, file: !7, line: 30, type: !772, isLocal: false, isDefinition: true, scopeLine: 30, isOptimized: false, unit: !1, retainedNodes: !3)
!772 = !DISubroutineType(types: !773)
!773 = !{!404, !19, !19}
!774 = !DILocalVariable(name: "title", arg: 1, scope: !771, file: !7, line: 30, type: !19)
!775 = !DILocation(line: 30, column: 15, scope: !771)
!776 = !DILocalVariable(name: "tmpl", arg: 2, scope: !771, file: !7, line: 30, type: !19)
!777 = !DILocation(line: 30, column: 22, scope: !771)
!778 = !DILocation(line: 33, column: 17, scope: !779)
!779 = distinct !DILexicalBlock(scope: !771, file: !7, line: 30, column: 1)
!780 = !DILocation(line: 34, column: 17, scope: !779)
!781 = !DILocation(line: 35, column: 17, scope: !779)
!782 = !DILocation(line: 36, column: 17, scope: !779)
!783 = !DILocation(line: 37, column: 17, scope: !779)
!784 = !DILocation(line: 38, column: 17, scope: !779)
!785 = !DILocation(line: 39, column: 17, scope: !779)
!786 = !DILocation(line: 40, column: 17, scope: !779)
!787 = !DILocation(line: 41, column: 17, scope: !779)
!788 = !DILocation(line: 42, column: 17, scope: !779)
!789 = !DILocation(line: 43, column: 17, scope: !779)
!790 = !DILocation(line: 44, column: 17, scope: !779)
!791 = !DILocation(line: 45, column: 17, scope: !779)
!792 = !DILocation(line: 46, column: 17, scope: !779)
!793 = !DILocation(line: 31, column: 7, scope: !779)
!794 = !DILocalVariable(name: "g", scope: !779, file: !7, line: 31, type: !404)
!795 = !DILocation(line: 31, column: 2, scope: !771)
!796 = !DILocation(line: 48, column: 3, scope: !779)
!797 = !DILocation(line: 50, column: 2, scope: !779)
!798 = distinct !DISubprogram(name: "main.main..thunk0", scope: null, file: !7, line: 59, type: !799, isLocal: true, isDefinition: true, scopeLine: 59, isOptimized: false, unit: !1, retainedNodes: !3)
!799 = !DISubroutineType(types: !800)
!800 = !{!37, !801}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*RWMutex}", file: !29, size: 64, align: 8, elements: !803)
!803 = !{!804}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !29, line: 59, baseType: !805, size: 64, align: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!806 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !798, file: !7, line: 59, type: !801)
!807 = !DILocation(line: 59, column: 2, scope: !798)
!808 = !DILocalVariable(name: "$ret13", scope: !798, file: !7, line: 59, type: !37)
!809 = distinct !DISubprogram(name: "main.main..thunk1", scope: null, file: !7, line: 65, type: !799, isLocal: true, isDefinition: true, scopeLine: 65, isOptimized: false, unit: !1, retainedNodes: !3)
!810 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !809, file: !7, line: 65, type: !801)
!811 = !DILocation(line: 65, column: 2, scope: !809)
!812 = !DILocalVariable(name: "$ret14", scope: !809, file: !7, line: 65, type: !37)
!813 = distinct !DISubprogram(name: "main.main..thunk2", scope: null, file: !7, line: 85, type: !799, isLocal: true, isDefinition: true, scopeLine: 85, isOptimized: false, unit: !1, retainedNodes: !3)
!814 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !813, file: !7, line: 85, type: !801)
!815 = !DILocation(line: 85, column: 2, scope: !813)
!816 = !DILocalVariable(name: "$ret15", scope: !813, file: !7, line: 85, type: !37)
!817 = distinct !DISubprogram(name: "main.main.HttpServer..hash", linkageName: "main.main.HttpServer..hash", scope: null, file: !20, line: 1, type: !297, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!818 = !DILocalVariable(name: "key", arg: 1, scope: !817, file: !20, line: 1, type: !212)
!819 = !DILocation(line: 1, column: 1, scope: !817)
!820 = !DILocalVariable(name: "seed", arg: 2, scope: !817, file: !20, line: 1, type: !100)
!821 = !DILocalVariable(name: "$ret27", scope: !817, file: !20, line: 1, type: !100)
!822 = distinct !DISubprogram(name: "main.main.HttpServer..eq", linkageName: "main.main.HttpServer..eq", scope: null, file: !20, line: 1, type: !305, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!823 = !DILocalVariable(name: "key1", arg: 1, scope: !822, file: !20, line: 1, type: !212)
!824 = !DILocation(line: 1, column: 1, scope: !822)
!825 = !DILocalVariable(name: "key2", arg: 2, scope: !822, file: !20, line: 1, type: !212)
!826 = !DILocalVariable(name: "$ret28", scope: !822, file: !20, line: 1, type: !37)
!827 = distinct !DISubprogram(name: "main.Close..1main.HttpServer", linkageName: "main.HttpServer.Close", scope: null, file: !70, line: 56, type: !828, isLocal: false, isDefinition: true, scopeLine: 56, isOptimized: false, unit: !1, retainedNodes: !3)
!828 = !DISubroutineType(types: !829)
!829 = !{!76, !830, !830}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "HttpServer", file: !70, line: 13, size: 512, align: 8, elements: !832)
!832 = !{!833, !834, !891, !892, !893}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "graph", file: !70, line: 14, baseType: !403, size: 64, align: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "listener", file: !70, line: 15, baseType: !835, size: 128, align: 64, offset: 64)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "Listener", file: !70, line: 7, size: 128, align: 8, elements: !836)
!836 = !{!837, !871}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !70, line: 7, baseType: !838, size: 64, align: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Conn,error},*func(*void)Addr,*func(*void)error}", file: !29, size: 256, align: 8, elements: !840)
!840 = !{!841, !842, !889, !890}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !29, line: 7, baseType: !282, size: 64, align: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "Accept", file: !29, line: 7, baseType: !843, size: 64, align: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!846, !212}
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Conn,error}", file: !29, size: 256, align: 8, elements: !847)
!847 = !{!848, !888}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !29, line: 7, baseType: !849, size: 128, align: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !70, line: 7, size: 128, align: 8, elements: !850)
!850 = !{!851, !871}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !70, line: 7, baseType: !852, size: 64, align: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)Addr,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void)Addr,*func(*void,Time)error,*func(*void,Time)error,*func(*void,Time)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !29, size: 576, align: 8, elements: !854)
!854 = !{!841, !855, !859, !872, !880, !881, !885, !886, !887}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !29, line: 7, baseType: !856, size: 64, align: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!335, !212}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "LocalAddr", file: !29, line: 7, baseType: !860, size: 64, align: 64, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!863, !212}
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "Addr", file: !70, line: 7, size: 128, align: 8, elements: !864)
!864 = !{!865, !871}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !70, line: 7, baseType: !866, size: 64, align: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)string}", file: !29, size: 192, align: 8, elements: !868)
!868 = !{!841, !869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "Network", file: !29, line: 7, baseType: !343, size: 64, align: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !29, line: 7, baseType: !343, size: 64, align: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !70, line: 1, baseType: !212, size: 64, align: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !29, line: 7, baseType: !873, size: 64, align: 64, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!876, !212, !123}
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !29, size: 192, align: 8, elements: !877)
!877 = !{!878, !879}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !29, line: 7, baseType: !26, size: 64, align: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !29, line: 7, baseType: !335, size: 128, align: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !29, line: 7, baseType: !860, size: 64, align: 64, offset: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "SetDeadline", file: !29, line: 7, baseType: !882, size: 64, align: 64, offset: 320)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!335, !212, !8}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "SetReadDeadline", file: !29, line: 7, baseType: !882, size: 64, align: 64, offset: 384)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "SetWriteDeadline", file: !29, line: 7, baseType: !882, size: 64, align: 64, offset: 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !29, line: 7, baseType: !873, size: 64, align: 64, offset: 512)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !29, line: 7, baseType: !335, size: 128, align: 64, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", file: !29, line: 7, baseType: !860, size: 64, align: 64, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !29, line: 7, baseType: !856, size: 64, align: 64, offset: 192)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "iface", file: !70, line: 16, baseType: !19, size: 128, align: 64, offset: 192)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "port", file: !70, line: 17, baseType: !19, size: 128, align: 64, offset: 320)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "listenerMtx", file: !70, line: 19, baseType: !199, size: 64, align: 32, offset: 448)
!894 = !DILocalVariable(name: "h", arg: 1, scope: !827, file: !70, line: 56, type: !830)
!895 = !DILocation(line: 56, column: 1, scope: !827)
!896 = !DILocation(line: 57, column: 3, scope: !827)
!897 = !DILocation(line: 57, column: 14, scope: !827)
!898 = distinct !DISubprogram(name: "main.Listener..1main.HttpServer", linkageName: "main.HttpServer.Listener", scope: null, file: !70, line: 64, type: !899, isLocal: false, isDefinition: true, scopeLine: 64, isOptimized: false, unit: !1, retainedNodes: !3)
!899 = !DISubroutineType(types: !900)
!900 = !{!835, !830, !830}
!901 = !DILocalVariable(name: "h", arg: 1, scope: !898, file: !70, line: 64, type: !830)
!902 = !DILocation(line: 64, column: 1, scope: !898)
!903 = !DILocalVariable(name: "$ret4", scope: !898, file: !70, line: 64, type: !835)
!904 = !DILocation(line: 64, column: 33, scope: !898)
!905 = !DILocation(line: 65, column: 3, scope: !906)
!906 = distinct !DILexicalBlock(scope: !898, file: !70, line: 64, column: 1)
!907 = !DILocation(line: 80, column: 1, scope: !898)
!908 = !DILocation(line: 65, column: 15, scope: !906)
!909 = !DILocation(line: 66, column: 9, scope: !906)
!910 = !DILocation(line: 66, column: 2, scope: !906)
!911 = !DILocation(line: 68, column: 6, scope: !906)
!912 = !DILocation(line: 68, column: 16, scope: !906)
!913 = !DILocation(line: 69, column: 3, scope: !906)
!914 = !DILocation(line: 72, column: 40, scope: !906)
!915 = !DILocation(line: 72, column: 49, scope: !906)
!916 = !DILocation(line: 72, column: 22, scope: !906)
!917 = !DILocalVariable(name: "ifaceAndPort", scope: !906, file: !70, line: 72, type: !19)
!918 = !DILocation(line: 72, column: 2, scope: !898)
!919 = !DILocation(line: 73, column: 23, scope: !906)
!920 = !DILocalVariable(name: "err", scope: !906, file: !70, line: 73, type: !335)
!921 = !DILocation(line: 73, column: 2, scope: !898)
!922 = !DILocation(line: 74, column: 9, scope: !906)
!923 = !DILocation(line: 75, column: 13, scope: !906)
!924 = !DILocation(line: 75, column: 7, scope: !906)
!925 = !DILocation(line: 78, column: 13, scope: !906)
!926 = !DILocation(line: 79, column: 2, scope: !906)
!927 = !DILocation(line: 69, column: 3, scope: !898)
!928 = distinct !DISubprogram(name: "main.Start..1main.HttpServer", linkageName: "main.HttpServer.Start", scope: null, file: !70, line: 32, type: !828, isLocal: false, isDefinition: true, scopeLine: 32, isOptimized: false, unit: !1, retainedNodes: !3)
!929 = !DILocalVariable(name: "param", arg: 1, scope: !928, file: !70, line: 32, type: !830)
!930 = !DILocation(line: 32, column: 1, scope: !928)
!931 = !DILocalVariable(name: "h", scope: !928, file: !70, line: 32, type: !932)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!933 = !DILocation(line: 33, column: 19, scope: !934)
!934 = distinct !DILexicalBlock(scope: !928, file: !70, line: 32, column: 1)
!935 = !DILocalVariable(name: "serveMux", scope: !934, file: !70, line: 33, type: !936)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServeMux", file: !70, line: 8, size: 320, align: 8, elements: !938)
!938 = !{!939, !940, !941}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !70, line: 8, baseType: !542, size: 192, align: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !70, line: 8, baseType: !489, size: 64, align: 64, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "hosts", file: !70, line: 8, baseType: !37, size: 8, align: 8, offset: 256)
!942 = !DILocation(line: 33, column: 2, scope: !928)
!943 = !DILocation(line: 35, column: 27, scope: !934)
!944 = !DILocation(line: 35, column: 10, scope: !934)
!945 = !DILocation(line: 39, column: 37, scope: !934)
!946 = !DILocation(line: 39, column: 10, scope: !934)
!947 = !DILocation(line: 47, column: 2, scope: !934)
!948 = !DILocalVariable(name: "server", scope: !934, file: !70, line: 47, type: !949)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "Server", file: !70, line: 8, size: 1600, align: 8, elements: !951)
!951 = !{!952, !953, !1251, !1427, !1429, !1430, !1431, !1432, !1433, !1434, !1443, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", file: !70, line: 8, baseType: !19, size: 128, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "Handler", file: !70, line: 8, baseType: !954, size: 128, align: 64, offset: 128)
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "Handler", file: !70, line: 8, size: 128, align: 8, elements: !955)
!955 = !{!956, !871}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !70, line: 8, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,ResponseWriter,*Request)void}", file: !29, size: 128, align: 8, elements: !959)
!959 = !{!960, !961}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !29, line: 8, baseType: !282, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ServeHTTP", file: !29, line: 8, baseType: !962, size: 64, align: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!76, !212, !965, !987}
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "ResponseWriter", file: !70, line: 8, size: 128, align: 8, elements: !966)
!966 = !{!967, !871}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !70, line: 8, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Header,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,int)void}", file: !29, size: 256, align: 8, elements: !970)
!970 = !{!960, !971, !975, !983}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !29, line: 8, baseType: !972, size: 64, align: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!489, !212}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !29, line: 8, baseType: !976, size: 64, align: 64, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!979, !212, !123}
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !29, size: 192, align: 8, elements: !980)
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !29, line: 8, baseType: !26, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !29, line: 8, baseType: !335, size: 128, align: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "WriteHeader", file: !29, line: 8, baseType: !984, size: 64, align: 64, offset: 192)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!76, !212, !26}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !70, line: 8, size: 1984, align: 8, elements: !989)
!989 = !{!990, !991, !1010, !1011, !1012, !1013, !1014, !1030, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1054, !1055, !1056, !1057, !1213, !1214, !1227}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !70, line: 8, baseType: !19, size: 128, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !70, line: 8, baseType: !992, size: 64, align: 64, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !70, line: 8, size: 1024, align: 8, elements: !994)
!994 = !{!995, !996, !997, !1004, !1005, !1006, !1007, !1008, !1009}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !70, line: 8, baseType: !19, size: 128, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !70, line: 8, baseType: !19, size: 128, align: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !70, line: 8, baseType: !998, size: 64, align: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !70, line: 8, size: 320, align: 8, elements: !1000)
!1000 = !{!1001, !1002, !1003}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !70, line: 8, baseType: !19, size: 128, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !70, line: 8, baseType: !19, size: 128, align: 64, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !70, line: 8, baseType: !37, size: 8, align: 8, offset: 256)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !70, line: 8, baseType: !19, size: 128, align: 64, offset: 320)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !70, line: 8, baseType: !19, size: 128, align: 64, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !70, line: 8, baseType: !19, size: 128, align: 64, offset: 576)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !70, line: 8, baseType: !37, size: 8, align: 8, offset: 704)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !70, line: 8, baseType: !19, size: 128, align: 64, offset: 768)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !70, line: 8, baseType: !19, size: 128, align: 64, offset: 896)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "Proto", file: !70, line: 8, baseType: !19, size: 128, align: 64, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMajor", file: !70, line: 8, baseType: !26, size: 64, align: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMinor", file: !70, line: 8, baseType: !26, size: 64, align: 64, offset: 384)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !70, line: 8, baseType: !489, size: 64, align: 64, offset: 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !70, line: 8, baseType: !1015, size: 128, align: 64, offset: 512)
!1015 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !7, line: 5, size: 128, align: 8, elements: !1016)
!1016 = !{!1017, !347}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 5, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !29, size: 192, align: 8, elements: !1020)
!1020 = !{!281, !1021, !1022}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !29, line: 5, baseType: !856, size: 64, align: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !29, line: 5, baseType: !1023, size: 64, align: 64, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!1026, !212, !123}
!1026 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !29, size: 192, align: 8, elements: !1027)
!1027 = !{!1028, !1029}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !29, line: 5, baseType: !26, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !29, line: 5, baseType: !335, size: 128, align: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !70, line: 8, baseType: !1031, size: 64, align: 64, offset: 640)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !70, line: 8, size: 64, align: 8, elements: !1033)
!1033 = !{!1034}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !70, line: 8, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!1038}
!1038 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !29, size: 256, align: 8, elements: !1039)
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !29, line: 8, baseType: !1015, size: 128, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !29, line: 8, baseType: !335, size: 128, align: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !70, line: 8, baseType: !13, size: 64, align: 64, offset: 704)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !70, line: 8, baseType: !135, size: 192, align: 64, offset: 768)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !70, line: 8, baseType: !37, size: 8, align: 8, offset: 960)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !70, line: 8, baseType: !19, size: 128, align: 64, offset: 1024)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "Form", file: !70, line: 8, baseType: !489, size: 64, align: 64, offset: 1152)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "PostForm", file: !70, line: 8, baseType: !489, size: 64, align: 64, offset: 1216)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "MultipartForm", file: !70, line: 8, baseType: !1049, size: 64, align: 64, offset: 1280)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", file: !70, line: 8, size: 128, align: 8, elements: !1051)
!1051 = !{!1052, !1053}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !70, line: 8, baseType: !489, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !70, line: 8, baseType: !489, size: 64, align: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !70, line: 8, baseType: !489, size: 64, align: 64, offset: 1344)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !70, line: 8, baseType: !19, size: 128, align: 64, offset: 1408)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "RequestURI", file: !70, line: 8, baseType: !19, size: 128, align: 64, offset: 1536)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !70, line: 8, baseType: !1058, size: 64, align: 64, offset: 1664)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionState", file: !70, line: 8, size: 1344, align: 8, elements: !1060)
!1060 = !{!1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1201, !1206, !1211, !1212}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !70, line: 8, baseType: !496, size: 16, align: 16)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "HandshakeComplete", file: !70, line: 8, baseType: !37, size: 8, align: 8, offset: 16)
