; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22animate\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22matcha\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22gomatcha.io/matcha\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22gomatcha.io/matcha\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22comm\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22gomatcha.io/matcha/comm\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22gomatcha.io/matcha/comm\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22internal\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22gomatcha.io/matcha/internal\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22gomatcha.io/matcha/internal\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22color\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22image/color\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./animation.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha/animate")
!3 = !{}
!4 = !{!5, !9, !84, !96, !98, !100, !116, !118, !120}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "gomatcha_io_matcha.MainLocker", linkageName: "gomatcha_io_matcha.MainLocker", scope: !1, file: !11, line: 7, type: !12, isLocal: false, isDefinition: true)
!11 = !DIFile(filename: "animation.go", directory: ".")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "Locker", file: !11, line: 7, size: 128, align: 8, elements: !13)
!13 = !{!14, !83}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 7, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void}", file: !17, size: 192, align: 8, elements: !18)
!17 = !DIFile(filename: "", directory: "")
!18 = !{!19, !78, !82}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 7, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !22)
!22 = !{!23, !25, !26, !27, !29, !30, !31, !41, !50, !52, !59, !77}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !24, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 160)
!28 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 168)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 176)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !32, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !34)
!34 = !{!35}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!24, !39, !24}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIBasicType(name: "void")
!41 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !42, size: 64, align: 64, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !44)
!44 = !{!45}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !39, !39}
!49 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !51, size: 64, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !53, size: 64, align: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !55)
!55 = !{!56, !57}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !51, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !60, size: 64, align: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !62)
!62 = !{!63, !64, !65}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !53, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !53, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !66, size: 192, align: 64, offset: 128)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !17, size: 192, align: 8, elements: !67)
!67 = !{!68, !75, !76}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !71)
!71 = !{!63, !64, !72, !73, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !17, line: 1, baseType: !58, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !17, line: 1, baseType: !58, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", file: !17, line: 7, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!40, !39}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Unlock", file: !17, line: 7, baseType: !79, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !11, line: 1, baseType: !39, size: 64, align: 64, offset: 64)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "command_line_arguments.easeIn", linkageName: "command_line_arguments.easeIn", scope: !1, file: !86, line: 11, type: !87, isLocal: true, isDefinition: true)
!86 = !DIFile(filename: "cubicBezier.go", directory: ".")
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !86, line: 31, size: 64, align: 8, elements: !89)
!89 = !{!90}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !86, line: 31, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !95, !95, !95}
!94 = !DIBasicType(name: "float32", size: 32, encoding: DW_ATE_float)
!95 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "command_line_arguments.easeOut", linkageName: "command_line_arguments.easeOut", scope: !1, file: !86, line: 12, type: !87, isLocal: true, isDefinition: true)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "command_line_arguments.easeInOut", linkageName: "command_line_arguments.easeInOut", scope: !1, file: !86, line: 13, type: !87, isLocal: true, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "command_line_arguments.DefaultEase", linkageName: "command_line_arguments.DefaultEase", scope: !1, file: !102, line: 40, type: !103, isLocal: false, isDefinition: true)
!102 = !DIFile(filename: "float.go", directory: ".")
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "FloatInterpolater", file: !102, line: 10, size: 128, align: 8, elements: !104)
!104 = !{!105, !115}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !102, line: 10, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,float64)float64}", file: !17, size: 128, align: 8, elements: !108)
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 10, baseType: !20, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolate", file: !17, line: 10, baseType: !111, size: 64, align: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!114, !39, !114}
!114 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !102, line: 1, baseType: !39, size: 64, align: 64, offset: 64)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "command_line_arguments.DefaultInEase", linkageName: "command_line_arguments.DefaultInEase", scope: !1, file: !102, line: 41, type: !103, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "command_line_arguments.DefaultOutEase", linkageName: "command_line_arguments.DefaultOutEase", scope: !1, file: !102, line: 42, type: !103, isLocal: false, isDefinition: true)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "command_line_arguments.DefaultInOutEase", linkageName: "command_line_arguments.DefaultInOutEase", scope: !1, file: !102, line: 43, type: !103, isLocal: false, isDefinition: true)
!122 = distinct !DISubprogram(name: "animate.Animation..1command_line_arguments.Value", linkageName: "command_line_arguments.Value.Animation", scope: null, file: !11, line: 78, type: !123, isLocal: false, isDefinition: true, scopeLine: 78, isOptimized: false, unit: !1, retainedNodes: !3)
!123 = !DISubroutineType(types: !124)
!124 = !{!125, !141, !141}
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "Animation", file: !11, line: 86, size: 128, align: 8, elements: !126)
!126 = !{!127, !83}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 86, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Duration,*func(*void,Duration)float64}", file: !17, size: 192, align: 8, elements: !130)
!130 = !{!131, !132, !137}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 86, baseType: !20, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Duration", file: !17, line: 86, baseType: !133, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !39}
!136 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Tick", file: !17, line: 86, baseType: !138, size: 64, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!114, !39, !136}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !11, line: 13, size: 384, align: 8, elements: !143)
!143 = !{!144, !145, !170}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !11, line: 14, baseType: !114, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "relay", file: !11, line: 15, baseType: !146, size: 256, align: 64, offset: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "Relay", file: !11, line: 8, size: 256, align: 8, elements: !147)
!147 = !{!148, !153, !167, !168}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !11, line: 8, baseType: !149, size: 64, align: 32)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !11, line: 8, size: 64, align: 8, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !11, line: 8, baseType: !95, size: 32, align: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !11, line: 8, baseType: !8, size: 32, align: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "subs", file: !11, line: 8, baseType: !154, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !156)
!156 = !{!157, !158, !159, !160, !162, !163, !164, !165, !166}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !58, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 72)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !161, size: 16, align: 16, offset: 80)
!161 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !24, size: 64, align: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", file: !11, line: 8, baseType: !154, size: 64, align: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "maxId", file: !11, line: 8, baseType: !169, size: 64, align: 64, offset: 192)
!169 = !DIBasicType(name: "Id", size: 64, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "animation", file: !11, line: 16, baseType: !171, size: 64, align: 64, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.animation", file: !11, line: 91, size: 384, align: 8, elements: !173)
!173 = !{!174, !175, !176, !190, !191}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "cancelled", file: !11, line: 92, baseType: !49, size: 8, align: 8)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "animation", file: !11, line: 93, baseType: !125, size: 128, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ticker", file: !11, line: 94, baseType: !177, size: 64, align: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ticker", file: !11, line: 9, size: 192, align: 8, elements: !179)
!179 = !{!180, !181, !182}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !11, line: 9, baseType: !58, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !11, line: 9, baseType: !149, size: 64, align: 32, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !11, line: 9, baseType: !183, size: 64, align: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !11, line: 9, size: 64, align: 8, elements: !185)
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !11, line: 9, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!40}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "onComplete", file: !11, line: 95, baseType: !183, size: 64, align: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !11, line: 96, baseType: !39, size: 64, align: 64, offset: 320)
!192 = !DILocalVariable(name: "v", arg: 1, scope: !122, file: !11, line: 78, type: !141)
!193 = !DILocation(line: 78, column: 1, scope: !122)
!194 = !DILocation(line: 79, column: 6, scope: !122)
!195 = !DILocation(line: 79, column: 17, scope: !122)
!196 = !DILocalVariable(name: "$ret2", scope: !122, file: !11, line: 78, type: !125)
!197 = !DILocation(line: 78, column: 29, scope: !122)
!198 = !DILocation(line: 80, column: 3, scope: !122)
!199 = !DILocation(line: 82, column: 2, scope: !122)
!200 = distinct !DISubprogram(name: "animate.Notify..1command_line_arguments.Value", linkageName: "command_line_arguments.Value.Notify", scope: null, file: !11, line: 20, type: !201, isLocal: false, isDefinition: true, scopeLine: 20, isOptimized: false, unit: !1, retainedNodes: !3)
!201 = !DISubroutineType(types: !202)
!202 = !{!169, !141, !141, !183}
!203 = !DILocalVariable(name: "v", arg: 1, scope: !200, file: !11, line: 20, type: !141)
!204 = !DILocation(line: 20, column: 1, scope: !200)
!205 = !DILocalVariable(name: "f", arg: 2, scope: !200, file: !11, line: 20, type: !183)
!206 = !DILocation(line: 20, column: 24, scope: !200)
!207 = !DILocalVariable(name: "$ret0", scope: !200, file: !11, line: 20, type: !169)
!208 = !DILocation(line: 20, column: 34, scope: !200)
!209 = !DILocation(line: 21, column: 10, scope: !200)
!210 = !DILocation(line: 21, column: 16, scope: !200)
!211 = !DILocation(line: 21, column: 2, scope: !200)
!212 = distinct !DISubprogram(name: "animate.Run..1command_line_arguments.Value", linkageName: "command_line_arguments.Value.Run", scope: null, file: !11, line: 50, type: !213, isLocal: false, isDefinition: true, scopeLine: 50, isOptimized: false, unit: !1, retainedNodes: !3)
!213 = !DISubroutineType(types: !214)
!214 = !{!183, !141, !141, !125}
!215 = !DILocalVariable(name: "param", arg: 1, scope: !212, file: !11, line: 50, type: !141)
!216 = !DILocation(line: 50, column: 1, scope: !212)
!217 = !DILocalVariable(name: "param", arg: 2, scope: !212, file: !11, line: 50, type: !125)
!218 = !DILocation(line: 50, column: 21, scope: !212)
!219 = !DILocalVariable(name: "v", scope: !212, file: !11, line: 50, type: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!221 = !DILocalVariable(name: "a", scope: !212, file: !11, line: 50, type: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!223 = !DILocalVariable(name: "cancelFunc", scope: !212, file: !11, line: 50, type: !183)
!224 = !DILocation(line: 50, column: 35, scope: !212)
!225 = !DILocation(line: 51, column: 5, scope: !226)
!226 = distinct !DILexicalBlock(scope: !212, file: !11, line: 50, column: 1)
!227 = !DILocation(line: 51, column: 6, scope: !226)
!228 = !DILocation(line: 51, column: 17, scope: !226)
!229 = !DILocation(line: 55, column: 2, scope: !226)
!230 = !DILocation(line: 55, column: 16, scope: !226)
!231 = !DILocation(line: 52, column: 14, scope: !226)
!232 = !DILocalVariable(name: "start", scope: !226, file: !11, line: 55, type: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !11, line: 5, size: 192, align: 8, elements: !235)
!235 = !{!236, !238, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !11, line: 5, baseType: !237, size: 64, align: 64)
!237 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !11, line: 5, baseType: !239, size: 64, align: 64, offset: 64)
!239 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !11, line: 5, baseType: !241, size: 64, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !11, line: 5, size: 704, align: 8, elements: !243)
!243 = !{!244, !245, !254, !265, !266, !267}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !11, line: 5, baseType: !54, size: 128, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !11, line: 5, baseType: !246, size: 192, align: 64, offset: 128)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !17, size: 192, align: 8, elements: !247)
!247 = !{!248, !75, !76}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !11, line: 5, size: 256, align: 8, elements: !251)
!251 = !{!244, !252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !11, line: 5, baseType: !58, size: 64, align: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !11, line: 5, baseType: !255, size: 192, align: 64, offset: 320)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !17, size: 192, align: 8, elements: !256)
!256 = !{!257, !75, !76}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !11, line: 5, size: 128, align: 8, elements: !260)
!260 = !{!261, !262, !263, !264}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !11, line: 5, baseType: !239, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !11, line: 5, baseType: !28, size: 8, align: 8, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 72)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 80)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !11, line: 5, baseType: !239, size: 64, align: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !11, line: 5, baseType: !239, size: 64, align: 64, offset: 576)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !11, line: 5, baseType: !249, size: 64, align: 64, offset: 640)
!268 = !DILocation(line: 55, column: 2, scope: !212)
!269 = !DILocation(line: 56, column: 2, scope: !226)
!270 = !DILocalVariable(name: "an", scope: !226, file: !11, line: 56, type: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!272 = !DILocation(line: 56, column: 2, scope: !212)
!273 = !DILocation(line: 56, column: 8, scope: !226)
!274 = !DILocation(line: 56, column: 40, scope: !226)
!275 = !DILocation(line: 56, column: 9, scope: !226)
!276 = !DILocation(line: 57, column: 33, scope: !226)
!277 = !DILocation(line: 57, column: 23, scope: !226)
!278 = !DILocation(line: 57, column: 2, scope: !226)
!279 = !DILocation(line: 57, column: 4, scope: !226)
!280 = !DILocation(line: 57, column: 12, scope: !226)
!281 = !DILocation(line: 70, column: 2, scope: !226)
!282 = !DILocation(line: 70, column: 3, scope: !226)
!283 = !DILocation(line: 70, column: 16, scope: !226)
!284 = !DILocation(line: 70, column: 14, scope: !226)
!285 = !DILocation(line: 72, column: 9, scope: !226)
!286 = !DILocation(line: 72, column: 2, scope: !226)
!287 = distinct !DISubprogram(name: "animate.SetValue..1command_line_arguments.Value", linkageName: "command_line_arguments.Value.SetValue", scope: null, file: !11, line: 35, type: !288, isLocal: false, isDefinition: true, scopeLine: 35, isOptimized: false, unit: !1, retainedNodes: !3)
!288 = !DISubroutineType(types: !289)
!289 = !{!40, !141, !141, !114}
!290 = !DILocalVariable(name: "v", arg: 1, scope: !287, file: !11, line: 35, type: !141)
!291 = !DILocation(line: 35, column: 1, scope: !287)
!292 = !DILocalVariable(name: "val", arg: 2, scope: !287, file: !11, line: 35, type: !114)
!293 = !DILocation(line: 35, column: 26, scope: !287)
!294 = !DILocation(line: 36, column: 3, scope: !287)
!295 = !DILocation(line: 37, column: 6, scope: !287)
!296 = !DILocation(line: 37, column: 17, scope: !287)
!297 = !DILocation(line: 38, column: 14, scope: !287)
!298 = distinct !DISubprogram(name: "animate.Unnotify..1command_line_arguments.Value", linkageName: "command_line_arguments.Value.Unnotify", scope: null, file: !11, line: 25, type: !299, isLocal: false, isDefinition: true, scopeLine: 25, isOptimized: false, unit: !1, retainedNodes: !3)
!299 = !DISubroutineType(types: !300)
!300 = !{!40, !141, !141, !169}
!301 = !DILocalVariable(name: "v", arg: 1, scope: !298, file: !11, line: 25, type: !141)
!302 = !DILocation(line: 25, column: 1, scope: !298)
!303 = !DILocalVariable(name: "id", arg: 2, scope: !298, file: !11, line: 25, type: !169)
!304 = !DILocation(line: 25, column: 26, scope: !298)
!305 = !DILocation(line: 26, column: 3, scope: !298)
!306 = !DILocation(line: 26, column: 9, scope: !298)
!307 = distinct !DISubprogram(name: "animate.Value..1command_line_arguments.Value", linkageName: "command_line_arguments.Value.Value", scope: null, file: !11, line: 30, type: !308, isLocal: false, isDefinition: true, scopeLine: 30, isOptimized: false, unit: !1, retainedNodes: !3)
!308 = !DISubroutineType(types: !309)
!309 = !{!114, !141, !141}
!310 = !DILocalVariable(name: "v", arg: 1, scope: !307, file: !11, line: 30, type: !141)
!311 = !DILocation(line: 30, column: 1, scope: !307)
!312 = !DILocalVariable(name: "$ret1", scope: !307, file: !11, line: 30, type: !114)
!313 = !DILocation(line: 30, column: 25, scope: !307)
!314 = !DILocation(line: 31, column: 10, scope: !307)
!315 = !DILocation(line: 31, column: 2, scope: !307)
!316 = distinct !DISubprogram(name: "animate.setValue..1command_line_arguments.Value", linkageName: "command_line_arguments.Value.setValue", scope: null, file: !11, line: 42, type: !288, isLocal: false, isDefinition: true, scopeLine: 42, isOptimized: false, unit: !1, retainedNodes: !3)
!317 = !DILocalVariable(name: "v", arg: 1, scope: !316, file: !11, line: 42, type: !141)
!318 = !DILocation(line: 42, column: 1, scope: !316)
!319 = !DILocalVariable(name: "val", arg: 2, scope: !316, file: !11, line: 42, type: !114)
!320 = !DILocation(line: 42, column: 26, scope: !316)
!321 = !DILocation(line: 43, column: 6, scope: !316)
!322 = !DILocation(line: 43, column: 13, scope: !316)
!323 = !DILocation(line: 44, column: 11, scope: !316)
!324 = !DILocation(line: 45, column: 4, scope: !316)
!325 = !DILocation(line: 45, column: 10, scope: !316)
!326 = distinct !DISubprogram(name: "animate.cancel..1command_line_arguments.animation", linkageName: "command_line_arguments.animation.cancel", scope: null, file: !11, line: 99, type: !327, isLocal: false, isDefinition: true, scopeLine: 99, isOptimized: false, unit: !1, retainedNodes: !3)
!327 = !DISubroutineType(types: !328)
!328 = !{!40, !171, !171}
!329 = !DILocalVariable(name: "a", arg: 1, scope: !326, file: !11, line: 99, type: !171)
!330 = !DILocation(line: 99, column: 1, scope: !326)
!331 = !DILocation(line: 100, column: 6, scope: !326)
!332 = !DILocation(line: 100, column: 2, scope: !326)
!333 = !DILocation(line: 101, column: 3, scope: !326)
!334 = !DILocation(line: 104, column: 3, scope: !326)
!335 = !DILocation(line: 104, column: 10, scope: !326)
!336 = !DILocation(line: 105, column: 3, scope: !326)
!337 = !DILocation(line: 105, column: 9, scope: !326)
!338 = !DILocation(line: 105, column: 20, scope: !326)
!339 = !DILocation(line: 106, column: 6, scope: !326)
!340 = !DILocation(line: 106, column: 18, scope: !326)
!341 = !DILocation(line: 107, column: 4, scope: !326)
!342 = !DILocation(line: 109, column: 14, scope: !326)
!343 = distinct !DISubprogram(name: "animate.func1", scope: null, file: !11, line: 57, type: !188, isLocal: true, isDefinition: true, scopeLine: 57, isOptimized: false, unit: !1, retainedNodes: !3)
!344 = !DILocation(line: 58, column: 20, scope: !345)
!345 = distinct !DILexicalBlock(scope: !343, file: !11, line: 57, column: 33)
!346 = !DILocation(line: 69, column: 2, scope: !343)
!347 = !DILocation(line: 59, column: 3, scope: !345)
!348 = !DILocation(line: 60, column: 6, scope: !345)
!349 = !DILocation(line: 60, column: 8, scope: !345)
!350 = !DILocation(line: 60, column: 3, scope: !345)
!351 = !DILocation(line: 64, column: 13, scope: !345)
!352 = !DILocation(line: 64, column: 23, scope: !345)
!353 = !DILocation(line: 64, column: 18, scope: !345)
!354 = !DILocalVariable(name: "d", scope: !345, file: !11, line: 64, type: !136)
!355 = !DILocation(line: 64, column: 3, scope: !343)
!356 = !DILocation(line: 65, column: 14, scope: !345)
!357 = !DILocation(line: 65, column: 15, scope: !345)
!358 = !DILocation(line: 65, column: 3, scope: !345)
!359 = !DILocation(line: 65, column: 4, scope: !345)
!360 = !DILocation(line: 66, column: 10, scope: !345)
!361 = !DILocation(line: 66, column: 11, scope: !345)
!362 = !DILocation(line: 66, column: 8, scope: !345)
!363 = !DILocation(line: 67, column: 4, scope: !345)
!364 = !DILocation(line: 67, column: 6, scope: !345)
!365 = !DILocation(line: 61, column: 4, scope: !343)
!366 = distinct !DISubprogram(name: "animate.func2", scope: null, file: !11, line: 72, type: !188, isLocal: true, isDefinition: true, scopeLine: 72, isOptimized: false, unit: !1, retainedNodes: !3)
!367 = !DILocation(line: 73, column: 3, scope: !366)
!368 = !DILocation(line: 73, column: 5, scope: !366)
!369 = distinct !DISubprogram(name: "animate.command_line_arguments..thunk0", scope: null, file: !11, line: 59, type: !370, isLocal: true, isDefinition: true, scopeLine: 59, isOptimized: false, unit: !1, retainedNodes: !3)
!370 = !DISubroutineType(types: !371)
!371 = !{!49, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Locker}", file: !17, size: 128, align: 8, elements: !374)
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "object", file: !17, line: 59, baseType: !12, size: 128, align: 64)
!376 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !369, file: !11, line: 59, type: !372)
!377 = !DILocation(line: 59, column: 3, scope: !369)
!378 = !DILocalVariable(name: "$ret29", scope: !369, file: !11, line: 59, type: !49)
!379 = distinct !DISubprogram(name: "animate.command_line_arguments.Basic..hash", linkageName: "command_line_arguments.command_line_arguments.Basic..hash", scope: null, file: !7, line: 1, type: !37, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!380 = !DILocalVariable(name: "key", arg: 1, scope: !379, file: !7, line: 1, type: !39)
!381 = !DILocation(line: 1, column: 1, scope: !379)
!382 = !DILocalVariable(name: "seed", arg: 2, scope: !379, file: !7, line: 1, type: !24)
!383 = !DILocalVariable(name: "$ret30", scope: !379, file: !7, line: 1, type: !24)
!384 = distinct !DISubprogram(name: "animate.command_line_arguments.Basic..eq", linkageName: "command_line_arguments.command_line_arguments.Basic..eq", scope: null, file: !7, line: 1, type: !47, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!385 = !DILocalVariable(name: "key1", arg: 1, scope: !384, file: !7, line: 1, type: !39)
!386 = !DILocation(line: 1, column: 1, scope: !384)
!387 = !DILocalVariable(name: "key2", arg: 2, scope: !384, file: !7, line: 1, type: !39)
!388 = !DILocalVariable(name: "$ret31", scope: !384, file: !7, line: 1, type: !49)
!389 = distinct !DISubprogram(name: "animate.Duration..1command_line_arguments.Basic", linkageName: "command_line_arguments.Basic.Duration", scope: null, file: !11, line: 121, type: !390, isLocal: false, isDefinition: true, scopeLine: 121, isOptimized: false, unit: !1, retainedNodes: !3)
!390 = !DISubroutineType(types: !391)
!391 = !{!136, !392, !392}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "Basic", file: !11, line: 113, size: 320, align: 8, elements: !394)
!394 = !{!395, !396, !397, !398}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Start", file: !11, line: 114, baseType: !114, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "End", file: !11, line: 115, baseType: !114, size: 64, align: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Ease", file: !11, line: 116, baseType: !103, size: 128, align: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Dur", file: !11, line: 117, baseType: !136, size: 64, align: 64, offset: 256)
!399 = !DILocalVariable(name: "a", arg: 1, scope: !389, file: !11, line: 121, type: !392)
!400 = !DILocation(line: 121, column: 1, scope: !389)
!401 = !DILocalVariable(name: "$ret3", scope: !389, file: !11, line: 121, type: !136)
!402 = !DILocation(line: 121, column: 28, scope: !389)
!403 = !DILocation(line: 122, column: 10, scope: !389)
!404 = !DILocation(line: 122, column: 2, scope: !389)
!405 = distinct !DISubprogram(name: "animate.Tick..1command_line_arguments.Basic", linkageName: "command_line_arguments.Basic.Tick", scope: null, file: !11, line: 126, type: !406, isLocal: false, isDefinition: true, scopeLine: 126, isOptimized: false, unit: !1, retainedNodes: !3)
!406 = !DISubroutineType(types: !407)
!407 = !{!114, !392, !392, !136}
!408 = !DILocalVariable(name: "a", arg: 1, scope: !405, file: !11, line: 126, type: !392)
!409 = !DILocation(line: 126, column: 1, scope: !405)
!410 = !DILocalVariable(name: "t", arg: 2, scope: !405, file: !11, line: 126, type: !136)
!411 = !DILocation(line: 126, column: 22, scope: !405)
!412 = !DILocalVariable(name: "$ret4", scope: !405, file: !11, line: 126, type: !114)
!413 = !DILocation(line: 126, column: 39, scope: !405)
!414 = !DILocation(line: 127, column: 6, scope: !415)
!415 = distinct !DILexicalBlock(scope: !405, file: !11, line: 126, column: 1)
!416 = !DILocation(line: 127, column: 11, scope: !415)
!417 = !DILocation(line: 128, column: 11, scope: !415)
!418 = !DILocation(line: 128, column: 3, scope: !415)
!419 = !DILocation(line: 130, column: 11, scope: !415)
!420 = !DILocation(line: 130, column: 24, scope: !415)
!421 = !DILocation(line: 130, column: 22, scope: !415)
!422 = !DILocalVariable(name: "ratio", scope: !415, file: !11, line: 130, type: !114)
!423 = !DILocation(line: 130, column: 2, scope: !405)
!424 = !DILocation(line: 131, column: 11, scope: !415)
!425 = !DILocation(line: 133, column: 18, scope: !415)
!426 = !DILocation(line: 136, column: 12, scope: !415)
!427 = !DILocation(line: 137, column: 17, scope: !415)
!428 = !DILocation(line: 0, scope: !415)
!429 = !DILocation(line: 139, column: 10, scope: !415)
!430 = !DILocation(line: 139, column: 27, scope: !415)
!431 = !DILocation(line: 139, column: 31, scope: !415)
!432 = !DILocation(line: 139, column: 24, scope: !415)
!433 = !DILocation(line: 139, column: 17, scope: !415)
!434 = !DILocation(line: 139, column: 2, scope: !415)
!435 = distinct !DISubprogram(name: "animate.ColorInterpolate", linkageName: "command_line_arguments.ColorInterpolate", scope: null, file: !436, line: 15, type: !437, isLocal: false, isDefinition: true, scopeLine: 15, isOptimized: false, unit: !1, retainedNodes: !3)
!436 = !DIFile(filename: "color.go", directory: ".")
!437 = !DISubroutineType(types: !438)
!438 = !{!439, !474, !484}
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorNotifier", file: !11, line: 8, size: 128, align: 8, elements: !440)
!440 = !{!441, !83}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 8, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*__go_descriptor)Id,*func(*void,Id)void,*func(*void)Color}", file: !17, size: 256, align: 8, elements: !444)
!444 = !{!445, !446, !450, !454}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 8, baseType: !20, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Notify", file: !17, line: 8, baseType: !447, size: 64, align: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!169, !39, !183}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "Unnotify", file: !17, line: 8, baseType: !451, size: 64, align: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!40, !39, !169}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !17, line: 8, baseType: !455, size: 64, align: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!458, !39}
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", file: !11, line: 8, size: 128, align: 8, elements: !459)
!459 = !{!460, !83}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 8, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{uint32,uint32,uint32,uint32}}", file: !17, size: 128, align: 8, elements: !463)
!463 = !{!445, !464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "RGBA", file: !17, line: 8, baseType: !465, size: 64, align: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!468, !39}
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{uint32,uint32,uint32,uint32}", file: !17, size: 128, align: 8, elements: !469)
!469 = !{!470, !471, !472, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !17, line: 8, baseType: !8, size: 32, align: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !17, line: 8, baseType: !8, size: 32, align: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !17, line: 8, baseType: !8, size: 32, align: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "a", file: !17, line: 8, baseType: !8, size: 32, align: 32, offset: 96)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "Float64Notifier", file: !11, line: 8, size: 128, align: 8, elements: !475)
!475 = !{!476, !83}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 8, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*__go_descriptor)Id,*func(*void,Id)void,*func(*void)float64}", file: !17, size: 256, align: 8, elements: !479)
!479 = !{!445, !446, !450, !480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !17, line: 8, baseType: !481, size: 64, align: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!114, !39}
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorInterpolater", file: !436, line: 10, size: 128, align: 8, elements: !485)
!485 = !{!486, !494}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !436, line: 10, baseType: !487, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,float64)Color}", file: !17, size: 128, align: 8, elements: !489)
!489 = !{!109, !490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolate", file: !17, line: 10, baseType: !491, size: 64, align: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!458, !39, !114}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !436, line: 1, baseType: !39, size: 64, align: 64, offset: 64)
!495 = !DILocalVariable(name: "n", arg: 1, scope: !435, file: !436, line: 15, type: !474)
!496 = !DILocation(line: 15, column: 23, scope: !435)
!497 = !DILocalVariable(name: "l", arg: 2, scope: !435, file: !436, line: 15, type: !484)
!498 = !DILocation(line: 15, column: 47, scope: !435)
!499 = !DILocation(line: 16, column: 9, scope: !435)
!500 = !DILocation(line: 16, column: 10, scope: !435)
!501 = !DILocalVariable(name: "$ret5", scope: !435, file: !436, line: 15, type: !439)
!502 = !DILocation(line: 15, column: 68, scope: !435)
!503 = !DILocation(line: 16, column: 2, scope: !435)
!504 = distinct !DISubprogram(name: "animate.Notify..1command_line_arguments.colorInterpolater", linkageName: "command_line_arguments.colorInterpolater.Notify", scope: null, file: !436, line: 27, type: !505, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!505 = !DISubroutineType(types: !506)
!506 = !{!169, !507, !507, !183}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.colorInterpolater", file: !436, line: 22, size: 256, align: 8, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "watcher", file: !436, line: 23, baseType: !474, size: 128, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "interpolater", file: !436, line: 24, baseType: !484, size: 128, align: 64, offset: 128)
!512 = !DILocalVariable(name: "w", arg: 1, scope: !504, file: !436, line: 27, type: !507)
!513 = !DILocation(line: 27, column: 1, scope: !504)
!514 = !DILocalVariable(name: "f", arg: 2, scope: !504, file: !436, line: 27, type: !183)
!515 = !DILocation(line: 27, column: 36, scope: !504)
!516 = !DILocalVariable(name: "$ret6", scope: !504, file: !436, line: 27, type: !169)
!517 = !DILocation(line: 27, column: 46, scope: !504)
!518 = !DILocation(line: 28, column: 10, scope: !504)
!519 = !DILocation(line: 28, column: 18, scope: !504)
!520 = !DILocation(line: 28, column: 2, scope: !504)
!521 = distinct !DISubprogram(name: "animate.Unnotify..1command_line_arguments.colorInterpolater", linkageName: "command_line_arguments.colorInterpolater.Unnotify", scope: null, file: !436, line: 31, type: !522, isLocal: false, isDefinition: true, scopeLine: 31, isOptimized: false, unit: !1, retainedNodes: !3)
!522 = !DISubroutineType(types: !523)
!523 = !{!40, !507, !507, !169}
!524 = !DILocalVariable(name: "w", arg: 1, scope: !521, file: !436, line: 31, type: !507)
!525 = !DILocation(line: 31, column: 1, scope: !521)
!526 = !DILocalVariable(name: "id", arg: 2, scope: !521, file: !436, line: 31, type: !169)
!527 = !DILocation(line: 31, column: 38, scope: !521)
!528 = !DILocation(line: 32, column: 3, scope: !521)
!529 = !DILocation(line: 32, column: 11, scope: !521)
!530 = distinct !DISubprogram(name: "animate.Value..1command_line_arguments.colorInterpolater", linkageName: "command_line_arguments.colorInterpolater.Value", scope: null, file: !436, line: 35, type: !531, isLocal: false, isDefinition: true, scopeLine: 35, isOptimized: false, unit: !1, retainedNodes: !3)
!531 = !DISubroutineType(types: !532)
!532 = !{!458, !507, !507}
!533 = !DILocalVariable(name: "w", arg: 1, scope: !530, file: !436, line: 35, type: !507)
!534 = !DILocation(line: 35, column: 1, scope: !530)
!535 = !DILocation(line: 36, column: 37, scope: !530)
!536 = !DILocation(line: 36, column: 45, scope: !530)
!537 = !DILocation(line: 36, column: 23, scope: !530)
!538 = !DILocation(line: 36, column: 2, scope: !530)
!539 = distinct !DISubprogram(name: "animate.command_line_arguments.colorInterpolater..hash", linkageName: "command_line_arguments.command_line_arguments.colorInterpolater..hash", scope: null, file: !7, line: 1, type: !37, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!540 = !DILocalVariable(name: "key", arg: 1, scope: !539, file: !7, line: 1, type: !39)
!541 = !DILocation(line: 1, column: 1, scope: !539)
!542 = !DILocalVariable(name: "seed", arg: 2, scope: !539, file: !7, line: 1, type: !24)
!543 = !DILocalVariable(name: "$ret32", scope: !539, file: !7, line: 1, type: !24)
!544 = distinct !DISubprogram(name: "animate.command_line_arguments.colorInterpolater..eq", linkageName: "command_line_arguments.command_line_arguments.colorInterpolater..eq", scope: null, file: !7, line: 1, type: !47, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!545 = !DILocalVariable(name: "key1", arg: 1, scope: !544, file: !7, line: 1, type: !39)
!546 = !DILocation(line: 1, column: 1, scope: !544)
!547 = !DILocalVariable(name: "key2", arg: 2, scope: !544, file: !7, line: 1, type: !39)
!548 = !DILocalVariable(name: "$ret33", scope: !544, file: !7, line: 1, type: !49)
!549 = distinct !DISubprogram(name: "animate.command_line_arguments.RGBALerp..hash", linkageName: "command_line_arguments.command_line_arguments.RGBALerp..hash", scope: null, file: !7, line: 1, type: !37, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!550 = !DILocalVariable(name: "key", arg: 1, scope: !549, file: !7, line: 1, type: !39)
!551 = !DILocation(line: 1, column: 1, scope: !549)
!552 = !DILocalVariable(name: "seed", arg: 2, scope: !549, file: !7, line: 1, type: !24)
!553 = !DILocalVariable(name: "$ret34", scope: !549, file: !7, line: 1, type: !24)
!554 = distinct !DISubprogram(name: "animate.command_line_arguments.RGBALerp..eq", linkageName: "command_line_arguments.command_line_arguments.RGBALerp..eq", scope: null, file: !7, line: 1, type: !47, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!555 = !DILocalVariable(name: "key1", arg: 1, scope: !554, file: !7, line: 1, type: !39)
!556 = !DILocation(line: 1, column: 1, scope: !554)
!557 = !DILocalVariable(name: "key2", arg: 2, scope: !554, file: !7, line: 1, type: !39)
!558 = !DILocalVariable(name: "$ret35", scope: !554, file: !7, line: 1, type: !49)
!559 = distinct !DISubprogram(name: "animate.Interpolate.command_line_arguments.RGBALerp", linkageName: "command_line_arguments.RGBALerp.Interpolate", scope: null, file: !436, line: 45, type: !560, isLocal: false, isDefinition: true, scopeLine: 45, isOptimized: false, unit: !1, retainedNodes: !3)
!560 = !DISubroutineType(types: !561)
!561 = !{!458, !562, !562, !114}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "RGBALerp", file: !436, line: 40, size: 256, align: 8, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "Start", file: !436, line: 41, baseType: !458, size: 128, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "End", file: !436, line: 41, baseType: !458, size: 128, align: 64, offset: 128)
!567 = !DILocalVariable(name: "pointer", arg: 1, scope: !559, file: !436, line: 45, type: !562)
!568 = !DILocation(line: 45, column: 1, scope: !559)
!569 = !DILocalVariable(name: "a", arg: 2, scope: !559, file: !436, line: 45, type: !114)
!570 = !DILocation(line: 45, column: 31, scope: !559)
!571 = !DILocalVariable(name: "e", scope: !559, file: !436, line: 45, type: !563)
!572 = !DILocation(line: 46, column: 27, scope: !573)
!573 = distinct !DILexicalBlock(scope: !559, file: !436, line: 45, column: 1)
!574 = !DILocalVariable(name: "r1", scope: !573, file: !436, line: 46, type: !8)
!575 = !DILocation(line: 46, column: 2, scope: !559)
!576 = !DILocalVariable(name: "g1", scope: !573, file: !436, line: 46, type: !8)
!577 = !DILocalVariable(name: "b1", scope: !573, file: !436, line: 46, type: !8)
!578 = !DILocalVariable(name: "a1", scope: !573, file: !436, line: 46, type: !8)
!579 = !DILocation(line: 47, column: 25, scope: !573)
!580 = !DILocalVariable(name: "r2", scope: !573, file: !436, line: 47, type: !8)
!581 = !DILocation(line: 47, column: 2, scope: !559)
!582 = !DILocalVariable(name: "g2", scope: !573, file: !436, line: 47, type: !8)
!583 = !DILocalVariable(name: "b2", scope: !573, file: !436, line: 47, type: !8)
!584 = !DILocalVariable(name: "a2", scope: !573, file: !436, line: 47, type: !8)
!585 = !DILocalVariable(name: "a", arg: 1, scope: !586, file: !436, line: 62, type: !8)
!586 = distinct !DISubprogram(name: "animate.uintInterpolate", scope: null, file: !436, line: 62, type: !587, isLocal: true, isDefinition: true, scopeLine: 62, isOptimized: false, unit: !1, retainedNodes: !3)
!587 = !DISubroutineType(types: !588)
!588 = !{!161, !8, !8, !114}
!589 = !DILocation(line: 62, column: 22, scope: !586, inlinedAt: !590)
!590 = distinct !DILocation(line: 49, column: 6, scope: !573)
!591 = !DILocalVariable(name: "b", arg: 2, scope: !586, file: !436, line: 62, type: !8)
!592 = !DILocation(line: 62, column: 25, scope: !586, inlinedAt: !590)
!593 = !DILocalVariable(name: "c", arg: 3, scope: !586, file: !436, line: 62, type: !114)
!594 = !DILocation(line: 62, column: 35, scope: !586, inlinedAt: !590)
!595 = !DILocalVariable(name: "$ret10", scope: !586, file: !436, line: 62, type: !161)
!596 = !DILocation(line: 62, column: 46, scope: !586, inlinedAt: !590)
!597 = !DILocation(line: 63, column: 36, scope: !586, inlinedAt: !590)
!598 = !DILocation(line: 63, column: 27, scope: !586, inlinedAt: !590)
!599 = !DILocation(line: 63, column: 39, scope: !586, inlinedAt: !590)
!600 = !DILocation(line: 63, column: 20, scope: !586, inlinedAt: !590)
!601 = !DILocation(line: 63, column: 18, scope: !586, inlinedAt: !590)
!602 = !DILocation(line: 63, column: 9, scope: !586, inlinedAt: !590)
!603 = !DILocation(line: 62, column: 22, scope: !586, inlinedAt: !604)
!604 = distinct !DILocation(line: 50, column: 6, scope: !573)
!605 = !DILocation(line: 62, column: 25, scope: !586, inlinedAt: !604)
!606 = !DILocation(line: 62, column: 35, scope: !586, inlinedAt: !604)
!607 = !DILocation(line: 62, column: 46, scope: !586, inlinedAt: !604)
!608 = !DILocation(line: 63, column: 36, scope: !586, inlinedAt: !604)
!609 = !DILocation(line: 63, column: 27, scope: !586, inlinedAt: !604)
!610 = !DILocation(line: 63, column: 39, scope: !586, inlinedAt: !604)
!611 = !DILocation(line: 63, column: 20, scope: !586, inlinedAt: !604)
!612 = !DILocation(line: 63, column: 18, scope: !586, inlinedAt: !604)
!613 = !DILocation(line: 63, column: 9, scope: !586, inlinedAt: !604)
!614 = !DILocation(line: 62, column: 22, scope: !586, inlinedAt: !615)
!615 = distinct !DILocation(line: 51, column: 6, scope: !573)
!616 = !DILocation(line: 62, column: 25, scope: !586, inlinedAt: !615)
!617 = !DILocation(line: 62, column: 35, scope: !586, inlinedAt: !615)
!618 = !DILocation(line: 62, column: 46, scope: !586, inlinedAt: !615)
!619 = !DILocation(line: 63, column: 36, scope: !586, inlinedAt: !615)
!620 = !DILocation(line: 63, column: 27, scope: !586, inlinedAt: !615)
!621 = !DILocation(line: 63, column: 39, scope: !586, inlinedAt: !615)
!622 = !DILocation(line: 63, column: 20, scope: !586, inlinedAt: !615)
!623 = !DILocation(line: 63, column: 18, scope: !586, inlinedAt: !615)
!624 = !DILocation(line: 63, column: 9, scope: !586, inlinedAt: !615)
!625 = !DILocation(line: 62, column: 22, scope: !586, inlinedAt: !626)
!626 = distinct !DILocation(line: 52, column: 6, scope: !573)
!627 = !DILocation(line: 62, column: 25, scope: !586, inlinedAt: !626)
!628 = !DILocation(line: 62, column: 35, scope: !586, inlinedAt: !626)
!629 = !DILocation(line: 62, column: 46, scope: !586, inlinedAt: !626)
!630 = !DILocation(line: 63, column: 36, scope: !586, inlinedAt: !626)
!631 = !DILocation(line: 63, column: 27, scope: !586, inlinedAt: !626)
!632 = !DILocation(line: 63, column: 39, scope: !586, inlinedAt: !626)
!633 = !DILocation(line: 63, column: 20, scope: !586, inlinedAt: !626)
!634 = !DILocation(line: 63, column: 18, scope: !586, inlinedAt: !626)
!635 = !DILocation(line: 63, column: 9, scope: !586, inlinedAt: !626)
!636 = !DILocalVariable(name: "color", scope: !573, file: !436, line: 48, type: !637)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "RGBA64", file: !436, line: 4, size: 64, align: 8, elements: !638)
!638 = !{!639, !640, !641, !642}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "R", file: !436, line: 4, baseType: !161, size: 16, align: 16)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "G", file: !436, line: 4, baseType: !161, size: 16, align: 16, offset: 16)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !436, line: 4, baseType: !161, size: 16, align: 16, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "A", file: !436, line: 4, baseType: !161, size: 16, align: 16, offset: 48)
!643 = !DILocation(line: 48, column: 2, scope: !559)
!644 = !DILocation(line: 54, column: 2, scope: !573)
!645 = !DILocalVariable(name: "$ret8", scope: !559, file: !436, line: 45, type: !458)
!646 = !DILocation(line: 45, column: 42, scope: !559)
!647 = distinct !DISubprogram(name: "animate.Notifier.command_line_arguments.RGBALerp", linkageName: "command_line_arguments.RGBALerp.Notifier", scope: null, file: !436, line: 58, type: !648, isLocal: false, isDefinition: true, scopeLine: 58, isOptimized: false, unit: !1, retainedNodes: !3)
!648 = !DISubroutineType(types: !649)
!649 = !{!439, !562, !562, !474}
!650 = !DILocalVariable(name: "pointer", arg: 1, scope: !647, file: !436, line: 58, type: !562)
!651 = !DILocation(line: 58, column: 1, scope: !647)
!652 = !DILocalVariable(name: "n", arg: 2, scope: !647, file: !436, line: 58, type: !474)
!653 = !DILocation(line: 58, column: 28, scope: !647)
!654 = !DILocation(line: 59, column: 29, scope: !647)
!655 = !DILocation(line: 59, column: 9, scope: !647)
!656 = !DILocalVariable(name: "$ret9", scope: !647, file: !436, line: 58, type: !439)
!657 = !DILocation(line: 58, column: 52, scope: !647)
!658 = !DILocation(line: 59, column: 2, scope: !647)
!659 = distinct !DISubprogram(name: "animate.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !11, line: 2, type: !188, isLocal: false, isDefinition: true, scopeLine: 2, isOptimized: false, unit: !1, retainedNodes: !3)
!660 = !DILocation(line: 1, column: 1, scope: !661)
!661 = !DILexicalBlockFile(scope: !659, file: !7, discriminator: 0)
!662 = !DILocation(line: 11, column: 14, scope: !663)
!663 = !DILexicalBlockFile(scope: !659, file: !86, discriminator: 0)
!664 = !DILocation(line: 11, column: 2, scope: !663)
!665 = !DILocation(line: 12, column: 14, scope: !663)
!666 = !DILocation(line: 12, column: 2, scope: !663)
!667 = !DILocation(line: 13, column: 14, scope: !663)
!668 = !DILocation(line: 13, column: 2, scope: !663)
!669 = !DILocation(line: 40, column: 2, scope: !670)
!670 = !DILexicalBlockFile(scope: !659, file: !102, discriminator: 0)
!671 = !DILocation(line: 41, column: 2, scope: !670)
!672 = !DILocation(line: 42, column: 2, scope: !670)
!673 = !DILocation(line: 43, column: 2, scope: !670)
!674 = distinct !DISubprogram(name: "animate.cubicBezier", scope: null, file: !86, line: 31, type: !675, isLocal: true, isDefinition: true, scopeLine: 31, isOptimized: false, unit: !1, retainedNodes: !3)
!675 = !DISubroutineType(types: !676)
!676 = !{!87, !94, !94, !94, !94}
!677 = !DILocalVariable(name: "param", arg: 1, scope: !674, file: !86, line: 31, type: !94)
!678 = !DILocation(line: 31, column: 18, scope: !674)
!679 = !DILocalVariable(name: "param", arg: 2, scope: !674, file: !86, line: 31, type: !94)
!680 = !DILocation(line: 31, column: 22, scope: !674)
!681 = !DILocalVariable(name: "param", arg: 3, scope: !674, file: !86, line: 31, type: !94)
!682 = !DILocation(line: 31, column: 26, scope: !674)
!683 = !DILocalVariable(name: "param", arg: 4, scope: !674, file: !86, line: 31, type: !94)
!684 = !DILocation(line: 31, column: 30, scope: !674)
!685 = !DILocalVariable(name: "x0", scope: !674, file: !86, line: 31, type: !686)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!687 = !DILocalVariable(name: "y0", scope: !674, file: !86, line: 31, type: !686)
!688 = !DILocalVariable(name: "x1", scope: !674, file: !86, line: 31, type: !686)
!689 = !DILocalVariable(name: "y1", scope: !674, file: !86, line: 31, type: !686)
!690 = !DILocalVariable(name: "$ret12", scope: !674, file: !86, line: 31, type: !87)
!691 = !DILocation(line: 31, column: 42, scope: !674)
!692 = !DILocation(line: 32, column: 9, scope: !674)
!693 = !DILocation(line: 32, column: 2, scope: !674)
!694 = distinct !DISubprogram(name: "animate.cubicBezier..func1", scope: null, file: !86, line: 32, type: !92, isLocal: true, isDefinition: true, scopeLine: 32, isOptimized: false, unit: !1, retainedNodes: !3)
!695 = !DILocalVariable(name: "start", arg: 1, scope: !694, file: !86, line: 32, type: !95)
!696 = !DILocation(line: 32, column: 14, scope: !694)
!697 = !DILocalVariable(name: "end", arg: 2, scope: !694, file: !86, line: 32, type: !95)
!698 = !DILocation(line: 32, column: 21, scope: !694)
!699 = !DILocalVariable(name: "now", arg: 3, scope: !694, file: !86, line: 32, type: !95)
!700 = !DILocation(line: 32, column: 26, scope: !694)
!701 = !DILocalVariable(name: "$ret13", scope: !694, file: !86, line: 32, type: !94)
!702 = !DILocation(line: 32, column: 37, scope: !694)
!703 = !DILocalVariable(name: "t0", arg: 1, scope: !704, file: !86, line: 17, type: !95)
!704 = distinct !DISubprogram(name: "animate.linear", scope: null, file: !86, line: 17, type: !92, isLocal: true, isDefinition: true, scopeLine: 17, isOptimized: false, unit: !1, retainedNodes: !3)
!705 = !DILocation(line: 17, column: 13, scope: !704, inlinedAt: !706)
!706 = distinct !DILocation(line: 45, column: 8, scope: !707)
!707 = distinct !DILexicalBlock(scope: !694, file: !86, line: 32, column: 9)
!708 = !DILocalVariable(name: "t1", arg: 2, scope: !704, file: !86, line: 17, type: !95)
!709 = !DILocation(line: 17, column: 17, scope: !704, inlinedAt: !706)
!710 = !DILocalVariable(name: "t", arg: 3, scope: !704, file: !86, line: 17, type: !95)
!711 = !DILocation(line: 17, column: 21, scope: !704, inlinedAt: !706)
!712 = !DILocalVariable(name: "$ret11", scope: !704, file: !86, line: 17, type: !94)
!713 = !DILocation(line: 17, column: 30, scope: !704, inlinedAt: !706)
!714 = !DILocation(line: 18, column: 7, scope: !704, inlinedAt: !706)
!715 = !DILocation(line: 21, column: 7, scope: !704, inlinedAt: !706)
!716 = !DILocation(line: 24, column: 18, scope: !704, inlinedAt: !706)
!717 = !DILocation(line: 24, column: 9, scope: !704, inlinedAt: !706)
!718 = !DILocation(line: 24, column: 35, scope: !704, inlinedAt: !706)
!719 = !DILocation(line: 24, column: 25, scope: !704, inlinedAt: !706)
!720 = !DILocation(line: 24, column: 23, scope: !704, inlinedAt: !706)
!721 = !DILocation(line: 24, column: 2, scope: !704, inlinedAt: !706)
!722 = !DILocalVariable(name: "x", scope: !707, file: !86, line: 45, type: !94)
!723 = !DILocation(line: 45, column: 3, scope: !694)
!724 = !DILocalVariable(name: "t", scope: !707, file: !86, line: 48, type: !94)
!725 = !DILocation(line: 48, column: 3, scope: !694)
!726 = !DILocalVariable(name: "i", scope: !727, file: !86, line: 49, type: !58)
!727 = distinct !DILexicalBlock(scope: !707, file: !86, line: 49, column: 3)
!728 = !DILocation(line: 49, column: 7, scope: !707)
!729 = !DILocation(line: 50, column: 12, scope: !730)
!730 = distinct !DILexicalBlock(scope: !727, file: !86, line: 49, column: 26)
!731 = !DILocalVariable(name: "t2", scope: !730, file: !86, line: 50, type: !94)
!732 = !DILocation(line: 50, column: 4, scope: !727)
!733 = !DILocation(line: 52, column: 11, scope: !730)
!734 = !DILocalVariable(name: "d", scope: !730, file: !86, line: 52, type: !94)
!735 = !DILocation(line: 52, column: 4, scope: !727)
!736 = !DILocation(line: 53, column: 12, scope: !730)
!737 = !DILocalVariable(name: "d2", scope: !730, file: !86, line: 53, type: !94)
!738 = !DILocation(line: 53, column: 4, scope: !727)
!739 = !DILocation(line: 55, column: 11, scope: !730)
!740 = !DILocation(line: 56, column: 16, scope: !730)
!741 = !DILocation(line: 56, column: 23, scope: !730)
!742 = !DILocation(line: 56, column: 25, scope: !730)
!743 = !DILocation(line: 56, column: 27, scope: !730)
!744 = !DILocation(line: 56, column: 20, scope: !730)
!745 = !DILocation(line: 56, column: 39, scope: !730)
!746 = !DILocation(line: 56, column: 42, scope: !730)
!747 = !DILocation(line: 56, column: 36, scope: !730)
!748 = !DILocalVariable(name: "dxdt", scope: !730, file: !86, line: 56, type: !94)
!749 = !DILocation(line: 56, column: 4, scope: !727)
!750 = !DILocation(line: 57, column: 12, scope: !730)
!751 = !DILocation(line: 55, column: 14, scope: !730)
!752 = !DILocation(line: 55, column: 16, scope: !730)
!753 = !DILocation(line: 55, column: 23, scope: !730)
!754 = !DILocation(line: 55, column: 25, scope: !730)
!755 = !DILocation(line: 55, column: 28, scope: !730)
!756 = !DILocation(line: 55, column: 20, scope: !730)
!757 = !DILocation(line: 51, column: 13, scope: !730)
!758 = !DILocalVariable(name: "t3", scope: !730, file: !86, line: 51, type: !94)
!759 = !DILocation(line: 51, column: 4, scope: !727)
!760 = !DILocation(line: 55, column: 32, scope: !730)
!761 = !DILocalVariable(name: "nx", scope: !730, file: !86, line: 55, type: !94)
!762 = !DILocation(line: 55, column: 4, scope: !727)
!763 = !DILocation(line: 61, column: 13, scope: !730)
!764 = !DILocation(line: 61, column: 18, scope: !730)
!765 = !DILocation(line: 61, column: 6, scope: !730)
!766 = !DILocation(line: 62, column: 9, scope: !730)
!767 = !DILocation(line: 62, column: 19, scope: !730)
!768 = !DILocation(line: 66, column: 8, scope: !707)
!769 = !DILocation(line: 69, column: 8, scope: !707)
!770 = !DILocation(line: 74, column: 11, scope: !707)
!771 = !DILocalVariable(name: "t2", scope: !707, file: !86, line: 74, type: !94)
!772 = !DILocation(line: 74, column: 3, scope: !694)
!773 = !DILocation(line: 75, column: 12, scope: !707)
!774 = !DILocalVariable(name: "t3", scope: !707, file: !86, line: 75, type: !94)
!775 = !DILocation(line: 75, column: 3, scope: !694)
!776 = !DILocation(line: 76, column: 10, scope: !707)
!777 = !DILocalVariable(name: "d", scope: !707, file: !86, line: 76, type: !94)
!778 = !DILocation(line: 76, column: 3, scope: !694)
!779 = !DILocation(line: 77, column: 11, scope: !707)
!780 = !DILocalVariable(name: "d2", scope: !707, file: !86, line: 77, type: !94)
!781 = !DILocation(line: 77, column: 3, scope: !694)
!782 = !DILocation(line: 78, column: 9, scope: !707)
!783 = !DILocation(line: 78, column: 12, scope: !707)
!784 = !DILocation(line: 78, column: 15, scope: !707)
!785 = !DILocation(line: 78, column: 14, scope: !707)
!786 = !DILocation(line: 78, column: 21, scope: !707)
!787 = !DILocation(line: 78, column: 23, scope: !707)
!788 = !DILocation(line: 78, column: 27, scope: !707)
!789 = !DILocation(line: 78, column: 26, scope: !707)
!790 = !DILocation(line: 78, column: 18, scope: !707)
!791 = !DILocation(line: 78, column: 30, scope: !707)
!792 = !DILocalVariable(name: "y", scope: !707, file: !86, line: 78, type: !94)
!793 = !DILocation(line: 78, column: 3, scope: !694)
!794 = !DILocation(line: 80, column: 3, scope: !707)
!795 = distinct !DISubprogram(name: "animate.FloatInterpolate", linkageName: "command_line_arguments.FloatInterpolate", scope: null, file: !102, line: 15, type: !796, isLocal: false, isDefinition: true, scopeLine: 15, isOptimized: false, unit: !1, retainedNodes: !3)
!796 = !DISubroutineType(types: !797)
!797 = !{!474, !474, !103}
!798 = !DILocalVariable(name: "w", arg: 1, scope: !795, file: !102, line: 15, type: !474)
!799 = !DILocation(line: 15, column: 23, scope: !795)
!800 = !DILocalVariable(name: "l", arg: 2, scope: !795, file: !102, line: 15, type: !103)
!801 = !DILocation(line: 15, column: 47, scope: !795)
!802 = !DILocation(line: 16, column: 9, scope: !795)
!803 = !DILocation(line: 16, column: 10, scope: !795)
!804 = !DILocalVariable(name: "$ret14", scope: !795, file: !102, line: 15, type: !474)
!805 = !DILocation(line: 15, column: 68, scope: !795)
!806 = !DILocation(line: 16, column: 2, scope: !795)
!807 = distinct !DISubprogram(name: "animate.Notify..1command_line_arguments.floatInterpolater", linkageName: "command_line_arguments.floatInterpolater.Notify", scope: null, file: !102, line: 27, type: !808, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!808 = !DISubroutineType(types: !809)
!809 = !{!169, !810, !810, !183}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.floatInterpolater", file: !102, line: 22, size: 256, align: 8, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "watcher", file: !102, line: 23, baseType: !474, size: 128, align: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "interpolater", file: !102, line: 24, baseType: !103, size: 128, align: 64, offset: 128)
!815 = !DILocalVariable(name: "w", arg: 1, scope: !807, file: !102, line: 27, type: !810)
!816 = !DILocation(line: 27, column: 1, scope: !807)
!817 = !DILocalVariable(name: "f", arg: 2, scope: !807, file: !102, line: 27, type: !183)
!818 = !DILocation(line: 27, column: 36, scope: !807)
!819 = !DILocalVariable(name: "$ret15", scope: !807, file: !102, line: 27, type: !169)
!820 = !DILocation(line: 27, column: 46, scope: !807)
!821 = !DILocation(line: 28, column: 10, scope: !807)
!822 = !DILocation(line: 28, column: 18, scope: !807)
!823 = !DILocation(line: 28, column: 2, scope: !807)
!824 = distinct !DISubprogram(name: "animate.Unnotify..1command_line_arguments.floatInterpolater", linkageName: "command_line_arguments.floatInterpolater.Unnotify", scope: null, file: !102, line: 31, type: !825, isLocal: false, isDefinition: true, scopeLine: 31, isOptimized: false, unit: !1, retainedNodes: !3)
!825 = !DISubroutineType(types: !826)
!826 = !{!40, !810, !810, !169}
!827 = !DILocalVariable(name: "w", arg: 1, scope: !824, file: !102, line: 31, type: !810)
!828 = !DILocation(line: 31, column: 1, scope: !824)
!829 = !DILocalVariable(name: "id", arg: 2, scope: !824, file: !102, line: 31, type: !169)
!830 = !DILocation(line: 31, column: 38, scope: !824)
!831 = !DILocation(line: 32, column: 3, scope: !824)
!832 = !DILocation(line: 32, column: 11, scope: !824)
!833 = distinct !DISubprogram(name: "animate.Value..1command_line_arguments.floatInterpolater", linkageName: "command_line_arguments.floatInterpolater.Value", scope: null, file: !102, line: 35, type: !834, isLocal: false, isDefinition: true, scopeLine: 35, isOptimized: false, unit: !1, retainedNodes: !3)
!834 = !DISubroutineType(types: !835)
!835 = !{!114, !810, !810}
!836 = !DILocalVariable(name: "w", arg: 1, scope: !833, file: !102, line: 35, type: !810)
!837 = !DILocation(line: 35, column: 1, scope: !833)
!838 = !DILocalVariable(name: "$ret16", scope: !833, file: !102, line: 35, type: !114)
!839 = !DILocation(line: 35, column: 37, scope: !833)
!840 = !DILocation(line: 36, column: 37, scope: !833)
!841 = !DILocation(line: 36, column: 45, scope: !833)
!842 = !DILocation(line: 36, column: 23, scope: !833)
!843 = !DILocation(line: 36, column: 2, scope: !833)
!844 = distinct !DISubprogram(name: "animate.command_line_arguments.floatInterpolater..hash", linkageName: "command_line_arguments.command_line_arguments.floatInterpolater..hash", scope: null, file: !7, line: 1, type: !37, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!845 = !DILocalVariable(name: "key", arg: 1, scope: !844, file: !7, line: 1, type: !39)
!846 = !DILocation(line: 1, column: 1, scope: !844)
!847 = !DILocalVariable(name: "seed", arg: 2, scope: !844, file: !7, line: 1, type: !24)
!848 = !DILocalVariable(name: "$ret36", scope: !844, file: !7, line: 1, type: !24)
!849 = distinct !DISubprogram(name: "animate.command_line_arguments.floatInterpolater..eq", linkageName: "command_line_arguments.command_line_arguments.floatInterpolater..eq", scope: null, file: !7, line: 1, type: !47, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!850 = !DILocalVariable(name: "key1", arg: 1, scope: !849, file: !7, line: 1, type: !39)
!851 = !DILocation(line: 1, column: 1, scope: !849)
!852 = !DILocalVariable(name: "key2", arg: 2, scope: !849, file: !7, line: 1, type: !39)
!853 = !DILocalVariable(name: "$ret37", scope: !849, file: !7, line: 1, type: !49)
!854 = distinct !DISubprogram(name: "animate.command_line_arguments.CubicBezierEase..hash", linkageName: "command_line_arguments.command_line_arguments.CubicBezierEase..hash", scope: null, file: !7, line: 1, type: !37, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!855 = !DILocalVariable(name: "key", arg: 1, scope: !854, file: !7, line: 1, type: !39)
!856 = !DILocation(line: 1, column: 1, scope: !854)
!857 = !DILocalVariable(name: "seed", arg: 2, scope: !854, file: !7, line: 1, type: !24)
!858 = !DILocalVariable(name: "$ret38", scope: !854, file: !7, line: 1, type: !24)
!859 = distinct !DISubprogram(name: "animate.command_line_arguments.CubicBezierEase..eq", linkageName: "command_line_arguments.command_line_arguments.CubicBezierEase..eq", scope: null, file: !7, line: 1, type: !47, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!860 = !DILocalVariable(name: "key1", arg: 1, scope: !859, file: !7, line: 1, type: !39)
!861 = !DILocation(line: 1, column: 1, scope: !859)
!862 = !DILocalVariable(name: "key2", arg: 2, scope: !859, file: !7, line: 1, type: !39)
!863 = !DILocalVariable(name: "$ret39", scope: !859, file: !7, line: 1, type: !49)
!864 = distinct !DISubprogram(name: "animate.Interpolate.command_line_arguments.CubicBezierEase", linkageName: "command_line_arguments.CubicBezierEase.Interpolate", scope: null, file: !102, line: 52, type: !865, isLocal: false, isDefinition: true, scopeLine: 52, isOptimized: false, unit: !1, retainedNodes: !3)
!865 = !DISubroutineType(types: !866)
!866 = !{!114, !867, !867, !114}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "CubicBezierEase", file: !102, line: 47, size: 256, align: 8, elements: !869)
!869 = !{!870, !871, !872, !873}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "X0", file: !102, line: 48, baseType: !114, size: 64, align: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "Y0", file: !102, line: 48, baseType: !114, size: 64, align: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "X1", file: !102, line: 48, baseType: !114, size: 64, align: 64, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "Y1", file: !102, line: 48, baseType: !114, size: 64, align: 64, offset: 192)
!874 = !DILocalVariable(name: "pointer", arg: 1, scope: !864, file: !102, line: 52, type: !867)
!875 = !DILocation(line: 52, column: 1, scope: !864)
!876 = !DILocalVariable(name: "a", arg: 2, scope: !864, file: !102, line: 52, type: !114)
!877 = !DILocation(line: 52, column: 38, scope: !864)
!878 = !DILocalVariable(name: "e", scope: !864, file: !102, line: 52, type: !868)
!879 = !DILocalVariable(name: "$ret17", scope: !864, file: !102, line: 52, type: !114)
!880 = !DILocation(line: 52, column: 49, scope: !864)
!881 = !DILocation(line: 53, column: 19, scope: !882)
!882 = distinct !DILexicalBlock(scope: !864, file: !102, line: 52, column: 1)
!883 = !DILocation(line: 53, column: 34, scope: !882)
!884 = !DILocation(line: 53, column: 49, scope: !882)
!885 = !DILocation(line: 53, column: 64, scope: !882)
!886 = !DILocation(line: 53, column: 7, scope: !882)
!887 = !DILocalVariable(name: "f", scope: !882, file: !102, line: 53, type: !87)
!888 = !DILocation(line: 53, column: 2, scope: !864)
!889 = !DILocation(line: 54, column: 7, scope: !882)
!890 = !DILocation(line: 54, column: 27, scope: !882)
!891 = !DILocation(line: 54, column: 20, scope: !882)
!892 = !DILocalVariable(name: "t", scope: !882, file: !102, line: 54, type: !94)
!893 = !DILocation(line: 54, column: 2, scope: !864)
!894 = !DILocation(line: 55, column: 9, scope: !882)
!895 = !DILocation(line: 55, column: 2, scope: !882)
!896 = distinct !DISubprogram(name: "animate.Notifier.command_line_arguments.CubicBezierEase", linkageName: "command_line_arguments.CubicBezierEase.Notifier", scope: null, file: !102, line: 59, type: !897, isLocal: false, isDefinition: true, scopeLine: 59, isOptimized: false, unit: !1, retainedNodes: !3)
!897 = !DISubroutineType(types: !898)
!898 = !{!474, !867, !867, !474}
!899 = !DILocalVariable(name: "pointer", arg: 1, scope: !896, file: !102, line: 59, type: !867)
!900 = !DILocation(line: 59, column: 1, scope: !896)
!901 = !DILocalVariable(name: "a", arg: 2, scope: !896, file: !102, line: 59, type: !474)
!902 = !DILocation(line: 59, column: 35, scope: !896)
!903 = !DILocation(line: 60, column: 29, scope: !896)
!904 = !DILocation(line: 60, column: 9, scope: !896)
!905 = !DILocalVariable(name: "$ret18", scope: !896, file: !102, line: 59, type: !474)
!906 = !DILocation(line: 59, column: 59, scope: !896)
!907 = !DILocation(line: 60, column: 2, scope: !896)
!908 = distinct !DISubprogram(name: "animate.Interpolate.command_line_arguments.LinearEase", linkageName: "command_line_arguments.LinearEase.Interpolate", scope: null, file: !102, line: 68, type: !909, isLocal: false, isDefinition: true, scopeLine: 68, isOptimized: false, unit: !1, retainedNodes: !3)
!909 = !DISubroutineType(types: !910)
!910 = !{!114, !911, !911, !114}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinearEase", file: !102, line: 64, align: 8, elements: !3)
!913 = !DILocalVariable(name: "pointer", arg: 1, scope: !908, file: !102, line: 68, type: !911)
!914 = !DILocation(line: 68, column: 1, scope: !908)
!915 = !DILocalVariable(name: "a", arg: 2, scope: !908, file: !102, line: 68, type: !114)
!916 = !DILocation(line: 68, column: 33, scope: !908)
!917 = !DILocalVariable(name: "$ret19", scope: !908, file: !102, line: 68, type: !114)
!918 = !DILocation(line: 68, column: 44, scope: !908)
!919 = !DILocation(line: 69, column: 2, scope: !908)
!920 = distinct !DISubprogram(name: "animate.Notifier.command_line_arguments.LinearEase", linkageName: "command_line_arguments.LinearEase.Notifier", scope: null, file: !102, line: 73, type: !921, isLocal: false, isDefinition: true, scopeLine: 73, isOptimized: false, unit: !1, retainedNodes: !3)
!921 = !DISubroutineType(types: !922)
!922 = !{!474, !911, !911, !474}
!923 = !DILocalVariable(name: "pointer", arg: 1, scope: !920, file: !102, line: 73, type: !911)
!924 = !DILocation(line: 73, column: 1, scope: !920)
!925 = !DILocalVariable(name: "a", arg: 2, scope: !920, file: !102, line: 73, type: !474)
!926 = !DILocation(line: 73, column: 30, scope: !920)
!927 = !DILocation(line: 74, column: 29, scope: !920)
!928 = !DILocation(line: 74, column: 9, scope: !920)
!929 = !DILocalVariable(name: "$ret20", scope: !920, file: !102, line: 73, type: !474)
!930 = !DILocation(line: 73, column: 54, scope: !920)
!931 = !DILocation(line: 74, column: 2, scope: !920)
!932 = distinct !DISubprogram(name: "animate.command_line_arguments.PolyInEase..hash", linkageName: "command_line_arguments.command_line_arguments.PolyInEase..hash", scope: null, file: !7, line: 1, type: !37, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!933 = !DILocalVariable(name: "key", arg: 1, scope: !932, file: !7, line: 1, type: !39)
!934 = !DILocation(line: 1, column: 1, scope: !932)
!935 = !DILocalVariable(name: "seed", arg: 2, scope: !932, file: !7, line: 1, type: !24)
!936 = !DILocalVariable(name: "$ret40", scope: !932, file: !7, line: 1, type: !24)
!937 = distinct !DISubprogram(name: "animate.command_line_arguments.PolyInEase..eq", linkageName: "command_line_arguments.command_line_arguments.PolyInEase..eq", scope: null, file: !7, line: 1, type: !47, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!938 = !DILocalVariable(name: "key1", arg: 1, scope: !937, file: !7, line: 1, type: !39)
!939 = !DILocation(line: 1, column: 1, scope: !937)
!940 = !DILocalVariable(name: "key2", arg: 2, scope: !937, file: !7, line: 1, type: !39)
!941 = !DILocalVariable(name: "$ret41", scope: !937, file: !7, line: 1, type: !49)
!942 = distinct !DISubprogram(name: "animate.Interpolate.command_line_arguments.PolyInEase", linkageName: "command_line_arguments.PolyInEase.Interpolate", scope: null, file: !102, line: 83, type: !943, isLocal: false, isDefinition: true, scopeLine: 83, isOptimized: false, unit: !1, retainedNodes: !3)
!943 = !DISubroutineType(types: !944)
!944 = !{!114, !945, !945, !114}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "PolyInEase", file: !102, line: 78, size: 64, align: 8, elements: !947)
!947 = !{!948}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "Exp", file: !102, line: 79, baseType: !114, size: 64, align: 64)
!949 = !DILocalVariable(name: "pointer", arg: 1, scope: !942, file: !102, line: 83, type: !945)
!950 = !DILocation(line: 83, column: 1, scope: !942)
!951 = !DILocalVariable(name: "a", arg: 2, scope: !942, file: !102, line: 83, type: !114)
!952 = !DILocation(line: 83, column: 33, scope: !942)
!953 = !DILocalVariable(name: "e", scope: !942, file: !102, line: 83, type: !946)
!954 = !DILocalVariable(name: "$ret21", scope: !942, file: !102, line: 83, type: !114)
!955 = !DILocation(line: 83, column: 44, scope: !942)
!956 = !DILocation(line: 84, column: 14, scope: !942)
!957 = !DILocation(line: 84, column: 2, scope: !942)
!958 = distinct !DISubprogram(name: "animate.Notifier.command_line_arguments.PolyInEase", linkageName: "command_line_arguments.PolyInEase.Notifier", scope: null, file: !102, line: 88, type: !959, isLocal: false, isDefinition: true, scopeLine: 88, isOptimized: false, unit: !1, retainedNodes: !3)
!959 = !DISubroutineType(types: !960)
!960 = !{!474, !945, !945, !474}
!961 = !DILocalVariable(name: "pointer", arg: 1, scope: !958, file: !102, line: 88, type: !945)
!962 = !DILocation(line: 88, column: 1, scope: !958)
!963 = !DILocalVariable(name: "a", arg: 2, scope: !958, file: !102, line: 88, type: !474)
!964 = !DILocation(line: 88, column: 30, scope: !958)
!965 = !DILocalVariable(name: "e", scope: !958, file: !102, line: 88, type: !946)
!966 = !DILocation(line: 89, column: 29, scope: !958)
!967 = !DILocation(line: 89, column: 9, scope: !958)
!968 = !DILocalVariable(name: "$ret22", scope: !958, file: !102, line: 88, type: !474)
!969 = !DILocation(line: 88, column: 54, scope: !958)
!970 = !DILocation(line: 89, column: 2, scope: !958)
!971 = distinct !DISubprogram(name: "animate.command_line_arguments.PolyOutEase..hash", linkageName: "command_line_arguments.command_line_arguments.PolyOutEase..hash", scope: null, file: !7, line: 1, type: !37, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!972 = !DILocalVariable(name: "key", arg: 1, scope: !971, file: !7, line: 1, type: !39)
!973 = !DILocation(line: 1, column: 1, scope: !971)
!974 = !DILocalVariable(name: "seed", arg: 2, scope: !971, file: !7, line: 1, type: !24)
!975 = !DILocalVariable(name: "$ret42", scope: !971, file: !7, line: 1, type: !24)
!976 = distinct !DISubprogram(name: "animate.command_line_arguments.PolyOutEase..eq", linkageName: "command_line_arguments.command_line_arguments.PolyOutEase..eq", scope: null, file: !7, line: 1, type: !47, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!977 = !DILocalVariable(name: "key1", arg: 1, scope: !976, file: !7, line: 1, type: !39)
!978 = !DILocation(line: 1, column: 1, scope: !976)
!979 = !DILocalVariable(name: "key2", arg: 2, scope: !976, file: !7, line: 1, type: !39)
!980 = !DILocalVariable(name: "$ret43", scope: !976, file: !7, line: 1, type: !49)
!981 = distinct !DISubprogram(name: "animate.Interpolate.command_line_arguments.PolyOutEase", linkageName: "command_line_arguments.PolyOutEase.Interpolate", scope: null, file: !102, line: 98, type: !982, isLocal: false, isDefinition: true, scopeLine: 98, isOptimized: false, unit: !1, retainedNodes: !3)
!982 = !DISubroutineType(types: !983)
!983 = !{!114, !984, !984, !114}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "PolyOutEase", file: !102, line: 93, size: 64, align: 8, elements: !986)
!986 = !{!987}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "Exp", file: !102, line: 94, baseType: !114, size: 64, align: 64)
!988 = !DILocalVariable(name: "pointer", arg: 1, scope: !981, file: !102, line: 98, type: !984)
!989 = !DILocation(line: 98, column: 1, scope: !981)
!990 = !DILocalVariable(name: "a", arg: 2, scope: !981, file: !102, line: 98, type: !114)
!991 = !DILocation(line: 98, column: 34, scope: !981)
!992 = !DILocalVariable(name: "e", scope: !981, file: !102, line: 98, type: !985)
!993 = !DILocalVariable(name: "$ret23", scope: !981, file: !102, line: 98, type: !114)
!994 = !DILocation(line: 98, column: 45, scope: !981)
!995 = !DILocation(line: 99, column: 23, scope: !981)
!996 = !DILocation(line: 99, column: 18, scope: !981)
!997 = !DILocation(line: 99, column: 11, scope: !981)
!998 = !DILocation(line: 99, column: 2, scope: !981)
!999 = distinct !DISubprogram(name: "animate.Notifier.command_line_arguments.PolyOutEase", linkageName: "command_line_arguments.PolyOutEase.Notifier", scope: null, file: !102, line: 103, type: !1000, isLocal: false, isDefinition: true, scopeLine: 103, isOptimized: false, unit: !1, retainedNodes: !3)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!474, !984, !984, !474}
!1002 = !DILocalVariable(name: "pointer", arg: 1, scope: !999, file: !102, line: 103, type: !984)
!1003 = !DILocation(line: 103, column: 1, scope: !999)
!1004 = !DILocalVariable(name: "a", arg: 2, scope: !999, file: !102, line: 103, type: !474)
!1005 = !DILocation(line: 103, column: 31, scope: !999)
!1006 = !DILocalVariable(name: "e", scope: !999, file: !102, line: 103, type: !985)
!1007 = !DILocation(line: 104, column: 29, scope: !999)
!1008 = !DILocation(line: 104, column: 9, scope: !999)
!1009 = !DILocalVariable(name: "$ret24", scope: !999, file: !102, line: 103, type: !474)
!1010 = !DILocation(line: 103, column: 55, scope: !999)
!1011 = !DILocation(line: 104, column: 2, scope: !999)
!1012 = distinct !DISubprogram(name: "animate.command_line_arguments.PolyInOutEase..hash", linkageName: "command_line_arguments.command_line_arguments.PolyInOutEase..hash", scope: null, file: !7, line: 1, type: !37, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!1013 = !DILocalVariable(name: "key", arg: 1, scope: !1012, file: !7, line: 1, type: !39)
!1014 = !DILocation(line: 1, column: 1, scope: !1012)
!1015 = !DILocalVariable(name: "seed", arg: 2, scope: !1012, file: !7, line: 1, type: !24)
!1016 = !DILocalVariable(name: "$ret44", scope: !1012, file: !7, line: 1, type: !24)
!1017 = distinct !DISubprogram(name: "animate.command_line_arguments.PolyInOutEase..eq", linkageName: "command_line_arguments.command_line_arguments.PolyInOutEase..eq", scope: null, file: !7, line: 1, type: !47, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!1018 = !DILocalVariable(name: "key1", arg: 1, scope: !1017, file: !7, line: 1, type: !39)
!1019 = !DILocation(line: 1, column: 1, scope: !1017)
!1020 = !DILocalVariable(name: "key2", arg: 2, scope: !1017, file: !7, line: 1, type: !39)
!1021 = !DILocalVariable(name: "$ret45", scope: !1017, file: !7, line: 1, type: !49)
!1022 = distinct !DISubprogram(name: "animate.Interpolate.command_line_arguments.PolyInOutEase", linkageName: "command_line_arguments.PolyInOutEase.Interpolate", scope: null, file: !102, line: 114, type: !1023, isLocal: false, isDefinition: true, scopeLine: 114, isOptimized: false, unit: !1, retainedNodes: !3)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!114, !1025, !1025, !114}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DICompositeType(tag: DW_TAG_structure_type, name: "PolyInOutEase", file: !102, line: 108, size: 128, align: 8, elements: !1027)
!1027 = !{!1028, !1029}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ExpIn", file: !102, line: 109, baseType: !114, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ExpOut", file: !102, line: 110, baseType: !114, size: 64, align: 64, offset: 64)
!1030 = !DILocalVariable(name: "pointer", arg: 1, scope: !1022, file: !102, line: 114, type: !1025)
!1031 = !DILocation(line: 114, column: 1, scope: !1022)
!1032 = !DILocalVariable(name: "a", arg: 2, scope: !1022, file: !102, line: 114, type: !114)
!1033 = !DILocation(line: 114, column: 36, scope: !1022)
!1034 = !DILocalVariable(name: "$ret25", scope: !1022, file: !102, line: 114, type: !114)
!1035 = !DILocation(line: 114, column: 47, scope: !1022)
!1036 = !DILocation(line: 115, column: 7, scope: !1022)
!1037 = !DILocalVariable(name: "e", scope: !1022, file: !102, line: 114, type: !1026)
!1038 = !DILocation(line: 116, column: 15, scope: !1022)
!1039 = !DILocation(line: 116, column: 3, scope: !1022)
!1040 = !DILocation(line: 118, column: 24, scope: !1022)
!1041 = !DILocation(line: 118, column: 19, scope: !1022)
!1042 = !DILocation(line: 118, column: 12, scope: !1022)
!1043 = !DILocation(line: 118, column: 3, scope: !1022)
!1044 = distinct !DISubprogram(name: "animate.Notifier.command_line_arguments.PolyInOutEase", linkageName: "command_line_arguments.PolyInOutEase.Notifier", scope: null, file: !102, line: 123, type: !1045, isLocal: false, isDefinition: true, scopeLine: 123, isOptimized: false, unit: !1, retainedNodes: !3)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!474, !1025, !1025, !474}
!1047 = !DILocalVariable(name: "pointer", arg: 1, scope: !1044, file: !102, line: 123, type: !1025)
!1048 = !DILocation(line: 123, column: 1, scope: !1044)
!1049 = !DILocalVariable(name: "a", arg: 2, scope: !1044, file: !102, line: 123, type: !474)
!1050 = !DILocation(line: 123, column: 33, scope: !1044)
!1051 = !DILocation(line: 124, column: 29, scope: !1044)
!1052 = !DILocation(line: 124, column: 9, scope: !1044)
!1053 = !DILocalVariable(name: "$ret26", scope: !1044, file: !102, line: 123, type: !474)
!1054 = !DILocation(line: 123, column: 57, scope: !1044)
!1055 = !DILocation(line: 124, column: 2, scope: !1044)
!1056 = distinct !DISubprogram(name: "animate.command_line_arguments.FloatLerp..hash", linkageName: "command_line_arguments.command_line_arguments.FloatLerp..hash", scope: null, file: !7, line: 1, type: !37, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!1057 = !DILocalVariable(name: "key", arg: 1, scope: !1056, file: !7, line: 1, type: !39)
!1058 = !DILocation(line: 1, column: 1, scope: !1056)
!1059 = !DILocalVariable(name: "seed", arg: 2, scope: !1056, file: !7, line: 1, type: !24)
!1060 = !DILocalVariable(name: "$ret46", scope: !1056, file: !7, line: 1, type: !24)
!1061 = distinct !DISubprogram(name: "animate.command_line_arguments.FloatLerp..eq", linkageName: "command_line_arguments.command_line_arguments.FloatLerp..eq", scope: null, file: !7, line: 1, type: !47, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!1062 = !DILocalVariable(name: "key1", arg: 1, scope: !1061, file: !7, line: 1, type: !39)
!1063 = !DILocation(line: 1, column: 1, scope: !1061)
!1064 = !DILocalVariable(name: "key2", arg: 2, scope: !1061, file: !7, line: 1, type: !39)
!1065 = !DILocalVariable(name: "$ret47", scope: !1061, file: !7, line: 1, type: !49)
!1066 = distinct !DISubprogram(name: "animate.Interpolate.command_line_arguments.FloatLerp", linkageName: "command_line_arguments.FloatLerp.Interpolate", scope: null, file: !102, line: 133, type: !1067, isLocal: false, isDefinition: true, scopeLine: 133, isOptimized: false, unit: !1, retainedNodes: !3)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!114, !1069, !1069, !114}
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DICompositeType(tag: DW_TAG_structure_type, name: "FloatLerp", file: !102, line: 128, size: 128, align: 8, elements: !1071)
!1071 = !{!1072, !1073}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "Start", file: !102, line: 129, baseType: !114, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "End", file: !102, line: 129, baseType: !114, size: 64, align: 64, offset: 64)
!1074 = !DILocalVariable(name: "pointer", arg: 1, scope: !1066, file: !102, line: 133, type: !1069)
!1075 = !DILocation(line: 133, column: 1, scope: !1066)
!1076 = !DILocalVariable(name: "a", arg: 2, scope: !1066, file: !102, line: 133, type: !114)
!1077 = !DILocation(line: 133, column: 32, scope: !1066)
!1078 = !DILocalVariable(name: "f", scope: !1066, file: !102, line: 133, type: !1070)
!1079 = !DILocalVariable(name: "$ret27", scope: !1066, file: !102, line: 133, type: !114)
!1080 = !DILocation(line: 133, column: 43, scope: !1066)
!1081 = !DILocation(line: 134, column: 25, scope: !1066)
!1082 = !DILocation(line: 134, column: 34, scope: !1066)
!1083 = !DILocation(line: 134, column: 17, scope: !1066)
!1084 = !DILocation(line: 134, column: 2, scope: !1066)
!1085 = distinct !DISubprogram(name: "animate.Notifier.command_line_arguments.FloatLerp", linkageName: "command_line_arguments.FloatLerp.Notifier", scope: null, file: !102, line: 138, type: !1086, isLocal: false, isDefinition: true, scopeLine: 138, isOptimized: false, unit: !1, retainedNodes: !3)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!474, !1069, !1069, !474}
!1088 = !DILocalVariable(name: "pointer", arg: 1, scope: !1085, file: !102, line: 138, type: !1069)
!1089 = !DILocation(line: 138, column: 1, scope: !1085)
!1090 = !DILocalVariable(name: "a", arg: 2, scope: !1085, file: !102, line: 138, type: !474)
!1091 = !DILocation(line: 138, column: 29, scope: !1085)
!1092 = !DILocation(line: 139, column: 29, scope: !1085)
!1093 = !DILocation(line: 139, column: 9, scope: !1085)
!1094 = !DILocalVariable(name: "$ret28", scope: !1085, file: !102, line: 138, type: !474)
!1095 = !DILocation(line: 138, column: 53, scope: !1085)
!1096 = !DILocation(line: 139, column: 2, scope: !1085)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "animate"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "command-line-arguments"
	.ascii ";\n"
	.ascii "import "
	.ascii "matcha"
	.ascii " "
	.ascii "gomatcha.io/matcha"
	.ascii " \""
	.ascii "gomatcha.io/matcha"
	.ascii "\";\n"
	.ascii "import "
	.ascii "comm"
	.ascii " "
	.ascii "gomatcha.io/matcha/comm"
	.ascii " \""
	.ascii "gomatcha.io/matcha/comm"
	.ascii "\";\n"
	.ascii "import "
	.ascii "internal"
	.ascii " "
	.ascii "gomatcha.io/matcha/internal"
	.ascii " \""
	.ascii "gomatcha.io/matcha/internal"
	.ascii "\";\n"
	.ascii "import "
	.ascii "color"
	.ascii " "
	.ascii "image/color"
	.ascii " \""
	.ascii "image/color"
	.ascii "\";\n"
	.ascii "import "
	.ascii "math"
	.ascii " "
	.ascii "math"
	.ascii " \""
	.ascii "math"
	.ascii "\";\n"
	.ascii "import "
	.ascii "time"
	.ascii " "
	.ascii "time"
	.ascii " \""
	.ascii "time"
	.ascii "\";\n"
	.ascii "init"
	.ascii " "
	.ascii "animate"
	.ascii " "
	.ascii "command_line_arguments..import"
	.ascii " "
	.ascii "bufio"
	.ascii " "
	.ascii "bufio..import"
	.ascii " "
	.ascii "bytes"
	.ascii " "
	.ascii "bytes..import"
	.ascii " "
	.ascii "flate"
	.ascii " "
	.ascii "compress_flate..import"
	.ascii " "
	.ascii "gzip"
	.ascii " "
	.ascii "compress_gzip..import"
	.ascii " "
	.ascii "context"
	.ascii " "
	.ascii "context..import"
	.ascii " "
	.ascii "base64"
	.ascii " "
	.ascii "encoding_base64..import"
	.ascii " "
	.ascii "binary"
	.ascii " "
	.ascii "encoding_binary..import"
	.ascii " "
	.ascii "json"
	.ascii " "
	.ascii "encoding_json..import"
	.ascii " "
	.ascii "fmt"
	.ascii " "
	.ascii "fmt..import"
	.ascii " "
	.ascii "proto"
	.ascii " "
	.ascii "github_com_gogo_protobuf_proto..import"
	.ascii " "
	.ascii "proto"
	.ascii " "
	.ascii "github_com_golang_protobuf_proto..import"
	.ascii " "
	.ascii "colornames"
	.ascii " "
	.ascii "golang_org_x_image_colornames..import"
	.ascii " "
	.ascii "matcha"
	.ascii " "
	.ascii "gomatcha_io_matcha..import"
	.ascii " "
	.ascii "application"
	.ascii " "
	.ascii "gomatcha_io_matcha_application..import"
	.ascii " "
