; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22application\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/gogo/protobuf/proto\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/gogo/protobuf/proto\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22colornames\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22golang.org/x/image/colornames\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./app.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha/application")
!3 = !{}
!4 = !{!5, !98, !129, !131, !139, !141, !171}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.OrientationNotifier", linkageName: "command_line_arguments.OrientationNotifier", scope: !1, file: !7, line: 75, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "app.go", directory: ".")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "IntNotifier", file: !7, line: 24, size: 128, align: 8, elements: !9)
!9 = !{!10, !97}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 24, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*__go_descriptor)Id,*func(*void,Id)void,*func(*void)int}", file: !13, size: 256, align: 8, elements: !14)
!13 = !DIFile(filename: "", directory: "")
!14 = !{!15, !76, !89, !93}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !13, line: 24, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !18, line: 1, size: 576, align: 8, elements: !19)
!18 = !DIFile(filename: "<built-in>", directory: "")
!19 = !{!20, !22, !23, !25, !27, !28, !29, !39, !48, !50, !57, !75}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !18, line: 1, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !18, line: 1, baseType: !21, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !18, line: 1, baseType: !24, size: 32, align: 32, offset: 128)
!24 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !18, line: 1, baseType: !26, size: 8, align: 8, offset: 160)
!26 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !18, line: 1, baseType: !26, size: 8, align: 8, offset: 168)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !18, line: 1, baseType: !26, size: 8, align: 8, offset: 176)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !18, line: 1, baseType: !30, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !18, line: 1, size: 64, align: 8, elements: !32)
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !18, line: 1, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{!21, !37, !21}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIBasicType(name: "void")
!39 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !18, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !18, line: 1, size: 64, align: 8, elements: !42)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !18, line: 1, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !37, !37}
!47 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !18, line: 1, baseType: !49, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !18, line: 1, baseType: !51, size: 64, align: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !18, line: 1, size: 128, align: 8, elements: !53)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !18, line: 1, baseType: !49, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !18, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !18, line: 1, baseType: !58, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !18, line: 1, size: 320, align: 8, elements: !60)
!60 = !{!61, !62, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !18, line: 1, baseType: !51, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !18, line: 1, baseType: !51, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !18, line: 1, baseType: !64, size: 192, align: 64, offset: 128)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !13, size: 192, align: 8, elements: !65)
!65 = !{!66, !73, !74}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !13, line: 1, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !18, line: 1, size: 320, align: 8, elements: !69)
!69 = !{!61, !62, !70, !71, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !18, line: 1, baseType: !37, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !18, line: 1, baseType: !37, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !18, line: 1, baseType: !37, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !13, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !13, line: 1, baseType: !56, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !18, line: 1, baseType: !37, size: 64, align: 64, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Notify", file: !13, line: 24, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !37, !81}
!80 = !DIBasicType(name: "Id", size: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !83, line: 11, size: 64, align: 8, elements: !84)
!83 = !DIFile(filename: "resource.go", directory: ".")
!84 = !{!85}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !83, line: 11, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!38}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Unnotify", file: !13, line: 24, baseType: !90, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!38, !37, !80}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !13, line: 24, baseType: !94, size: 64, align: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!56, !37}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "command_line_arguments.orientationNotifier", linkageName: "command_line_arguments.orientationNotifier", scope: !1, file: !7, line: 76, type: !100, isLocal: true, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "IntValue", file: !7, line: 24, size: 384, align: 8, elements: !101)
!101 = !{!102, !103, !128}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !7, line: 24, baseType: !56, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "relay", file: !7, line: 24, baseType: !104, size: 256, align: 64, offset: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "Relay", file: !7, line: 24, size: 256, align: 8, elements: !105)
!105 = !{!106, !112, !126, !127}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !7, line: 24, baseType: !107, size: 64, align: 32)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 24, size: 64, align: 8, elements: !108)
!108 = !{!109, !111}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 24, baseType: !110, size: 32, align: 32)
!110 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 24, baseType: !24, size: 32, align: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "subs", file: !7, line: 24, baseType: !113, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !18, line: 1, size: 384, align: 8, elements: !115)
!115 = !{!116, !117, !118, !119, !121, !122, !123, !124, !125}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !18, line: 1, baseType: !56, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !18, line: 1, baseType: !26, size: 8, align: 8, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !18, line: 1, baseType: !26, size: 8, align: 8, offset: 72)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !18, line: 1, baseType: !120, size: 16, align: 16, offset: 80)
!120 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !18, line: 1, baseType: !24, size: 32, align: 32, offset: 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !18, line: 1, baseType: !37, size: 64, align: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !18, line: 1, baseType: !37, size: 64, align: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !18, line: 1, baseType: !21, size: 64, align: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !18, line: 1, baseType: !37, size: 64, align: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", file: !7, line: 24, baseType: !113, size: 64, align: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "maxId", file: !7, line: 24, baseType: !80, size: 64, align: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !7, line: 24, baseType: !107, size: 64, align: 32, offset: 320)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !18, line: 1, type: !24, isLocal: false, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "command_line_arguments.ShakeNotifier", linkageName: "command_line_arguments.ShakeNotifier", scope: !1, file: !7, line: 85, type: !133, isLocal: false, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "Notifier", file: !7, line: 24, size: 128, align: 8, elements: !134)
!134 = !{!135, !97}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 24, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*__go_descriptor)Id,*func(*void,Id)void}", file: !13, size: 192, align: 8, elements: !138)
!138 = !{!15, !76, !89}
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "command_line_arguments.shakeNotifier", linkageName: "command_line_arguments.shakeNotifier", scope: !1, file: !7, line: 86, type: !104, isLocal: true, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "image_color.RGBAModel", linkageName: "image_color.RGBAModel", scope: !1, file: !83, line: 6, type: !143, isLocal: false, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "Model", file: !83, line: 5, size: 128, align: 8, elements: !144)
!144 = !{!145, !170}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !83, line: 5, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Color)Color}", file: !13, size: 128, align: 8, elements: !148)
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !13, line: 5, baseType: !16, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Convert", file: !13, line: 5, baseType: !151, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!154, !37, !154}
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", file: !7, line: 24, size: 128, align: 8, elements: !155)
!155 = !{!156, !97}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 24, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{uint32,uint32,uint32,uint32}}", file: !13, size: 128, align: 8, elements: !159)
!159 = !{!15, !160}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "RGBA", file: !13, line: 24, baseType: !161, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!164, !37}
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{uint32,uint32,uint32,uint32}", file: !13, size: 128, align: 8, elements: !165)
!165 = !{!166, !167, !168, !169}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !13, line: 24, baseType: !24, size: 32, align: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !13, line: 24, baseType: !24, size: 32, align: 32, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !13, line: 24, baseType: !24, size: 32, align: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "a", file: !13, line: 24, baseType: !24, size: 32, align: 32, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !83, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "golang_org_x_image_colornames.Black", linkageName: "golang_org_x_image_colornames.Black", scope: !1, file: !83, line: 9, type: !173, isLocal: false, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "RGBA", file: !83, line: 5, size: 32, align: 8, elements: !174)
!174 = !{!175, !176, !177, !178}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "R", file: !83, line: 5, baseType: !26, size: 8, align: 8)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "G", file: !83, line: 5, baseType: !26, size: 8, align: 8, offset: 8)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !83, line: 5, baseType: !26, size: 8, align: 8, offset: 16)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "A", file: !83, line: 5, baseType: !26, size: 8, align: 8, offset: 24)
!179 = distinct !DISubprogram(name: "application.OpenURL", linkageName: "command_line_arguments.OpenURL", scope: null, file: !7, line: 33, type: !180, isLocal: false, isDefinition: true, scopeLine: 33, isOptimized: false, unit: !1, retainedNodes: !3)
!180 = !DISubroutineType(types: !181)
!181 = !{!182, !52}
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !18, line: 1, size: 128, align: 8, elements: !183)
!183 = !{!184, !193}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !18, line: 1, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !13, size: 128, align: 8, elements: !187)
!187 = !{!188, !189}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !13, line: 1, baseType: !16, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !13, line: 1, baseType: !190, size: 64, align: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!52, !37}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !18, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!194 = !DILocalVariable(name: "url", arg: 1, scope: !179, file: !7, line: 33, type: !52)
!195 = !DILocation(line: 33, column: 14, scope: !179)
!196 = !DILocalVariable(name: "success", scope: !197, file: !7, line: 34, type: !47)
!197 = distinct !DILexicalBlock(scope: !179, file: !7, line: 33, column: 1)
!198 = !DILocation(line: 34, column: 2, scope: !179)
!199 = !DILocation(line: 38, column: 20, scope: !197)
!200 = !DILocation(line: 38, column: 55, scope: !197)
!201 = !DILocation(line: 38, column: 30, scope: !197)
!202 = !DILocation(line: 38, column: 67, scope: !197)
!203 = !DILocation(line: 40, column: 5, scope: !197)
!204 = !DILocation(line: 41, column: 17, scope: !197)
!205 = !DILocation(line: 41, column: 3, scope: !197)
!206 = !DILocalVariable(name: "$ret0", scope: !179, file: !7, line: 33, type: !182)
!207 = !DILocation(line: 33, column: 26, scope: !179)
!208 = !DILocation(line: 43, column: 2, scope: !197)
!209 = distinct !DISubprogram(name: "application.Orientation", linkageName: "command_line_arguments.Orientation", scope: null, file: !7, line: 62, type: !210, isLocal: false, isDefinition: true, scopeLine: 62, isOptimized: false, unit: !1, retainedNodes: !3)
!210 = !DISubroutineType(types: !211)
!211 = !{!212}
!212 = !DIBasicType(name: "Edge", size: 64, encoding: DW_ATE_signed)
!213 = !DILocalVariable(name: "$ret2", scope: !209, file: !7, line: 62, type: !212)
!214 = !DILocation(line: 62, column: 20, scope: !209)
!215 = !DILocalVariable(name: "o", scope: !216, file: !7, line: 63, type: !217)
!216 = distinct !DILexicalBlock(scope: !209, file: !7, line: 62, column: 1)
!217 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!218 = !DILocation(line: 63, column: 6, scope: !209)
!219 = !DILocation(line: 67, column: 14, scope: !216)
!220 = !DILocation(line: 67, column: 24, scope: !216)
!221 = !DILocation(line: 67, column: 44, scope: !216)
!222 = !DILocation(line: 69, column: 2, scope: !216)
!223 = distinct !DISubprogram(name: "application.command_line_arguments..init0", linkageName: "command_line_arguments.command_line_arguments..init0", scope: null, file: !7, line: 78, type: !87, isLocal: false, isDefinition: true, scopeLine: 78, isOptimized: false, unit: !1, retainedNodes: !3)
!224 = !DILocation(line: 79, column: 22, scope: !223)
!225 = !DILocation(line: 80, column: 71, scope: !223)
!226 = !DILocation(line: 80, column: 9, scope: !223)
!227 = distinct !DISubprogram(name: "application.command_line_arguments..init0..func1", scope: null, file: !7, line: 80, type: !228, isLocal: true, isDefinition: true, scopeLine: 80, isOptimized: false, unit: !1, retainedNodes: !3)
!228 = !DISubroutineType(types: !229)
!229 = !{!38, !56}
!230 = !DILocalVariable(name: "v", arg: 1, scope: !227, file: !7, line: 80, type: !56)
!231 = !DILocation(line: 80, column: 76, scope: !227)
!232 = !DILocation(line: 81, column: 22, scope: !227)
!233 = distinct !DISubprogram(name: "application.command_line_arguments..init1", linkageName: "command_line_arguments.command_line_arguments..init1", scope: null, file: !7, line: 88, type: !87, isLocal: false, isDefinition: true, scopeLine: 88, isOptimized: false, unit: !1, retainedNodes: !3)
!234 = !DILocation(line: 89, column: 16, scope: !233)
!235 = !DILocation(line: 90, column: 64, scope: !233)
!236 = !DILocation(line: 90, column: 9, scope: !233)
!237 = distinct !DISubprogram(name: "application.command_line_arguments..init1..func1", scope: null, file: !7, line: 90, type: !87, isLocal: true, isDefinition: true, scopeLine: 90, isOptimized: false, unit: !1, retainedNodes: !3)
!238 = !DILocation(line: 91, column: 16, scope: !237)
!239 = distinct !DISubprogram(name: "application.command_line_arguments.ImageResource..hash", linkageName: "command_line_arguments.command_line_arguments.ImageResource..hash", scope: null, file: !18, line: 1, type: !35, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!240 = !DILocalVariable(name: "key", arg: 1, scope: !239, file: !18, line: 1, type: !37)
!241 = !DILocation(line: 1, column: 1, scope: !239)
!242 = !DILocalVariable(name: "seed", arg: 2, scope: !239, file: !18, line: 1, type: !21)
!243 = !DILocalVariable(name: "$ret12", scope: !239, file: !18, line: 1, type: !21)
!244 = distinct !DISubprogram(name: "application.command_line_arguments.ImageResource..eq", linkageName: "command_line_arguments.command_line_arguments.ImageResource..eq", scope: null, file: !18, line: 1, type: !45, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!245 = !DILocalVariable(name: "key1", arg: 1, scope: !244, file: !18, line: 1, type: !37)
!246 = !DILocation(line: 1, column: 1, scope: !244)
!247 = !DILocalVariable(name: "key2", arg: 2, scope: !244, file: !18, line: 1, type: !37)
!248 = !DILocalVariable(name: "$ret13", scope: !244, file: !18, line: 1, type: !47)
!249 = distinct !DISubprogram(name: "application.At..1command_line_arguments.ImageResource", linkageName: "command_line_arguments.ImageResource.At", scope: null, file: !83, line: 94, type: !250, isLocal: false, isDefinition: true, scopeLine: 94, isOptimized: false, unit: !1, retainedNodes: !3)
!250 = !DISubroutineType(types: !251)
!251 = !{!154, !252, !252, !56, !56}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImageResource", file: !83, line: 42, size: 576, align: 8, elements: !254)
!254 = !{!255, !256, !265, !284}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "path", file: !83, line: 43, baseType: !52, size: 128, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "rect", file: !83, line: 44, baseType: !257, size: 256, align: 64, offset: 128)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rectangle", file: !83, line: 5, size: 256, align: 8, elements: !258)
!258 = !{!259, !264}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Min", file: !83, line: 5, baseType: !260, size: 128, align: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "Point", file: !83, line: 5, size: 128, align: 8, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "X", file: !83, line: 5, baseType: !56, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Y", file: !83, line: 5, baseType: !56, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Max", file: !83, line: 5, baseType: !260, size: 128, align: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "image", file: !83, line: 45, baseType: !266, size: 128, align: 64, offset: 384)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !83, line: 5, size: 128, align: 8, elements: !267)
!267 = !{!268, !170}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !83, line: 5, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,int,int)Color,*func(*void)Rectangle,*func(*void)Model}", file: !13, size: 256, align: 8, elements: !271)
!271 = !{!149, !272, !276, !280}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "At", file: !13, line: 5, baseType: !273, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!154, !37, !56, !56}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Bounds", file: !13, line: 5, baseType: !277, size: 64, align: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!257, !37}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ColorModel", file: !13, line: 5, baseType: !281, size: 64, align: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!143, !37}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "scale", file: !83, line: 46, baseType: !285, size: 64, align: 64, offset: 512)
!285 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!286 = !DILocalVariable(name: "res", arg: 1, scope: !249, file: !83, line: 94, type: !252)
!287 = !DILocation(line: 94, column: 1, scope: !249)
!288 = !DILocalVariable(name: "x", arg: 2, scope: !249, file: !83, line: 94, type: !56)
!289 = !DILocation(line: 94, column: 30, scope: !249)
!290 = !DILocalVariable(name: "y", arg: 3, scope: !249, file: !83, line: 94, type: !56)
!291 = !DILocation(line: 94, column: 33, scope: !249)
!292 = !DILocation(line: 95, column: 8, scope: !249)
!293 = !DILocation(line: 95, column: 15, scope: !249)
!294 = !DILocation(line: 96, column: 6, scope: !249)
!295 = !DILocation(line: 98, column: 18, scope: !249)
!296 = !DILocation(line: 98, column: 2, scope: !249)
!297 = distinct !DISubprogram(name: "application.Bounds..1command_line_arguments.ImageResource", linkageName: "command_line_arguments.ImageResource.Bounds", scope: null, file: !83, line: 89, type: !298, isLocal: false, isDefinition: true, scopeLine: 89, isOptimized: false, unit: !1, retainedNodes: !3)
!298 = !DISubroutineType(types: !299)
!299 = !{!257, !252, !252}
!300 = !DILocalVariable(name: "res", arg: 1, scope: !297, file: !83, line: 89, type: !252)
!301 = !DILocation(line: 89, column: 1, scope: !297)
!302 = !DILocation(line: 90, column: 12, scope: !297)
!303 = !DILocation(line: 90, column: 2, scope: !297)
!304 = distinct !DISubprogram(name: "application.ColorModel..1command_line_arguments.ImageResource", linkageName: "command_line_arguments.ImageResource.ColorModel", scope: null, file: !83, line: 81, type: !305, isLocal: false, isDefinition: true, scopeLine: 81, isOptimized: false, unit: !1, retainedNodes: !3)
!305 = !DISubroutineType(types: !306)
!306 = !{!143, !252, !252}
!307 = !DILocalVariable(name: "res", arg: 1, scope: !304, file: !83, line: 81, type: !252)
!308 = !DILocation(line: 81, column: 1, scope: !304)
!309 = !DILocation(line: 82, column: 8, scope: !304)
!310 = !DILocation(line: 82, column: 15, scope: !304)
!311 = !DILocation(line: 83, column: 3, scope: !304)
!312 = !DILocalVariable(name: "$ret6", scope: !304, file: !83, line: 81, type: !143)
!313 = !DILocation(line: 81, column: 40, scope: !304)
!314 = !DILocation(line: 85, column: 18, scope: !304)
!315 = !DILocation(line: 85, column: 2, scope: !304)
!316 = distinct !DISubprogram(name: "application.MarshalProtobuf..1command_line_arguments.ImageResource", linkageName: "command_line_arguments.ImageResource.MarshalProtobuf", scope: null, file: !83, line: 128, type: !317, isLocal: false, isDefinition: true, scopeLine: 128, isOptimized: false, unit: !1, retainedNodes: !3)
!317 = !DISubroutineType(types: !318)
!318 = !{!319, !252, !252}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImageResource", file: !83, line: 14, size: 128, align: 8, elements: !321)
!321 = !{!322}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !83, line: 14, baseType: !52, size: 128, align: 64)
!323 = !DILocalVariable(name: "res", arg: 1, scope: !316, file: !83, line: 128, type: !252)
!324 = !DILocation(line: 128, column: 1, scope: !316)
!325 = !DILocalVariable(name: "$ret11", scope: !316, file: !83, line: 128, type: !319)
!326 = !DILocation(line: 128, column: 45, scope: !316)
!327 = !DILocation(line: 129, column: 9, scope: !316)
!328 = !DILocation(line: 130, column: 3, scope: !316)
!329 = !DILocation(line: 132, column: 9, scope: !316)
!330 = !DILocation(line: 132, column: 14, scope: !316)
!331 = !DILocation(line: 132, column: 2, scope: !316)
!332 = distinct !DISubprogram(name: "application.Path..1command_line_arguments.ImageResource", linkageName: "command_line_arguments.ImageResource.Path", scope: null, file: !83, line: 107, type: !333, isLocal: false, isDefinition: true, scopeLine: 107, isOptimized: false, unit: !1, retainedNodes: !3)
!333 = !DISubroutineType(types: !334)
!334 = !{!52, !252, !252}
!335 = !DILocalVariable(name: "res", arg: 1, scope: !332, file: !83, line: 107, type: !252)
!336 = !DILocation(line: 107, column: 1, scope: !332)
!337 = !DILocation(line: 108, column: 12, scope: !332)
!338 = !DILocation(line: 108, column: 2, scope: !332)
!339 = !DILocalVariable(name: "$ret10", scope: !332, file: !83, line: 107, type: !52)
!340 = !DILocation(line: 107, column: 34, scope: !332)
!341 = distinct !DISubprogram(name: "application.Scale..1command_line_arguments.ImageResource", linkageName: "command_line_arguments.ImageResource.Scale", scope: null, file: !83, line: 102, type: !342, isLocal: false, isDefinition: true, scopeLine: 102, isOptimized: false, unit: !1, retainedNodes: !3)
!342 = !DISubroutineType(types: !343)
!343 = !{!285, !252, !252}
!344 = !DILocalVariable(name: "res", arg: 1, scope: !341, file: !83, line: 102, type: !252)
!345 = !DILocation(line: 102, column: 1, scope: !341)
!346 = !DILocalVariable(name: "$ret9", scope: !341, file: !83, line: 102, type: !285)
!347 = !DILocation(line: 102, column: 35, scope: !341)
!348 = !DILocation(line: 103, column: 12, scope: !341)
!349 = !DILocation(line: 103, column: 2, scope: !341)
!350 = distinct !DISubprogram(name: "application.load..1command_line_arguments.ImageResource", linkageName: "command_line_arguments.ImageResource.load", scope: null, file: !83, line: 111, type: !351, isLocal: false, isDefinition: true, scopeLine: 111, isOptimized: false, unit: !1, retainedNodes: !3)
!351 = !DISubroutineType(types: !352)
!352 = !{!38, !252, !252}
!353 = !DILocalVariable(name: "res", arg: 1, scope: !350, file: !83, line: 111, type: !252)
!354 = !DILocation(line: 111, column: 1, scope: !350)
!355 = !DILocalVariable(name: "data", scope: !356, file: !83, line: 112, type: !357)
!356 = distinct !DILexicalBlock(scope: !350, file: !83, line: 111, column: 1)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !13, size: 192, align: 8, elements: !358)
!358 = !{!359, !73, !74}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !13, line: 1, baseType: !49, size: 64, align: 64)
!360 = !DILocation(line: 112, column: 6, scope: !350)
!361 = !DILocation(line: 118, column: 18, scope: !356)
!362 = !DILocalVariable(name: "reader", scope: !356, file: !83, line: 118, type: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !83, line: 4, size: 320, align: 8, elements: !365)
!365 = !{!366, !367, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "s", file: !83, line: 4, baseType: !357, size: 192, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i", file: !83, line: 4, baseType: !217, size: 64, align: 64, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "prevRune", file: !83, line: 4, baseType: !56, size: 64, align: 64, offset: 256)
!369 = !DILocation(line: 118, column: 2, scope: !350)
!370 = !DILocation(line: 119, column: 30, scope: !356)
!371 = !DILocation(line: 119, column: 23, scope: !356)
!372 = !DILocalVariable(name: "err", scope: !356, file: !83, line: 119, type: !182)
!373 = !DILocation(line: 119, column: 2, scope: !350)
!374 = !DILocation(line: 120, column: 9, scope: !356)
!375 = !DILocation(line: 121, column: 43, scope: !356)
!376 = !DILocation(line: 121, column: 21, scope: !356)
!377 = !DILocation(line: 121, column: 6, scope: !356)
!378 = !DILocation(line: 124, column: 5, scope: !356)
!379 = !DILocation(line: 121, column: 13, scope: !356)
!380 = !DILocation(line: 122, column: 3, scope: !356)
!381 = !DILocation(line: 124, column: 12, scope: !356)
!382 = distinct !DISubprogram(name: "application.LoadImage", linkageName: "command_line_arguments.LoadImage", scope: null, file: !83, line: 50, type: !383, isLocal: false, isDefinition: true, scopeLine: 50, isOptimized: false, unit: !1, retainedNodes: !3)
!383 = !DISubroutineType(types: !384)
!384 = !{!385, !52}
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ImageResource,error}", file: !13, size: 192, align: 8, elements: !386)
!386 = !{!387, !388}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !13, line: 50, baseType: !252, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !13, line: 50, baseType: !182, size: 128, align: 64, offset: 64)
!389 = !DILocalVariable(name: "path", arg: 1, scope: !382, file: !83, line: 50, type: !52)
!390 = !DILocation(line: 50, column: 16, scope: !382)
!391 = !DILocalVariable(name: "$ret3", scope: !382, file: !83, line: 50, type: !252)
!392 = !DILocation(line: 50, column: 30, scope: !382)
!393 = !DILocation(line: 57, column: 11, scope: !394)
!394 = distinct !DILexicalBlock(scope: !382, file: !83, line: 50, column: 1)
!395 = !DILocalVariable(name: "props", scope: !394, file: !83, line: 57, type: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImageProperties", file: !83, line: 13, size: 192, align: 8, elements: !398)
!398 = !{!399, !400, !401}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Width", file: !83, line: 13, baseType: !217, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Height", file: !83, line: 13, baseType: !217, size: 64, align: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Scale", file: !83, line: 13, baseType: !285, size: 64, align: 64, offset: 128)
!402 = !DILocation(line: 57, column: 2, scope: !382)
!403 = !DILocation(line: 58, column: 35, scope: !394)
!404 = !DILocalVariable(name: "propData", scope: !394, file: !83, line: 51, type: !357)
!405 = !DILocation(line: 51, column: 6, scope: !382)
!406 = !DILocation(line: 58, column: 15, scope: !394)
!407 = !DILocalVariable(name: "err", scope: !394, file: !83, line: 58, type: !182)
!408 = !DILocation(line: 58, column: 2, scope: !382)
!409 = !DILocation(line: 59, column: 9, scope: !394)
!410 = !DILocalVariable(name: "$ret4", scope: !382, file: !83, line: 50, type: !182)
!411 = !DILocation(line: 50, column: 46, scope: !382)
!412 = !DILocation(line: 60, column: 3, scope: !394)
!413 = !DILocation(line: 65, column: 36, scope: !394)
!414 = !DILocation(line: 65, column: 54, scope: !394)
!415 = !DILocation(line: 65, column: 16, scope: !394)
!416 = !DILocation(line: 67, column: 15, scope: !394)
!417 = !DILocation(line: 63, column: 9, scope: !394)
!418 = !DILocation(line: 63, column: 10, scope: !394)
!419 = !DILocation(line: 63, column: 2, scope: !394)
!420 = distinct !DISubprogram(name: "application.MustLoadImage", linkageName: "command_line_arguments.MustLoadImage", scope: null, file: !83, line: 72, type: !421, isLocal: false, isDefinition: true, scopeLine: 72, isOptimized: false, unit: !1, retainedNodes: !3)
!421 = !DISubroutineType(types: !422)
!422 = !{!252, !52}
!423 = !DILocalVariable(name: "path", arg: 1, scope: !420, file: !83, line: 72, type: !52)
!424 = !DILocation(line: 72, column: 20, scope: !420)
!425 = !DILocalVariable(name: "$ret5", scope: !420, file: !83, line: 72, type: !252)
!426 = !DILocation(line: 72, column: 33, scope: !420)
!427 = !DILocation(line: 73, column: 14, scope: !428)
!428 = distinct !DILexicalBlock(scope: !420, file: !83, line: 72, column: 1)
!429 = !DILocalVariable(name: "err", scope: !428, file: !83, line: 73, type: !182)
!430 = !DILocation(line: 73, column: 2, scope: !420)
!431 = !DILocation(line: 74, column: 9, scope: !428)
!432 = !DILocation(line: 75, column: 12, scope: !428)
!433 = !DILocation(line: 75, column: 3, scope: !428)
!434 = !DILocalVariable(name: "res", scope: !428, file: !83, line: 73, type: !252)
!435 = !DILocation(line: 77, column: 2, scope: !428)
!436 = distinct !DISubprogram(name: "application.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", linkageName: "command_line_arguments.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", scope: null, file: !18, line: 1, type: !35, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!437 = !DILocalVariable(name: "key", arg: 1, scope: !436, file: !18, line: 1, type: !37)
!438 = !DILocation(line: 1, column: 1, scope: !436)
!439 = !DILocalVariable(name: "seed", arg: 2, scope: !436, file: !18, line: 1, type: !21)
!440 = !DILocalVariable(name: "$ret22", scope: !436, file: !18, line: 1, type: !21)
!441 = distinct !DISubprogram(name: "application.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", linkageName: "command_line_arguments.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", scope: null, file: !18, line: 1, type: !45, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!442 = !DILocalVariable(name: "key1", arg: 1, scope: !441, file: !18, line: 1, type: !37)
!443 = !DILocation(line: 1, column: 1, scope: !441)
!444 = !DILocalVariable(name: "key2", arg: 2, scope: !441, file: !18, line: 1, type: !37)
!445 = !DILocalVariable(name: "$ret23", scope: !441, file: !18, line: 1, type: !47)
!446 = distinct !DISubprogram(name: "application.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 17, type: !87, isLocal: false, isDefinition: true, scopeLine: 17, isOptimized: false, unit: !1, retainedNodes: !3)
!447 = !DILocation(line: 1, column: 1, scope: !448)
