; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22cobra\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/spf13/cobra\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/spf13/cobra\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22cmd\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22gomatcha.io/matcha/cmd\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22gomatcha.io/matcha/cmd\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22log\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./main.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha/cmd/matcha")
!3 = !{}
!4 = !{!5, !308, !310, !312, !314, !316, !318, !320, !322, !324, !326, !328, !379}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "main.RootCmd", linkageName: "main.RootCmd", scope: !1, file: !7, line: 20, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "main.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "Command", file: !7, line: 9, size: 4800, align: 8, elements: !10)
!10 = !{!11, !20, !28, !29, !30, !31, !32, !33, !102, !103, !104, !105, !106, !120, !121, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !147, !151, !152, !153, !154, !155, !156, !161, !162, !177, !281, !282, !283, !284, !285, !286, !287, !295, !296, !304, !305, !306, !307}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "Use", file: !7, line: 9, baseType: !12, size: 128, align: 64)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !13, line: 1, size: 128, align: 8, elements: !14)
!13 = !DIFile(filename: "<built-in>", directory: "")
!14 = !{!15, !18}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !13, line: 1, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !13, line: 1, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Aliases", file: !7, line: 9, baseType: !21, size: 192, align: 64, offset: 128)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !22, size: 192, align: 8, elements: !23)
!22 = !DIFile(filename: "", directory: "")
!23 = !{!24, !26, !27}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !22, line: 1, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !22, line: 1, baseType: !19, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !22, line: 1, baseType: !19, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "SuggestFor", file: !7, line: 9, baseType: !21, size: 192, align: 64, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "Short", file: !7, line: 9, baseType: !12, size: 128, align: 64, offset: 512)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Long", file: !7, line: 9, baseType: !12, size: 128, align: 64, offset: 640)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Example", file: !7, line: 9, baseType: !12, size: 128, align: 64, offset: 768)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ValidArgs", file: !7, line: 9, baseType: !21, size: 192, align: 64, offset: 896)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "Args", file: !7, line: 9, baseType: !34, size: 64, align: 64, offset: 1088)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 9, size: 64, align: 8, elements: !36)
!36 = !{!37}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 9, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !67, !21}
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !13, line: 1, size: 128, align: 8, elements: !42)
!42 = !{!43, !101}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !13, line: 1, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !22, size: 128, align: 8, elements: !46)
!46 = !{!47, !97}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !22, line: 1, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !13, line: 1, size: 576, align: 8, elements: !50)
!50 = !{!51, !53, !54, !56, !57, !58, !59, !69, !78, !79, !80, !96}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !13, line: 1, baseType: !52, size: 64, align: 64)
!52 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !13, line: 1, baseType: !52, size: 64, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !13, line: 1, baseType: !55, size: 32, align: 32, offset: 128)
!55 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !13, line: 1, baseType: !17, size: 8, align: 8, offset: 160)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !13, line: 1, baseType: !17, size: 8, align: 8, offset: 168)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !13, line: 1, baseType: !17, size: 8, align: 8, offset: 176)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !13, line: 1, baseType: !60, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !13, line: 1, size: 64, align: 8, elements: !62)
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !13, line: 1, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!52, !67, !52}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIBasicType(name: "void")
!69 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !13, line: 1, baseType: !70, size: 64, align: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !13, line: 1, size: 64, align: 8, elements: !72)
!72 = !{!73}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !13, line: 1, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !67, !67}
!77 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !13, line: 1, baseType: !16, size: 64, align: 64, offset: 320)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !13, line: 1, baseType: !25, size: 64, align: 64, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !13, line: 1, baseType: !81, size: 64, align: 64, offset: 448)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !13, line: 1, size: 320, align: 8, elements: !83)
!83 = !{!84, !85, !86}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !13, line: 1, baseType: !25, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !13, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !13, line: 1, baseType: !87, size: 192, align: 64, offset: 128)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !22, size: 192, align: 8, elements: !88)
!88 = !{!89, !26, !27}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !22, line: 1, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !13, line: 1, size: 320, align: 8, elements: !92)
!92 = !{!84, !85, !93, !94, !95}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !13, line: 1, baseType: !67, size: 64, align: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !13, line: 1, baseType: !67, size: 64, align: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !13, line: 1, baseType: !67, size: 64, align: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !13, line: 1, baseType: !67, size: 64, align: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !22, line: 1, baseType: !98, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!12, !67}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !13, line: 1, baseType: !67, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ArgAliases", file: !7, line: 9, baseType: !21, size: 192, align: 64, offset: 1152)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "BashCompletionFunction", file: !7, line: 9, baseType: !12, size: 128, align: 64, offset: 1344)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Deprecated", file: !7, line: 9, baseType: !12, size: 128, align: 64, offset: 1472)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Hidden", file: !7, line: 9, baseType: !77, size: 8, align: 8, offset: 1600)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Annotations", file: !7, line: 9, baseType: !107, size: 64, align: 64, offset: 1664)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !13, line: 1, size: 384, align: 8, elements: !109)
!109 = !{!110, !111, !112, !113, !115, !116, !117, !118, !119}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !13, line: 1, baseType: !19, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !13, line: 1, baseType: !17, size: 8, align: 8, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !13, line: 1, baseType: !17, size: 8, align: 8, offset: 72)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !13, line: 1, baseType: !114, size: 16, align: 16, offset: 80)
!114 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !13, line: 1, baseType: !55, size: 32, align: 32, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !13, line: 1, baseType: !67, size: 64, align: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !13, line: 1, baseType: !67, size: 64, align: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !13, line: 1, baseType: !52, size: 64, align: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !13, line: 1, baseType: !67, size: 64, align: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !7, line: 9, baseType: !12, size: 128, align: 64, offset: 1728)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "PersistentPreRun", file: !7, line: 9, baseType: !122, size: 64, align: 64, offset: 1856)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 9, size: 64, align: 8, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 9, baseType: !67, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "PersistentPreRunE", file: !7, line: 9, baseType: !34, size: 64, align: 64, offset: 1920)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "PreRun", file: !7, line: 9, baseType: !122, size: 64, align: 64, offset: 1984)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "PreRunE", file: !7, line: 9, baseType: !34, size: 64, align: 64, offset: 2048)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Run", file: !7, line: 9, baseType: !122, size: 64, align: 64, offset: 2112)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "RunE", file: !7, line: 9, baseType: !34, size: 64, align: 64, offset: 2176)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "PostRun", file: !7, line: 9, baseType: !122, size: 64, align: 64, offset: 2240)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "PostRunE", file: !7, line: 9, baseType: !34, size: 64, align: 64, offset: 2304)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "PersistentPostRun", file: !7, line: 9, baseType: !122, size: 64, align: 64, offset: 2368)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "PersistentPostRunE", file: !7, line: 9, baseType: !34, size: 64, align: 64, offset: 2432)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "SilenceErrors", file: !7, line: 9, baseType: !77, size: 8, align: 8, offset: 2496)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "SilenceUsage", file: !7, line: 9, baseType: !77, size: 8, align: 8, offset: 2504)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "DisableFlagParsing", file: !7, line: 9, baseType: !77, size: 8, align: 8, offset: 2512)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "DisableAutoGenTag", file: !7, line: 9, baseType: !77, size: 8, align: 8, offset: 2520)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "DisableFlagsInUseLine", file: !7, line: 9, baseType: !77, size: 8, align: 8, offset: 2528)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "DisableSuggestions", file: !7, line: 9, baseType: !77, size: 8, align: 8, offset: 2536)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "SuggestionsMinimumDistance", file: !7, line: 9, baseType: !19, size: 64, align: 64, offset: 2560)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "TraverseChildren", file: !7, line: 9, baseType: !77, size: 8, align: 8, offset: 2624)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "FParseErrWhitelist", file: !7, line: 9, baseType: !144, size: 8, align: 8, offset: 2632)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "FParseErrWhitelist", file: !7, line: 9, size: 8, align: 8, elements: !145)
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownFlags", file: !7, line: 9, baseType: !77, size: 8, align: 8)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "commands", file: !7, line: 9, baseType: !148, size: 192, align: 64, offset: 2688)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Command,int,int}", file: !22, size: 192, align: 8, elements: !149)
!149 = !{!150, !26, !27}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !22, line: 1, baseType: !67, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !7, line: 9, baseType: !67, size: 64, align: 64, offset: 2880)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "commandsMaxUseLen", file: !7, line: 9, baseType: !19, size: 64, align: 64, offset: 2944)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "commandsMaxCommandPathLen", file: !7, line: 9, baseType: !19, size: 64, align: 64, offset: 3008)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "commandsMaxNameLen", file: !7, line: 9, baseType: !19, size: 64, align: 64, offset: 3072)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "commandsAreSorted", file: !7, line: 9, baseType: !77, size: 8, align: 8, offset: 3136)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "commandCalledAs", file: !7, line: 9, baseType: !157, size: 192, align: 64, offset: 3200)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,bool}", file: !22, size: 192, align: 8, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !22, line: 9, baseType: !12, size: 128, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "called", file: !22, line: 9, baseType: !77, size: 8, align: 8, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "args", file: !7, line: 9, baseType: !21, size: 192, align: 64, offset: 3392)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "flagErrorBuf", file: !7, line: 9, baseType: !163, size: 64, align: 64, offset: 3584)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", file: !7, line: 9, size: 832, align: 8, elements: !165)
!165 = !{!166, !170, !171, !175}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 9, baseType: !167, size: 192, align: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !22, size: 192, align: 8, elements: !168)
!168 = !{!169, !26, !27}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !22, line: 1, baseType: !16, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "off", file: !7, line: 9, baseType: !19, size: 64, align: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "bootstrap", file: !7, line: 9, baseType: !172, size: 512, align: 8, offset: 256)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 512, align: 1, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "lastRead", file: !7, line: 9, baseType: !176, size: 8, align: 8, offset: 768)
!176 = !DIBasicType(name: ".bytes.readOp", size: 8, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 9, baseType: !178, size: 64, align: 64, offset: 3648)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "FlagSet", file: !7, line: 9, size: 2048, align: 8, elements: !180)
!180 = !{!181, !189, !190, !192, !193, !194, !195, !228, !229, !230, !231, !232, !233, !234, !235, !237, !253, !254, !266}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Usage", file: !7, line: 9, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 9, size: 64, align: 8, elements: !184)
!184 = !{!185}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 9, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!68}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "SortFlags", file: !7, line: 9, baseType: !77, size: 8, align: 8, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ParseErrorsWhitelist", file: !7, line: 9, baseType: !191, size: 8, align: 8, offset: 72)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParseErrorsWhitelist", file: !7, line: 9, size: 8, align: 8, elements: !145)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 9, baseType: !12, size: 128, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "parsed", file: !7, line: 9, baseType: !77, size: 8, align: 8, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "actual", file: !7, line: 9, baseType: !107, size: 64, align: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "orderedActual", file: !7, line: 9, baseType: !196, size: 192, align: 64, offset: 384)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Flag,int,int}", file: !22, size: 192, align: 8, elements: !197)
!197 = !{!198, !26, !27}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !22, line: 1, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", file: !7, line: 9, size: 1216, align: 8, elements: !202)
!202 = !{!203, !204, !205, !206, !221, !222, !223, !224, !225, !226, !227}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !7, line: 9, baseType: !12, size: 128, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Shorthand", file: !7, line: 9, baseType: !12, size: 128, align: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Usage", file: !7, line: 9, baseType: !12, size: 128, align: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 9, baseType: !207, size: 128, align: 64, offset: 384)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !7, line: 9, size: 128, align: 8, elements: !208)
!208 = !{!209, !220}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 9, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)error,*func(*void)string,*func(*void)string}", file: !22, size: 256, align: 8, elements: !212)
!212 = !{!213, !214, !218, !219}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !22, line: 9, baseType: !48, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Set", file: !22, line: 9, baseType: !215, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!41, !67, !12}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !22, line: 9, baseType: !98, size: 64, align: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !22, line: 9, baseType: !98, size: 64, align: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !67, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "DefValue", file: !7, line: 9, baseType: !12, size: 128, align: 64, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Changed", file: !7, line: 9, baseType: !77, size: 8, align: 8, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "NoOptDefVal", file: !7, line: 9, baseType: !12, size: 128, align: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Deprecated", file: !7, line: 9, baseType: !12, size: 128, align: 64, offset: 832)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Hidden", file: !7, line: 9, baseType: !77, size: 8, align: 8, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ShorthandDeprecated", file: !7, line: 9, baseType: !12, size: 128, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Annotations", file: !7, line: 9, baseType: !107, size: 64, align: 64, offset: 1152)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "sortedActual", file: !7, line: 9, baseType: !196, size: 192, align: 64, offset: 576)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "formal", file: !7, line: 9, baseType: !107, size: 64, align: 64, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "orderedFormal", file: !7, line: 9, baseType: !196, size: 192, align: 64, offset: 832)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "sortedFormal", file: !7, line: 9, baseType: !196, size: 192, align: 64, offset: 1024)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "shorthands", file: !7, line: 9, baseType: !107, size: 64, align: 64, offset: 1216)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "args", file: !7, line: 9, baseType: !21, size: 192, align: 64, offset: 1280)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "argsLenAtDash", file: !7, line: 9, baseType: !19, size: 64, align: 64, offset: 1472)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "errorHandling", file: !7, line: 9, baseType: !236, size: 64, align: 64, offset: 1536)
!236 = !DIBasicType(name: "ErrorHandling", size: 64, encoding: DW_ATE_signed)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "output", file: !7, line: 9, baseType: !238, size: 128, align: 64, offset: 1600)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !7, line: 5, size: 128, align: 8, elements: !239)
!239 = !{!240, !220}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 5, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !22, size: 128, align: 8, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !22, line: 5, baseType: !48, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !22, line: 5, baseType: !246, size: 64, align: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!249, !67, !167}
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !22, size: 192, align: 8, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !22, line: 5, baseType: !19, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !22, line: 5, baseType: !41, size: 128, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "interspersed", file: !7, line: 9, baseType: !77, size: 8, align: 8, offset: 1728)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "normalizeNameFunc", file: !7, line: 9, baseType: !255, size: 64, align: 64, offset: 1792)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 9, size: 64, align: 8, elements: !257)
!257 = !{!258}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 9, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!262, !67, !12}
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "NormalizedName", file: !7, line: 9, size: 128, align: 8, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !16, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !19, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "addedGoFlagSets", file: !7, line: 9, baseType: !267, size: 192, align: 64, offset: 1856)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**FlagSet,int,int}", file: !22, size: 192, align: 8, elements: !268)
!268 = !{!269, !26, !27}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !22, line: 1, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "FlagSet", file: !7, line: 9, size: 768, align: 8, elements: !273)
!273 = !{!181, !274, !275, !276, !277, !278, !279, !280}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 9, baseType: !12, size: 128, align: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "parsed", file: !7, line: 9, baseType: !77, size: 8, align: 8, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "actual", file: !7, line: 9, baseType: !107, size: 64, align: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "formal", file: !7, line: 9, baseType: !107, size: 64, align: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "args", file: !7, line: 9, baseType: !21, size: 192, align: 64, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "errorHandling", file: !7, line: 9, baseType: !236, size: 64, align: 64, offset: 576)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "output", file: !7, line: 9, baseType: !238, size: 128, align: 64, offset: 640)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pflags", file: !7, line: 9, baseType: !178, size: 64, align: 64, offset: 3712)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "lflags", file: !7, line: 9, baseType: !178, size: 64, align: 64, offset: 3776)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "iflags", file: !7, line: 9, baseType: !178, size: 64, align: 64, offset: 3840)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "parentsPflags", file: !7, line: 9, baseType: !178, size: 64, align: 64, offset: 3904)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "globNormFunc", file: !7, line: 9, baseType: !255, size: 64, align: 64, offset: 3968)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "output", file: !7, line: 9, baseType: !238, size: 128, align: 64, offset: 4032)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "usageFunc", file: !7, line: 9, baseType: !288, size: 64, align: 64, offset: 4160)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 9, size: 64, align: 8, elements: !290)
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 9, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!41, !67}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "usageTemplate", file: !7, line: 9, baseType: !12, size: 128, align: 64, offset: 4224)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flagErrorFunc", file: !7, line: 9, baseType: !297, size: 64, align: 64, offset: 4352)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 9, size: 64, align: 8, elements: !299)
!299 = !{!300}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 9, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!41, !67, !41}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "helpTemplate", file: !7, line: 9, baseType: !12, size: 128, align: 64, offset: 4416)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "helpFunc", file: !7, line: 9, baseType: !122, size: 64, align: 64, offset: 4544)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "helpCommand", file: !7, line: 9, baseType: !67, size: 64, align: 64, offset: 4608)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "versionTemplate", file: !7, line: 9, baseType: !12, size: 128, align: 64, offset: 4672)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !13, line: 1, type: !55, isLocal: false, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "main.buildN", linkageName: "main.buildN", scope: !1, file: !7, line: 28, type: !77, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "main.buildX", linkageName: "main.buildX", scope: !1, file: !7, line: 29, type: !77, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "main.buildV", linkageName: "main.buildV", scope: !1, file: !7, line: 30, type: !77, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "main.buildWork", linkageName: "main.buildWork", scope: !1, file: !7, line: 31, type: !77, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "main.buildGcflags", linkageName: "main.buildGcflags", scope: !1, file: !7, line: 32, type: !12, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "main.buildLdflags", linkageName: "main.buildLdflags", scope: !1, file: !7, line: 33, type: !12, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "main.buildO", linkageName: "main.buildO", scope: !1, file: !7, line: 34, type: !12, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "main.buildTargets", linkageName: "main.buildTargets", scope: !1, file: !7, line: 37, type: !12, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "main.InitCmd", linkageName: "main.InitCmd", scope: !1, file: !7, line: 53, type: !8, isLocal: false, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "os.Stderr", linkageName: "os.Stderr", scope: !1, file: !7, line: 7, type: !330, isLocal: false, isDefinition: true)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !7, line: 7, size: 64, align: 8, elements: !332)
!332 = !{!333}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !7, line: 7, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !7, line: 7, size: 640, align: 8, elements: !336)
!336 = !{!337, !368, !369, !377, !378}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !7, line: 7, baseType: !338, size: 384, align: 64)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !7, line: 7, size: 384, align: 8, elements: !339)
!339 = !{!340, !347, !348, !352, !363, !364, !365, !366, !367}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !7, line: 7, baseType: !341, size: 128, align: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !7, line: 7, size: 128, align: 8, elements: !342)
!342 = !{!343, !345, !346}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 7, baseType: !344, size: 64, align: 64)
!344 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !7, line: 7, baseType: !55, size: 32, align: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !7, line: 7, baseType: !55, size: 32, align: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !7, line: 7, baseType: !19, size: 64, align: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !7, line: 7, baseType: !349, size: 64, align: 64, offset: 192)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !7, line: 7, size: 64, align: 8, elements: !350)
!350 = !{!351}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !7, line: 7, baseType: !52, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !7, line: 7, baseType: !353, size: 64, align: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !22, size: 192, align: 8, elements: !355)
!355 = !{!356, !26, !27}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !22, line: 1, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !7, line: 7, size: 128, align: 8, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !7, line: 7, baseType: !16, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !7, line: 7, baseType: !362, size: 64, align: 64, offset: 64)
!362 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !7, line: 7, baseType: !55, size: 32, align: 32, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !7, line: 7, baseType: !77, size: 8, align: 8, offset: 352)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !7, line: 7, baseType: !77, size: 8, align: 8, offset: 360)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !7, line: 7, baseType: !77, size: 8, align: 8, offset: 368)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !7, line: 7, baseType: !77, size: 8, align: 8, offset: 376)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 7, baseType: !12, size: 128, align: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !7, line: 7, baseType: !370, size: 64, align: 64, offset: 512)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !7, line: 7, size: 256, align: 8, elements: !372)
!372 = !{!373, !374}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 7, baseType: !167, size: 192, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !7, line: 7, baseType: !375, size: 64, align: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !7, line: 7, align: 8, elements: !3)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !7, line: 7, baseType: !77, size: 8, align: 8, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !7, line: 7, baseType: !77, size: 8, align: 8, offset: 584)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "main.BuildCmd", linkageName: "main.BuildCmd", scope: !1, file: !7, line: 88, type: !8, isLocal: false, isDefinition: true)
!381 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !7, line: 2, type: !187, isLocal: false, isDefinition: true, scopeLine: 2, isOptimized: false, unit: !1, retainedNodes: !3)
!382 = !DILocation(line: 1, column: 1, scope: !383)
!383 = !DILexicalBlockFile(scope: !381, file: !13, discriminator: 0)
!384 = !DILocation(line: 20, column: 15, scope: !385)
!385 = !DILexicalBlockFile(scope: !381, file: !7, discriminator: 0)
!386 = !DILocation(line: 20, column: 22, scope: !385)
!387 = !DILocation(line: 20, column: 5, scope: !385)
!388 = !DILocation(line: 53, column: 15, scope: !385)
!389 = !DILocation(line: 53, column: 22, scope: !385)
!390 = !DILocation(line: 53, column: 5, scope: !385)
!391 = !DILocation(line: 88, column: 16, scope: !385)
!392 = !DILocation(line: 88, column: 23, scope: !385)
!393 = !DILocation(line: 88, column: 5, scope: !385)
!394 = !DILocation(line: 40, column: 1, scope: !385)
!395 = !DILocation(line: 75, column: 1, scope: !385)
!396 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !7, line: 13, type: !187, isLocal: false, isDefinition: true, scopeLine: 13, isOptimized: false, unit: !1, retainedNodes: !3)
!397 = !DILocation(line: 14, column: 12, scope: !398)
!398 = distinct !DILexicalBlock(scope: !396, file: !7, line: 14, column: 2)
!399 = !DILocation(line: 14, column: 19, scope: !398)
!400 = !DILocalVariable(name: "err", scope: !398, file: !7, line: 14, type: !41)
!401 = !DILocation(line: 14, column: 5, scope: !396)
!402 = !DILocation(line: 14, column: 35, scope: !398)
!403 = !DILocation(line: 15, column: 15, scope: !398)
!404 = !DILocation(line: 15, column: 7, scope: !398)
!405 = !DILocation(line: 16, column: 6, scope: !398)
!406 = distinct !DISubprogram(name: "main.main..init0", linkageName: "main.main..init0", scope: null, file: !7, line: 40, type: !187, isLocal: false, isDefinition: true, scopeLine: 40, isOptimized: false, unit: !1, retainedNodes: !3)
!407 = !DILocation(line: 41, column: 11, scope: !408)
!408 = distinct !DILexicalBlock(scope: !406, file: !7, line: 40, column: 1)
!409 = !DILocation(line: 41, column: 18, scope: !408)
!410 = !DILocalVariable(name: "flags", scope: !408, file: !7, line: 41, type: !178)
!411 = !DILocation(line: 41, column: 2, scope: !406)
!412 = !DILocation(line: 42, column: 7, scope: !408)
!413 = !DILocation(line: 43, column: 7, scope: !408)
!414 = !DILocation(line: 44, column: 7, scope: !408)
!415 = !DILocation(line: 45, column: 7, scope: !408)
!416 = !DILocation(line: 46, column: 7, scope: !408)
!417 = !DILocation(line: 47, column: 7, scope: !408)
!418 = !DILocation(line: 48, column: 7, scope: !408)
!419 = !DILocation(line: 50, column: 21, scope: !408)
!420 = !DILocation(line: 50, column: 9, scope: !408)
!421 = !DILocation(line: 50, column: 2, scope: !408)
!422 = distinct !DISubprogram(name: "main.func1", scope: null, file: !7, line: 57, type: !423, isLocal: true, isDefinition: true, scopeLine: 57, isOptimized: false, unit: !1, retainedNodes: !3)
!423 = !DISubroutineType(types: !424)
!424 = !{!68, !8, !21}
!425 = !DILocalVariable(name: "args", arg: 2, scope: !422, file: !7, line: 57, type: !21)
!426 = !DILocation(line: 57, column: 36, scope: !422)
!427 = !DILocalVariable(name: "command", arg: 1, scope: !422, file: !7, line: 57, type: !8)
!428 = !DILocation(line: 57, column: 12, scope: !422)
!429 = !DILocation(line: 59, column: 29, scope: !430)
!430 = distinct !DILexicalBlock(scope: !422, file: !7, line: 57, column: 7)
!431 = !DILocation(line: 59, column: 22, scope: !430)
!432 = !DILocation(line: 60, column: 18, scope: !430)
!433 = !DILocation(line: 61, column: 18, scope: !430)
!434 = !DILocation(line: 62, column: 18, scope: !430)
!435 = !DILocation(line: 63, column: 18, scope: !430)
!436 = !DILocation(line: 58, column: 17, scope: !430)
!437 = !DILocalVariable(name: "flags", scope: !430, file: !7, line: 58, type: !438)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flags", file: !7, line: 10, size: 704, align: 8, elements: !440)
!440 = !{!441, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Logger", file: !7, line: 10, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "Logger", file: !7, line: 6, size: 576, align: 8, elements: !444)
!444 = !{!445, !451, !452, !453, !454}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !7, line: 6, baseType: !446, size: 64, align: 32)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 6, size: 64, align: 8, elements: !447)
!447 = !{!448, !450}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 6, baseType: !449, size: 32, align: 32)
!449 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 6, baseType: !55, size: 32, align: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", file: !7, line: 6, baseType: !12, size: 128, align: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !7, line: 6, baseType: !19, size: 64, align: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "out", file: !7, line: 6, baseType: !238, size: 128, align: 64, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 6, baseType: !167, size: 192, align: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Threaded", file: !7, line: 10, baseType: !77, size: 8, align: 8, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "disablePrint", file: !7, line: 10, baseType: !77, size: 8, align: 8, offset: 72)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "BuildN", file: !7, line: 10, baseType: !77, size: 8, align: 8, offset: 80)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "BuildX", file: !7, line: 10, baseType: !77, size: 8, align: 8, offset: 88)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "BuildV", file: !7, line: 10, baseType: !77, size: 8, align: 8, offset: 96)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "BuildWork", file: !7, line: 10, baseType: !77, size: 8, align: 8, offset: 104)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "BuildGcflags", file: !7, line: 10, baseType: !12, size: 128, align: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "BuildLdflags", file: !7, line: 10, baseType: !12, size: 128, align: 64, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "BuildO", file: !7, line: 10, baseType: !12, size: 128, align: 64, offset: 384)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "BuildBinary", file: !7, line: 10, baseType: !77, size: 8, align: 8, offset: 512)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "BuildTargets", file: !7, line: 10, baseType: !12, size: 128, align: 64, offset: 576)
!466 = !DILocation(line: 58, column: 3, scope: !422)
!467 = !DILocation(line: 69, column: 17, scope: !468)
!468 = distinct !DILexicalBlock(scope: !430, file: !7, line: 69, column: 3)
!469 = !DILocalVariable(name: "err", scope: !468, file: !7, line: 69, type: !41)
!470 = !DILocation(line: 69, column: 6, scope: !430)
!471 = !DILocation(line: 69, column: 34, scope: !468)
!472 = !DILocation(line: 70, column: 16, scope: !468)
!473 = !DILocation(line: 70, column: 8, scope: !468)
!474 = distinct !DISubprogram(name: "main.main..init1", linkageName: "main.main..init1", scope: null, file: !7, line: 75, type: !187, isLocal: false, isDefinition: true, scopeLine: 75, isOptimized: false, unit: !1, retainedNodes: !3)
!475 = !DILocation(line: 76, column: 11, scope: !476)
!476 = distinct !DILexicalBlock(scope: !474, file: !7, line: 75, column: 1)
!477 = !DILocation(line: 76, column: 19, scope: !476)
!478 = !DILocalVariable(name: "flags", scope: !476, file: !7, line: 76, type: !178)
!479 = !DILocation(line: 76, column: 2, scope: !474)
!480 = !DILocation(line: 77, column: 7, scope: !476)
!481 = !DILocation(line: 78, column: 7, scope: !476)
!482 = !DILocation(line: 79, column: 7, scope: !476)
!483 = !DILocation(line: 80, column: 7, scope: !476)
!484 = !DILocation(line: 81, column: 7, scope: !476)
!485 = !DILocation(line: 82, column: 7, scope: !476)
!486 = !DILocation(line: 83, column: 7, scope: !476)
!487 = !DILocation(line: 85, column: 21, scope: !476)
!488 = !DILocation(line: 85, column: 9, scope: !476)
!489 = !DILocation(line: 85, column: 2, scope: !476)
!490 = distinct !DISubprogram(name: "main.func2", scope: null, file: !7, line: 92, type: !423, isLocal: true, isDefinition: true, scopeLine: 92, isOptimized: false, unit: !1, retainedNodes: !3)
!491 = !DILocalVariable(name: "args", arg: 2, scope: !490, file: !7, line: 92, type: !21)
!492 = !DILocation(line: 92, column: 36, scope: !490)
!493 = !DILocalVariable(name: "command", arg: 1, scope: !490, file: !7, line: 92, type: !8)
!494 = !DILocation(line: 92, column: 12, scope: !490)
!495 = !DILocation(line: 94, column: 29, scope: !496)
!496 = distinct !DILexicalBlock(scope: !490, file: !7, line: 92, column: 7)
!497 = !DILocation(line: 94, column: 22, scope: !496)
!498 = !DILocation(line: 93, column: 12, scope: !496)
!499 = !DILocation(line: 95, column: 18, scope: !496)
!500 = !DILocation(line: 96, column: 18, scope: !496)
!501 = !DILocation(line: 97, column: 18, scope: !496)
!502 = !DILocation(line: 98, column: 18, scope: !496)
!503 = !DILocation(line: 93, column: 17, scope: !496)
!504 = !DILocalVariable(name: "flags", scope: !496, file: !7, line: 93, type: !438)
!505 = !DILocation(line: 93, column: 3, scope: !490)
!506 = !DILocation(line: 104, column: 17, scope: !507)
!507 = distinct !DILexicalBlock(scope: !496, file: !7, line: 104, column: 3)
!508 = !DILocalVariable(name: "err", scope: !507, file: !7, line: 104, type: !41)
!509 = !DILocation(line: 104, column: 6, scope: !496)
!510 = !DILocation(line: 104, column: 41, scope: !507)
!511 = !DILocation(line: 105, column: 16, scope: !507)
!512 = !DILocation(line: 105, column: 8, scope: !507)
!513 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", scope: null, file: !13, line: 1, type: !65, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!514 = !DILocalVariable(name: "key", arg: 1, scope: !513, file: !13, line: 1, type: !67)
!515 = !DILocation(line: 1, column: 1, scope: !513)
!516 = !DILocalVariable(name: "seed", arg: 2, scope: !513, file: !13, line: 1, type: !52)
!517 = !DILocalVariable(name: "$ret14", scope: !513, file: !13, line: 1, type: !52)
