; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22comm\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22color\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22image/color\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22image/color\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22strconv\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22strconv\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22strconv\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22sync\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22sync\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22sync\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22color\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22image_color..import\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./notify.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha/comm")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "comm.Notify..1command_line_arguments.Relay", linkageName: "command_line_arguments.Relay.Notify", scope: null, file: !10, line: 59, type: !11, isLocal: false, isDefinition: true, scopeLine: 59, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DIFile(filename: "relay.go", directory: ".")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !14, !44}
!13 = !DIBasicType(name: "Id", size: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "Relay", file: !10, line: 12, size: 256, align: 8, elements: !16)
!16 = !{!17, !23, !42, !43}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !10, line: 13, baseType: !18, size: 64, align: 32)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !10, line: 7, size: 64, align: 8, elements: !19)
!19 = !{!20, !22}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !10, line: 7, baseType: !21, size: 32, align: 32)
!21 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !10, line: 7, baseType: !8, size: 32, align: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "subs", file: !10, line: 14, baseType: !24, size: 64, align: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !26)
!26 = !{!27, !29, !31, !32, !34, !35, !38, !39, !41}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !28, size: 64, align: 64)
!28 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !30, size: 8, align: 8, offset: 64)
!30 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !30, size: 8, align: 8, offset: 72)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !33, size: 16, align: 16, offset: 80)
!33 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !36, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIBasicType(name: "void")
!38 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !36, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!40 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !36, size: 64, align: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", file: !10, line: 15, baseType: !24, size: 64, align: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "maxId", file: !10, line: 16, baseType: !13, size: 64, align: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 15, size: 64, align: 8, elements: !46)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 15, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!37}
!51 = !DILocalVariable(name: "r", arg: 1, scope: !9, file: !10, line: 59, type: !14)
!52 = !DILocation(line: 59, column: 1, scope: !9)
!53 = !DILocalVariable(name: "f", arg: 2, scope: !9, file: !10, line: 59, type: !44)
!54 = !DILocation(line: 59, column: 24, scope: !9)
!55 = !DILocalVariable(name: "$ret0", scope: !9, file: !10, line: 59, type: !13)
!56 = !DILocation(line: 59, column: 34, scope: !9)
!57 = !DILocation(line: 60, column: 3, scope: !9)
!58 = !DILocation(line: 69, column: 1, scope: !9)
!59 = !DILocation(line: 60, column: 6, scope: !9)
!60 = !DILocation(line: 61, column: 9, scope: !9)
!61 = !DILocation(line: 61, column: 2, scope: !9)
!62 = !DILocation(line: 63, column: 6, scope: !9)
!63 = !DILocation(line: 63, column: 13, scope: !9)
!64 = !DILocation(line: 64, column: 13, scope: !9)
!65 = !DILocation(line: 64, column: 11, scope: !9)
!66 = !DILocation(line: 67, column: 3, scope: !9)
!67 = !DILocation(line: 66, column: 3, scope: !9)
!68 = !DILocation(line: 66, column: 10, scope: !9)
!69 = !DILocation(line: 67, column: 19, scope: !9)
!70 = !DILocation(line: 68, column: 10, scope: !9)
!71 = !DILocation(line: 68, column: 2, scope: !9)
!72 = distinct !DISubprogram(name: "comm.Signal..1command_line_arguments.Relay", linkageName: "command_line_arguments.Relay.Signal", scope: null, file: !10, line: 86, type: !73, isLocal: false, isDefinition: true, scopeLine: 86, isOptimized: false, unit: !1, retainedNodes: !3)
!73 = !DISubroutineType(types: !74)
!74 = !{!37, !14, !14}
!75 = !DILocalVariable(name: "r", arg: 1, scope: !72, file: !10, line: 86, type: !14)
!76 = !DILocation(line: 86, column: 1, scope: !72)
!77 = !DILocation(line: 87, column: 3, scope: !72)
!78 = !DILocation(line: 93, column: 1, scope: !72)
!79 = !DILocation(line: 87, column: 6, scope: !72)
!80 = !DILocation(line: 88, column: 9, scope: !72)
!81 = !DILocation(line: 88, column: 2, scope: !72)
!82 = !DILocalVariable(name: "f", scope: !83, file: !10, line: 90, type: !44)
!83 = distinct !DILexicalBlock(scope: !72, file: !10, line: 90, column: 2)
!84 = !DILocation(line: 90, column: 6, scope: !72)
!85 = !DILocation(line: 90, column: 21, scope: !83)
!86 = !DILocation(line: 90, column: 2, scope: !83)
!87 = !DILocation(line: 91, column: 3, scope: !83)
!88 = distinct !DISubprogram(name: "comm.Subscribe..1command_line_arguments.Relay", linkageName: "command_line_arguments.Relay.Subscribe", scope: null, file: !10, line: 22, type: !89, isLocal: false, isDefinition: true, scopeLine: 22, isOptimized: false, unit: !1, retainedNodes: !3)
!89 = !DISubroutineType(types: !90)
!90 = !{!37, !14, !14, !91}
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Notifier", file: !92, line: 14, size: 128, align: 8, elements: !93)
!92 = !DIFile(filename: "notify.go", directory: ".")
!93 = !{!94, !161}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !92, line: 14, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*__go_descriptor)Id,*func(*void,Id)void}", file: !97, size: 192, align: 8, elements: !98)
!97 = !DIFile(filename: "", directory: "")
!98 = !{!99, !153, !157}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !97, line: 14, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !102)
!102 = !{!103, !104, !105, !106, !107, !108, !109, !117, !126, !128, !134, !152}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !40, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !30, size: 8, align: 8, offset: 160)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !30, size: 8, align: 8, offset: 168)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !30, size: 8, align: 8, offset: 176)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !110, size: 64, align: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !112)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!40, !36, !40}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !118, size: 64, align: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !120)
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!125, !36, !36}
!125 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !127, size: 64, align: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !129, size: 64, align: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !131)
!131 = !{!132, !133}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !127, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !28, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !135, size: 64, align: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !137)
!137 = !{!138, !139, !140}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !129, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !129, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !141, size: 192, align: 64, offset: 128)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !97, size: 192, align: 8, elements: !142)
!142 = !{!143, !150, !151}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !97, line: 1, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !146)
!146 = !{!138, !139, !147, !148, !149}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !36, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !36, size: 64, align: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !36, size: 64, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !97, line: 1, baseType: !28, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !97, line: 1, baseType: !28, size: 64, align: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !36, size: 64, align: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Notify", file: !97, line: 14, baseType: !154, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!13, !36, !44}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Unnotify", file: !97, line: 14, baseType: !158, size: 64, align: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!37, !36, !13}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !92, line: 1, baseType: !36, size: 64, align: 64, offset: 64)
!162 = !DILocalVariable(name: "param", arg: 1, scope: !88, file: !10, line: 22, type: !14)
!163 = !DILocation(line: 22, column: 1, scope: !88)
!164 = !DILocalVariable(name: "n", arg: 2, scope: !88, file: !10, line: 22, type: !91)
!165 = !DILocation(line: 22, column: 27, scope: !88)
!166 = !DILocation(line: 43, column: 1, scope: !88)
!167 = !DILocalVariable(name: "r", scope: !88, file: !10, line: 22, type: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!169 = !DILocation(line: 23, column: 2, scope: !170)
!170 = distinct !DILexicalBlock(scope: !88, file: !10, line: 22, column: 1)
!171 = !DILocation(line: 23, column: 3, scope: !170)
!172 = !DILocation(line: 23, column: 6, scope: !170)
!173 = !DILocation(line: 24, column: 8, scope: !170)
!174 = !DILocation(line: 24, column: 9, scope: !170)
!175 = !DILocation(line: 24, column: 2, scope: !170)
!176 = !DILocalVariable(name: "ok", scope: !177, file: !10, line: 27, type: !125)
!177 = distinct !DILexicalBlock(scope: !170, file: !10, line: 27, column: 2)
!178 = !DILocation(line: 27, column: 5, scope: !170)
!179 = !DILocation(line: 27, column: 14, scope: !177)
!180 = !DILocation(line: 27, column: 15, scope: !177)
!181 = !DILocation(line: 27, column: 5, scope: !177)
!182 = !DILocation(line: 27, column: 2, scope: !177)
!183 = !DILocation(line: 31, column: 9, scope: !170)
!184 = !DILocation(line: 31, column: 17, scope: !170)
!185 = !DILocalVariable(name: "id", scope: !170, file: !10, line: 31, type: !13)
!186 = !DILocation(line: 31, column: 2, scope: !88)
!187 = !DILocation(line: 39, column: 5, scope: !170)
!188 = !DILocation(line: 39, column: 6, scope: !170)
!189 = !DILocation(line: 39, column: 12, scope: !170)
!190 = !DILocation(line: 40, column: 3, scope: !170)
!191 = !DILocation(line: 40, column: 4, scope: !170)
!192 = !DILocation(line: 42, column: 2, scope: !170)
!193 = !DILocation(line: 42, column: 3, scope: !170)
!194 = !DILocation(line: 40, column: 12, scope: !170)
!195 = !DILocation(line: 40, column: 10, scope: !170)
!196 = !DILocation(line: 42, column: 12, scope: !170)
!197 = !DILocation(line: 28, column: 3, scope: !88)
!198 = distinct !DISubprogram(name: "comm.Unnotify..1command_line_arguments.Relay", linkageName: "command_line_arguments.Relay.Unnotify", scope: null, file: !10, line: 72, type: !199, isLocal: false, isDefinition: true, scopeLine: 72, isOptimized: false, unit: !1, retainedNodes: !3)
!199 = !DISubroutineType(types: !200)
!200 = !{!37, !14, !14, !13}
!201 = !DILocalVariable(name: "r", arg: 1, scope: !198, file: !10, line: 72, type: !14)
!202 = !DILocation(line: 72, column: 1, scope: !198)
!203 = !DILocalVariable(name: "id", arg: 2, scope: !198, file: !10, line: 72, type: !13)
!204 = !DILocation(line: 72, column: 26, scope: !198)
!205 = !DILocation(line: 73, column: 3, scope: !198)
!206 = !DILocation(line: 83, column: 1, scope: !198)
!207 = !DILocation(line: 73, column: 6, scope: !198)
!208 = !DILocation(line: 74, column: 9, scope: !198)
!209 = !DILocation(line: 74, column: 2, scope: !198)
!210 = !DILocation(line: 76, column: 6, scope: !198)
!211 = !DILocation(line: 76, column: 13, scope: !198)
!212 = !DILocation(line: 77, column: 13, scope: !198)
!213 = !DILocation(line: 77, column: 11, scope: !198)
!214 = !DILocation(line: 79, column: 15, scope: !215)
!215 = distinct !DILexicalBlock(scope: !198, file: !10, line: 79, column: 2)
!216 = !DILocalVariable(name: "ok", scope: !215, file: !10, line: 79, type: !125)
!217 = !DILocation(line: 79, column: 5, scope: !198)
!218 = !DILocation(line: 79, column: 5, scope: !215)
!219 = !DILocation(line: 79, column: 27, scope: !215)
!220 = !DILocation(line: 80, column: 54, scope: !215)
!221 = !DILocation(line: 80, column: 3, scope: !215)
!222 = !DILocation(line: 80, column: 41, scope: !215)
!223 = !DILocation(line: 82, column: 10, scope: !198)
!224 = !DILocation(line: 82, column: 2, scope: !198)
!225 = distinct !DISubprogram(name: "comm.Unsubscribe..1command_line_arguments.Relay", linkageName: "command_line_arguments.Relay.Unsubscribe", scope: null, file: !10, line: 46, type: !89, isLocal: false, isDefinition: true, scopeLine: 46, isOptimized: false, unit: !1, retainedNodes: !3)
!226 = !DILocalVariable(name: "r", arg: 1, scope: !225, file: !10, line: 46, type: !14)
!227 = !DILocation(line: 46, column: 1, scope: !225)
!228 = !DILocalVariable(name: "n", arg: 2, scope: !225, file: !10, line: 46, type: !91)
!229 = !DILocation(line: 46, column: 29, scope: !225)
!230 = !DILocation(line: 47, column: 3, scope: !231)
!231 = distinct !DILexicalBlock(scope: !225, file: !10, line: 46, column: 1)
!232 = !DILocation(line: 56, column: 1, scope: !225)
!233 = !DILocation(line: 47, column: 6, scope: !231)
!234 = !DILocation(line: 48, column: 9, scope: !231)
!235 = !DILocation(line: 48, column: 2, scope: !231)
!236 = !DILocalVariable(name: "id", scope: !231, file: !10, line: 50, type: !13)
!237 = !DILocation(line: 50, column: 2, scope: !225)
!238 = !DILocalVariable(name: "ok", scope: !231, file: !10, line: 50, type: !125)
!239 = !DILocation(line: 50, column: 13, scope: !231)
!240 = !DILocation(line: 50, column: 2, scope: !231)
!241 = !DILocation(line: 51, column: 5, scope: !231)
!242 = !DILocation(line: 54, column: 3, scope: !231)
!243 = !DILocation(line: 55, column: 10, scope: !231)
!244 = !DILocation(line: 55, column: 2, scope: !231)
!245 = !DILocation(line: 52, column: 3, scope: !225)
!246 = distinct !DISubprogram(name: "comm.command_line_arguments..thunk0", scope: null, file: !10, line: 24, type: !247, isLocal: true, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !1, retainedNodes: !3)
!247 = !DISubroutineType(types: !248)
!248 = !{!125, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Mutex}", file: !97, size: 64, align: 8, elements: !251)
!251 = !{!252}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !97, line: 24, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!254 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !246, file: !10, line: 24, type: !249)
!255 = !DILocation(line: 24, column: 2, scope: !246)
!256 = !DILocalVariable(name: "$ret15", scope: !246, file: !10, line: 24, type: !125)
!257 = distinct !DISubprogram(name: "comm.func1", scope: null, file: !10, line: 31, type: !49, isLocal: true, isDefinition: true, scopeLine: 31, isOptimized: false, unit: !1, retainedNodes: !3)
!258 = !DILocation(line: 32, column: 3, scope: !257)
!259 = !DILocation(line: 32, column: 4, scope: !257)
!260 = !DILocation(line: 38, column: 2, scope: !257)
!261 = !DILocation(line: 32, column: 7, scope: !257)
!262 = !DILocation(line: 33, column: 9, scope: !257)
!263 = !DILocation(line: 33, column: 10, scope: !257)
!264 = !DILocation(line: 33, column: 3, scope: !257)
!265 = !DILocalVariable(name: "f", scope: !266, file: !10, line: 35, type: !44)
!266 = distinct !DILexicalBlock(scope: !257, file: !10, line: 35, column: 3)
!267 = !DILocation(line: 35, column: 7, scope: !257)
!268 = !DILocation(line: 35, column: 21, scope: !266)
!269 = !DILocation(line: 35, column: 22, scope: !266)
!270 = !DILocation(line: 35, column: 3, scope: !266)
!271 = !DILocation(line: 36, column: 4, scope: !266)
!272 = distinct !DISubprogram(name: "comm.command_line_arguments..thunk1", scope: null, file: !10, line: 33, type: !247, isLocal: true, isDefinition: true, scopeLine: 33, isOptimized: false, unit: !1, retainedNodes: !3)
!273 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !272, file: !10, line: 33, type: !249)
!274 = !DILocation(line: 33, column: 3, scope: !272)
!275 = !DILocalVariable(name: "$ret16", scope: !272, file: !10, line: 33, type: !125)
!276 = distinct !DISubprogram(name: "comm.command_line_arguments..thunk2", scope: null, file: !10, line: 48, type: !247, isLocal: true, isDefinition: true, scopeLine: 48, isOptimized: false, unit: !1, retainedNodes: !3)
!277 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !276, file: !10, line: 48, type: !249)
!278 = !DILocation(line: 48, column: 2, scope: !276)
!279 = !DILocalVariable(name: "$ret17", scope: !276, file: !10, line: 48, type: !125)
!280 = distinct !DISubprogram(name: "comm.command_line_arguments..thunk3", scope: null, file: !10, line: 61, type: !247, isLocal: true, isDefinition: true, scopeLine: 61, isOptimized: false, unit: !1, retainedNodes: !3)
!281 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !280, file: !10, line: 61, type: !249)
!282 = !DILocation(line: 61, column: 2, scope: !280)
!283 = !DILocalVariable(name: "$ret18", scope: !280, file: !10, line: 61, type: !125)
!284 = distinct !DISubprogram(name: "comm.command_line_arguments..thunk4", scope: null, file: !10, line: 74, type: !247, isLocal: true, isDefinition: true, scopeLine: 74, isOptimized: false, unit: !1, retainedNodes: !3)
!285 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !284, file: !10, line: 74, type: !249)
!286 = !DILocation(line: 74, column: 2, scope: !284)
!287 = !DILocalVariable(name: "$ret19", scope: !284, file: !10, line: 74, type: !125)
!288 = distinct !DISubprogram(name: "comm.command_line_arguments..thunk5", scope: null, file: !10, line: 88, type: !247, isLocal: true, isDefinition: true, scopeLine: 88, isOptimized: false, unit: !1, retainedNodes: !3)
!289 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !288, file: !10, line: 88, type: !249)
!290 = !DILocation(line: 88, column: 2, scope: !288)
!291 = !DILocalVariable(name: "$ret20", scope: !288, file: !10, line: 88, type: !125)
!292 = distinct !DISubprogram(name: "comm.Notify..1command_line_arguments.InterfaceValue", linkageName: "command_line_arguments.InterfaceValue.Notify", scope: null, file: !293, line: 16, type: !294, isLocal: false, isDefinition: true, scopeLine: 16, isOptimized: false, unit: !1, retainedNodes: !3)
!293 = !DIFile(filename: "values.go", directory: ".")
!294 = !DISubroutineType(types: !295)
!295 = !{!13, !296, !296, !44}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterfaceValue", file: !293, line: 9, size: 448, align: 8, elements: !298)
!298 = !{!299, !304, !305}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !293, line: 10, baseType: !300, size: 128, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !97, size: 128, align: 8, elements: !301)
!301 = !{!302, !303}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !97, line: 1, baseType: !100, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !97, line: 1, baseType: !36, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "relay", file: !293, line: 11, baseType: !15, size: 256, align: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !293, line: 12, baseType: !18, size: 64, align: 32, offset: 384)
!306 = !DILocalVariable(name: "v", arg: 1, scope: !292, file: !293, line: 16, type: !296)
!307 = !DILocation(line: 16, column: 1, scope: !292)
!308 = !DILocalVariable(name: "f", arg: 2, scope: !292, file: !293, line: 16, type: !44)
!309 = !DILocation(line: 16, column: 33, scope: !292)
!310 = !DILocalVariable(name: "$ret1", scope: !292, file: !293, line: 16, type: !13)
!311 = !DILocation(line: 16, column: 43, scope: !292)
!312 = !DILocation(line: 17, column: 10, scope: !292)
!313 = !DILocation(line: 17, column: 16, scope: !292)
!314 = !DILocation(line: 17, column: 2, scope: !292)
!315 = distinct !DISubprogram(name: "comm.SetValue..1command_line_arguments.InterfaceValue", linkageName: "command_line_arguments.InterfaceValue.SetValue", scope: null, file: !293, line: 33, type: !316, isLocal: false, isDefinition: true, scopeLine: 33, isOptimized: false, unit: !1, retainedNodes: !3)
!316 = !DISubroutineType(types: !317)
!317 = !{!37, !296, !296, !300}
!318 = !DILocalVariable(name: "v", arg: 1, scope: !315, file: !293, line: 33, type: !296)
!319 = !DILocation(line: 33, column: 1, scope: !315)
!320 = !DILocalVariable(name: "val", arg: 2, scope: !315, file: !293, line: 33, type: !300)
!321 = !DILocation(line: 33, column: 35, scope: !315)
!322 = !DILocation(line: 34, column: 3, scope: !315)
!323 = !DILocation(line: 34, column: 9, scope: !315)
!324 = !DILocation(line: 35, column: 9, scope: !315)
!325 = !DILocation(line: 36, column: 11, scope: !315)
!326 = !DILocation(line: 37, column: 10, scope: !315)
!327 = !DILocation(line: 38, column: 4, scope: !315)
!328 = !DILocation(line: 38, column: 10, scope: !315)
!329 = !DILocation(line: 40, column: 10, scope: !315)
!330 = distinct !DISubprogram(name: "comm.Unnotify..1command_line_arguments.InterfaceValue", linkageName: "command_line_arguments.InterfaceValue.Unnotify", scope: null, file: !293, line: 21, type: !331, isLocal: false, isDefinition: true, scopeLine: 21, isOptimized: false, unit: !1, retainedNodes: !3)
!331 = !DISubroutineType(types: !332)
!332 = !{!37, !296, !296, !13}
!333 = !DILocalVariable(name: "v", arg: 1, scope: !330, file: !293, line: 21, type: !296)
!334 = !DILocation(line: 21, column: 1, scope: !330)
!335 = !DILocalVariable(name: "id", arg: 2, scope: !330, file: !293, line: 21, type: !13)
!336 = !DILocation(line: 21, column: 35, scope: !330)
!337 = !DILocation(line: 22, column: 3, scope: !330)
!338 = !DILocation(line: 22, column: 9, scope: !330)
!339 = distinct !DISubprogram(name: "comm.Value..1command_line_arguments.InterfaceValue", linkageName: "command_line_arguments.InterfaceValue.Value", scope: null, file: !293, line: 26, type: !340, isLocal: false, isDefinition: true, scopeLine: 26, isOptimized: false, unit: !1, retainedNodes: !3)
!340 = !DISubroutineType(types: !341)
!341 = !{!300, !296, !296}
!342 = !DILocalVariable(name: "v", arg: 1, scope: !339, file: !293, line: 26, type: !296)
!343 = !DILocation(line: 26, column: 1, scope: !339)
!344 = !DILocalVariable(name: "$ret2", scope: !339, file: !293, line: 26, type: !300)
!345 = !DILocation(line: 26, column: 34, scope: !339)
!346 = !DILocation(line: 27, column: 3, scope: !339)
!347 = !DILocation(line: 30, column: 1, scope: !339)
!348 = !DILocation(line: 27, column: 9, scope: !339)
!349 = !DILocation(line: 28, column: 9, scope: !339)
!350 = !DILocation(line: 28, column: 2, scope: !339)
!351 = !DILocation(line: 29, column: 10, scope: !339)
!352 = !DILocation(line: 29, column: 2, scope: !339)
!353 = distinct !DISubprogram(name: "comm.command_line_arguments..thunk6", scope: null, file: !293, line: 28, type: !247, isLocal: true, isDefinition: true, scopeLine: 28, isOptimized: false, unit: !1, retainedNodes: !3)
!354 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !353, file: !293, line: 28, type: !249)
!355 = !DILocation(line: 28, column: 2, scope: !353)
!356 = !DILocalVariable(name: "$ret21", scope: !353, file: !293, line: 28, type: !125)
!357 = distinct !DISubprogram(name: "comm.Notify..1command_line_arguments.BoolValue", linkageName: "command_line_arguments.BoolValue.Notify", scope: null, file: !293, line: 52, type: !358, isLocal: false, isDefinition: true, scopeLine: 52, isOptimized: false, unit: !1, retainedNodes: !3)
!358 = !DISubroutineType(types: !359)
!359 = !{!13, !360, !360, !44}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "BoolValue", file: !293, line: 45, size: 384, align: 8, elements: !362)
!362 = !{!363, !364, !365}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !293, line: 46, baseType: !125, size: 8, align: 8)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "relay", file: !293, line: 47, baseType: !15, size: 256, align: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !293, line: 48, baseType: !18, size: 64, align: 32, offset: 320)
!366 = !DILocalVariable(name: "v", arg: 1, scope: !357, file: !293, line: 52, type: !360)
!367 = !DILocation(line: 52, column: 1, scope: !357)
!368 = !DILocalVariable(name: "f", arg: 2, scope: !357, file: !293, line: 52, type: !44)
!369 = !DILocation(line: 52, column: 28, scope: !357)
!370 = !DILocalVariable(name: "$ret3", scope: !357, file: !293, line: 52, type: !13)
!371 = !DILocation(line: 52, column: 38, scope: !357)
!372 = !DILocation(line: 53, column: 10, scope: !357)
!373 = !DILocation(line: 53, column: 16, scope: !357)
!374 = !DILocation(line: 53, column: 2, scope: !357)
!375 = distinct !DISubprogram(name: "comm.SetValue..1command_line_arguments.BoolValue", linkageName: "command_line_arguments.BoolValue.SetValue", scope: null, file: !293, line: 69, type: !376, isLocal: false, isDefinition: true, scopeLine: 69, isOptimized: false, unit: !1, retainedNodes: !3)
!376 = !DISubroutineType(types: !377)
!377 = !{!37, !360, !360, !125}
!378 = !DILocalVariable(name: "v", arg: 1, scope: !375, file: !293, line: 69, type: !360)
!379 = !DILocation(line: 69, column: 1, scope: !375)
!380 = !DILocalVariable(name: "val", arg: 2, scope: !375, file: !293, line: 69, type: !125)
!381 = !DILocation(line: 69, column: 30, scope: !375)
!382 = !DILocation(line: 70, column: 3, scope: !375)
!383 = !DILocation(line: 70, column: 9, scope: !375)
!384 = !DILocation(line: 71, column: 13, scope: !375)
!385 = !DILocation(line: 71, column: 9, scope: !375)
!386 = !DILocation(line: 72, column: 11, scope: !375)
!387 = !DILocation(line: 73, column: 10, scope: !375)
!388 = !DILocation(line: 74, column: 4, scope: !375)
!389 = !DILocation(line: 74, column: 10, scope: !375)
!390 = !DILocation(line: 76, column: 10, scope: !375)
!391 = distinct !DISubprogram(name: "comm.Unnotify..1command_line_arguments.BoolValue", linkageName: "command_line_arguments.BoolValue.Unnotify", scope: null, file: !293, line: 57, type: !392, isLocal: false, isDefinition: true, scopeLine: 57, isOptimized: false, unit: !1, retainedNodes: !3)
!392 = !DISubroutineType(types: !393)
!393 = !{!37, !360, !360, !13}
!394 = !DILocalVariable(name: "v", arg: 1, scope: !391, file: !293, line: 57, type: !360)
!395 = !DILocation(line: 57, column: 1, scope: !391)
!396 = !DILocalVariable(name: "id", arg: 2, scope: !391, file: !293, line: 57, type: !13)
!397 = !DILocation(line: 57, column: 30, scope: !391)
!398 = !DILocation(line: 58, column: 3, scope: !391)
!399 = !DILocation(line: 58, column: 9, scope: !391)
!400 = distinct !DISubprogram(name: "comm.Value..1command_line_arguments.BoolValue", linkageName: "command_line_arguments.BoolValue.Value", scope: null, file: !293, line: 62, type: !401, isLocal: false, isDefinition: true, scopeLine: 62, isOptimized: false, unit: !1, retainedNodes: !3)
!401 = !DISubroutineType(types: !402)
!402 = !{!125, !360, !360}
!403 = !DILocalVariable(name: "v", arg: 1, scope: !400, file: !293, line: 62, type: !360)
!404 = !DILocation(line: 62, column: 1, scope: !400)
!405 = !DILocalVariable(name: "$ret4", scope: !400, file: !293, line: 62, type: !125)
!406 = !DILocation(line: 62, column: 29, scope: !400)
!407 = !DILocation(line: 63, column: 3, scope: !400)
!408 = !DILocation(line: 66, column: 1, scope: !400)
!409 = !DILocation(line: 63, column: 9, scope: !400)
!410 = !DILocation(line: 64, column: 9, scope: !400)
!411 = !DILocation(line: 64, column: 2, scope: !400)
!412 = !DILocation(line: 65, column: 10, scope: !400)
!413 = !DILocation(line: 65, column: 2, scope: !400)
!414 = distinct !DISubprogram(name: "comm.command_line_arguments..thunk7", scope: null, file: !293, line: 64, type: !247, isLocal: true, isDefinition: true, scopeLine: 64, isOptimized: false, unit: !1, retainedNodes: !3)
!415 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !414, file: !293, line: 64, type: !249)
!416 = !DILocation(line: 64, column: 2, scope: !414)
!417 = !DILocalVariable(name: "$ret22", scope: !414, file: !293, line: 64, type: !125)
!418 = distinct !DISubprogram(name: "comm.Notify..1command_line_arguments.IntValue", linkageName: "command_line_arguments.IntValue.Notify", scope: null, file: !293, line: 88, type: !419, isLocal: false, isDefinition: true, scopeLine: 88, isOptimized: false, unit: !1, retainedNodes: !3)
!419 = !DISubroutineType(types: !420)
!420 = !{!13, !421, !421, !44}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "IntValue", file: !293, line: 81, size: 384, align: 8, elements: !423)
!423 = !{!424, !425, !426}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !293, line: 82, baseType: !28, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "relay", file: !293, line: 83, baseType: !15, size: 256, align: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !293, line: 84, baseType: !18, size: 64, align: 32, offset: 320)
!427 = !DILocalVariable(name: "v", arg: 1, scope: !418, file: !293, line: 88, type: !421)
!428 = !DILocation(line: 88, column: 1, scope: !418)
!429 = !DILocalVariable(name: "f", arg: 2, scope: !418, file: !293, line: 88, type: !44)
!430 = !DILocation(line: 88, column: 27, scope: !418)
!431 = !DILocalVariable(name: "$ret5", scope: !418, file: !293, line: 88, type: !13)
!432 = !DILocation(line: 88, column: 37, scope: !418)
!433 = !DILocation(line: 89, column: 10, scope: !418)
!434 = !DILocation(line: 89, column: 16, scope: !418)
!435 = !DILocation(line: 89, column: 2, scope: !418)
!436 = distinct !DISubprogram(name: "comm.SetValue..1command_line_arguments.IntValue", linkageName: "command_line_arguments.IntValue.SetValue", scope: null, file: !293, line: 105, type: !437, isLocal: false, isDefinition: true, scopeLine: 105, isOptimized: false, unit: !1, retainedNodes: !3)
!437 = !DISubroutineType(types: !438)
!438 = !{!37, !421, !421, !28}
!439 = !DILocalVariable(name: "v", arg: 1, scope: !436, file: !293, line: 105, type: !421)
!440 = !DILocation(line: 105, column: 1, scope: !436)
!441 = !DILocalVariable(name: "val", arg: 2, scope: !436, file: !293, line: 105, type: !28)
!442 = !DILocation(line: 105, column: 29, scope: !436)
!443 = !DILocation(line: 106, column: 3, scope: !436)
!444 = !DILocation(line: 106, column: 9, scope: !436)
!445 = !DILocation(line: 107, column: 13, scope: !436)
!446 = !DILocation(line: 107, column: 9, scope: !436)
!447 = !DILocation(line: 108, column: 11, scope: !436)
!448 = !DILocation(line: 109, column: 10, scope: !436)
!449 = !DILocation(line: 110, column: 4, scope: !436)
!450 = !DILocation(line: 110, column: 10, scope: !436)
!451 = !DILocation(line: 112, column: 10, scope: !436)
!452 = distinct !DISubprogram(name: "comm.Unnotify..1command_line_arguments.IntValue", linkageName: "command_line_arguments.IntValue.Unnotify", scope: null, file: !293, line: 93, type: !453, isLocal: false, isDefinition: true, scopeLine: 93, isOptimized: false, unit: !1, retainedNodes: !3)
!453 = !DISubroutineType(types: !454)
!454 = !{!37, !421, !421, !13}
!455 = !DILocalVariable(name: "v", arg: 1, scope: !452, file: !293, line: 93, type: !421)
!456 = !DILocation(line: 93, column: 1, scope: !452)
!457 = !DILocalVariable(name: "id", arg: 2, scope: !452, file: !293, line: 93, type: !13)
!458 = !DILocation(line: 93, column: 29, scope: !452)
!459 = !DILocation(line: 94, column: 3, scope: !452)
!460 = !DILocation(line: 94, column: 9, scope: !452)
!461 = distinct !DISubprogram(name: "comm.Value..1command_line_arguments.IntValue", linkageName: "command_line_arguments.IntValue.Value", scope: null, file: !293, line: 98, type: !462, isLocal: false, isDefinition: true, scopeLine: 98, isOptimized: false, unit: !1, retainedNodes: !3)
!462 = !DISubroutineType(types: !463)
!463 = !{!28, !421, !421}
!464 = !DILocalVariable(name: "v", arg: 1, scope: !461, file: !293, line: 98, type: !421)
!465 = !DILocation(line: 98, column: 1, scope: !461)
!466 = !DILocalVariable(name: "$ret6", scope: !461, file: !293, line: 98, type: !28)
!467 = !DILocation(line: 98, column: 28, scope: !461)
!468 = !DILocation(line: 99, column: 3, scope: !461)
!469 = !DILocation(line: 102, column: 1, scope: !461)
!470 = !DILocation(line: 99, column: 9, scope: !461)
!471 = !DILocation(line: 100, column: 9, scope: !461)
!472 = !DILocation(line: 100, column: 2, scope: !461)
!473 = !DILocation(line: 101, column: 10, scope: !461)
!474 = !DILocation(line: 101, column: 2, scope: !461)
!475 = distinct !DISubprogram(name: "comm.command_line_arguments..thunk8", scope: null, file: !293, line: 100, type: !247, isLocal: true, isDefinition: true, scopeLine: 100, isOptimized: false, unit: !1, retainedNodes: !3)
!476 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !475, file: !293, line: 100, type: !249)
!477 = !DILocation(line: 100, column: 2, scope: !475)
!478 = !DILocalVariable(name: "$ret23", scope: !475, file: !293, line: 100, type: !125)
!479 = distinct !DISubprogram(name: "comm.Notify..1command_line_arguments.Float64Value", linkageName: "command_line_arguments.Float64Value.Notify", scope: null, file: !293, line: 124, type: !480, isLocal: false, isDefinition: true, scopeLine: 124, isOptimized: false, unit: !1, retainedNodes: !3)
!480 = !DISubroutineType(types: !481)
!481 = !{!13, !482, !482, !44}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "Float64Value", file: !293, line: 117, size: 384, align: 8, elements: !484)
!484 = !{!485, !487, !488}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !293, line: 118, baseType: !486, size: 64, align: 64)
!486 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "relay", file: !293, line: 119, baseType: !15, size: 256, align: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !293, line: 120, baseType: !18, size: 64, align: 32, offset: 320)
!489 = !DILocalVariable(name: "v", arg: 1, scope: !479, file: !293, line: 124, type: !482)
!490 = !DILocation(line: 124, column: 1, scope: !479)
!491 = !DILocalVariable(name: "f", arg: 2, scope: !479, file: !293, line: 124, type: !44)
!492 = !DILocation(line: 124, column: 31, scope: !479)
!493 = !DILocalVariable(name: "$ret7", scope: !479, file: !293, line: 124, type: !13)
!494 = !DILocation(line: 124, column: 41, scope: !479)
!495 = !DILocation(line: 125, column: 10, scope: !479)
!496 = !DILocation(line: 125, column: 16, scope: !479)
!497 = !DILocation(line: 125, column: 2, scope: !479)
!498 = distinct !DISubprogram(name: "comm.SetValue..1command_line_arguments.Float64Value", linkageName: "command_line_arguments.Float64Value.SetValue", scope: null, file: !293, line: 141, type: !499, isLocal: false, isDefinition: true, scopeLine: 141, isOptimized: false, unit: !1, retainedNodes: !3)
!499 = !DISubroutineType(types: !500)
!500 = !{!37, !482, !482, !486}
!501 = !DILocalVariable(name: "v", arg: 1, scope: !498, file: !293, line: 141, type: !482)
!502 = !DILocation(line: 141, column: 1, scope: !498)
!503 = !DILocalVariable(name: "val", arg: 2, scope: !498, file: !293, line: 141, type: !486)
!504 = !DILocation(line: 141, column: 33, scope: !498)
!505 = !DILocation(line: 142, column: 3, scope: !498)
!506 = !DILocation(line: 142, column: 9, scope: !498)
!507 = !DILocation(line: 143, column: 13, scope: !498)
!508 = !DILocation(line: 143, column: 9, scope: !498)
!509 = !DILocation(line: 144, column: 11, scope: !498)
!510 = !DILocation(line: 145, column: 10, scope: !498)
!511 = !DILocation(line: 146, column: 4, scope: !498)
!512 = !DILocation(line: 146, column: 10, scope: !498)
!513 = !DILocation(line: 148, column: 10, scope: !498)
!514 = distinct !DISubprogram(name: "comm.Unnotify..1command_line_arguments.Float64Value", linkageName: "command_line_arguments.Float64Value.Unnotify", scope: null, file: !293, line: 129, type: !515, isLocal: false, isDefinition: true, scopeLine: 129, isOptimized: false, unit: !1, retainedNodes: !3)
!515 = !DISubroutineType(types: !516)
!516 = !{!37, !482, !482, !13}
!517 = !DILocalVariable(name: "v", arg: 1, scope: !514, file: !293, line: 129, type: !482)
!518 = !DILocation(line: 129, column: 1, scope: !514)
!519 = !DILocalVariable(name: "id", arg: 2, scope: !514, file: !293, line: 129, type: !13)
!520 = !DILocation(line: 129, column: 33, scope: !514)
!521 = !DILocation(line: 130, column: 3, scope: !514)
!522 = !DILocation(line: 130, column: 9, scope: !514)
!523 = distinct !DISubprogram(name: "comm.Value..1command_line_arguments.Float64Value", linkageName: "command_line_arguments.Float64Value.Value", scope: null, file: !293, line: 134, type: !524, isLocal: false, isDefinition: true, scopeLine: 134, isOptimized: false, unit: !1, retainedNodes: !3)
!524 = !DISubroutineType(types: !525)
!525 = !{!486, !482, !482}
!526 = !DILocalVariable(name: "v", arg: 1, scope: !523, file: !293, line: 134, type: !482)
!527 = !DILocation(line: 134, column: 1, scope: !523)
!528 = !DILocalVariable(name: "$ret8", scope: !523, file: !293, line: 134, type: !486)
!529 = !DILocation(line: 134, column: 32, scope: !523)
!530 = !DILocation(line: 135, column: 3, scope: !523)
!531 = !DILocation(line: 138, column: 1, scope: !523)
!532 = !DILocation(line: 135, column: 9, scope: !523)
!533 = !DILocation(line: 136, column: 9, scope: !523)
!534 = !DILocation(line: 136, column: 2, scope: !523)
!535 = !DILocation(line: 137, column: 10, scope: !523)
!536 = !DILocation(line: 137, column: 2, scope: !523)
!537 = distinct !DISubprogram(name: "comm.command_line_arguments..thunk9", scope: null, file: !293, line: 136, type: !247, isLocal: true, isDefinition: true, scopeLine: 136, isOptimized: false, unit: !1, retainedNodes: !3)
!538 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !537, file: !293, line: 136, type: !249)
!539 = !DILocation(line: 136, column: 2, scope: !537)
!540 = !DILocalVariable(name: "$ret24", scope: !537, file: !293, line: 136, type: !125)
!541 = distinct !DISubprogram(name: "comm.Notify..1command_line_arguments.StringValue", linkageName: "command_line_arguments.StringValue.Notify", scope: null, file: !293, line: 160, type: !542, isLocal: false, isDefinition: true, scopeLine: 160, isOptimized: false, unit: !1, retainedNodes: !3)
!542 = !DISubroutineType(types: !543)
!543 = !{!13, !544, !544, !44}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "StringValue", file: !293, line: 153, size: 448, align: 8, elements: !546)
!546 = !{!547, !548, !549}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !293, line: 154, baseType: !130, size: 128, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "relay", file: !293, line: 155, baseType: !15, size: 256, align: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !293, line: 156, baseType: !18, size: 64, align: 32, offset: 384)
!550 = !DILocalVariable(name: "v", arg: 1, scope: !541, file: !293, line: 160, type: !544)
!551 = !DILocation(line: 160, column: 1, scope: !541)
!552 = !DILocalVariable(name: "f", arg: 2, scope: !541, file: !293, line: 160, type: !44)
!553 = !DILocation(line: 160, column: 30, scope: !541)
!554 = !DILocalVariable(name: "$ret9", scope: !541, file: !293, line: 160, type: !13)
!555 = !DILocation(line: 160, column: 40, scope: !541)
!556 = !DILocation(line: 161, column: 10, scope: !541)
!557 = !DILocation(line: 161, column: 16, scope: !541)
!558 = !DILocation(line: 161, column: 2, scope: !541)
!559 = distinct !DISubprogram(name: "comm.SetValue..1command_line_arguments.StringValue", linkageName: "command_line_arguments.StringValue.SetValue", scope: null, file: !293, line: 177, type: !560, isLocal: false, isDefinition: true, scopeLine: 177, isOptimized: false, unit: !1, retainedNodes: !3)
!560 = !DISubroutineType(types: !561)
!561 = !{!37, !544, !544, !130}
!562 = !DILocalVariable(name: "v", arg: 1, scope: !559, file: !293, line: 177, type: !544)
!563 = !DILocation(line: 177, column: 1, scope: !559)
!564 = !DILocation(line: 178, column: 3, scope: !559)
!565 = !DILocation(line: 178, column: 9, scope: !559)
!566 = !DILocation(line: 179, column: 9, scope: !559)
!567 = !DILocation(line: 180, column: 11, scope: !559)
!568 = !DILocation(line: 181, column: 10, scope: !559)
!569 = !DILocation(line: 182, column: 4, scope: !559)
!570 = !DILocation(line: 182, column: 10, scope: !559)
!571 = !DILocation(line: 184, column: 10, scope: !559)
!572 = distinct !DISubprogram(name: "comm.Unnotify..1command_line_arguments.StringValue", linkageName: "command_line_arguments.StringValue.Unnotify", scope: null, file: !293, line: 165, type: !573, isLocal: false, isDefinition: true, scopeLine: 165, isOptimized: false, unit: !1, retainedNodes: !3)
!573 = !DISubroutineType(types: !574)
!574 = !{!37, !544, !544, !13}
!575 = !DILocalVariable(name: "v", arg: 1, scope: !572, file: !293, line: 165, type: !544)
!576 = !DILocation(line: 165, column: 1, scope: !572)
!577 = !DILocalVariable(name: "id", arg: 2, scope: !572, file: !293, line: 165, type: !13)
!578 = !DILocation(line: 165, column: 32, scope: !572)
!579 = !DILocation(line: 166, column: 3, scope: !572)
!580 = !DILocation(line: 166, column: 9, scope: !572)
!581 = distinct !DISubprogram(name: "comm.Value..1command_line_arguments.StringValue", linkageName: "command_line_arguments.StringValue.Value", scope: null, file: !293, line: 170, type: !582, isLocal: false, isDefinition: true, scopeLine: 170, isOptimized: false, unit: !1, retainedNodes: !3)
!582 = !DISubroutineType(types: !583)
!583 = !{!130, !544, !544}
!584 = !DILocalVariable(name: "v", arg: 1, scope: !581, file: !293, line: 170, type: !544)
!585 = !DILocation(line: 170, column: 1, scope: !581)
!586 = !DILocalVariable(name: "$ret10", scope: !581, file: !293, line: 170, type: !130)
!587 = !DILocation(line: 170, column: 31, scope: !581)
!588 = !DILocation(line: 171, column: 3, scope: !581)
!589 = !DILocation(line: 174, column: 1, scope: !581)
!590 = !DILocation(line: 171, column: 9, scope: !581)
!591 = !DILocation(line: 172, column: 9, scope: !581)
!592 = !DILocation(line: 172, column: 2, scope: !581)
!593 = !DILocation(line: 173, column: 10, scope: !581)
!594 = !DILocation(line: 173, column: 2, scope: !581)
!595 = distinct !DISubprogram(name: "comm.command_line_arguments..thunk10", scope: null, file: !293, line: 172, type: !247, isLocal: true, isDefinition: true, scopeLine: 172, isOptimized: false, unit: !1, retainedNodes: !3)
!596 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !595, file: !293, line: 172, type: !249)
!597 = !DILocation(line: 172, column: 2, scope: !595)
!598 = !DILocalVariable(name: "$ret25", scope: !595, file: !293, line: 172, type: !125)
!599 = distinct !DISubprogram(name: "comm.Notify..1command_line_arguments.Bytes", linkageName: "command_line_arguments.Bytes.Notify", scope: null, file: !293, line: 196, type: !600, isLocal: false, isDefinition: true, scopeLine: 196, isOptimized: false, unit: !1, retainedNodes: !3)
!600 = !DISubroutineType(types: !601)
!601 = !{!13, !602, !602, !44}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bytes", file: !293, line: 189, size: 512, align: 8, elements: !604)
!604 = !{!605, !609, !610}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !293, line: 190, baseType: !606, size: 192, align: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !97, size: 192, align: 8, elements: !607)
!607 = !{!608, !150, !151}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !97, line: 1, baseType: !127, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "relay", file: !293, line: 191, baseType: !15, size: 256, align: 64, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !293, line: 192, baseType: !18, size: 64, align: 32, offset: 448)
!611 = !DILocalVariable(name: "v", arg: 1, scope: !599, file: !293, line: 196, type: !602)
!612 = !DILocation(line: 196, column: 1, scope: !599)
!613 = !DILocalVariable(name: "f", arg: 2, scope: !599, file: !293, line: 196, type: !44)
!614 = !DILocation(line: 196, column: 24, scope: !599)
!615 = !DILocalVariable(name: "$ret11", scope: !599, file: !293, line: 196, type: !13)
!616 = !DILocation(line: 196, column: 34, scope: !599)
!617 = !DILocation(line: 197, column: 10, scope: !599)
!618 = !DILocation(line: 197, column: 16, scope: !599)
!619 = !DILocation(line: 197, column: 2, scope: !599)
!620 = distinct !DISubprogram(name: "comm.SetValue..1command_line_arguments.Bytes", linkageName: "command_line_arguments.Bytes.SetValue", scope: null, file: !293, line: 213, type: !621, isLocal: false, isDefinition: true, scopeLine: 213, isOptimized: false, unit: !1, retainedNodes: !3)
!621 = !DISubroutineType(types: !622)
!622 = !{!37, !602, !602, !606}
!623 = !DILocalVariable(name: "val", arg: 2, scope: !620, file: !293, line: 213, type: !606)
!624 = !DILocation(line: 213, column: 26, scope: !620)
!625 = !DILocalVariable(name: "v", arg: 1, scope: !620, file: !293, line: 213, type: !602)
!626 = !DILocation(line: 213, column: 1, scope: !620)
!627 = !DILocation(line: 214, column: 3, scope: !620)
!628 = !DILocation(line: 214, column: 9, scope: !620)
!629 = !DILocation(line: 215, column: 10, scope: !620)
!630 = !DILocation(line: 216, column: 9, scope: !620)
!631 = !DILocation(line: 217, column: 3, scope: !620)
!632 = !DILocation(line: 217, column: 9, scope: !620)
!633 = distinct !DISubprogram(name: "comm.Unnotify..1command_line_arguments.Bytes", linkageName: "command_line_arguments.Bytes.Unnotify", scope: null, file: !293, line: 201, type: !634, isLocal: false, isDefinition: true, scopeLine: 201, isOptimized: false, unit: !1, retainedNodes: !3)
!634 = !DISubroutineType(types: !635)
!635 = !{!37, !602, !602, !13}
!636 = !DILocalVariable(name: "v", arg: 1, scope: !633, file: !293, line: 201, type: !602)
!637 = !DILocation(line: 201, column: 1, scope: !633)
!638 = !DILocalVariable(name: "id", arg: 2, scope: !633, file: !293, line: 201, type: !13)
!639 = !DILocation(line: 201, column: 26, scope: !633)
!640 = !DILocation(line: 202, column: 3, scope: !633)
!641 = !DILocation(line: 202, column: 9, scope: !633)
!642 = distinct !DISubprogram(name: "comm.Value..1command_line_arguments.Bytes", linkageName: "command_line_arguments.Bytes.Value", scope: null, file: !293, line: 206, type: !643, isLocal: false, isDefinition: true, scopeLine: 206, isOptimized: false, unit: !1, retainedNodes: !3)
!643 = !DISubroutineType(types: !644)
!644 = !{!606, !602, !602}
!645 = !DILocalVariable(name: "v", arg: 1, scope: !642, file: !293, line: 206, type: !602)
!646 = !DILocation(line: 206, column: 1, scope: !642)
!647 = !DILocation(line: 207, column: 3, scope: !642)
!648 = !DILocation(line: 210, column: 1, scope: !642)
!649 = !DILocation(line: 207, column: 9, scope: !642)
!650 = !DILocation(line: 208, column: 9, scope: !642)
!651 = !DILocation(line: 208, column: 2, scope: !642)
!652 = !DILocation(line: 209, column: 10, scope: !642)
!653 = !DILocation(line: 209, column: 2, scope: !642)
!654 = distinct !DISubprogram(name: "comm.command_line_arguments..thunk11", scope: null, file: !293, line: 208, type: !247, isLocal: true, isDefinition: true, scopeLine: 208, isOptimized: false, unit: !1, retainedNodes: !3)
!655 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !654, file: !293, line: 208, type: !249)
!656 = !DILocation(line: 208, column: 2, scope: !654)
!657 = !DILocalVariable(name: "$ret26", scope: !654, file: !293, line: 208, type: !125)
!658 = distinct !DISubprogram(name: "comm.Notify..1command_line_arguments.ColorValue", linkageName: "command_line_arguments.ColorValue.Notify", scope: null, file: !293, line: 228, type: !659, isLocal: false, isDefinition: true, scopeLine: 228, isOptimized: false, unit: !1, retainedNodes: !3)
!659 = !DISubroutineType(types: !660)
!660 = !{!13, !661, !661, !44}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorValue", file: !293, line: 221, size: 448, align: 8, elements: !663)
!663 = !{!664, !682, !683}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !293, line: 222, baseType: !665, size: 128, align: 64)
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", file: !92, line: 4, size: 128, align: 8, elements: !666)
!666 = !{!667, !161}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !92, line: 4, baseType: !668, size: 64, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{uint32,uint32,uint32,uint32}}", file: !97, size: 128, align: 8, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !97, line: 4, baseType: !100, size: 64, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "RGBA", file: !97, line: 4, baseType: !673, size: 64, align: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!676, !36}
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{uint32,uint32,uint32,uint32}", file: !97, size: 128, align: 8, elements: !677)
!677 = !{!678, !679, !680, !681}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !97, line: 4, baseType: !8, size: 32, align: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !97, line: 4, baseType: !8, size: 32, align: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !97, line: 4, baseType: !8, size: 32, align: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "a", file: !97, line: 4, baseType: !8, size: 32, align: 32, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "relay", file: !293, line: 223, baseType: !15, size: 256, align: 64, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !293, line: 224, baseType: !18, size: 64, align: 32, offset: 384)
!684 = !DILocalVariable(name: "v", arg: 1, scope: !658, file: !293, line: 228, type: !661)
!685 = !DILocation(line: 228, column: 1, scope: !658)
!686 = !DILocalVariable(name: "f", arg: 2, scope: !658, file: !293, line: 228, type: !44)
!687 = !DILocation(line: 228, column: 29, scope: !658)
!688 = !DILocalVariable(name: "$ret13", scope: !658, file: !293, line: 228, type: !13)
!689 = !DILocation(line: 228, column: 39, scope: !658)
!690 = !DILocation(line: 229, column: 10, scope: !658)
!691 = !DILocation(line: 229, column: 16, scope: !658)
!692 = !DILocation(line: 229, column: 2, scope: !658)
!693 = distinct !DISubprogram(name: "comm.SetValue..1command_line_arguments.ColorValue", linkageName: "command_line_arguments.ColorValue.SetValue", scope: null, file: !293, line: 245, type: !694, isLocal: false, isDefinition: true, scopeLine: 245, isOptimized: false, unit: !1, retainedNodes: !3)
!694 = !DISubroutineType(types: !695)
!695 = !{!37, !661, !661, !665}
!696 = !DILocalVariable(name: "v", arg: 1, scope: !693, file: !293, line: 245, type: !661)
!697 = !DILocation(line: 245, column: 1, scope: !693)
!698 = !DILocation(line: 246, column: 3, scope: !693)
!699 = !DILocation(line: 246, column: 9, scope: !693)
!700 = !DILocation(line: 247, column: 9, scope: !693)
!701 = !DILocation(line: 248, column: 11, scope: !693)
!702 = !DILocation(line: 249, column: 10, scope: !693)
!703 = !DILocation(line: 250, column: 4, scope: !693)
!704 = !DILocation(line: 250, column: 10, scope: !693)
!705 = !DILocation(line: 252, column: 10, scope: !693)
!706 = distinct !DISubprogram(name: "comm.Unnotify..1command_line_arguments.ColorValue", linkageName: "command_line_arguments.ColorValue.Unnotify", scope: null, file: !293, line: 233, type: !707, isLocal: false, isDefinition: true, scopeLine: 233, isOptimized: false, unit: !1, retainedNodes: !3)
!707 = !DISubroutineType(types: !708)
!708 = !{!37, !661, !661, !13}
!709 = !DILocalVariable(name: "v", arg: 1, scope: !706, file: !293, line: 233, type: !661)
!710 = !DILocation(line: 233, column: 1, scope: !706)
!711 = !DILocalVariable(name: "id", arg: 2, scope: !706, file: !293, line: 233, type: !13)
!712 = !DILocation(line: 233, column: 31, scope: !706)
!713 = !DILocation(line: 234, column: 3, scope: !706)
!714 = !DILocation(line: 234, column: 9, scope: !706)
!715 = distinct !DISubprogram(name: "comm.Value..1command_line_arguments.ColorValue", linkageName: "command_line_arguments.ColorValue.Value", scope: null, file: !293, line: 238, type: !716, isLocal: false, isDefinition: true, scopeLine: 238, isOptimized: false, unit: !1, retainedNodes: !3)
!716 = !DISubroutineType(types: !717)
!717 = !{!665, !661, !661}
!718 = !DILocalVariable(name: "v", arg: 1, scope: !715, file: !293, line: 238, type: !661)
!719 = !DILocation(line: 238, column: 1, scope: !715)
!720 = !DILocalVariable(name: "$ret14", scope: !715, file: !293, line: 238, type: !665)
!721 = !DILocation(line: 238, column: 30, scope: !715)
!722 = !DILocation(line: 239, column: 3, scope: !715)
!723 = !DILocation(line: 242, column: 1, scope: !715)
!724 = !DILocation(line: 239, column: 9, scope: !715)
!725 = !DILocation(line: 240, column: 9, scope: !715)
!726 = !DILocation(line: 240, column: 2, scope: !715)
!727 = !DILocation(line: 241, column: 10, scope: !715)
!728 = !DILocation(line: 241, column: 2, scope: !715)
!729 = distinct !DISubprogram(name: "comm.command_line_arguments..thunk12", scope: null, file: !293, line: 240, type: !247, isLocal: true, isDefinition: true, scopeLine: 240, isOptimized: false, unit: !1, retainedNodes: !3)
!730 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !729, file: !293, line: 240, type: !249)
!731 = !DILocation(line: 240, column: 2, scope: !729)
!732 = !DILocalVariable(name: "$ret27", scope: !729, file: !293, line: 240, type: !125)
