; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22internal\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/gogo/protobuf/proto\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/gogo/protobuf/proto\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22application\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22gomatcha.io/matcha/application\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22gomatcha.io/matcha/application\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bridge\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./color.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha/internal")
!3 = !{}
!4 = !{!5, !14, !37, !40, !64}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.middlewaresMu", linkageName: "command_line_arguments.middlewaresMu", scope: !1, file: !7, line: 5, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "middleware.go", directory: ".")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 3, size: 64, align: 8, elements: !9)
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 3, baseType: !11, size: 32, align: 32)
!11 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 3, baseType: !13, size: 32, align: 32, offset: 32)
!13 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "command_line_arguments.middlewares", linkageName: "command_line_arguments.middlewares", scope: !1, file: !7, line: 6, type: !16, isLocal: true, isDefinition: true)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**__go_descriptor,int,int}", file: !17, size: 192, align: 8, elements: !18)
!17 = !DIFile(filename: "", directory: "")
!18 = !{!19, !34, !36}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 6, size: 64, align: 8, elements: !23)
!23 = !{!24}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 6, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{!28}
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !17, size: 128, align: 8, elements: !29)
!29 = !{!30, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 1, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIBasicType(name: "void")
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !17, line: 1, baseType: !31, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !17, line: 1, baseType: !35, size: 64, align: 64, offset: 64)
!35 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !17, line: 1, baseType: !35, size: 64, align: 64, offset: 128)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !39, line: 1, type: !13, isLocal: false, isDefinition: true)
!39 = !DIFile(filename: "<built-in>", directory: "")
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "command_line_arguments.tickers", linkageName: "command_line_arguments.tickers", scope: !1, file: !42, line: 9, type: !43, isLocal: true, isDefinition: true)
!42 = !DIFile(filename: "ticker.go", directory: ".")
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*runtime.hmap,*Mutex,int}", file: !17, size: 192, align: 8, elements: !44)
!44 = !{!45, !61, !63}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ts", file: !17, line: 10, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !39, line: 1, size: 384, align: 8, elements: !48)
!48 = !{!49, !50, !52, !53, !55, !56, !57, !58, !60}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !39, line: 1, baseType: !35, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !39, line: 1, baseType: !51, size: 8, align: 8, offset: 64)
!51 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !39, line: 1, baseType: !51, size: 8, align: 8, offset: 72)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !39, line: 1, baseType: !54, size: 16, align: 16, offset: 80)
!54 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !39, line: 1, baseType: !13, size: 32, align: 32, offset: 96)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !39, line: 1, baseType: !31, size: 64, align: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !39, line: 1, baseType: !31, size: 64, align: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !39, line: 1, baseType: !59, size: 64, align: 64, offset: 256)
!59 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !39, line: 1, baseType: !31, size: 64, align: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !17, line: 11, baseType: !62, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "maxKey", file: !17, line: 12, baseType: !35, size: 64, align: 64, offset: 128)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "os.Stdout", linkageName: "os.Stdout", scope: !1, file: !66, line: 5, type: !67, isLocal: false, isDefinition: true)
!66 = !DIFile(filename: "tools.go", directory: ".")
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !66, line: 5, size: 64, align: 8, elements: !69)
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !66, line: 5, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !66, line: 5, size: 640, align: 8, elements: !73)
!73 = !{!74, !107, !112, !123, !124}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !66, line: 5, baseType: !75, size: 384, align: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !66, line: 5, size: 384, align: 8, elements: !76)
!76 = !{!77, !84, !85, !89, !101, !102, !104, !105, !106}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !66, line: 5, baseType: !78, size: 128, align: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !66, line: 5, size: 128, align: 8, elements: !79)
!79 = !{!80, !82, !83}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !66, line: 5, baseType: !81, size: 64, align: 64)
!81 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !66, line: 5, baseType: !13, size: 32, align: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !66, line: 5, baseType: !13, size: 32, align: 32, offset: 96)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !66, line: 5, baseType: !35, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !66, line: 5, baseType: !86, size: 64, align: 64, offset: 192)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !66, line: 5, size: 64, align: 8, elements: !87)
!87 = !{!88}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !66, line: 5, baseType: !59, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !66, line: 5, baseType: !90, size: 64, align: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !17, size: 192, align: 8, elements: !92)
!92 = !{!93, !34, !36}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !66, line: 5, size: 128, align: 8, elements: !96)
!96 = !{!97, !99}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !66, line: 5, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !66, line: 5, baseType: !100, size: 64, align: 64, offset: 64)
!100 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !66, line: 5, baseType: !13, size: 32, align: 32, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !66, line: 5, baseType: !103, size: 8, align: 8, offset: 352)
!103 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !66, line: 5, baseType: !103, size: 8, align: 8, offset: 360)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !66, line: 5, baseType: !103, size: 8, align: 8, offset: 368)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !66, line: 5, baseType: !103, size: 8, align: 8, offset: 376)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !66, line: 5, baseType: !108, size: 128, align: 64, offset: 384)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !39, line: 1, size: 128, align: 8, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !39, line: 1, baseType: !98, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !39, line: 1, baseType: !35, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !66, line: 5, baseType: !113, size: 64, align: 64, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !66, line: 5, size: 256, align: 8, elements: !115)
!115 = !{!116, !120}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !66, line: 5, baseType: !117, size: 192, align: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !17, size: 192, align: 8, elements: !118)
!118 = !{!119, !34, !36}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !98, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !66, line: 5, baseType: !121, size: 64, align: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !66, line: 5, align: 8, elements: !3)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !66, line: 5, baseType: !103, size: 8, align: 8, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !66, line: 5, baseType: !103, size: 8, align: 8, offset: 584)
!125 = distinct !DISubprogram(name: "internal.TintColor", linkageName: "command_line_arguments.TintColor", scope: null, file: !126, line: 10, type: !127, isLocal: false, isDefinition: true, scopeLine: 10, isOptimized: false, unit: !1, retainedNodes: !3)
!126 = !DIFile(filename: "color.go", directory: ".")
!127 = !DISubroutineType(types: !128)
!128 = !{!129, !129, !140}
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !126, line: 4, size: 128, align: 8, elements: !130)
!130 = !{!131, !156}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !126, line: 4, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,int,int)Color,*func(*void)Rectangle,*func(*void)Model}", file: !17, size: 256, align: 8, elements: !134)
!134 = !{!135, !136, !157, !169}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 4, baseType: !31, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "At", file: !17, line: 4, baseType: !137, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!140, !31, !35, !35}
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", file: !126, line: 4, size: 128, align: 8, elements: !141)
!141 = !{!142, !156}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !126, line: 4, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{uint32,uint32,uint32,uint32}}", file: !17, size: 128, align: 8, elements: !145)
!145 = !{!135, !146}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "RGBA", file: !17, line: 4, baseType: !147, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!150, !31}
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{uint32,uint32,uint32,uint32}", file: !17, size: 128, align: 8, elements: !151)
!151 = !{!152, !153, !154, !155}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !17, line: 4, baseType: !13, size: 32, align: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !17, line: 4, baseType: !13, size: 32, align: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !17, line: 4, baseType: !13, size: 32, align: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "a", file: !17, line: 4, baseType: !13, size: 32, align: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !126, line: 1, baseType: !31, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Bounds", file: !17, line: 4, baseType: !158, size: 64, align: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!161, !31}
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rectangle", file: !126, line: 4, size: 256, align: 8, elements: !162)
!162 = !{!163, !168}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Min", file: !126, line: 4, baseType: !164, size: 128, align: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "Point", file: !126, line: 4, size: 128, align: 8, elements: !165)
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "X", file: !126, line: 4, baseType: !35, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Y", file: !126, line: 4, baseType: !35, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Max", file: !126, line: 4, baseType: !164, size: 128, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ColorModel", file: !17, line: 4, baseType: !170, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!173, !31}
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "Model", file: !126, line: 4, size: 128, align: 8, elements: !174)
!174 = !{!175, !156}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !126, line: 4, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Color)Color}", file: !17, size: 128, align: 8, elements: !178)
!178 = !{!135, !179}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Convert", file: !17, line: 4, baseType: !180, size: 64, align: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!140, !31, !140}
!183 = !DILocalVariable(name: "img", arg: 1, scope: !125, file: !126, line: 10, type: !129)
!184 = !DILocation(line: 10, column: 16, scope: !125)
!185 = !DILocalVariable(name: "color", arg: 2, scope: !125, file: !126, line: 10, type: !140)
!186 = !DILocation(line: 10, column: 33, scope: !125)
!187 = !DILocalVariable(name: "$ret0", scope: !125, file: !126, line: 10, type: !129)
!188 = !DILocation(line: 10, column: 52, scope: !125)
!189 = !DILocation(line: 11, column: 2, scope: !125)
!190 = distinct !DISubprogram(name: "internal.RegisterMiddleware", linkageName: "command_line_arguments.RegisterMiddleware", scope: null, file: !7, line: 9, type: !191, isLocal: false, isDefinition: true, scopeLine: 9, isOptimized: false, unit: !1, retainedNodes: !3)
!191 = !DISubroutineType(types: !192)
!192 = !{!32, !21}
!193 = !DILocalVariable(name: "v", arg: 1, scope: !190, file: !7, line: 9, type: !21)
!194 = !DILocation(line: 9, column: 25, scope: !190)
!195 = !DILocation(line: 10, column: 15, scope: !190)
!196 = !DILocation(line: 14, column: 1, scope: !190)
!197 = !DILocation(line: 11, column: 2, scope: !190)
!198 = !DILocation(line: 13, column: 16, scope: !190)
!199 = !DILocation(line: 13, column: 14, scope: !190)
!200 = distinct !DISubprogram(name: "internal.command_line_arguments..thunk0", scope: null, file: !7, line: 11, type: !201, isLocal: true, isDefinition: true, scopeLine: 11, isOptimized: false, unit: !1, retainedNodes: !3)
!201 = !DISubroutineType(types: !202)
!202 = !{!103, !203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{}", file: !17, align: 8, elements: !3)
!205 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !200, file: !7, line: 11, type: !203)
!206 = !DILocation(line: 11, column: 2, scope: !200)
!207 = !DILocalVariable(name: "$ret6", scope: !200, file: !7, line: 11, type: !103)
!208 = distinct !DISubprogram(name: "internal.Middlewares", linkageName: "command_line_arguments.Middlewares", scope: null, file: !7, line: 16, type: !209, isLocal: false, isDefinition: true, scopeLine: 16, isOptimized: false, unit: !1, retainedNodes: !3)
!209 = !DISubroutineType(types: !210)
!210 = !{!16}
!211 = !DILocation(line: 17, column: 15, scope: !208)
!212 = !DILocation(line: 21, column: 1, scope: !208)
!213 = !DILocation(line: 18, column: 2, scope: !208)
!214 = !DILocation(line: 20, column: 2, scope: !208)
!215 = distinct !DISubprogram(name: "internal.command_line_arguments..thunk1", scope: null, file: !7, line: 18, type: !201, isLocal: true, isDefinition: true, scopeLine: 18, isOptimized: false, unit: !1, retainedNodes: !3)
!216 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !215, file: !7, line: 18, type: !203)
!217 = !DILocation(line: 18, column: 2, scope: !215)
!218 = !DILocalVariable(name: "$ret7", scope: !215, file: !7, line: 18, type: !103)
!219 = distinct !DISubprogram(name: "internal.ReflectName", linkageName: "command_line_arguments.ReflectName", scope: null, file: !220, line: 5, type: !221, isLocal: false, isDefinition: true, scopeLine: 5, isOptimized: false, unit: !1, retainedNodes: !3)
!220 = !DIFile(filename: "reflect.go", directory: ".")
!221 = !DISubroutineType(types: !222)
!222 = !{!108, !28}
!223 = !DILocalVariable(name: "a", arg: 1, scope: !219, file: !220, line: 5, type: !28)
!224 = !DILocation(line: 5, column: 18, scope: !219)
!225 = !DILocation(line: 6, column: 19, scope: !226)
!226 = distinct !DILexicalBlock(scope: !219, file: !220, line: 5, column: 1)
!227 = !DILocation(line: 6, column: 28, scope: !226)
!228 = !DILocalVariable(name: "iType", scope: !226, file: !220, line: 6, type: !229)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type", file: !220, line: 3, size: 128, align: 8, elements: !230)
!230 = !{!231, !410}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !220, line: 3, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,Type)bool,*func(*void)int,*func(*void)ChanDir,*func(*void)bool,*func(*void,Type)bool,*func(*void)Type,*func(*void,int)StructField,*func(*void)int,*func(*void,struct{*int,int,int})StructField,*func(*void,string)struct{StructField,bool},*func(*void,*__go_descriptor)struct{StructField,bool},*func(*void,Type)bool,*func(*void,int)Type,*func(*void)bool,*func(*void)Type,*func(*void)Kind,*func(*void)int,*func(*void,int)Method,*func(*void,string)struct{Method,bool},*func(*void)string,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void)int,*func(*void,int)Type,*func(*void)string,*func(*void)uintptr,*func(*void)string,*func(*void)*.reflect.rtype,*func(*void)string,*func(*void)*.reflect.uncommonType}", file: !17, size: 2112, align: 8, elements: !234)
!234 = !{!235, !236, !240, !244, !245, !250, !254, !255, !259, !280, !281, !285, !293, !304, !305, !309, !310, !311, !316, !317, !378, !386, !390, !391, !392, !393, !394, !395, !396, !400, !401, !405, !406}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 3, baseType: !31, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Align", file: !17, line: 3, baseType: !237, size: 64, align: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!35, !31}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "AssignableTo", file: !17, line: 3, baseType: !241, size: 64, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!103, !31, !229}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Bits", file: !17, line: 3, baseType: !237, size: 64, align: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ChanDir", file: !17, line: 3, baseType: !246, size: 64, align: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!249, !31}
!249 = !DIBasicType(name: "ChanDir", size: 64, encoding: DW_ATE_signed)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Comparable", file: !17, line: 3, baseType: !251, size: 64, align: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!103, !31}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertibleTo", file: !17, line: 3, baseType: !241, size: 64, align: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Elem", file: !17, line: 3, baseType: !256, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!229, !31}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Field", file: !17, line: 3, baseType: !260, size: 64, align: 64, offset: 512)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!263, !31, !35}
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructField", file: !220, line: 3, size: 832, align: 8, elements: !264)
!264 = !{!265, !266, !267, !268, !273, !274, !279}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !220, line: 3, baseType: !108, size: 128, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !220, line: 3, baseType: !108, size: 128, align: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !220, line: 3, baseType: !229, size: 128, align: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", file: !220, line: 3, baseType: !269, size: 128, align: 64, offset: 384)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructTag", file: !220, line: 3, size: 128, align: 8, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !220, line: 1, baseType: !98, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !220, line: 1, baseType: !35, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !220, line: 3, baseType: !59, size: 64, align: 64, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !220, line: 3, baseType: !275, size: 192, align: 64, offset: 576)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !17, size: 192, align: 8, elements: !276)
!276 = !{!277, !34, !36}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Anonymous", file: !220, line: 3, baseType: !103, size: 8, align: 8, offset: 768)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "FieldAlign", file: !17, line: 3, baseType: !237, size: 64, align: 64, offset: 576)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByIndex", file: !17, line: 3, baseType: !282, size: 64, align: 64, offset: 640)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!263, !31, !275}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByName", file: !17, line: 3, baseType: !286, size: 64, align: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!289, !31, !108}
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{StructField,bool}", file: !17, size: 896, align: 8, elements: !290)
!290 = !{!291, !292}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 3, baseType: !263, size: 832, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 3, baseType: !103, size: 8, align: 8, offset: 832)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "FieldByNameFunc", file: !17, line: 3, baseType: !294, size: 64, align: 64, offset: 768)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!289, !31, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !220, line: 3, size: 64, align: 8, elements: !299)
!299 = !{!300}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !220, line: 3, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!103, !108}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Implements", file: !17, line: 3, baseType: !241, size: 64, align: 64, offset: 832)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "In", file: !17, line: 3, baseType: !306, size: 64, align: 64, offset: 896)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!229, !31, !35}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "IsVariadic", file: !17, line: 3, baseType: !251, size: 64, align: 64, offset: 960)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !17, line: 3, baseType: !256, size: 64, align: 64, offset: 1024)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !17, line: 3, baseType: !312, size: 64, align: 64, offset: 1088)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!315, !31}
!315 = !DIBasicType(name: "Kind", size: 64, encoding: DW_ATE_unsigned)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !17, line: 3, baseType: !237, size: 64, align: 64, offset: 1152)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !17, line: 3, baseType: !318, size: 64, align: 64, offset: 1216)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!321, !31, !35}
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method", file: !220, line: 3, size: 640, align: 8, elements: !322)
!322 = !{!265, !266, !267, !323, !377}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Func", file: !220, line: 3, baseType: !324, size: 192, align: 64, offset: 384)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !220, line: 3, size: 192, align: 8, elements: !325)
!325 = !{!326, !374, !375}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !220, line: 3, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.rtype", file: !220, line: 3, size: 576, align: 8, elements: !329)
!329 = !{!330, !331, !332, !333, !334, !336, !337, !338, !346, !354, !355, !357, !373}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !220, line: 3, baseType: !59, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !220, line: 3, baseType: !59, size: 64, align: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !220, line: 3, baseType: !13, size: 32, align: 32, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !220, line: 3, baseType: !51, size: 8, align: 8, offset: 160)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !220, line: 3, baseType: !335, size: 8, align: 8, offset: 168)
!335 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !220, line: 3, baseType: !51, size: 8, align: 8, offset: 176)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_", file: !220, line: 3, baseType: !51, size: 8, align: 8, offset: 184)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !220, line: 3, baseType: !339, size: 64, align: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !220, line: 3, size: 64, align: 8, elements: !341)
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !220, line: 3, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!59, !31, !59}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !220, line: 3, baseType: !347, size: 64, align: 64, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !220, line: 3, size: 64, align: 8, elements: !349)
!349 = !{!350}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !220, line: 3, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!103, !31, !31}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !220, line: 3, baseType: !98, size: 64, align: 64, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !220, line: 3, baseType: !356, size: 64, align: 64, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !220, line: 3, baseType: !358, size: 64, align: 64, offset: 448)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.uncommonType", file: !220, line: 3, size: 320, align: 8, elements: !360)
!360 = !{!361, !362, !363}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !220, line: 3, baseType: !356, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !220, line: 3, baseType: !356, size: 64, align: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !220, line: 3, baseType: !364, size: 192, align: 64, offset: 128)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.reflect.method,int,int}", file: !17, size: 192, align: 8, elements: !365)
!365 = !{!366, !34, !36}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.method", file: !220, line: 3, size: 320, align: 8, elements: !369)
!369 = !{!361, !362, !370, !371, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !220, line: 3, baseType: !31, size: 64, align: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !220, line: 3, baseType: !31, size: 64, align: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !220, line: 3, baseType: !31, size: 64, align: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !220, line: 3, baseType: !31, size: 64, align: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !220, line: 3, baseType: !31, size: 64, align: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !220, line: 3, baseType: !376, size: 64, align: 64, offset: 128)
!376 = !DIBasicType(name: ".reflect.flag", size: 64, encoding: DW_ATE_unsigned)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !220, line: 3, baseType: !35, size: 64, align: 64, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "MethodByName", file: !17, line: 3, baseType: !379, size: 64, align: 64, offset: 1280)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!382, !31, !108}
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Method,bool}", file: !17, size: 704, align: 8, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 3, baseType: !321, size: 640, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 3, baseType: !103, size: 8, align: 8, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !17, line: 3, baseType: !387, size: 64, align: 64, offset: 1344)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!108, !31}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "NumField", file: !17, line: 3, baseType: !237, size: 64, align: 64, offset: 1408)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "NumIn", file: !17, line: 3, baseType: !237, size: 64, align: 64, offset: 1472)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "NumMethod", file: !17, line: 3, baseType: !237, size: 64, align: 64, offset: 1536)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "NumOut", file: !17, line: 3, baseType: !237, size: 64, align: 64, offset: 1600)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !17, line: 3, baseType: !306, size: 64, align: 64, offset: 1664)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "PkgPath", file: !17, line: 3, baseType: !387, size: 64, align: 64, offset: 1728)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !17, line: 3, baseType: !397, size: 64, align: 64, offset: 1792)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!59, !31}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !17, line: 3, baseType: !387, size: 64, align: 64, offset: 1856)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "common", file: !17, line: 3, baseType: !402, size: 64, align: 64, offset: 1920)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!327, !31}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "rawString", file: !17, line: 3, baseType: !387, size: 64, align: 64, offset: 1984)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "uncommon", file: !17, line: 3, baseType: !407, size: 64, align: 64, offset: 2048)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!358, !31}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !220, line: 1, baseType: !31, size: 64, align: 64, offset: 64)
!411 = !DILocation(line: 6, column: 2, scope: !219)
!412 = !DILocation(line: 7, column: 16, scope: !226)
!413 = !DILocation(line: 7, column: 31, scope: !226)
!414 = !DILocation(line: 8, column: 2, scope: !226)
!415 = distinct !DISubprogram(name: "internal.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !126, line: 1, type: !416, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!416 = !DISubroutineType(types: !417)
!417 = !{!32}
!418 = !DILocation(line: 1, column: 1, scope: !419)
!419 = !DILexicalBlockFile(scope: !415, file: !39, discriminator: 0)
!420 = !DILocation(line: 14, column: 10, scope: !421)
!421 = !DILexicalBlockFile(scope: !415, file: !42, discriminator: 0)
!422 = !DILocation(line: 15, column: 10, scope: !421)
!423 = !DILocation(line: 9, column: 15, scope: !421)
!424 = !DILocation(line: 9, column: 5, scope: !421)
!425 = !DILocation(line: 19, column: 1, scope: !421)
!426 = !DILocation(line: 16, column: 1, scope: !427)
!427 = !DILexicalBlockFile(scope: !415, file: !66, discriminator: 0)
!428 = distinct !DISubprogram(name: "internal.Stop..1command_line_arguments.Ticker", linkageName: "command_line_arguments.Ticker.Stop", scope: null, file: !42, line: 55, type: !429, isLocal: false, isDefinition: true, scopeLine: 55, isOptimized: false, unit: !1, retainedNodes: !3)
!429 = !DISubroutineType(types: !430)
!430 = !{!32, !431, !431}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ticker", file: !42, line: 36, size: 192, align: 8, elements: !433)
!433 = !{!434, !435, !436}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !42, line: 37, baseType: !35, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !42, line: 38, baseType: !8, size: 64, align: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !42, line: 39, baseType: !437, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !42, line: 39, size: 64, align: 8, elements: !439)
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !42, line: 39, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!442 = !DILocalVariable(name: "t", arg: 1, scope: !428, file: !42, line: 55, type: !431)
!443 = !DILocation(line: 55, column: 1, scope: !428)
!444 = !DILocation(line: 56, column: 9, scope: !428)
!445 = !DILocation(line: 56, column: 12, scope: !428)
!446 = !DILocation(line: 62, column: 1, scope: !428)
!447 = !DILocation(line: 57, column: 15, scope: !428)
!448 = !DILocation(line: 57, column: 2, scope: !428)
!449 = !DILocation(line: 58, column: 3, scope: !428)
!450 = !DILocation(line: 58, column: 6, scope: !428)
!451 = !DILocation(line: 59, column: 9, scope: !428)
!452 = !DILocation(line: 59, column: 2, scope: !428)
!453 = !DILocation(line: 61, column: 16, scope: !428)
!454 = !DILocation(line: 61, column: 22, scope: !428)
!455 = !DILocation(line: 61, column: 2, scope: !428)
!456 = distinct !DISubprogram(name: "internal.signal..1command_line_arguments.Ticker", linkageName: "command_line_arguments.Ticker.signal", scope: null, file: !42, line: 64, type: !429, isLocal: false, isDefinition: true, scopeLine: 64, isOptimized: false, unit: !1, retainedNodes: !3)
!457 = !DILocalVariable(name: "t", arg: 1, scope: !456, file: !42, line: 64, type: !431)
!458 = !DILocation(line: 64, column: 1, scope: !456)
!459 = !DILocation(line: 65, column: 3, scope: !460)
!460 = distinct !DILexicalBlock(scope: !456, file: !42, line: 64, column: 1)
!461 = !DILocation(line: 65, column: 6, scope: !460)
!462 = !DILocation(line: 66, column: 8, scope: !460)
!463 = !DILocalVariable(name: "f", scope: !460, file: !42, line: 66, type: !437)
!464 = !DILocation(line: 66, column: 2, scope: !456)
!465 = !DILocation(line: 67, column: 6, scope: !460)
!466 = !DILocation(line: 69, column: 2, scope: !460)
!467 = distinct !DISubprogram(name: "internal.command_line_arguments..init0", linkageName: "command_line_arguments.command_line_arguments..init0", scope: null, file: !42, line: 19, type: !416, isLocal: false, isDefinition: true, scopeLine: 19, isOptimized: false, unit: !1, retainedNodes: !3)
!468 = !DILocation(line: 20, column: 65, scope: !467)
!469 = !DILocation(line: 20, column: 9, scope: !467)
!470 = distinct !DISubprogram(name: "internal.screenUpdate", scope: null, file: !42, line: 23, type: !416, isLocal: true, isDefinition: true, scopeLine: 23, isOptimized: false, unit: !1, retainedNodes: !3)
!471 = !DILocation(line: 24, column: 9, scope: !472)
!472 = distinct !DILexicalBlock(scope: !470, file: !42, line: 23, column: 1)
!473 = !DILocation(line: 24, column: 12, scope: !472)
!474 = !DILocation(line: 25, column: 8, scope: !472)
!475 = !DILocalVariable(name: "ts", scope: !472, file: !42, line: 25, type: !476)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Ticker,int,int}", file: !17, size: 192, align: 8, elements: !477)
!477 = !{!478, !34, !36}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !479, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!480 = !DILocation(line: 25, column: 2, scope: !470)
!481 = !DILocalVariable(name: "i", scope: !482, file: !42, line: 26, type: !431)
!482 = distinct !DILexicalBlock(scope: !472, file: !42, line: 26, column: 2)
!483 = !DILocation(line: 26, column: 6, scope: !472)
!484 = !DILocation(line: 26, column: 27, scope: !482)
!485 = !DILocation(line: 26, column: 2, scope: !482)
!486 = !DILocation(line: 29, column: 9, scope: !472)
!487 = !DILocation(line: 29, column: 12, scope: !472)
!488 = !DILocalVariable(name: "i", scope: !489, file: !42, line: 31, type: !431)
!489 = distinct !DILexicalBlock(scope: !472, file: !42, line: 31, column: 2)
!490 = !DILocation(line: 31, column: 6, scope: !472)
!491 = !DILocation(line: 27, column: 8, scope: !482)
!492 = !DILocation(line: 27, column: 6, scope: !482)
!493 = !DILocation(line: 31, column: 2, scope: !489)
!494 = !DILocation(line: 32, column: 4, scope: !489)
!495 = distinct !DISubprogram(name: "internal.NewTicker", linkageName: "command_line_arguments.NewTicker", scope: null, file: !42, line: 42, type: !496, isLocal: false, isDefinition: true, scopeLine: 42, isOptimized: false, unit: !1, retainedNodes: !3)
!496 = !DISubroutineType(types: !497)
!497 = !{!431, !437}
!498 = !DILocalVariable(name: "f", arg: 1, scope: !495, file: !42, line: 42, type: !437)
!499 = !DILocation(line: 42, column: 16, scope: !495)
!500 = !DILocalVariable(name: "$ret3", scope: !495, file: !42, line: 42, type: !431)
!501 = !DILocation(line: 42, column: 26, scope: !495)
!502 = !DILocation(line: 43, column: 9, scope: !503)
!503 = distinct !DILexicalBlock(scope: !495, file: !42, line: 42, column: 1)
!504 = !DILocation(line: 43, column: 12, scope: !503)
!505 = !DILocation(line: 53, column: 1, scope: !495)
!506 = !DILocation(line: 44, column: 15, scope: !503)
!507 = !DILocation(line: 44, column: 2, scope: !503)
!508 = !DILocation(line: 46, column: 9, scope: !503)
!509 = !DILocation(line: 46, column: 17, scope: !503)
!510 = !DILocation(line: 47, column: 7, scope: !503)
!511 = !DILocation(line: 47, column: 8, scope: !503)
!512 = !DILocalVariable(name: "t", scope: !503, file: !42, line: 47, type: !431)
!513 = !DILocation(line: 47, column: 2, scope: !495)
!514 = !DILocation(line: 51, column: 14, scope: !503)
!515 = !DILocation(line: 51, column: 9, scope: !503)
!516 = !DILocation(line: 51, column: 20, scope: !503)
!517 = !DILocation(line: 52, column: 2, scope: !495)
!518 = distinct !DISubprogram(name: "internal.command_line_arguments..thunk2", scope: null, file: !42, line: 44, type: !519, isLocal: true, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!519 = !DISubroutineType(types: !520)
!520 = !{!103, !521}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Mutex}", file: !17, size: 64, align: 8, elements: !523)
!523 = !{!524}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !17, line: 44, baseType: !62, size: 64, align: 64)
!525 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !518, file: !42, line: 44, type: !521)
!526 = !DILocation(line: 44, column: 2, scope: !518)
!527 = !DILocalVariable(name: "$ret8", scope: !518, file: !42, line: 44, type: !103)
!528 = distinct !DISubprogram(name: "internal.command_line_arguments..thunk3", scope: null, file: !42, line: 57, type: !519, isLocal: true, isDefinition: true, scopeLine: 57, isOptimized: false, unit: !1, retainedNodes: !3)
!529 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !528, file: !42, line: 57, type: !521)
!530 = !DILocation(line: 57, column: 2, scope: !528)
!531 = !DILocalVariable(name: "$ret9", scope: !528, file: !42, line: 57, type: !103)
!532 = distinct !DISubprogram(name: "internal.command_line_arguments..thunk4", scope: null, file: !42, line: 59, type: !519, isLocal: true, isDefinition: true, scopeLine: 59, isOptimized: false, unit: !1, retainedNodes: !3)
!533 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !532, file: !42, line: 59, type: !521)
!534 = !DILocation(line: 59, column: 2, scope: !532)
!535 = !DILocalVariable(name: "$ret10", scope: !532, file: !42, line: 59, type: !103)
!536 = distinct !DISubprogram(name: "internal.command_line_arguments..init1", linkageName: "command_line_arguments.command_line_arguments..init1", scope: null, file: !66, line: 16, type: !416, isLocal: false, isDefinition: true, scopeLine: 16, isOptimized: false, unit: !1, retainedNodes: !3)
!537 = !DILocation(line: 17, column: 64, scope: !536)
!538 = !DILocation(line: 17, column: 9, scope: !536)
!539 = distinct !DISubprogram(name: "internal.printStack", scope: null, file: !66, line: 20, type: !416, isLocal: true, isDefinition: true, scopeLine: 20, isOptimized: false, unit: !1, retainedNodes: !3)
!540 = !DILocation(line: 21, column: 8, scope: !539)
!541 = !DILocation(line: 21, column: 39, scope: !539)
!542 = !DILocation(line: 21, column: 27, scope: !539)
!543 = distinct !DISubprogram(name: "internal.ImageMarshalProtobuf", linkageName: "command_line_arguments.ImageMarshalProtobuf", scope: null, file: !66, line: 24, type: !544, isLocal: false, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !1, retainedNodes: !3)
!544 = !DISubroutineType(types: !545)
!545 = !{!546, !129}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImageOrResource", file: !66, line: 13, size: 192, align: 8, elements: !548)
!548 = !{!549, !558}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Image", file: !66, line: 13, baseType: !550, size: 64, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !66, line: 13, size: 384, align: 8, elements: !552)
!552 = !{!553, !555, !556, !557}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Width", file: !66, line: 13, baseType: !554, size: 64, align: 64)
!554 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Height", file: !66, line: 13, baseType: !554, size: 64, align: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Stride", file: !66, line: 13, baseType: !554, size: 64, align: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Data", file: !66, line: 13, baseType: !117, size: 192, align: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !66, line: 13, baseType: !108, size: 128, align: 64, offset: 64)
!559 = !DILocalVariable(name: "img", arg: 1, scope: !543, file: !66, line: 24, type: !129)
!560 = !DILocation(line: 24, column: 27, scope: !543)
!561 = !DILocalVariable(name: "$ret4", scope: !543, file: !66, line: 24, type: !546)
!562 = !DILocation(line: 24, column: 44, scope: !543)
!563 = !DILocation(line: 25, column: 9, scope: !543)
!564 = !DILocation(line: 26, column: 3, scope: !543)
!565 = !DILocalVariable(name: "res", scope: !566, file: !66, line: 28, type: !567)
!566 = distinct !DILexicalBlock(scope: !543, file: !66, line: 28, column: 2)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImageResource", file: !66, line: 11, size: 576, align: 8, elements: !569)
!569 = !{!570, !571, !572, !573}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "path", file: !66, line: 11, baseType: !108, size: 128, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "rect", file: !66, line: 11, baseType: !161, size: 256, align: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "image", file: !66, line: 11, baseType: !129, size: 128, align: 64, offset: 384)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "scale", file: !66, line: 11, baseType: !574, size: 64, align: 64, offset: 512)
!574 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!575 = !DILocation(line: 28, column: 5, scope: !543)
!576 = !DILocalVariable(name: "ok", scope: !566, file: !66, line: 28, type: !103)
!577 = !DILocation(line: 28, column: 5, scope: !566)
!578 = !DILocation(line: 28, column: 2, scope: !566)
!579 = !DILocation(line: 30, column: 13, scope: !566)
!580 = !DILocation(line: 29, column: 10, scope: !566)
!581 = !DILocation(line: 29, column: 17, scope: !566)
!582 = !DILocation(line: 29, column: 3, scope: !566)
!583 = !DILocation(line: 34, column: 17, scope: !566)
!584 = !DILocation(line: 33, column: 10, scope: !566)
!585 = !DILocation(line: 33, column: 17, scope: !566)
!586 = !DILocation(line: 33, column: 3, scope: !566)
!587 = distinct !DISubprogram(name: "internal.MarshalProtobuf", linkageName: "command_line_arguments.MarshalProtobuf", scope: null, file: !66, line: 39, type: !588, isLocal: false, isDefinition: true, scopeLine: 39, isOptimized: false, unit: !1, retainedNodes: !3)
!588 = !DISubroutineType(types: !589)
!589 = !{!117, !590}
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !66, line: 10, size: 128, align: 8, elements: !591)
!591 = !{!592, !603}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !66, line: 10, baseType: !593, size: 64, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void,*func(*void)string}", file: !17, size: 256, align: 8, elements: !595)
!595 = !{!596, !597, !601, !602}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 10, baseType: !31, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMessage", file: !17, line: 10, baseType: !598, size: 64, align: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!32, !31}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", file: !17, line: 10, baseType: !598, size: 64, align: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !17, line: 10, baseType: !387, size: 64, align: 64, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !66, line: 1, baseType: !31, size: 64, align: 64, offset: 64)
!604 = !DILocalVariable(name: "pb", arg: 1, scope: !587, file: !66, line: 39, type: !590)
!605 = !DILocation(line: 39, column: 22, scope: !587)
!606 = !DILocation(line: 40, column: 25, scope: !607)
!607 = distinct !DILexicalBlock(scope: !587, file: !66, line: 39, column: 1)
!608 = !DILocalVariable(name: "err", scope: !607, file: !66, line: 40, type: !609)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !39, line: 1, size: 128, align: 8, elements: !610)
!610 = !{!611, !616}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !39, line: 1, baseType: !612, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !17, size: 128, align: 8, elements: !614)
!614 = !{!30, !615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !17, line: 1, baseType: !387, size: 64, align: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !39, line: 1, baseType: !31, size: 64, align: 64, offset: 64)
!617 = !DILocation(line: 40, column: 2, scope: !587)
!618 = !DILocation(line: 41, column: 9, scope: !607)
!619 = !DILocation(line: 42, column: 7, scope: !607)
!620 = !DILocation(line: 42, column: 45, scope: !607)
!621 = !DILocation(line: 44, column: 2, scope: !607)
!622 = !DILocation(line: 42, column: 49, scope: !607)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "internal"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "command-line-arguments"
	.ascii ";\n"
	.ascii "import "
	.ascii "fmt"
	.ascii " "
	.ascii "fmt"
	.ascii " \""
	.ascii "fmt"
	.ascii "\";\n"
	.ascii "import "
	.ascii "proto"
	.ascii " "
	.ascii "github.com/gogo/protobuf/proto"
	.ascii " \""
	.ascii "github.com/gogo/protobuf/proto"
	.ascii "\";\n"
	.ascii "import "
	.ascii "application"
	.ascii " "
	.ascii "gomatcha.io/matcha/application"
	.ascii " \""
	.ascii "gomatcha.io/matcha/application"
	.ascii "\";\n"
	.ascii "import "
	.ascii "bridge"
	.ascii " "
	.ascii "gomatcha.io/matcha/bridge"
	.ascii " \""
	.ascii "gomatcha.io/matcha/bridge"
	.ascii "\";\n"
	.ascii "import "
	.ascii "device"
	.ascii " "
	.ascii "gomatcha.io/matcha/internal/device"
	.ascii " \""
	.ascii "gomatcha.io/matcha/internal/device"
	.ascii "\";\n"
	.ascii "import "
	.ascii "proto"
	.ascii " "
	.ascii "gomatcha.io/matcha/proto"
	.ascii " \""
	.ascii "gomatcha.io/matcha/proto"
	.ascii "\";\n"
	.ascii "import "
	.ascii "image"
	.ascii " "
	.ascii "image"
	.ascii " \""
	.ascii "image"
	.ascii "\";\n"
	.ascii "import "
	.ascii "color"
	.ascii " "
	.ascii "image/color"
	.ascii " \""
	.ascii "image/color"
	.ascii "\";\n"
	.ascii "import "
	.ascii "os"
	.ascii " "
	.ascii "os"
	.ascii " \""
	.ascii "os"
	.ascii "\";\n"
	.ascii "import "
	.ascii "reflect"
	.ascii " "
	.ascii "reflect"
	.ascii " \""
	.ascii "reflect"
	.ascii "\";\n"
	.ascii "import "
	.ascii "pprof"
	.ascii " "
	.ascii "runtime/pprof"
	.ascii " \""
	.ascii "runtime/pprof"
	.ascii "\";\n"
	.ascii "import "
	.ascii "sync"
	.ascii " "
	.ascii "sync"
	.ascii " \""
	.ascii "sync"
	.ascii "\";\n"
	.ascii "init"
	.ascii " "
	.ascii "internal"
	.ascii " "
	.ascii "command_line_arguments..import"
	.ascii " "
	.ascii "bufio"
	.ascii " "
	.ascii "bufio..import"
	.ascii " "
	.ascii "bytes"
	.ascii " "
	.ascii "bytes..import"
	.ascii " "
	.ascii "flate"
	.ascii " "
	.ascii "compress_flate..import"
	.ascii " "
	.ascii "gzip"
	.ascii " "
	.ascii "compress_gzip..import"
	.ascii " "
	.ascii "context"
	.ascii " "
	.ascii "context..import"
	.ascii " "
	.ascii "base64"
	.ascii " "
	.ascii "encoding_base64..import"
	.ascii " "
	.ascii "binary"
	.ascii " "
	.ascii "encoding_binary..import"
	.ascii " "
	.ascii "json"
	.ascii " "
	.ascii "encoding_json..import"
	.ascii " "
	.ascii "fmt"
	.ascii " "
	.ascii "fmt..import"
	.ascii " "
	.ascii "proto"
	.ascii " "
	.ascii "github_com_gogo_protobuf_proto..import"
	.ascii " "
	.ascii "proto"
	.ascii " "
	.ascii "github_com_golang_protobuf_proto..import"
	.ascii " "
	.ascii "colornames"
	.ascii " "
	.ascii "golang_org_x_image_colornames..import"
	.ascii " "
	.ascii "application"
	.ascii " "
	.ascii "gomatcha_io_matcha_application..import"
	.ascii " "
	.ascii "device"
	.ascii " "
	.ascii "gomatcha_io_matcha_internal_device..import"
	.ascii " "
	.ascii "proto"
	.ascii " "
	.ascii "gomatcha_io_matcha_proto..import"
	.ascii " "
	.ascii "env"
	.ascii " "
	.ascii "gomatcha_io_matcha_proto_env..import"
	.ascii " "
	.ascii "layout"
	.ascii " "
	.ascii "gomatcha_io_matcha_proto_layout..import"
	.ascii " "
	.ascii "crc32"
	.ascii " "
	.ascii "hash_crc32..import"
	.ascii " "
	.ascii "image"
	.ascii " "
	.ascii "image..import"
	.ascii " "
	.ascii "color"
	.ascii " "
	.ascii "image_color..import"
	.ascii " "
	.ascii "poll"
	.ascii " "
	.ascii "internal_poll..import"
	.ascii " "
	.ascii "testlog"
	.ascii " "
	.ascii "internal_testlog..import"
	.ascii " "
	.ascii "io"
