; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22keyboard\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22comm\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22gomatcha.io/matcha/comm\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22gomatcha.io/matcha/comm\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22keyboard\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22gomatcha.io/matcha/proto/keyboard\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22gomatcha.io/matcha/proto/keyboard\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22base64\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3)
!2 = !DIFile(filename: "./keyboard.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha/keyboard")
!3 = !{}
!4 = distinct !DISubprogram(name: "keyboard.MarshalProtobuf.command_line_arguments.Type", linkageName: "command_line_arguments.Type.MarshalProtobuf", scope: null, file: !5, line: 30, type: !6, isLocal: false, isDefinition: true, scopeLine: 30, isOptimized: false, unit: !1, retainedNodes: !3)
!5 = !DIFile(filename: "keyboard.go", directory: ".")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !9, !9}
!8 = !DIBasicType(name: "Type", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "Type", size: 64, encoding: DW_ATE_signed)
!11 = !DILocalVariable(name: "pointer", arg: 1, scope: !4, file: !5, line: 30, type: !9)
!12 = !DILocation(line: 30, column: 1, scope: !4)
!13 = !DILocalVariable(name: "t", scope: !4, file: !5, line: 30, type: !10)
!14 = !DILocalVariable(name: "$ret0", scope: !4, file: !5, line: 30, type: !8)
!15 = !DILocation(line: 30, column: 33, scope: !4)
!16 = !DILocation(line: 31, column: 22, scope: !4)
!17 = !DILocation(line: 31, column: 2, scope: !4)
!18 = distinct !DISubprogram(name: "keyboard.Dismiss..1command_line_arguments.Responder", linkageName: "command_line_arguments.Responder.Dismiss", scope: null, file: !5, line: 71, type: !19, isLocal: false, isDefinition: true, scopeLine: 71, isOptimized: false, unit: !1, retainedNodes: !3)
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !22, !22}
!21 = !DIBasicType(name: "void")
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "Responder", file: !5, line: 57, size: 320, align: 8, elements: !24)
!24 = !{!25, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "visible", file: !5, line: 58, baseType: !26, size: 8, align: 8)
!26 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !5, line: 59, baseType: !28, size: 256, align: 64, offset: 64)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "Relay", file: !5, line: 14, size: 256, align: 8, elements: !29)
!29 = !{!30, !37, !56, !57}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !5, line: 14, baseType: !31, size: 64, align: 32)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !5, line: 14, size: 64, align: 8, elements: !32)
!32 = !{!33, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !5, line: 14, baseType: !34, size: 32, align: 32)
!34 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !5, line: 14, baseType: !36, size: 32, align: 32, offset: 32)
!36 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "subs", file: !5, line: 14, baseType: !38, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !40, line: 1, size: 384, align: 8, elements: !41)
!40 = !DIFile(filename: "<built-in>", directory: "")
!41 = !{!42, !44, !46, !47, !49, !50, !52, !53, !55}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !40, line: 1, baseType: !43, size: 64, align: 64)
!43 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !40, line: 1, baseType: !45, size: 8, align: 8, offset: 64)
!45 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !40, line: 1, baseType: !45, size: 8, align: 8, offset: 72)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !40, line: 1, baseType: !48, size: 16, align: 16, offset: 80)
!48 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !40, line: 1, baseType: !36, size: 32, align: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !40, line: 1, baseType: !51, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !40, line: 1, baseType: !51, size: 64, align: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !40, line: 1, baseType: !54, size: 64, align: 64, offset: 256)
!54 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !40, line: 1, baseType: !51, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", file: !5, line: 14, baseType: !38, size: 64, align: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "maxId", file: !5, line: 14, baseType: !58, size: 64, align: 64, offset: 192)
!58 = !DIBasicType(name: "Id", size: 64, encoding: DW_ATE_signed)
!59 = !DILocalVariable(name: "g", arg: 1, scope: !18, file: !5, line: 71, type: !22)
!60 = !DILocation(line: 71, column: 1, scope: !18)
!61 = !DILocation(line: 72, column: 6, scope: !18)
!62 = !DILocation(line: 72, column: 2, scope: !18)
!63 = !DILocation(line: 73, column: 13, scope: !18)
!64 = !DILocation(line: 74, column: 4, scope: !18)
!65 = !DILocation(line: 74, column: 10, scope: !18)
!66 = distinct !DISubprogram(name: "keyboard.Notify..1command_line_arguments.Responder", linkageName: "command_line_arguments.Responder.Notify", scope: null, file: !5, line: 84, type: !67, isLocal: false, isDefinition: true, scopeLine: 84, isOptimized: false, unit: !1, retainedNodes: !3)
!67 = !DISubroutineType(types: !68)
!68 = !{!58, !22, !22, !69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 71, size: 64, align: 8, elements: !71)
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 71, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!21}
!76 = !DILocalVariable(name: "g", arg: 1, scope: !66, file: !5, line: 84, type: !22)
!77 = !DILocation(line: 84, column: 1, scope: !66)
!78 = !DILocalVariable(name: "f", arg: 2, scope: !66, file: !5, line: 84, type: !69)
!79 = !DILocation(line: 84, column: 28, scope: !66)
!80 = !DILocalVariable(name: "$ret2", scope: !66, file: !5, line: 84, type: !58)
!81 = !DILocation(line: 84, column: 38, scope: !66)
!82 = !DILocation(line: 85, column: 10, scope: !66)
!83 = !DILocation(line: 85, column: 16, scope: !66)
!84 = !DILocation(line: 85, column: 2, scope: !66)
!85 = distinct !DISubprogram(name: "keyboard.Show..1command_line_arguments.Responder", linkageName: "command_line_arguments.Responder.Show", scope: null, file: !5, line: 63, type: !19, isLocal: false, isDefinition: true, scopeLine: 63, isOptimized: false, unit: !1, retainedNodes: !3)
!86 = !DILocalVariable(name: "g", arg: 1, scope: !85, file: !5, line: 63, type: !22)
!87 = !DILocation(line: 63, column: 1, scope: !85)
!88 = !DILocation(line: 64, column: 7, scope: !85)
!89 = !DILocation(line: 64, column: 5, scope: !85)
!90 = !DILocation(line: 65, column: 13, scope: !85)
!91 = !DILocation(line: 66, column: 4, scope: !85)
!92 = !DILocation(line: 66, column: 10, scope: !85)
!93 = distinct !DISubprogram(name: "keyboard.Unnotify..1command_line_arguments.Responder", linkageName: "command_line_arguments.Responder.Unnotify", scope: null, file: !5, line: 89, type: !94, isLocal: false, isDefinition: true, scopeLine: 89, isOptimized: false, unit: !1, retainedNodes: !3)
!94 = !DISubroutineType(types: !95)
!95 = !{!21, !22, !22, !58}
!96 = !DILocalVariable(name: "g", arg: 1, scope: !93, file: !5, line: 89, type: !22)
!97 = !DILocation(line: 89, column: 1, scope: !93)
!98 = !DILocalVariable(name: "id", arg: 2, scope: !93, file: !5, line: 89, type: !58)
!99 = !DILocation(line: 89, column: 30, scope: !93)
!100 = !DILocation(line: 90, column: 3, scope: !93)
!101 = !DILocation(line: 90, column: 9, scope: !93)
!102 = distinct !DISubprogram(name: "keyboard.Visible..1command_line_arguments.Responder", linkageName: "command_line_arguments.Responder.Visible", scope: null, file: !5, line: 79, type: !103, isLocal: false, isDefinition: true, scopeLine: 79, isOptimized: false, unit: !1, retainedNodes: !3)
!103 = !DISubroutineType(types: !104)
!104 = !{!26, !22, !22}
!105 = !DILocalVariable(name: "g", arg: 1, scope: !102, file: !5, line: 79, type: !22)
!106 = !DILocation(line: 79, column: 1, scope: !102)
!107 = !DILocalVariable(name: "$ret1", scope: !102, file: !5, line: 79, type: !26)
!108 = !DILocation(line: 79, column: 31, scope: !102)
