; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22paint\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22comm\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22gomatcha.io/matcha/comm\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22gomatcha.io/matcha/comm\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22layout\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22gomatcha.io/matcha/layout\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22gomatcha.io/matcha/layout\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22color\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22image/color\22"
module asm "\09.ascii \22 \5C\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./painter.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha/paint")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "paint.command_line_arguments.Style..hash", linkageName: "command_line_arguments.command_line_arguments.Style..hash", scope: null, file: !7, line: 1, type: !10, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !13, !12}
!12 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "void")
!15 = !DILocalVariable(name: "key", arg: 1, scope: !9, file: !7, line: 1, type: !13)
!16 = !DILocation(line: 1, column: 1, scope: !9)
!17 = !DILocalVariable(name: "seed", arg: 2, scope: !9, file: !7, line: 1, type: !12)
!18 = !DILocalVariable(name: "$ret5", scope: !9, file: !7, line: 1, type: !12)
!19 = distinct !DISubprogram(name: "paint.command_line_arguments.Style..eq", linkageName: "command_line_arguments.command_line_arguments.Style..eq", scope: null, file: !7, line: 1, type: !20, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !13, !13}
!22 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!23 = !DILocalVariable(name: "key1", arg: 1, scope: !19, file: !7, line: 1, type: !13)
!24 = !DILocation(line: 1, column: 1, scope: !19)
!25 = !DILocalVariable(name: "key2", arg: 2, scope: !19, file: !7, line: 1, type: !13)
!26 = !DILocalVariable(name: "$ret6", scope: !19, file: !7, line: 1, type: !22)
!27 = distinct !DISubprogram(name: "paint.Notify..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.Notify", scope: null, file: !28, line: 52, type: !29, isLocal: false, isDefinition: true, scopeLine: 52, isOptimized: false, unit: !1, retainedNodes: !3)
!28 = !DIFile(filename: "painter.go", directory: ".")
!29 = !DISubroutineType(types: !30)
!30 = !{!31, !32, !32, !117}
!31 = !DIBasicType(name: "Id", size: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "Style", file: !28, line: 30, size: 768, align: 8, elements: !34)
!34 = !{!35, !37, !107, !108, !109, !110, !111, !116}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency", file: !28, line: 31, baseType: !36, size: 64, align: 64)
!36 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "BackgroundColor", file: !28, line: 32, baseType: !38, size: 128, align: 64, offset: 64)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", file: !28, line: 17, size: 128, align: 8, elements: !39)
!39 = !{!40, !106}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 17, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{uint32,uint32,uint32,uint32}}", file: !43, size: 128, align: 8, elements: !44)
!43 = !DIFile(filename: "", directory: "")
!44 = !{!45, !96}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !43, line: 17, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !48)
!48 = !{!49, !50, !51, !52, !54, !55, !56, !62, !68, !70, !77, !95}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !12, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !53, size: 8, align: 8, offset: 160)
!53 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !53, size: 8, align: 8, offset: 168)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !53, size: 8, align: 8, offset: 176)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !57, size: 64, align: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !59)
!59 = !{!60}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !63, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !65)
!65 = !{!66}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !69, size: 64, align: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !71, size: 64, align: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !73)
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !69, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !78, size: 64, align: 64, offset: 448)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !80)
!80 = !{!81, !82, !83}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !71, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !71, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !84, size: 192, align: 64, offset: 128)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !43, size: 192, align: 8, elements: !85)
!85 = !{!86, !93, !94}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !89)
!89 = !{!81, !82, !90, !91, !92}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !43, line: 1, baseType: !76, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !43, line: 1, baseType: !76, size: 64, align: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "RGBA", file: !43, line: 17, baseType: !97, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !13}
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{uint32,uint32,uint32,uint32}", file: !43, size: 128, align: 8, elements: !101)
!101 = !{!102, !103, !104, !105}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !43, line: 17, baseType: !8, size: 32, align: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !43, line: 17, baseType: !8, size: 32, align: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !43, line: 17, baseType: !8, size: 32, align: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "a", file: !43, line: 17, baseType: !8, size: 32, align: 32, offset: 96)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !28, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "BorderColor", file: !28, line: 33, baseType: !38, size: 128, align: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "BorderWidth", file: !28, line: 34, baseType: !36, size: 64, align: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "CornerRadius", file: !28, line: 36, baseType: !36, size: 64, align: 64, offset: 384)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowRadius", file: !28, line: 38, baseType: !36, size: 64, align: 64, offset: 448)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowOffset", file: !28, line: 39, baseType: !112, size: 128, align: 64, offset: 512)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "Point", file: !28, line: 20, size: 128, align: 8, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "X", file: !28, line: 20, baseType: !36, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Y", file: !28, line: 20, baseType: !36, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowColor", file: !28, line: 40, baseType: !38, size: 128, align: 64, offset: 640)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !28, line: 19, size: 64, align: 8, elements: !119)
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !28, line: 19, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!14}
!124 = !DILocalVariable(name: "s", arg: 1, scope: !27, file: !28, line: 52, type: !32)
!125 = !DILocation(line: 52, column: 1, scope: !27)
!126 = !DILocalVariable(name: "p.0", arg: 2, scope: !27, file: !28, line: 52, type: !117)
!127 = !DILocation(line: 52, column: 24, scope: !27)
!128 = !DILocalVariable(name: "$ret1", scope: !27, file: !28, line: 52, type: !31)
!129 = !DILocation(line: 52, column: 32, scope: !27)
!130 = !DILocation(line: 53, column: 2, scope: !27)
!131 = distinct !DISubprogram(name: "paint.PaintStyle..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.PaintStyle", scope: null, file: !28, line: 44, type: !132, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!132 = !DISubroutineType(types: !133)
!133 = !{!33, !32, !32}
!134 = !DILocalVariable(name: "s", arg: 1, scope: !131, file: !28, line: 44, type: !32)
!135 = !DILocation(line: 44, column: 1, scope: !131)
!136 = !DILocation(line: 45, column: 7, scope: !131)
!137 = !DILocation(line: 46, column: 3, scope: !131)
!138 = !DILocation(line: 48, column: 2, scope: !131)
!139 = distinct !DISubprogram(name: "paint.String..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.String", scope: null, file: !28, line: 61, type: !140, isLocal: false, isDefinition: true, scopeLine: 61, isOptimized: false, unit: !1, retainedNodes: !3)
!140 = !DISubroutineType(types: !141)
!141 = !{!72, !32, !32}
!142 = !DILocalVariable(name: "s", arg: 1, scope: !139, file: !28, line: 61, type: !32)
!143 = !DILocation(line: 61, column: 1, scope: !139)
!144 = !DILocation(line: 62, column: 7, scope: !139)
!145 = !DILocalVariable(name: "$ret2", scope: !139, file: !28, line: 61, type: !72)
!146 = !DILocation(line: 61, column: 26, scope: !139)
!147 = !DILocation(line: 63, column: 3, scope: !139)
!148 = !DILocation(line: 65, column: 13, scope: !139)
!149 = !DILocation(line: 65, column: 2, scope: !139)
!150 = distinct !DISubprogram(name: "paint.Notify..1command_line_arguments.AnimatedStyle", linkageName: "command_line_arguments.AnimatedStyle.Notify", scope: null, file: !28, line: 120, type: !151, isLocal: false, isDefinition: true, scopeLine: 120, isOptimized: false, unit: !1, retainedNodes: !3)
!151 = !DISubroutineType(types: !152)
!152 = !{!31, !153, !153, !117}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimatedStyle", file: !28, line: 74, size: 1920, align: 8, elements: !155)
!155 = !{!156, !157, !177, !188, !189, !190, !191, !192, !206, !207, !208}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Style", file: !28, line: 75, baseType: !33, size: 768, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency", file: !28, line: 76, baseType: !158, size: 128, align: 64, offset: 768)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "Float64Notifier", file: !28, line: 19, size: 128, align: 8, elements: !159)
!159 = !{!160, !106}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 19, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*__go_descriptor)Id,*func(*void,Id)void,*func(*void)float64}", file: !43, size: 256, align: 8, elements: !163)
!163 = !{!164, !165, !169, !173}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !43, line: 19, baseType: !46, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Notify", file: !43, line: 19, baseType: !166, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!31, !13, !117}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Unnotify", file: !43, line: 19, baseType: !170, size: 64, align: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!14, !13, !31}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !43, line: 19, baseType: !174, size: 64, align: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!36, !13}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "BackgroundColor", file: !28, line: 77, baseType: !178, size: 128, align: 64, offset: 896)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorNotifier", file: !28, line: 19, size: 128, align: 8, elements: !179)
!179 = !{!180, !106}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 19, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*__go_descriptor)Id,*func(*void,Id)void,*func(*void)Color}", file: !43, size: 256, align: 8, elements: !183)
!183 = !{!164, !165, !169, !184}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !43, line: 19, baseType: !185, size: 64, align: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!38, !13}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "BorderColor", file: !28, line: 78, baseType: !178, size: 128, align: 64, offset: 1024)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "BorderWidth", file: !28, line: 79, baseType: !158, size: 128, align: 64, offset: 1152)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "CornerRadius", file: !28, line: 80, baseType: !158, size: 128, align: 64, offset: 1280)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowRadius", file: !28, line: 81, baseType: !158, size: 128, align: 64, offset: 1408)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowOffset", file: !28, line: 82, baseType: !193, size: 128, align: 64, offset: 1536)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "PointNotifier", file: !28, line: 20, size: 128, align: 8, elements: !194)
!194 = !{!195, !106}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 20, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*__go_descriptor)Id,*func(*void,Id)void,*func(*void)Point}", file: !43, size: 256, align: 8, elements: !198)
!198 = !{!199, !200, !201, !202}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !43, line: 20, baseType: !46, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Notify", file: !43, line: 20, baseType: !166, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Unnotify", file: !43, line: 20, baseType: !170, size: 64, align: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !43, line: 20, baseType: !203, size: 64, align: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!112, !13}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowColor", file: !28, line: 83, baseType: !178, size: 128, align: 64, offset: 1664)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "maxId", file: !28, line: 85, baseType: !31, size: 64, align: 64, offset: 1792)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "groupNotifiers", file: !28, line: 86, baseType: !209, size: 64, align: 64, offset: 1856)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !211)
!211 = !{!212, !213, !214, !215, !217, !218, !219, !220, !221}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !76, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !53, size: 8, align: 8, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !53, size: 8, align: 8, offset: 72)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !216, size: 16, align: 16, offset: 80)
!216 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !12, size: 64, align: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 320)
!222 = !DILocalVariable(name: "as", arg: 1, scope: !150, file: !28, line: 120, type: !153)
!223 = !DILocation(line: 120, column: 1, scope: !150)
!224 = !DILocalVariable(name: "f", arg: 2, scope: !150, file: !28, line: 120, type: !117)
!225 = !DILocation(line: 120, column: 33, scope: !150)
!226 = !DILocalVariable(name: "$ret4", scope: !150, file: !28, line: 120, type: !31)
!227 = !DILocation(line: 120, column: 43, scope: !150)
!228 = !DILocation(line: 121, column: 7, scope: !229)
!229 = distinct !DILexicalBlock(scope: !150, file: !28, line: 120, column: 1)
!230 = !DILocalVariable(name: "n", scope: !229, file: !28, line: 121, type: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "Relay", file: !28, line: 19, size: 256, align: 8, elements: !233)
!233 = !{!234, !240, !241, !242}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !28, line: 19, baseType: !235, size: 64, align: 32)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !28, line: 19, size: 64, align: 8, elements: !236)
!236 = !{!237, !239}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !28, line: 19, baseType: !238, size: 32, align: 32)
!238 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !28, line: 19, baseType: !8, size: 32, align: 32, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "subs", file: !28, line: 19, baseType: !209, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", file: !28, line: 19, baseType: !209, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "maxId", file: !28, line: 19, baseType: !31, size: 64, align: 64, offset: 192)
!243 = !DILocation(line: 121, column: 2, scope: !150)
!244 = !DILocation(line: 123, column: 7, scope: !229)
!245 = !DILocation(line: 123, column: 21, scope: !229)
!246 = !DILocation(line: 124, column: 17, scope: !229)
!247 = !DILocation(line: 124, column: 4, scope: !229)
!248 = !DILocation(line: 126, column: 24, scope: !229)
!249 = !DILocation(line: 127, column: 17, scope: !229)
!250 = !DILocation(line: 127, column: 4, scope: !229)
!251 = !DILocation(line: 129, column: 20, scope: !229)
!252 = !DILocation(line: 130, column: 17, scope: !229)
!253 = !DILocation(line: 130, column: 4, scope: !229)
!254 = !DILocation(line: 132, column: 20, scope: !229)
!255 = !DILocation(line: 133, column: 17, scope: !229)
!256 = !DILocation(line: 133, column: 4, scope: !229)
!257 = !DILocation(line: 135, column: 21, scope: !229)
!258 = !DILocation(line: 136, column: 17, scope: !229)
!259 = !DILocation(line: 136, column: 4, scope: !229)
!260 = !DILocation(line: 138, column: 21, scope: !229)
!261 = !DILocation(line: 139, column: 17, scope: !229)
!262 = !DILocation(line: 139, column: 4, scope: !229)
!263 = !DILocation(line: 141, column: 21, scope: !229)
!264 = !DILocation(line: 142, column: 17, scope: !229)
!265 = !DILocation(line: 142, column: 4, scope: !229)
!266 = !DILocation(line: 144, column: 20, scope: !229)
!267 = !DILocation(line: 145, column: 17, scope: !229)
!268 = !DILocation(line: 145, column: 4, scope: !229)
!269 = !DILocation(line: 148, column: 4, scope: !229)
!270 = !DILocation(line: 148, column: 11, scope: !229)
!271 = !DILocation(line: 149, column: 7, scope: !229)
!272 = !DILocation(line: 149, column: 23, scope: !229)
!273 = !DILocation(line: 150, column: 23, scope: !229)
!274 = !DILocation(line: 150, column: 21, scope: !229)
!275 = !DILocation(line: 152, column: 22, scope: !229)
!276 = !DILocation(line: 154, column: 14, scope: !229)
!277 = !DILocation(line: 152, column: 32, scope: !229)
!278 = !DILocation(line: 152, column: 4, scope: !229)
!279 = !DILocation(line: 152, column: 30, scope: !229)
!280 = !DILocation(line: 156, column: 11, scope: !229)
!281 = !DILocation(line: 156, column: 2, scope: !229)
!282 = distinct !DISubprogram(name: "paint.PaintStyle..1command_line_arguments.AnimatedStyle", linkageName: "command_line_arguments.AnimatedStyle.PaintStyle", scope: null, file: !28, line: 90, type: !283, isLocal: false, isDefinition: true, scopeLine: 90, isOptimized: false, unit: !1, retainedNodes: !3)
!283 = !DISubroutineType(types: !284)
!284 = !{!33, !153, !153}
!285 = !DILocalVariable(name: "as", arg: 1, scope: !282, file: !28, line: 90, type: !153)
!286 = !DILocation(line: 90, column: 1, scope: !282)
!287 = !DILocation(line: 91, column: 9, scope: !288)
!288 = distinct !DILexicalBlock(scope: !282, file: !28, line: 90, column: 1)
!289 = !DILocalVariable(name: "s", scope: !288, file: !28, line: 91, type: !33)
!290 = !DILocation(line: 91, column: 2, scope: !282)
!291 = !DILocation(line: 92, column: 21, scope: !288)
!292 = !DILocation(line: 93, column: 35, scope: !288)
!293 = !DILocation(line: 95, column: 24, scope: !288)
!294 = !DILocation(line: 96, column: 41, scope: !288)
!295 = !DILocation(line: 98, column: 20, scope: !288)
!296 = !DILocation(line: 99, column: 33, scope: !288)
!297 = !DILocation(line: 101, column: 20, scope: !288)
!298 = !DILocation(line: 102, column: 33, scope: !288)
!299 = !DILocation(line: 104, column: 21, scope: !288)
!300 = !DILocation(line: 105, column: 35, scope: !288)
!301 = !DILocation(line: 107, column: 21, scope: !288)
!302 = !DILocation(line: 108, column: 35, scope: !288)
!303 = !DILocation(line: 110, column: 21, scope: !288)
!304 = !DILocation(line: 111, column: 35, scope: !288)
!305 = !DILocation(line: 113, column: 20, scope: !288)
!306 = !DILocalVariable(name: "$ret3", scope: !282, file: !28, line: 90, type: !33)
!307 = !DILocation(line: 90, column: 39, scope: !282)
!308 = !DILocation(line: 116, column: 2, scope: !288)
!309 = !DILocation(line: 114, column: 33, scope: !288)
!310 = distinct !DISubprogram(name: "paint.Unnotify..1command_line_arguments.AnimatedStyle", linkageName: "command_line_arguments.AnimatedStyle.Unnotify", scope: null, file: !28, line: 160, type: !311, isLocal: false, isDefinition: true, scopeLine: 160, isOptimized: false, unit: !1, retainedNodes: !3)
!311 = !DISubroutineType(types: !312)
!312 = !{!14, !153, !153, !31}
!313 = !DILocalVariable(name: "as", arg: 1, scope: !310, file: !28, line: 160, type: !153)
!314 = !DILocation(line: 160, column: 1, scope: !310)
!315 = !DILocalVariable(name: "id", arg: 2, scope: !310, file: !28, line: 160, type: !31)
!316 = !DILocation(line: 160, column: 35, scope: !310)
!317 = !DILocalVariable(name: "ok", scope: !318, file: !28, line: 161, type: !22)
!318 = distinct !DILexicalBlock(scope: !310, file: !28, line: 160, column: 1)
!319 = !DILocation(line: 161, column: 2, scope: !310)
!320 = !DILocation(line: 161, column: 13, scope: !318)
!321 = !DILocation(line: 161, column: 2, scope: !318)
!322 = !DILocation(line: 162, column: 2, scope: !318)
!323 = !DILocalVariable(name: "n", scope: !318, file: !28, line: 161, type: !324)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.notifier", file: !28, line: 68, size: 128, align: 8, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "notifier", file: !28, line: 69, baseType: !231, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !28, line: 70, baseType: !31, size: 64, align: 64, offset: 64)
!328 = !DILocation(line: 163, column: 13, scope: !318)
!329 = !DILocation(line: 164, column: 12, scope: !318)
!330 = !DILocation(line: 164, column: 3, scope: !318)
!331 = distinct !DISubprogram(name: "paint.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !28, line: 13, type: !122, isLocal: false, isDefinition: true, scopeLine: 13, isOptimized: false, unit: !1, retainedNodes: !3)
!332 = !DILocation(line: 1, column: 1, scope: !333)
!333 = !DILexicalBlockFile(scope: !331, file: !7, discriminator: 0)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "paint"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "command-line-arguments"
	.ascii ";\n"
	.ascii "import "
	.ascii "fmt"
	.ascii " "
	.ascii "fmt"
	.ascii " \""
	.ascii "fmt"
	.ascii "\";\n"
	.ascii "import "
	.ascii "comm"
	.ascii " "
	.ascii "gomatcha.io/matcha/comm"
	.ascii " \""
	.ascii "gomatcha.io/matcha/comm"
	.ascii "\";\n"
	.ascii "import "
	.ascii "layout"
	.ascii " "
	.ascii "gomatcha.io/matcha/layout"
	.ascii " \""
	.ascii "gomatcha.io/matcha/layout"
	.ascii "\";\n"
	.ascii "import "
	.ascii "color"
	.ascii " "
	.ascii "image/color"
	.ascii " \""
	.ascii "image/color"
	.ascii "\";\n"
	.ascii "init"
	.ascii " "
	.ascii "bufio"
	.ascii " "
	.ascii "bufio..import"
	.ascii " "
	.ascii "bytes"
	.ascii " "
	.ascii "bytes..import"
	.ascii " "
	.ascii "base64"
	.ascii " "
	.ascii "encoding_base64..import"
	.ascii " "
	.ascii "binary"
	.ascii " "
	.ascii "encoding_binary..import"
	.ascii " "
	.ascii "json"
	.ascii " "
	.ascii "encoding_json..import"
	.ascii " "
	.ascii "fmt"
	.ascii " "
	.ascii "fmt..import"
	.ascii " "
	.ascii "proto"
	.ascii " "
	.ascii "github_com_golang_protobuf_proto..import"
	.ascii " "
	.ascii "layout"
	.ascii " "
	.ascii "gomatcha_io_matcha_proto_layout..import"
	.ascii " "
	.ascii "color"
	.ascii " "
	.ascii "image_color..import"
	.ascii " "
	.ascii "poll"
	.ascii " "
	.ascii "internal_poll..import"
	.ascii " "
	.ascii "testlog"
	.ascii " "
	.ascii "internal_testlog..import"
	.ascii " "
	.ascii "io"
	.ascii " "
	.ascii "io..import"
	.ascii " "
	.ascii "log"
	.ascii " "
	.ascii "log..import"
	.ascii " "
	.ascii "os"
	.ascii " "
	.ascii "os..import"
	.ascii " "
	.ascii "reflect"
	.ascii " "
	.ascii "reflect..import"
	.ascii " "
	.ascii "runtime"
	.ascii " "
	.ascii "runtime..import"
	.ascii " "
	.ascii "sys"
	.ascii " "
	.ascii "runtime_internal_sys..import"
	.ascii " "
	.ascii "strconv"
	.ascii " "
	.ascii "strconv..import"
	.ascii " "
	.ascii "sync"
	.ascii " "
	.ascii "sync..import"
	.ascii " "
	.ascii "syscall"
	.ascii " "
	.ascii "syscall..import"
	.ascii " "
	.ascii "time"
	.ascii " "
	.ascii "time..import"
	.ascii " "
	.ascii "unicode"
	.ascii " "
	.ascii "unicode..import"
	.ascii ";\n"
	.ascii "init_graph"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "11"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "15"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "16"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "18"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "21"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "11"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "15"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "16"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "18"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "21"
	.ascii " "
	.ascii "2"
	.ascii " "
	.ascii "3"
	.ascii " "
	.ascii "2"
	.ascii " "
	.ascii "11"
	.ascii " "
	.ascii "2"
	.ascii " "
	.ascii "14"
	.ascii " "
	.ascii "2"
	.ascii " "
	.ascii "15"
	.ascii " "
	.ascii "2"
	.ascii " "
	.ascii "16"
	.ascii " "
	.ascii "2"
	.ascii " "
	.ascii "17"
	.ascii " "
	.ascii "2"
	.ascii " "
	.ascii "18"
	.ascii " "
	.ascii "2"
	.ascii " "
	.ascii "21"
	.ascii " "
	.ascii "3"
	.ascii " "
	.ascii "11"
	.ascii " "
	.ascii "3"
	.ascii " "
	.ascii "14"
	.ascii " "
	.ascii "3"
	.ascii " "
