; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22pointer\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/gogo/protobuf/proto\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/gogo/protobuf/proto\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22ptypes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/golang/protobuf/ptypes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/golang/protobuf/ptypes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22layout\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./pointer.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha/pointer")
!3 = !{}
!4 = !{!5, !9}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.maxFuncId", linkageName: "command_line_arguments.maxFuncId", scope: !1, file: !7, line: 41, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "pointer.go", directory: ".")
!8 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !11, line: 1, type: !12, isLocal: false, isDefinition: true)
!11 = !DIFile(filename: "<built-in>", directory: "")
!12 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!13 = distinct !DISubprogram(name: "pointer.newFuncId", scope: null, file: !7, line: 44, type: !14, isLocal: true, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!14 = !DISubroutineType(types: !15)
!15 = !{!8}
!16 = !DILocalVariable(name: "$ret0", scope: !13, file: !7, line: 44, type: !8)
!17 = !DILocation(line: 44, column: 18, scope: !13)
!18 = !DILocation(line: 45, column: 16, scope: !13)
!19 = !DILocation(line: 45, column: 2, scope: !13)
!20 = distinct !DISubprogram(name: "pointer.OptionKey.command_line_arguments.GestureList", linkageName: "command_line_arguments.GestureList.OptionKey", scope: null, file: !7, line: 50, type: !21, isLocal: false, isDefinition: true, scopeLine: 50, isOptimized: false, unit: !1, retainedNodes: !3)
!21 = !DISubroutineType(types: !22)
!22 = !{!23, !30, !30}
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !11, line: 1, size: 128, align: 8, elements: !24)
!24 = !{!25, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !11, line: 1, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !11, line: 1, baseType: !29, size: 64, align: 64, offset: 64)
!29 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "GestureList", file: !7, line: 48, size: 192, align: 8, elements: !32)
!32 = !{!33, !137, !138}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !7, line: 1, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "Gesture", file: !7, line: 54, size: 128, align: 8, elements: !36)
!36 = !{!37, !118}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 54, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Model,*func(*void)int64}", file: !40, size: 192, align: 8, elements: !41)
!40 = !DIFile(filename: "", directory: "")
!41 = !{!42, !94, !133}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !40, line: 54, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !11, line: 1, size: 576, align: 8, elements: !45)
!45 = !{!46, !48, !49, !50, !51, !52, !53, !63, !72, !73, !75, !93}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !11, line: 1, baseType: !47, size: 64, align: 64)
!47 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !11, line: 1, baseType: !47, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !11, line: 1, baseType: !12, size: 32, align: 32, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !11, line: 1, baseType: !27, size: 8, align: 8, offset: 160)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !11, line: 1, baseType: !27, size: 8, align: 8, offset: 168)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !11, line: 1, baseType: !27, size: 8, align: 8, offset: 176)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !11, line: 1, baseType: !54, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !11, line: 1, size: 64, align: 8, elements: !56)
!56 = !{!57}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !11, line: 1, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!47, !61, !47}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIBasicType(name: "void")
!63 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !11, line: 1, baseType: !64, size: 64, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !11, line: 1, size: 64, align: 8, elements: !66)
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !11, line: 1, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !61, !61}
!71 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !11, line: 1, baseType: !26, size: 64, align: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !11, line: 1, baseType: !74, size: 64, align: 64, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !11, line: 1, baseType: !76, size: 64, align: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !11, line: 1, size: 320, align: 8, elements: !78)
!78 = !{!79, !80, !81}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !11, line: 1, baseType: !74, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !11, line: 1, baseType: !74, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !11, line: 1, baseType: !82, size: 192, align: 64, offset: 128)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !40, size: 192, align: 8, elements: !83)
!83 = !{!84, !91, !92}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !40, line: 1, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !11, line: 1, size: 320, align: 8, elements: !87)
!87 = !{!79, !80, !88, !89, !90}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !11, line: 1, baseType: !61, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !11, line: 1, baseType: !61, size: 64, align: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !11, line: 1, baseType: !61, size: 64, align: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !40, line: 1, baseType: !29, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !40, line: 1, baseType: !29, size: 64, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !11, line: 1, baseType: !61, size: 64, align: 64, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Build", file: !40, line: 54, baseType: !95, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !61}
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "Model", file: !7, line: 59, size: 320, align: 8, elements: !99)
!99 = !{!100, !101, !119}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "NativeViewName", file: !7, line: 60, baseType: !23, size: 128, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "NativeViewState", file: !7, line: 61, baseType: !102, size: 128, align: 64, offset: 128)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !7, line: 35, size: 128, align: 8, elements: !103)
!103 = !{!104, !118}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 35, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void,*func(*void)string}", file: !40, size: 256, align: 8, elements: !107)
!107 = !{!108, !109, !113, !114}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !40, line: 35, baseType: !43, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMessage", file: !40, line: 35, baseType: !110, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!62, !61}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", file: !40, line: 35, baseType: !110, size: 64, align: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !40, line: 35, baseType: !115, size: 64, align: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!23, !61}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !61, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "NativeFuncs", file: !7, line: 62, baseType: !120, size: 64, align: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !11, line: 1, size: 384, align: 8, elements: !122)
!122 = !{!123, !124, !125, !126, !128, !129, !130, !131, !132}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !11, line: 1, baseType: !29, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !11, line: 1, baseType: !27, size: 8, align: 8, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !11, line: 1, baseType: !27, size: 8, align: 8, offset: 72)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !11, line: 1, baseType: !127, size: 16, align: 16, offset: 80)
!127 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !11, line: 1, baseType: !12, size: 32, align: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !11, line: 1, baseType: !61, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !11, line: 1, baseType: !61, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !11, line: 1, baseType: !47, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !11, line: 1, baseType: !61, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "TouchKey", file: !40, line: 54, baseType: !134, size: 64, align: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!8, !61}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !7, line: 1, baseType: !29, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !7, line: 1, baseType: !29, size: 64, align: 64, offset: 128)
!139 = !DILocalVariable(name: "pointer", arg: 1, scope: !20, file: !7, line: 50, type: !30)
!140 = !DILocation(line: 50, column: 1, scope: !20)
!141 = !DILocalVariable(name: "$ret1", scope: !20, file: !7, line: 50, type: !23)
!142 = !DILocation(line: 50, column: 34, scope: !20)
!143 = !DILocation(line: 51, column: 2, scope: !20)
!144 = distinct !DISubprogram(name: "pointer.command_line_arguments.TapEvent..hash", linkageName: "command_line_arguments.command_line_arguments.TapEvent..hash", scope: null, file: !11, line: 1, type: !59, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!145 = !DILocalVariable(name: "key", arg: 1, scope: !144, file: !11, line: 1, type: !61)
!146 = !DILocation(line: 1, column: 1, scope: !144)
!147 = !DILocalVariable(name: "seed", arg: 2, scope: !144, file: !11, line: 1, type: !47)
!148 = !DILocalVariable(name: "$ret11", scope: !144, file: !11, line: 1, type: !47)
!149 = distinct !DISubprogram(name: "pointer.command_line_arguments.TapEvent..eq", linkageName: "command_line_arguments.command_line_arguments.TapEvent..eq", scope: null, file: !11, line: 1, type: !69, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!150 = !DILocalVariable(name: "key1", arg: 1, scope: !149, file: !11, line: 1, type: !61)
!151 = !DILocation(line: 1, column: 1, scope: !149)
!152 = !DILocalVariable(name: "key2", arg: 2, scope: !149, file: !11, line: 1, type: !61)
!153 = !DILocalVariable(name: "$ret12", scope: !149, file: !11, line: 1, type: !71)
!154 = distinct !DISubprogram(name: "pointer.unmarshalProtobuf..1command_line_arguments.TapEvent", linkageName: "command_line_arguments.TapEvent.unmarshalProtobuf", scope: null, file: !7, line: 95, type: !155, isLocal: false, isDefinition: true, scopeLine: 95, isOptimized: false, unit: !1, retainedNodes: !3)
!155 = !DISubroutineType(types: !156)
!156 = !{!157, !166, !166, !211}
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !11, line: 1, size: 128, align: 8, elements: !158)
!158 = !{!159, !165}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 1, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !40, size: 128, align: 8, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !40, line: 1, baseType: !43, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !40, line: 1, baseType: !115, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !11, line: 1, baseType: !61, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "TapEvent", file: !7, line: 89, size: 384, align: 8, elements: !168)
!168 = !{!169, !171, !205}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !7, line: 90, baseType: !170, size: 64, align: 64)
!170 = !DIBasicType(name: "EventKind", size: 64, encoding: DW_ATE_signed)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !7, line: 91, baseType: !172, size: 192, align: 64, offset: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 33, size: 192, align: 8, elements: !173)
!173 = !{!174, !176, !177}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 33, baseType: !175, size: 64, align: 64)
!175 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 33, baseType: !8, size: 64, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 33, baseType: !178, size: 64, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 33, size: 704, align: 8, elements: !180)
!180 = !{!181, !182, !191, !202, !203, !204}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 33, baseType: !23, size: 128, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 33, baseType: !183, size: 192, align: 64, offset: 128)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !40, size: 192, align: 8, elements: !184)
!184 = !{!185, !91, !92}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !40, line: 1, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 33, size: 256, align: 8, elements: !188)
!188 = !{!181, !189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 33, baseType: !29, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 33, baseType: !71, size: 8, align: 8, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 33, baseType: !192, size: 192, align: 64, offset: 320)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !40, size: 192, align: 8, elements: !193)
!193 = !{!194, !91, !92}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !40, line: 1, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 33, size: 128, align: 8, elements: !197)
!197 = !{!198, !199, !200, !201}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 33, baseType: !8, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 33, baseType: !27, size: 8, align: 8, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 33, baseType: !71, size: 8, align: 8, offset: 72)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 33, baseType: !71, size: 8, align: 8, offset: 80)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 33, baseType: !8, size: 64, align: 64, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 33, baseType: !8, size: 64, align: 64, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 33, baseType: !186, size: 64, align: 64, offset: 640)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Position", file: !7, line: 92, baseType: !206, size: 128, align: 64, offset: 256)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "Point", file: !7, line: 37, size: 128, align: 8, elements: !207)
!207 = !{!208, !210}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "X", file: !7, line: 37, baseType: !209, size: 64, align: 64)
!209 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Y", file: !7, line: 37, baseType: !209, size: 64, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "TapEvent", file: !7, line: 38, size: 192, align: 8, elements: !213)
!213 = !{!214, !228, !230}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !7, line: 38, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timestamp", file: !7, line: 36, size: 384, align: 8, elements: !217)
!217 = !{!218, !219, !221, !223, !227}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Seconds", file: !7, line: 36, baseType: !8, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Nanos", file: !7, line: 36, baseType: !220, size: 32, align: 32, offset: 64)
!220 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_NoUnkeyedLiteral", file: !7, line: 36, baseType: !222, align: 8, offset: 96)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !11, line: 1, align: 8, elements: !3)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 36, baseType: !224, size: 192, align: 64, offset: 128)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !40, size: 192, align: 8, elements: !225)
!225 = !{!226, !91, !92}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !40, line: 1, baseType: !26, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_sizecache", file: !7, line: 36, baseType: !220, size: 32, align: 32, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Position", file: !7, line: 38, baseType: !229, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !7, line: 38, baseType: !231, size: 32, align: 32, offset: 128)
!231 = !DIBasicType(name: "EventKind", size: 32, encoding: DW_ATE_signed)
!232 = !DILocalVariable(name: "e", arg: 1, scope: !154, file: !7, line: 95, type: !166)
!233 = !DILocation(line: 95, column: 1, scope: !154)
!234 = !DILocalVariable(name: "ev", arg: 2, scope: !154, file: !7, line: 95, type: !211)
!235 = !DILocation(line: 95, column: 38, scope: !154)
!236 = !DILocation(line: 96, column: 29, scope: !237)
!237 = distinct !DILexicalBlock(scope: !154, file: !7, line: 95, column: 1)
!238 = !DILocation(line: 96, column: 17, scope: !237)
!239 = !DILocation(line: 97, column: 3, scope: !237)
!240 = !DILocation(line: 97, column: 14, scope: !237)
!241 = !DILocation(line: 98, column: 3, scope: !237)
!242 = !DILocation(line: 98, column: 23, scope: !237)
!243 = !DILocation(line: 98, column: 20, scope: !237)
!244 = !DILocation(line: 98, column: 9, scope: !237)
!245 = !DILocation(line: 99, column: 3, scope: !237)
!246 = !DILocation(line: 99, column: 33, scope: !237)
!247 = !DILocation(line: 99, column: 12, scope: !237)
!248 = !DILocalVariable(name: "$ret2", scope: !154, file: !7, line: 95, type: !157)
!249 = !DILocation(line: 95, column: 60, scope: !154)
!250 = !DILocation(line: 100, column: 2, scope: !237)
!251 = distinct !DISubprogram(name: "pointer.Build..1command_line_arguments.TapGesture", linkageName: "command_line_arguments.TapGesture.Build", scope: null, file: !7, line: 114, type: !252, isLocal: false, isDefinition: true, scopeLine: 114, isOptimized: false, unit: !1, retainedNodes: !3)
!252 = !DISubroutineType(types: !253)
!253 = !{!98, !254, !254}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "TapGesture", file: !7, line: 104, size: 192, align: 8, elements: !256)
!256 = !{!257, !258, !259}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !7, line: 105, baseType: !8, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Count", file: !7, line: 106, baseType: !29, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "OnEvent", file: !7, line: 107, baseType: !260, size: 64, align: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 107, size: 64, align: 8, elements: !262)
!262 = !{!263}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 107, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!62, !166}
!267 = !DILocalVariable(name: "param", arg: 1, scope: !251, file: !7, line: 114, type: !254)
!268 = !DILocation(line: 114, column: 1, scope: !251)
!269 = !DILocalVariable(name: "r", scope: !251, file: !7, line: 114, type: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!271 = !DILocation(line: 115, column: 12, scope: !272)
!272 = distinct !DILexicalBlock(scope: !251, file: !7, line: 114, column: 1)
!273 = !DILocalVariable(name: "funcId", scope: !272, file: !7, line: 115, type: !8)
!274 = !DILocation(line: 115, column: 2, scope: !251)
!275 = !DILocation(line: 116, column: 7, scope: !272)
!276 = !DILocation(line: 142, column: 8, scope: !272)
!277 = !DILocation(line: 138, column: 19, scope: !272)
!278 = !DILocation(line: 138, column: 20, scope: !272)
!279 = !DILocalVariable(name: "f", scope: !272, file: !7, line: 116, type: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 116, size: 64, align: 8, elements: !282)
!282 = !{!283}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 116, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!62, !224}
!287 = !DILocation(line: 116, column: 2, scope: !251)
!288 = !DILocation(line: 141, column: 16, scope: !272)
!289 = !DILocation(line: 137, column: 20, scope: !272)
!290 = !DILocation(line: 137, column: 29, scope: !272)
!291 = !DILocalVariable(name: "$ret4", scope: !251, file: !7, line: 114, type: !98)
!292 = !DILocation(line: 114, column: 30, scope: !251)
!293 = !DILocation(line: 135, column: 2, scope: !272)
!294 = distinct !DISubprogram(name: "pointer.TouchKey..1command_line_arguments.TapGesture", linkageName: "command_line_arguments.TapGesture.TouchKey", scope: null, file: !7, line: 110, type: !295, isLocal: false, isDefinition: true, scopeLine: 110, isOptimized: false, unit: !1, retainedNodes: !3)
!295 = !DISubroutineType(types: !296)
!296 = !{!8, !254, !254}
!297 = !DILocalVariable(name: "r", arg: 1, scope: !294, file: !7, line: 110, type: !254)
!298 = !DILocation(line: 110, column: 1, scope: !294)
!299 = !DILocalVariable(name: "$ret3", scope: !294, file: !7, line: 110, type: !8)
!300 = !DILocation(line: 110, column: 33, scope: !294)
!301 = !DILocation(line: 111, column: 10, scope: !294)
!302 = !DILocation(line: 111, column: 2, scope: !294)
!303 = distinct !DISubprogram(name: "pointer.func1", scope: null, file: !7, line: 116, type: !285, isLocal: true, isDefinition: true, scopeLine: 116, isOptimized: false, unit: !1, retainedNodes: !3)
!304 = !DILocalVariable(name: "data", arg: 1, scope: !303, file: !7, line: 116, type: !224)
!305 = !DILocation(line: 116, column: 12, scope: !303)
!306 = !DILocation(line: 117, column: 14, scope: !307)
!307 = distinct !DILexicalBlock(scope: !303, file: !7, line: 116, column: 7)
!308 = !DILocation(line: 118, column: 32, scope: !307)
!309 = !DILocation(line: 118, column: 16, scope: !307)
!310 = !DILocalVariable(name: "err", scope: !307, file: !7, line: 118, type: !157)
!311 = !DILocation(line: 118, column: 3, scope: !303)
!312 = !DILocation(line: 119, column: 10, scope: !307)
!313 = !DILocation(line: 120, column: 8, scope: !307)
!314 = !DILocation(line: 120, column: 25, scope: !307)
!315 = !DILocation(line: 121, column: 4, scope: !307)
!316 = !DILocalVariable(name: "pbevent", scope: !307, file: !7, line: 117, type: !211)
!317 = !DILocation(line: 117, column: 3, scope: !303)
!318 = !DILocation(line: 124, column: 12, scope: !307)
!319 = !DILocalVariable(name: "event", scope: !307, file: !7, line: 124, type: !166)
!320 = !DILocation(line: 124, column: 3, scope: !303)
!321 = !DILocation(line: 125, column: 18, scope: !322)
!322 = distinct !DILexicalBlock(scope: !307, file: !7, line: 125, column: 3)
!323 = !DILocalVariable(name: "err", scope: !322, file: !7, line: 125, type: !157)
!324 = !DILocation(line: 125, column: 6, scope: !307)
!325 = !DILocation(line: 130, column: 6, scope: !307)
!326 = !DILocation(line: 130, column: 7, scope: !307)
!327 = !DILocation(line: 130, column: 16, scope: !307)
!328 = !DILocation(line: 131, column: 5, scope: !307)
!329 = distinct !DISubprogram(name: "pointer.command_line_arguments.PressEvent..hash", linkageName: "command_line_arguments.command_line_arguments.PressEvent..hash", scope: null, file: !11, line: 1, type: !59, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!330 = !DILocalVariable(name: "key", arg: 1, scope: !329, file: !11, line: 1, type: !61)
!331 = !DILocation(line: 1, column: 1, scope: !329)
!332 = !DILocalVariable(name: "seed", arg: 2, scope: !329, file: !11, line: 1, type: !47)
!333 = !DILocalVariable(name: "$ret13", scope: !329, file: !11, line: 1, type: !47)
!334 = distinct !DISubprogram(name: "pointer.command_line_arguments.PressEvent..eq", linkageName: "command_line_arguments.command_line_arguments.PressEvent..eq", scope: null, file: !11, line: 1, type: !69, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!335 = !DILocalVariable(name: "key1", arg: 1, scope: !334, file: !11, line: 1, type: !61)
!336 = !DILocation(line: 1, column: 1, scope: !334)
!337 = !DILocalVariable(name: "key2", arg: 2, scope: !334, file: !11, line: 1, type: !61)
!338 = !DILocalVariable(name: "$ret14", scope: !334, file: !11, line: 1, type: !71)
!339 = distinct !DISubprogram(name: "pointer.unmarshalProtobuf..1command_line_arguments.PressEvent", linkageName: "command_line_arguments.PressEvent.unmarshalProtobuf", scope: null, file: !7, line: 155, type: !340, isLocal: false, isDefinition: true, scopeLine: 155, isOptimized: false, unit: !1, retainedNodes: !3)
!340 = !DISubroutineType(types: !341)
!341 = !{!157, !342, !342, !350}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "PressEvent", file: !7, line: 148, size: 448, align: 8, elements: !344)
!344 = !{!345, !346, !347, !348}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !7, line: 149, baseType: !170, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !7, line: 150, baseType: !172, size: 192, align: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Position", file: !7, line: 151, baseType: !206, size: 128, align: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "Duration", file: !7, line: 152, baseType: !349, size: 64, align: 64, offset: 384)
!349 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "PressEvent", file: !7, line: 38, size: 256, align: 8, elements: !352)
!352 = !{!214, !228, !230, !353}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Duration", file: !7, line: 38, baseType: !354, size: 64, align: 64, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "Duration", file: !7, line: 36, size: 384, align: 8, elements: !217)
!356 = !DILocalVariable(name: "e", arg: 1, scope: !339, file: !7, line: 155, type: !342)
!357 = !DILocation(line: 155, column: 1, scope: !339)
!358 = !DILocalVariable(name: "ev", arg: 2, scope: !339, file: !7, line: 155, type: !350)
!359 = !DILocation(line: 155, column: 40, scope: !339)
!360 = !DILocation(line: 156, column: 30, scope: !361)
!361 = distinct !DILexicalBlock(scope: !339, file: !7, line: 155, column: 1)
!362 = !DILocation(line: 156, column: 19, scope: !361)
!363 = !DILocalVariable(name: "d", scope: !361, file: !7, line: 156, type: !349)
!364 = !DILocation(line: 156, column: 2, scope: !339)
!365 = !DILocalVariable(name: "err", scope: !361, file: !7, line: 156, type: !157)
!366 = !DILocation(line: 157, column: 9, scope: !361)
!367 = !DILocation(line: 158, column: 3, scope: !361)
!368 = !DILocalVariable(name: "$ret5", scope: !339, file: !7, line: 155, type: !157)
!369 = !DILocation(line: 155, column: 64, scope: !339)
!370 = !DILocation(line: 160, column: 31, scope: !361)
!371 = !DILocation(line: 160, column: 19, scope: !361)
!372 = !DILocation(line: 161, column: 9, scope: !361)
!373 = !DILocation(line: 162, column: 3, scope: !361)
!374 = !DILocation(line: 164, column: 3, scope: !361)
!375 = !DILocation(line: 164, column: 23, scope: !361)
!376 = !DILocation(line: 164, column: 20, scope: !361)
!377 = !DILocation(line: 164, column: 9, scope: !361)
!378 = !DILocation(line: 165, column: 3, scope: !361)
!379 = !DILocation(line: 165, column: 14, scope: !361)
!380 = !DILocation(line: 166, column: 3, scope: !361)
!381 = !DILocation(line: 166, column: 33, scope: !361)
!382 = !DILocation(line: 166, column: 12, scope: !361)
!383 = !DILocation(line: 167, column: 3, scope: !361)
!384 = !DILocation(line: 167, column: 13, scope: !361)
!385 = !DILocation(line: 168, column: 2, scope: !361)
!386 = distinct !DISubprogram(name: "pointer.Build..1command_line_arguments.PressGesture", linkageName: "command_line_arguments.PressGesture.Build", scope: null, file: !7, line: 182, type: !387, isLocal: false, isDefinition: true, scopeLine: 182, isOptimized: false, unit: !1, retainedNodes: !3)
!387 = !DISubroutineType(types: !388)
!388 = !{!98, !389, !389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "PressGesture", file: !7, line: 172, size: 192, align: 8, elements: !391)
!391 = !{!392, !393, !394}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !7, line: 173, baseType: !8, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "MinDuration", file: !7, line: 174, baseType: !349, size: 64, align: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "OnEvent", file: !7, line: 175, baseType: !395, size: 64, align: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 175, size: 64, align: 8, elements: !397)
!397 = !{!398}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 175, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!62, !342}
!402 = !DILocalVariable(name: "param", arg: 1, scope: !386, file: !7, line: 182, type: !389)
!403 = !DILocation(line: 182, column: 1, scope: !386)
!404 = !DILocalVariable(name: "r", scope: !386, file: !7, line: 182, type: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!406 = !DILocation(line: 183, column: 12, scope: !407)
!407 = distinct !DILexicalBlock(scope: !386, file: !7, line: 182, column: 1)
!408 = !DILocalVariable(name: "funcId", scope: !407, file: !7, line: 183, type: !8)
!409 = !DILocation(line: 183, column: 2, scope: !386)
!410 = !DILocation(line: 184, column: 7, scope: !407)
!411 = !DILocation(line: 205, column: 38, scope: !407)
!412 = !DILocation(line: 205, column: 39, scope: !407)
!413 = !DILocalVariable(name: "f", scope: !407, file: !7, line: 184, type: !280)
!414 = !DILocation(line: 184, column: 2, scope: !386)
!415 = !DILocation(line: 205, column: 24, scope: !407)
!416 = !DILocation(line: 209, column: 8, scope: !407)
!417 = !DILocation(line: 208, column: 16, scope: !407)
!418 = !DILocation(line: 204, column: 20, scope: !407)
!419 = !DILocation(line: 204, column: 29, scope: !407)
!420 = !DILocalVariable(name: "$ret7", scope: !386, file: !7, line: 182, type: !98)
!421 = !DILocation(line: 182, column: 32, scope: !386)
!422 = !DILocation(line: 202, column: 2, scope: !407)
!423 = distinct !DISubprogram(name: "pointer.TouchKey..1command_line_arguments.PressGesture", linkageName: "command_line_arguments.PressGesture.TouchKey", scope: null, file: !7, line: 178, type: !424, isLocal: false, isDefinition: true, scopeLine: 178, isOptimized: false, unit: !1, retainedNodes: !3)
!424 = !DISubroutineType(types: !425)
!425 = !{!8, !389, !389}
!426 = !DILocalVariable(name: "r", arg: 1, scope: !423, file: !7, line: 178, type: !389)
!427 = !DILocation(line: 178, column: 1, scope: !423)
!428 = !DILocalVariable(name: "$ret6", scope: !423, file: !7, line: 178, type: !8)
!429 = !DILocation(line: 178, column: 35, scope: !423)
!430 = !DILocation(line: 179, column: 10, scope: !423)
!431 = !DILocation(line: 179, column: 2, scope: !423)
!432 = distinct !DISubprogram(name: "pointer.func1", scope: null, file: !7, line: 184, type: !285, isLocal: true, isDefinition: true, scopeLine: 184, isOptimized: false, unit: !1, retainedNodes: !3)
!433 = !DILocalVariable(name: "data", arg: 1, scope: !432, file: !7, line: 184, type: !224)
!434 = !DILocation(line: 184, column: 12, scope: !432)
!435 = !DILocation(line: 185, column: 12, scope: !436)
!436 = distinct !DILexicalBlock(scope: !432, file: !7, line: 184, column: 7)
!437 = !DILocalVariable(name: "event", scope: !436, file: !7, line: 185, type: !342)
!438 = !DILocation(line: 185, column: 3, scope: !432)
!439 = !DILocation(line: 186, column: 14, scope: !436)
!440 = !DILocation(line: 187, column: 32, scope: !436)
!441 = !DILocation(line: 187, column: 16, scope: !436)
!442 = !DILocalVariable(name: "err", scope: !436, file: !7, line: 187, type: !157)
!443 = !DILocation(line: 187, column: 3, scope: !432)
!444 = !DILocation(line: 188, column: 10, scope: !436)
!445 = !DILocation(line: 189, column: 8, scope: !436)
!446 = !DILocation(line: 189, column: 25, scope: !436)
!447 = !DILocation(line: 190, column: 4, scope: !436)
!448 = !DILocalVariable(name: "pbevent", scope: !436, file: !7, line: 186, type: !350)
!449 = !DILocation(line: 186, column: 3, scope: !432)
!450 = !DILocation(line: 193, column: 18, scope: !451)
!451 = distinct !DILexicalBlock(scope: !436, file: !7, line: 193, column: 3)
!452 = !DILocalVariable(name: "err", scope: !451, file: !7, line: 193, type: !157)
!453 = !DILocation(line: 193, column: 6, scope: !436)
!454 = !DILocation(line: 193, column: 51, scope: !451)
!455 = !DILocation(line: 194, column: 8, scope: !451)
!456 = !DILocation(line: 194, column: 25, scope: !451)
!457 = !DILocation(line: 195, column: 4, scope: !451)
!458 = !DILocation(line: 197, column: 6, scope: !436)
!459 = !DILocation(line: 197, column: 7, scope: !436)
!460 = !DILocation(line: 197, column: 16, scope: !436)
!461 = !DILocation(line: 198, column: 5, scope: !436)
!462 = distinct !DISubprogram(name: "pointer.command_line_arguments.ButtonEvent..hash", linkageName: "command_line_arguments.command_line_arguments.ButtonEvent..hash", scope: null, file: !11, line: 1, type: !59, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!463 = !DILocalVariable(name: "key", arg: 1, scope: !462, file: !11, line: 1, type: !61)
!464 = !DILocation(line: 1, column: 1, scope: !462)
!465 = !DILocalVariable(name: "seed", arg: 2, scope: !462, file: !11, line: 1, type: !47)
!466 = !DILocalVariable(name: "$ret15", scope: !462, file: !11, line: 1, type: !47)
!467 = distinct !DISubprogram(name: "pointer.command_line_arguments.ButtonEvent..eq", linkageName: "command_line_arguments.command_line_arguments.ButtonEvent..eq", scope: null, file: !11, line: 1, type: !69, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!468 = !DILocalVariable(name: "key1", arg: 1, scope: !467, file: !11, line: 1, type: !61)
!469 = !DILocation(line: 1, column: 1, scope: !467)
!470 = !DILocalVariable(name: "key2", arg: 2, scope: !467, file: !11, line: 1, type: !61)
!471 = !DILocalVariable(name: "$ret16", scope: !467, file: !11, line: 1, type: !71)
!472 = distinct !DISubprogram(name: "pointer.unmarshalProtobuf..1command_line_arguments.ButtonEvent", linkageName: "command_line_arguments.ButtonEvent.unmarshalProtobuf", scope: null, file: !7, line: 221, type: !473, isLocal: false, isDefinition: true, scopeLine: 221, isOptimized: false, unit: !1, retainedNodes: !3)
!473 = !DISubroutineType(types: !474)
!474 = !{!157, !475, !475, !481}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "ButtonEvent", file: !7, line: 215, size: 320, align: 8, elements: !477)
!477 = !{!478, !479, !480}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", file: !7, line: 216, baseType: !172, size: 192, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Inside", file: !7, line: 217, baseType: !71, size: 8, align: 8, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !7, line: 218, baseType: !170, size: 64, align: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "ButtonEvent", file: !7, line: 38, size: 128, align: 8, elements: !483)
!483 = !{!214, !484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Inside", file: !7, line: 38, baseType: !71, size: 8, align: 8, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !7, line: 38, baseType: !231, size: 32, align: 32, offset: 96)
!486 = !DILocalVariable(name: "e", arg: 1, scope: !472, file: !7, line: 221, type: !475)
!487 = !DILocation(line: 221, column: 1, scope: !472)
!488 = !DILocalVariable(name: "ev", arg: 2, scope: !472, file: !7, line: 221, type: !481)
!489 = !DILocation(line: 221, column: 41, scope: !472)
!490 = !DILocation(line: 222, column: 31, scope: !491)
!491 = distinct !DILexicalBlock(scope: !472, file: !7, line: 221, column: 1)
!492 = !DILocation(line: 222, column: 19, scope: !491)
!493 = !DILocalVariable(name: "err", scope: !491, file: !7, line: 222, type: !157)
!494 = !DILocation(line: 222, column: 2, scope: !472)
!495 = !DILocation(line: 223, column: 9, scope: !491)
!496 = !DILocation(line: 224, column: 3, scope: !491)
!497 = !DILocalVariable(name: "$ret8", scope: !472, file: !7, line: 221, type: !157)
!498 = !DILocation(line: 221, column: 66, scope: !472)
!499 = !DILocation(line: 226, column: 3, scope: !491)
!500 = !DILocation(line: 226, column: 14, scope: !491)
!501 = !DILocation(line: 227, column: 3, scope: !491)
!502 = !DILocation(line: 227, column: 15, scope: !491)
!503 = !DILocation(line: 227, column: 11, scope: !491)
!504 = !DILocation(line: 228, column: 3, scope: !491)
!505 = !DILocation(line: 228, column: 23, scope: !491)
!506 = !DILocation(line: 228, column: 20, scope: !491)
!507 = !DILocation(line: 228, column: 9, scope: !491)
!508 = !DILocation(line: 229, column: 2, scope: !491)
!509 = distinct !DISubprogram(name: "pointer.Build..1command_line_arguments.ButtonGesture", linkageName: "command_line_arguments.ButtonGesture.Build", scope: null, file: !7, line: 243, type: !510, isLocal: false, isDefinition: true, scopeLine: 243, isOptimized: false, unit: !1, retainedNodes: !3)
!510 = !DISubroutineType(types: !511)
!511 = !{!98, !512, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "ButtonGesture", file: !7, line: 233, size: 192, align: 8, elements: !514)
!514 = !{!515, !516, !524}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !7, line: 234, baseType: !8, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "OnEvent", file: !7, line: 235, baseType: !517, size: 64, align: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 235, size: 64, align: 8, elements: !519)
!519 = !{!520}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 235, baseType: !521, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!62, !475}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "IgnoresScroll", file: !7, line: 236, baseType: !71, size: 8, align: 8, offset: 128)
!525 = !DILocalVariable(name: "param", arg: 1, scope: !509, file: !7, line: 243, type: !512)
!526 = !DILocation(line: 243, column: 1, scope: !509)
!527 = !DILocalVariable(name: "r", scope: !509, file: !7, line: 243, type: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!529 = !DILocation(line: 244, column: 12, scope: !530)
!530 = distinct !DILexicalBlock(scope: !509, file: !7, line: 243, column: 1)
!531 = !DILocalVariable(name: "funcId", scope: !530, file: !7, line: 244, type: !8)
!532 = !DILocation(line: 244, column: 2, scope: !509)
!533 = !DILocation(line: 245, column: 7, scope: !530)
!534 = !DILocation(line: 271, column: 8, scope: !530)
!535 = !DILocation(line: 268, column: 19, scope: !530)
!536 = !DILocation(line: 268, column: 20, scope: !530)
!537 = !DILocalVariable(name: "f", scope: !530, file: !7, line: 245, type: !280)
!538 = !DILocation(line: 245, column: 2, scope: !509)
!539 = !DILocation(line: 270, column: 16, scope: !530)
!540 = !DILocation(line: 266, column: 20, scope: !530)
!541 = !DILocation(line: 266, column: 29, scope: !530)
!542 = !DILocalVariable(name: "$ret10", scope: !509, file: !7, line: 243, type: !98)
!543 = !DILocation(line: 243, column: 33, scope: !509)
!544 = !DILocation(line: 264, column: 2, scope: !530)
!545 = distinct !DISubprogram(name: "pointer.TouchKey..1command_line_arguments.ButtonGesture", linkageName: "command_line_arguments.ButtonGesture.TouchKey", scope: null, file: !7, line: 239, type: !546, isLocal: false, isDefinition: true, scopeLine: 239, isOptimized: false, unit: !1, retainedNodes: !3)
!546 = !DISubroutineType(types: !547)
!547 = !{!8, !512, !512}
!548 = !DILocalVariable(name: "r", arg: 1, scope: !545, file: !7, line: 239, type: !512)
!549 = !DILocation(line: 239, column: 1, scope: !545)
!550 = !DILocalVariable(name: "$ret9", scope: !545, file: !7, line: 239, type: !8)
!551 = !DILocation(line: 239, column: 36, scope: !545)
!552 = !DILocation(line: 240, column: 10, scope: !545)
!553 = !DILocation(line: 240, column: 2, scope: !545)
!554 = distinct !DISubprogram(name: "pointer.func1", scope: null, file: !7, line: 245, type: !285, isLocal: true, isDefinition: true, scopeLine: 245, isOptimized: false, unit: !1, retainedNodes: !3)
!555 = !DILocalVariable(name: "data", arg: 1, scope: !554, file: !7, line: 245, type: !224)
!556 = !DILocation(line: 245, column: 12, scope: !554)
!557 = !DILocation(line: 246, column: 12, scope: !558)
!558 = distinct !DILexicalBlock(scope: !554, file: !7, line: 245, column: 7)
!559 = !DILocalVariable(name: "event", scope: !558, file: !7, line: 246, type: !475)
!560 = !DILocation(line: 246, column: 3, scope: !554)
!561 = !DILocation(line: 247, column: 14, scope: !558)
!562 = !DILocation(line: 248, column: 32, scope: !558)
!563 = !DILocation(line: 248, column: 16, scope: !558)
!564 = !DILocalVariable(name: "err", scope: !558, file: !7, line: 248, type: !157)
!565 = !DILocation(line: 248, column: 3, scope: !554)
!566 = !DILocation(line: 249, column: 10, scope: !558)
!567 = !DILocation(line: 250, column: 8, scope: !558)
!568 = !DILocation(line: 250, column: 25, scope: !558)
!569 = !DILocation(line: 251, column: 4, scope: !558)
!570 = !DILocalVariable(name: "pbevent", scope: !558, file: !7, line: 247, type: !481)
!571 = !DILocation(line: 247, column: 3, scope: !554)
!572 = !DILocation(line: 254, column: 18, scope: !573)
!573 = distinct !DILexicalBlock(scope: !558, file: !7, line: 254, column: 3)
!574 = !DILocalVariable(name: "err", scope: !573, file: !7, line: 254, type: !157)
!575 = !DILocation(line: 254, column: 6, scope: !558)
!576 = !DILocation(line: 254, column: 51, scope: !573)
!577 = !DILocation(line: 255, column: 8, scope: !573)
!578 = !DILocation(line: 255, column: 25, scope: !573)
!579 = !DILocation(line: 256, column: 4, scope: !573)
!580 = !DILocation(line: 259, column: 6, scope: !558)
