; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22keyboard\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/golang/protobuf/proto\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/golang/protobuf/proto\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22math\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22math\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22keyboard\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22command_line_arguments..import\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./keyboard.pb.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha/proto/keyboard")
!3 = !{}
!4 = !{!5, !109, !111, !127, !137, !152, !154, !156, !158, !160, !162}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments._.0", linkageName: "command_line_arguments._.0", scope: !1, file: !7, line: 19, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "keyboard.pb.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 14, size: 64, align: 8, elements: !10)
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 14, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !95}
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !16, size: 320, align: 8, elements: !17)
!16 = !DIFile(filename: "", directory: "")
!17 = !{!18, !27}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 14, baseType: !19, size: 192, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !16, size: 192, align: 8, elements: !20)
!20 = !{!21, !24, !26}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !16, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !16, line: 1, baseType: !25, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 14, baseType: !28, size: 128, align: 64, offset: 192)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !29, line: 1, size: 128, align: 8, elements: !30)
!29 = !DIFile(filename: "<built-in>", directory: "")
!30 = !{!31, !94}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !29, line: 1, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !16, size: 128, align: 8, elements: !34)
!34 = !{!35, !90}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 1, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !29, line: 1, size: 576, align: 8, elements: !38)
!38 = !{!39, !41, !42, !44, !45, !46, !47, !57, !66, !67, !73, !89}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !29, line: 1, baseType: !40, size: 64, align: 64)
!40 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !29, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !29, line: 1, baseType: !43, size: 32, align: 32, offset: 128)
!43 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 168)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 176)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !29, line: 1, baseType: !48, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !29, line: 1, size: 64, align: 8, elements: !50)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !29, line: 1, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!40, !55, !40}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIBasicType(name: "void")
!57 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !29, line: 1, baseType: !58, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !29, line: 1, size: 64, align: 8, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !29, line: 1, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !55, !55}
!65 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !29, line: 1, baseType: !22, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !29, line: 1, baseType: !68, size: 64, align: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !29, line: 1, size: 128, align: 8, elements: !70)
!70 = !{!71, !72}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !29, line: 1, baseType: !22, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !29, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !29, line: 1, baseType: !74, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !29, line: 1, size: 320, align: 8, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !29, line: 1, baseType: !68, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !29, line: 1, baseType: !68, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !29, line: 1, baseType: !80, size: 192, align: 64, offset: 128)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !16, size: 192, align: 8, elements: !81)
!81 = !{!82, !24, !26}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !29, line: 1, size: 320, align: 8, elements: !85)
!85 = !{!77, !78, !86, !87, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !16, line: 1, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!69, !55}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !7, line: 14, size: 128, align: 8, elements: !96)
!96 = !{!97, !108}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 14, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void,*func(*void)string}", file: !16, size: 256, align: 8, elements: !100)
!100 = !{!101, !102, !106, !107}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 14, baseType: !36, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMessage", file: !16, line: 14, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!56, !55}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", file: !16, line: 14, baseType: !103, size: 64, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !16, line: 14, baseType: !91, size: 64, align: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !29, line: 1, type: !43, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "command_line_arguments._.1", linkageName: "command_line_arguments._.1", scope: !1, file: !7, line: 20, type: !113, isLocal: false, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 15, size: 64, align: 8, elements: !115)
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 15, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!28, !69, !120}
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*void},int,int}", file: !16, size: 192, align: 8, elements: !121)
!121 = !{!122, !24, !26}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !16, size: 128, align: 8, elements: !125)
!125 = !{!35, !126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !16, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "command_line_arguments._.2", linkageName: "command_line_arguments._.2", scope: !1, file: !7, line: 21, type: !129, isLocal: false, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 16, size: 64, align: 8, elements: !131)
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 16, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !25}
!136 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "command_line_arguments.Type_name", linkageName: "command_line_arguments.Type_name", scope: !1, file: !7, line: 40, type: !139, isLocal: false, isDefinition: true)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !29, line: 1, size: 384, align: 8, elements: !141)
!141 = !{!142, !143, !144, !145, !147, !148, !149, !150, !151}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !29, line: 1, baseType: !25, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 72)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !29, line: 1, baseType: !146, size: 16, align: 16, offset: 80)
!146 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !29, line: 1, baseType: !43, size: 32, align: 32, offset: 96)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !29, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 320)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "command_line_arguments.Type_value", linkageName: "command_line_arguments.Type_value", scope: !1, file: !7, line: 48, type: !139, isLocal: false, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor0", linkageName: "command_line_arguments.fileDescriptor0", scope: !1, file: !7, line: 145, type: !19, isLocal: true, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "command_line_arguments.Appearance_name", linkageName: "command_line_arguments.Appearance_name", scope: !1, file: !7, line: 70, type: !139, isLocal: false, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "command_line_arguments.Appearance_value", linkageName: "command_line_arguments.Appearance_value", scope: !1, file: !7, line: 75, type: !139, isLocal: false, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "command_line_arguments.ReturnType_name", linkageName: "command_line_arguments.ReturnType_name", scope: !1, file: !7, line: 103, type: !139, isLocal: false, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "command_line_arguments.ReturnType_value", linkageName: "command_line_arguments.ReturnType_value", scope: !1, file: !7, line: 117, type: !139, isLocal: false, isDefinition: true)
!164 = distinct !DISubprogram(name: "keyboard.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 12, type: !165, isLocal: false, isDefinition: true, scopeLine: 12, isOptimized: false, unit: !1, retainedNodes: !3)
!165 = !DISubroutineType(types: !166)
!166 = !{!56}
!167 = !DILocation(line: 1, column: 1, scope: !168)
!168 = !DILexicalBlockFile(scope: !164, file: !29, discriminator: 0)
!169 = !DILocation(line: 19, column: 5, scope: !170)
!170 = !DILexicalBlockFile(scope: !164, file: !7, discriminator: 0)
!171 = !DILocation(line: 20, column: 5, scope: !170)
!172 = !DILocation(line: 21, column: 5, scope: !170)
!173 = !DILocation(line: 40, column: 17, scope: !170)
!174 = !DILocation(line: 40, column: 5, scope: !170)
!175 = !DILocation(line: 48, column: 18, scope: !170)
!176 = !DILocation(line: 48, column: 5, scope: !170)
!177 = !DILocation(line: 70, column: 23, scope: !170)
!178 = !DILocation(line: 70, column: 5, scope: !170)
!179 = !DILocation(line: 75, column: 24, scope: !170)
!180 = !DILocation(line: 75, column: 5, scope: !170)
!181 = !DILocation(line: 103, column: 23, scope: !170)
!182 = !DILocation(line: 103, column: 5, scope: !170)
!183 = !DILocation(line: 117, column: 24, scope: !170)
!184 = !DILocation(line: 117, column: 5, scope: !170)
!185 = !DILocation(line: 137, column: 1, scope: !170)
!186 = !DILocation(line: 143, column: 1, scope: !170)
!187 = distinct !DISubprogram(name: "keyboard.EnumDescriptor.command_line_arguments.Type", linkageName: "command_line_arguments.Type.EnumDescriptor", scope: null, file: !7, line: 60, type: !188, isLocal: false, isDefinition: true, scopeLine: 60, isOptimized: false, unit: !1, retainedNodes: !3)
!188 = !DISubroutineType(types: !189)
!189 = !{!190, !198, !198}
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},struct{*int,int,int}}", file: !16, size: 384, align: 8, elements: !191)
!191 = !{!192, !193}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 60, baseType: !19, size: 192, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 60, baseType: !194, size: 192, align: 64, offset: 192)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !16, size: 192, align: 8, elements: !195)
!195 = !{!196, !24, !26}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIBasicType(name: "Type", size: 32, encoding: DW_ATE_signed)
!200 = !DILocalVariable(name: "r.0.pointer", arg: 1, scope: !187, file: !7, line: 60, type: !198)
!201 = !DILocation(line: 60, column: 1, scope: !187)
!202 = !DILocalVariable(name: "r.0", scope: !187, file: !7, line: 60, type: !199)
!203 = !DILocation(line: 60, column: 72, scope: !187)
!204 = !DILocalVariable(name: "$ret2", scope: !187, file: !7, line: 60, type: !194)
!205 = !DILocation(line: 60, column: 39, scope: !187)
!206 = !DILocation(line: 60, column: 48, scope: !187)
!207 = distinct !DISubprogram(name: "keyboard.String.command_line_arguments.Type", linkageName: "command_line_arguments.Type.String", scope: null, file: !7, line: 57, type: !208, isLocal: false, isDefinition: true, scopeLine: 57, isOptimized: false, unit: !1, retainedNodes: !3)
!208 = !DISubroutineType(types: !209)
!209 = !{!69, !198, !198}
!210 = !DILocalVariable(name: "pointer", arg: 1, scope: !207, file: !7, line: 57, type: !198)
!211 = !DILocation(line: 57, column: 1, scope: !207)
!212 = !DILocalVariable(name: "x", scope: !207, file: !7, line: 57, type: !199)
!213 = !DILocation(line: 58, column: 24, scope: !207)
!214 = !DILocation(line: 58, column: 15, scope: !207)
!215 = !DILocation(line: 58, column: 2, scope: !207)
!216 = distinct !DISubprogram(name: "keyboard.EnumDescriptor.command_line_arguments.Appearance", linkageName: "command_line_arguments.Appearance.EnumDescriptor", scope: null, file: !7, line: 84, type: !217, isLocal: false, isDefinition: true, scopeLine: 84, isOptimized: false, unit: !1, retainedNodes: !3)
!217 = !DISubroutineType(types: !218)
!218 = !{!190, !219, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIBasicType(name: "Appearance", size: 32, encoding: DW_ATE_signed)
!221 = !DILocalVariable(name: "r.1.pointer", arg: 1, scope: !216, file: !7, line: 84, type: !219)
!222 = !DILocation(line: 84, column: 1, scope: !216)
!223 = !DILocalVariable(name: "r.1", scope: !216, file: !7, line: 84, type: !220)
!224 = !DILocation(line: 84, column: 78, scope: !216)
!225 = !DILocalVariable(name: "$ret5", scope: !216, file: !7, line: 84, type: !194)
!226 = !DILocation(line: 84, column: 45, scope: !216)
!227 = !DILocation(line: 84, column: 54, scope: !216)
!228 = distinct !DISubprogram(name: "keyboard.String.command_line_arguments.Appearance", linkageName: "command_line_arguments.Appearance.String", scope: null, file: !7, line: 81, type: !229, isLocal: false, isDefinition: true, scopeLine: 81, isOptimized: false, unit: !1, retainedNodes: !3)
!229 = !DISubroutineType(types: !230)
!230 = !{!69, !219, !219}
!231 = !DILocalVariable(name: "pointer", arg: 1, scope: !228, file: !7, line: 81, type: !219)
!232 = !DILocation(line: 81, column: 1, scope: !228)
!233 = !DILocalVariable(name: "x", scope: !228, file: !7, line: 81, type: !220)
!234 = !DILocation(line: 82, column: 24, scope: !228)
!235 = !DILocation(line: 82, column: 15, scope: !228)
!236 = !DILocation(line: 82, column: 2, scope: !228)
!237 = distinct !DISubprogram(name: "keyboard.EnumDescriptor.command_line_arguments.ReturnType", linkageName: "command_line_arguments.ReturnType.EnumDescriptor", scope: null, file: !7, line: 135, type: !238, isLocal: false, isDefinition: true, scopeLine: 135, isOptimized: false, unit: !1, retainedNodes: !3)
!238 = !DISubroutineType(types: !239)
!239 = !{!190, !240, !240}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
