; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22android\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/golang/protobuf/proto\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/golang/protobuf/proto\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22gomatcha.io/matcha/proto\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22gomatcha.io/matcha/proto\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22text\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22gomatcha.io/matcha/proto/text\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./pagerview.pb.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha/proto/view/android")
!3 = !{}
!4 = !{!5, !109, !111, !127, !137, !139, !142, !144, !146, !148, !151, !153, !155}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments._.0", linkageName: "command_line_arguments._.0", scope: !1, file: !7, line: 30, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "pagerview.pb.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 25, size: 64, align: 8, elements: !10)
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 25, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !95}
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !16, size: 320, align: 8, elements: !17)
!16 = !DIFile(filename: "", directory: "")
!17 = !{!18, !27}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 25, baseType: !19, size: 192, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !16, size: 192, align: 8, elements: !20)
!20 = !{!21, !24, !26}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !16, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !16, line: 1, baseType: !25, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 25, baseType: !28, size: 128, align: 64, offset: 192)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !29, line: 1, size: 128, align: 8, elements: !30)
!29 = !DIFile(filename: "<built-in>", directory: "")
!30 = !{!31, !94}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !29, line: 1, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !16, size: 128, align: 8, elements: !34)
!34 = !{!35, !90}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 1, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !29, line: 1, size: 576, align: 8, elements: !38)
!38 = !{!39, !41, !42, !44, !45, !46, !47, !57, !66, !67, !73, !89}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !29, line: 1, baseType: !40, size: 64, align: 64)
!40 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !29, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !29, line: 1, baseType: !43, size: 32, align: 32, offset: 128)
!43 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 168)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 176)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !29, line: 1, baseType: !48, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !29, line: 1, size: 64, align: 8, elements: !50)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !29, line: 1, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!40, !55, !40}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIBasicType(name: "void")
!57 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !29, line: 1, baseType: !58, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !29, line: 1, size: 64, align: 8, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !29, line: 1, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !55, !55}
!65 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !29, line: 1, baseType: !22, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !29, line: 1, baseType: !68, size: 64, align: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !29, line: 1, size: 128, align: 8, elements: !70)
!70 = !{!71, !72}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !29, line: 1, baseType: !22, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !29, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !29, line: 1, baseType: !74, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !29, line: 1, size: 320, align: 8, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !29, line: 1, baseType: !68, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !29, line: 1, baseType: !68, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !29, line: 1, baseType: !80, size: 192, align: 64, offset: 128)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !16, size: 192, align: 8, elements: !81)
!81 = !{!82, !24, !26}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !29, line: 1, size: 320, align: 8, elements: !85)
!85 = !{!77, !78, !86, !87, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !16, line: 1, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!69, !55}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !7, line: 25, size: 128, align: 8, elements: !96)
!96 = !{!97, !108}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 25, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void,*func(*void)string}", file: !16, size: 256, align: 8, elements: !100)
!100 = !{!101, !102, !106, !107}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 25, baseType: !36, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMessage", file: !16, line: 25, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!56, !55}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", file: !16, line: 25, baseType: !103, size: 64, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !16, line: 25, baseType: !91, size: 64, align: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !29, line: 1, type: !43, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "command_line_arguments._.1", linkageName: "command_line_arguments._.1", scope: !1, file: !7, line: 31, type: !113, isLocal: false, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 26, size: 64, align: 8, elements: !115)
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 26, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!28, !69, !120}
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*void},int,int}", file: !16, size: 192, align: 8, elements: !121)
!121 = !{!122, !24, !26}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !16, size: 128, align: 8, elements: !125)
!125 = !{!35, !126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !16, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "command_line_arguments._.2", linkageName: "command_line_arguments._.2", scope: !1, file: !7, line: 32, type: !129, isLocal: false, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 27, size: 64, align: 8, elements: !131)
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 27, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !25}
!136 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor0", linkageName: "command_line_arguments.fileDescriptor0", scope: !1, file: !7, line: 106, type: !19, isLocal: true, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "command_line_arguments._.3", linkageName: "command_line_arguments._.3", scope: !1, file: !141, line: 13, type: !8, isLocal: false, isDefinition: true)
!141 = !DIFile(filename: "stackview.pb.go", directory: ".")
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "command_line_arguments._.4", linkageName: "command_line_arguments._.4", scope: !1, file: !141, line: 14, type: !113, isLocal: false, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "command_line_arguments._.5", linkageName: "command_line_arguments._.5", scope: !1, file: !141, line: 15, type: !129, isLocal: false, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor1", linkageName: "command_line_arguments.fileDescriptor1", scope: !1, file: !141, line: 197, type: !19, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "command_line_arguments._.6", linkageName: "command_line_arguments._.6", scope: !1, file: !150, line: 12, type: !8, isLocal: false, isDefinition: true)
!150 = !DIFile(filename: "statusbar.pb.go", directory: ".")
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "command_line_arguments._.7", linkageName: "command_line_arguments._.7", scope: !1, file: !150, line: 13, type: !113, isLocal: false, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "command_line_arguments._.8", linkageName: "command_line_arguments._.8", scope: !1, file: !150, line: 14, type: !129, isLocal: false, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor2", linkageName: "command_line_arguments.fileDescriptor2", scope: !1, file: !150, line: 48, type: !19, isLocal: true, isDefinition: true)
!157 = distinct !DISubprogram(name: "android.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 23, type: !158, isLocal: false, isDefinition: true, scopeLine: 23, isOptimized: false, unit: !1, retainedNodes: !3)
!158 = !DISubroutineType(types: !159)
!159 = !{!56}
!160 = !DILocation(line: 1, column: 1, scope: !161)
!161 = !DILexicalBlockFile(scope: !157, file: !29, discriminator: 0)
!162 = !DILocation(line: 30, column: 5, scope: !163)
!163 = !DILexicalBlockFile(scope: !157, file: !7, discriminator: 0)
!164 = !DILocation(line: 31, column: 5, scope: !163)
!165 = !DILocation(line: 32, column: 5, scope: !163)
!166 = !DILocation(line: 13, column: 5, scope: !167)
!167 = !DILexicalBlockFile(scope: !157, file: !141, discriminator: 0)
!168 = !DILocation(line: 14, column: 5, scope: !167)
!169 = !DILocation(line: 15, column: 5, scope: !167)
!170 = !DILocation(line: 12, column: 5, scope: !171)
!171 = !DILexicalBlockFile(scope: !157, file: !150, discriminator: 0)
!172 = !DILocation(line: 13, column: 5, scope: !171)
!173 = !DILocation(line: 14, column: 5, scope: !171)
!174 = !DILocation(line: 96, column: 1, scope: !163)
!175 = !DILocation(line: 102, column: 1, scope: !163)
!176 = !DILocation(line: 185, column: 1, scope: !167)
!177 = !DILocation(line: 193, column: 1, scope: !167)
!178 = !DILocation(line: 40, column: 1, scope: !171)
!179 = !DILocation(line: 44, column: 1, scope: !171)
!180 = distinct !DISubprogram(name: "android.command_line_arguments.PagerChildView..hash", linkageName: "command_line_arguments.command_line_arguments.PagerChildView..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!181 = !DILocalVariable(name: "key", arg: 1, scope: !180, file: !29, line: 1, type: !55)
!182 = !DILocation(line: 1, column: 1, scope: !180)
!183 = !DILocalVariable(name: "seed", arg: 2, scope: !180, file: !29, line: 1, type: !40)
!184 = !DILocalVariable(name: "$ret49", scope: !180, file: !29, line: 1, type: !40)
!185 = distinct !DISubprogram(name: "android.command_line_arguments.PagerChildView..eq", linkageName: "command_line_arguments.command_line_arguments.PagerChildView..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!186 = !DILocalVariable(name: "key1", arg: 1, scope: !185, file: !29, line: 1, type: !55)
!187 = !DILocation(line: 1, column: 1, scope: !185)
!188 = !DILocalVariable(name: "key2", arg: 2, scope: !185, file: !29, line: 1, type: !55)
!189 = !DILocalVariable(name: "$ret50", scope: !185, file: !29, line: 1, type: !65)
!190 = distinct !DISubprogram(name: "android.Descriptor..1command_line_arguments.PagerChildView", linkageName: "command_line_arguments.PagerChildView.Descriptor", scope: null, file: !7, line: 47, type: !191, isLocal: false, isDefinition: true, scopeLine: 47, isOptimized: false, unit: !1, retainedNodes: !3)
!191 = !DISubroutineType(types: !192)
!192 = !{!193, !201, !201}
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},struct{*int,int,int}}", file: !16, size: 384, align: 8, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 47, baseType: !19, size: 192, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 47, baseType: !197, size: 192, align: 64, offset: 192)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !16, size: 192, align: 8, elements: !198)
!198 = !{!199, !24, !26}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "PagerChildView", file: !7, line: 40, size: 128, align: 8, elements: !203)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Title", file: !7, line: 41, baseType: !69, size: 128, align: 64)
!205 = !DILocalVariable(name: "r.1", arg: 1, scope: !190, file: !7, line: 47, type: !201)
!206 = !DILocation(line: 47, column: 1, scope: !190)
!207 = !DILocation(line: 47, column: 79, scope: !190)
!208 = !DILocalVariable(name: "$ret2", scope: !190, file: !7, line: 47, type: !197)
!209 = !DILocation(line: 47, column: 46, scope: !190)
!210 = !DILocation(line: 47, column: 55, scope: !190)
!211 = distinct !DISubprogram(name: "android.GetTitle..1command_line_arguments.PagerChildView", linkageName: "command_line_arguments.PagerChildView.GetTitle", scope: null, file: !7, line: 49, type: !212, isLocal: false, isDefinition: true, scopeLine: 49, isOptimized: false, unit: !1, retainedNodes: !3)
!212 = !DISubroutineType(types: !213)
!213 = !{!69, !201, !201}
!214 = !DILocalVariable(name: "m", arg: 1, scope: !211, file: !7, line: 49, type: !201)
!215 = !DILocation(line: 49, column: 1, scope: !211)
!216 = !DILocation(line: 50, column: 7, scope: !211)
!217 = !DILocalVariable(name: "$ret3", scope: !211, file: !7, line: 49, type: !69)
!218 = !DILocation(line: 49, column: 37, scope: !211)
!219 = !DILocation(line: 53, column: 2, scope: !211)
!220 = !DILocation(line: 51, column: 3, scope: !211)
!221 = distinct !DISubprogram(name: "android.Reset..1command_line_arguments.PagerChildView", linkageName: "command_line_arguments.PagerChildView.Reset", scope: null, file: !7, line: 44, type: !222, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!222 = !DISubroutineType(types: !223)
!223 = !{!56, !201, !201}
!224 = !DILocalVariable(name: "m", arg: 1, scope: !221, file: !7, line: 44, type: !201)
!225 = !DILocation(line: 44, column: 1, scope: !221)
!226 = !DILocation(line: 44, column: 58, scope: !221)
!227 = distinct !DISubprogram(name: "android.String..1command_line_arguments.PagerChildView", linkageName: "command_line_arguments.PagerChildView.String", scope: null, file: !7, line: 45, type: !212, isLocal: false, isDefinition: true, scopeLine: 45, isOptimized: false, unit: !1, retainedNodes: !3)
!228 = !DILocalVariable(name: "m", arg: 1, scope: !227, file: !7, line: 45, type: !201)
!229 = !DILocation(line: 45, column: 1, scope: !227)
!230 = !DILocation(line: 45, column: 86, scope: !227)
!231 = !DILocation(line: 45, column: 68, scope: !227)
!232 = !DILocation(line: 45, column: 55, scope: !227)
!233 = distinct !DISubprogram(name: "android.Descriptor..1command_line_arguments.PagerView", linkageName: "command_line_arguments.PagerView.Descriptor", scope: null, file: !7, line: 64, type: !234, isLocal: false, isDefinition: true, scopeLine: 64, isOptimized: false, unit: !1, retainedNodes: !3)
!234 = !DISubroutineType(types: !235)
!235 = !{!193, !236, !236}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "PagerView", file: !7, line: 56, size: 256, align: 8, elements: !238)
!238 = !{!239, !244}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ChildViews", file: !7, line: 57, baseType: !240, size: 192, align: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**PagerChildView,int,int}", file: !16, size: 192, align: 8, elements: !241)
!241 = !{!242, !24, !26}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "SelectedIndex", file: !7, line: 58, baseType: !245, size: 64, align: 64, offset: 192)
!245 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!246 = !DILocalVariable(name: "r.3", arg: 1, scope: !233, file: !7, line: 64, type: !236)
!247 = !DILocation(line: 64, column: 1, scope: !233)
!248 = !DILocation(line: 64, column: 74, scope: !233)
!249 = !DILocalVariable(name: "$ret6", scope: !233, file: !7, line: 64, type: !197)
!250 = !DILocation(line: 64, column: 41, scope: !233)
!251 = !DILocation(line: 64, column: 50, scope: !233)
!252 = distinct !DISubprogram(name: "android.GetChildViews..1command_line_arguments.PagerView", linkageName: "command_line_arguments.PagerView.GetChildViews", scope: null, file: !7, line: 66, type: !253, isLocal: false, isDefinition: true, scopeLine: 66, isOptimized: false, unit: !1, retainedNodes: !3)
!253 = !DISubroutineType(types: !254)
!254 = !{!240, !236, !236}
!255 = !DILocalVariable(name: "m", arg: 1, scope: !252, file: !7, line: 66, type: !236)
!256 = !DILocation(line: 66, column: 1, scope: !252)
!257 = !DILocation(line: 67, column: 7, scope: !252)
!258 = !DILocation(line: 70, column: 2, scope: !252)
!259 = !DILocation(line: 68, column: 3, scope: !252)
!260 = distinct !DISubprogram(name: "android.GetSelectedIndex..1command_line_arguments.PagerView", linkageName: "command_line_arguments.PagerView.GetSelectedIndex", scope: null, file: !7, line: 73, type: !261, isLocal: false, isDefinition: true, scopeLine: 73, isOptimized: false, unit: !1, retainedNodes: !3)
!261 = !DISubroutineType(types: !262)
!262 = !{!245, !236, !236}
!263 = !DILocalVariable(name: "m", arg: 1, scope: !260, file: !7, line: 73, type: !236)
!264 = !DILocation(line: 73, column: 1, scope: !260)
!265 = !DILocalVariable(name: "$ret8", scope: !260, file: !7, line: 73, type: !245)
!266 = !DILocation(line: 73, column: 40, scope: !260)
!267 = !DILocation(line: 74, column: 7, scope: !260)
!268 = !DILocation(line: 77, column: 2, scope: !260)
!269 = !DILocation(line: 75, column: 11, scope: !260)
!270 = !DILocation(line: 75, column: 3, scope: !260)
!271 = distinct !DISubprogram(name: "android.Reset..1command_line_arguments.PagerView", linkageName: "command_line_arguments.PagerView.Reset", scope: null, file: !7, line: 61, type: !272, isLocal: false, isDefinition: true, scopeLine: 61, isOptimized: false, unit: !1, retainedNodes: !3)
!272 = !DISubroutineType(types: !273)
!273 = !{!56, !236, !236}
!274 = !DILocalVariable(name: "m", arg: 1, scope: !271, file: !7, line: 61, type: !236)
!275 = !DILocation(line: 61, column: 1, scope: !271)
!276 = !DILocation(line: 61, column: 53, scope: !271)
!277 = distinct !DISubprogram(name: "android.String..1command_line_arguments.PagerView", linkageName: "command_line_arguments.PagerView.String", scope: null, file: !7, line: 62, type: !278, isLocal: false, isDefinition: true, scopeLine: 62, isOptimized: false, unit: !1, retainedNodes: !3)
!278 = !DISubroutineType(types: !279)
!279 = !{!69, !236, !236}
!280 = !DILocalVariable(name: "m", arg: 1, scope: !277, file: !7, line: 62, type: !236)
!281 = !DILocation(line: 62, column: 1, scope: !277)
!282 = !DILocation(line: 62, column: 81, scope: !277)
!283 = !DILocation(line: 62, column: 63, scope: !277)
!284 = !DILocation(line: 62, column: 50, scope: !277)
!285 = distinct !DISubprogram(name: "android.Descriptor..1command_line_arguments.PagerEvent", linkageName: "command_line_arguments.PagerEvent.Descriptor", scope: null, file: !7, line: 87, type: !286, isLocal: false, isDefinition: true, scopeLine: 87, isOptimized: false, unit: !1, retainedNodes: !3)
!286 = !DISubroutineType(types: !287)
!287 = !{!193, !288, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "PagerEvent", file: !7, line: 80, size: 64, align: 8, elements: !290)
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "SelectedIndex", file: !7, line: 81, baseType: !245, size: 64, align: 64)
!292 = !DILocalVariable(name: "r.5", arg: 1, scope: !285, file: !7, line: 87, type: !288)
!293 = !DILocation(line: 87, column: 1, scope: !285)
!294 = !DILocation(line: 87, column: 75, scope: !285)
!295 = !DILocalVariable(name: "$ret11", scope: !285, file: !7, line: 87, type: !197)
!296 = !DILocation(line: 87, column: 42, scope: !285)
!297 = !DILocation(line: 87, column: 51, scope: !285)
!298 = distinct !DISubprogram(name: "android.GetSelectedIndex..1command_line_arguments.PagerEvent", linkageName: "command_line_arguments.PagerEvent.GetSelectedIndex", scope: null, file: !7, line: 89, type: !299, isLocal: false, isDefinition: true, scopeLine: 89, isOptimized: false, unit: !1, retainedNodes: !3)
!299 = !DISubroutineType(types: !300)
!300 = !{!245, !288, !288}
!301 = !DILocalVariable(name: "m", arg: 1, scope: !298, file: !7, line: 89, type: !288)
!302 = !DILocation(line: 89, column: 1, scope: !298)
!303 = !DILocalVariable(name: "$ret12", scope: !298, file: !7, line: 89, type: !245)
!304 = !DILocation(line: 89, column: 41, scope: !298)
!305 = !DILocation(line: 90, column: 7, scope: !298)
!306 = !DILocation(line: 93, column: 2, scope: !298)
!307 = !DILocation(line: 91, column: 11, scope: !298)
!308 = !DILocation(line: 91, column: 3, scope: !298)
!309 = distinct !DISubprogram(name: "android.Reset..1command_line_arguments.PagerEvent", linkageName: "command_line_arguments.PagerEvent.Reset", scope: null, file: !7, line: 84, type: !310, isLocal: false, isDefinition: true, scopeLine: 84, isOptimized: false, unit: !1, retainedNodes: !3)
!310 = !DISubroutineType(types: !311)
!311 = !{!56, !288, !288}
!312 = !DILocalVariable(name: "m", arg: 1, scope: !309, file: !7, line: 84, type: !288)
!313 = !DILocation(line: 84, column: 1, scope: !309)
!314 = !DILocation(line: 84, column: 51, scope: !309)
!315 = !DILocation(line: 84, column: 54, scope: !309)
!316 = distinct !DISubprogram(name: "android.String..1command_line_arguments.PagerEvent", linkageName: "command_line_arguments.PagerEvent.String", scope: null, file: !7, line: 85, type: !317, isLocal: false, isDefinition: true, scopeLine: 85, isOptimized: false, unit: !1, retainedNodes: !3)
!317 = !DISubroutineType(types: !318)
!318 = !{!69, !288, !288}
!319 = !DILocalVariable(name: "m", arg: 1, scope: !316, file: !7, line: 85, type: !288)
!320 = !DILocation(line: 85, column: 1, scope: !316)
!321 = !DILocation(line: 85, column: 82, scope: !316)
!322 = !DILocation(line: 85, column: 64, scope: !316)
!323 = !DILocation(line: 85, column: 51, scope: !316)
!324 = distinct !DISubprogram(name: "android.command_line_arguments..init0", linkageName: "command_line_arguments.command_line_arguments..init0", scope: null, file: !7, line: 96, type: !158, isLocal: false, isDefinition: true, scopeLine: 96, isOptimized: false, unit: !1, retainedNodes: !3)
!325 = !DILocation(line: 97, column: 8, scope: !324)
!326 = !DILocation(line: 98, column: 8, scope: !324)
!327 = !DILocation(line: 99, column: 8, scope: !324)
!328 = distinct !DISubprogram(name: "android.command_line_arguments..init1", linkageName: "command_line_arguments.command_line_arguments..init1", scope: null, file: !7, line: 102, type: !158, isLocal: false, isDefinition: true, scopeLine: 102, isOptimized: false, unit: !1, retainedNodes: !3)
!329 = !DILocation(line: 103, column: 8, scope: !328)
!330 = distinct !DISubprogram(name: "android.Descriptor..1command_line_arguments.StackChildView", linkageName: "command_line_arguments.StackChildView.Descriptor", scope: null, file: !141, line: 24, type: !331, isLocal: false, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !1, retainedNodes: !3)
!331 = !DISubroutineType(types: !332)
!332 = !{!193, !333, !333}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "StackChildView", file: !141, line: 17, size: 64, align: 8, elements: !335)
!335 = !{!336}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ScreenId", file: !141, line: 18, baseType: !245, size: 64, align: 64)
!337 = !DILocalVariable(name: "r.7", arg: 1, scope: !330, file: !141, line: 24, type: !333)
!338 = !DILocation(line: 24, column: 1, scope: !330)
!339 = !DILocation(line: 24, column: 79, scope: !330)
!340 = !DILocalVariable(name: "$ret15", scope: !330, file: !141, line: 24, type: !197)
!341 = !DILocation(line: 24, column: 46, scope: !330)
!342 = !DILocation(line: 24, column: 55, scope: !330)
!343 = distinct !DISubprogram(name: "android.GetScreenId..1command_line_arguments.StackChildView", linkageName: "command_line_arguments.StackChildView.GetScreenId", scope: null, file: !141, line: 26, type: !344, isLocal: false, isDefinition: true, scopeLine: 26, isOptimized: false, unit: !1, retainedNodes: !3)
!344 = !DISubroutineType(types: !345)
!345 = !{!245, !333, !333}
!346 = !DILocalVariable(name: "m", arg: 1, scope: !343, file: !141, line: 26, type: !333)
!347 = !DILocation(line: 26, column: 1, scope: !343)
!348 = !DILocalVariable(name: "$ret16", scope: !343, file: !141, line: 26, type: !245)
!349 = !DILocation(line: 26, column: 40, scope: !343)
!350 = !DILocation(line: 27, column: 7, scope: !343)
!351 = !DILocation(line: 30, column: 2, scope: !343)
!352 = !DILocation(line: 28, column: 11, scope: !343)
!353 = !DILocation(line: 28, column: 3, scope: !343)
!354 = distinct !DISubprogram(name: "android.Reset..1command_line_arguments.StackChildView", linkageName: "command_line_arguments.StackChildView.Reset", scope: null, file: !141, line: 21, type: !355, isLocal: false, isDefinition: true, scopeLine: 21, isOptimized: false, unit: !1, retainedNodes: !3)
!355 = !DISubroutineType(types: !356)
!356 = !{!56, !333, !333}
!357 = !DILocalVariable(name: "m", arg: 1, scope: !354, file: !141, line: 21, type: !333)
!358 = !DILocation(line: 21, column: 1, scope: !354)
!359 = !DILocation(line: 21, column: 55, scope: !354)
!360 = !DILocation(line: 21, column: 58, scope: !354)
!361 = distinct !DISubprogram(name: "android.String..1command_line_arguments.StackChildView", linkageName: "command_line_arguments.StackChildView.String", scope: null, file: !141, line: 22, type: !362, isLocal: false, isDefinition: true, scopeLine: 22, isOptimized: false, unit: !1, retainedNodes: !3)
!362 = !DISubroutineType(types: !363)
!363 = !{!69, !333, !333}
!364 = !DILocalVariable(name: "m", arg: 1, scope: !361, file: !141, line: 22, type: !333)
!365 = !DILocation(line: 22, column: 1, scope: !361)
!366 = !DILocation(line: 22, column: 86, scope: !361)
!367 = !DILocation(line: 22, column: 68, scope: !361)
!368 = !DILocation(line: 22, column: 55, scope: !361)
!369 = distinct !DISubprogram(name: "android.Descriptor..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.Descriptor", scope: null, file: !141, line: 40, type: !370, isLocal: false, isDefinition: true, scopeLine: 40, isOptimized: false, unit: !1, retainedNodes: !3)
!370 = !DISubroutineType(types: !371)
!371 = !{!193, !372, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "StackView", file: !141, line: 33, size: 192, align: 8, elements: !374)
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Children", file: !141, line: 34, baseType: !376, size: 192, align: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**StackChildView,int,int}", file: !16, size: 192, align: 8, elements: !377)
!377 = !{!378, !24, !26}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!380 = !DILocalVariable(name: "r.9", arg: 1, scope: !369, file: !141, line: 40, type: !372)
!381 = !DILocation(line: 40, column: 1, scope: !369)
!382 = !DILocation(line: 40, column: 74, scope: !369)
!383 = !DILocalVariable(name: "$ret19", scope: !369, file: !141, line: 40, type: !197)
!384 = !DILocation(line: 40, column: 41, scope: !369)
!385 = !DILocation(line: 40, column: 50, scope: !369)
!386 = distinct !DISubprogram(name: "android.GetChildren..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.GetChildren", scope: null, file: !141, line: 42, type: !387, isLocal: false, isDefinition: true, scopeLine: 42, isOptimized: false, unit: !1, retainedNodes: !3)
!387 = !DISubroutineType(types: !388)
!388 = !{!376, !372, !372}
!389 = !DILocalVariable(name: "m", arg: 1, scope: !386, file: !141, line: 42, type: !372)
!390 = !DILocation(line: 42, column: 1, scope: !386)
!391 = !DILocation(line: 43, column: 7, scope: !386)
!392 = !DILocation(line: 46, column: 2, scope: !386)
!393 = !DILocation(line: 44, column: 3, scope: !386)
!394 = distinct !DISubprogram(name: "android.Reset..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.Reset", scope: null, file: !141, line: 37, type: !395, isLocal: false, isDefinition: true, scopeLine: 37, isOptimized: false, unit: !1, retainedNodes: !3)
!395 = !DISubroutineType(types: !396)
!396 = !{!56, !372, !372}
!397 = !DILocalVariable(name: "m", arg: 1, scope: !394, file: !141, line: 37, type: !372)
!398 = !DILocation(line: 37, column: 1, scope: !394)
!399 = !DILocation(line: 37, column: 53, scope: !394)
!400 = distinct !DISubprogram(name: "android.String..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.String", scope: null, file: !141, line: 38, type: !401, isLocal: false, isDefinition: true, scopeLine: 38, isOptimized: false, unit: !1, retainedNodes: !3)
!401 = !DISubroutineType(types: !402)
!402 = !{!69, !372, !372}
!403 = !DILocalVariable(name: "m", arg: 1, scope: !400, file: !141, line: 38, type: !372)
!404 = !DILocation(line: 38, column: 1, scope: !400)
!405 = !DILocation(line: 38, column: 81, scope: !400)
!406 = !DILocation(line: 38, column: 63, scope: !400)
!407 = !DILocation(line: 38, column: 50, scope: !400)
!408 = distinct !DISubprogram(name: "android.Descriptor..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.Descriptor", scope: null, file: !141, line: 62, type: !409, isLocal: false, isDefinition: true, scopeLine: 62, isOptimized: false, unit: !1, retainedNodes: !3)
!409 = !DISubroutineType(types: !410)
!410 = !{!193, !411, !411}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "StackBar", file: !141, line: 49, size: 704, align: 8, elements: !413)
!413 = !{!414, !415, !464, !465, !466, !474, !500}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Title", file: !141, line: 50, baseType: !69, size: 128, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "StyledTitle", file: !141, line: 51, baseType: !416, size: 64, align: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "StyledText", file: !141, line: 10, size: 256, align: 8, elements: !418)
!418 = !{!419, !459}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Styles", file: !141, line: 10, baseType: !420, size: 192, align: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**TextStyle,int,int}", file: !16, size: 192, align: 8, elements: !421)
!421 = !{!422, !24, !26}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "TextStyle", file: !141, line: 10, size: 1280, align: 8, elements: !426)
!426 = !{!427, !428, !430, !432, !433, !434, !435, !436, !437, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !454, !456, !457, !458}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !141, line: 10, baseType: !245, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "TextAlignment", file: !141, line: 10, baseType: !429, size: 32, align: 32, offset: 64)
!429 = !DIBasicType(name: "TextAlignment", size: 32, encoding: DW_ATE_signed)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughStyle", file: !141, line: 10, baseType: !431, size: 32, align: 32, offset: 96)
!431 = !DIBasicType(name: "StrikethroughStyle", size: 32, encoding: DW_ATE_signed)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "HasStrikethroughColor", file: !141, line: 10, baseType: !65, size: 8, align: 8, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorRed", file: !141, line: 10, baseType: !43, size: 32, align: 32, offset: 160)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorGreen", file: !141, line: 10, baseType: !43, size: 32, align: 32, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorBlue", file: !141, line: 10, baseType: !43, size: 32, align: 32, offset: 224)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorAlpha", file: !141, line: 10, baseType: !43, size: 32, align: 32, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineStyle", file: !141, line: 10, baseType: !438, size: 32, align: 32, offset: 288)
!438 = !DIBasicType(name: "UnderlineStyle", size: 32, encoding: DW_ATE_signed)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "HasUnderlineColor", file: !141, line: 10, baseType: !65, size: 8, align: 8, offset: 320)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorRed", file: !141, line: 10, baseType: !43, size: 32, align: 32, offset: 352)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorGreen", file: !141, line: 10, baseType: !43, size: 32, align: 32, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorBlue", file: !141, line: 10, baseType: !43, size: 32, align: 32, offset: 416)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorAlpha", file: !141, line: 10, baseType: !43, size: 32, align: 32, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Hyphenation", file: !141, line: 10, baseType: !136, size: 64, align: 64, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "LineHeightMultiple", file: !141, line: 10, baseType: !136, size: 64, align: 64, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "MaxLines", file: !141, line: 10, baseType: !245, size: 64, align: 64, offset: 640)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "HasTextColor", file: !141, line: 10, baseType: !65, size: 8, align: 8, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorRed", file: !141, line: 10, baseType: !43, size: 32, align: 32, offset: 736)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorGreen", file: !141, line: 10, baseType: !43, size: 32, align: 32, offset: 768)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorBlue", file: !141, line: 10, baseType: !43, size: 32, align: 32, offset: 800)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorAlpha", file: !141, line: 10, baseType: !43, size: 32, align: 32, offset: 832)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Wrap", file: !141, line: 10, baseType: !453, size: 32, align: 32, offset: 864)
!453 = !DIBasicType(name: "TextWrap", size: 32, encoding: DW_ATE_signed)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Truncation", file: !141, line: 10, baseType: !455, size: 32, align: 32, offset: 896)
!455 = !DIBasicType(name: "Truncation", size: 32, encoding: DW_ATE_signed)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "TruncationString", file: !141, line: 10, baseType: !69, size: 128, align: 64, offset: 960)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "FontName", file: !141, line: 10, baseType: !69, size: 128, align: 64, offset: 1088)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "FontSize", file: !141, line: 10, baseType: !136, size: 64, align: 64, offset: 1216)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Text", file: !141, line: 10, baseType: !460, size: 64, align: 64, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "Text", file: !141, line: 10, size: 128, align: 8, elements: !462)
!462 = !{!463}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "Text", file: !141, line: 10, baseType: !69, size: 128, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "Subtitle", file: !141, line: 52, baseType: !69, size: 128, align: 64, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "StyledSubtitle", file: !141, line: 53, baseType: !416, size: 64, align: 64, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Color", file: !141, line: 54, baseType: !467, size: 64, align: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", file: !141, line: 9, size: 128, align: 8, elements: !469)
!469 = !{!470, !471, !472, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Red", file: !141, line: 9, baseType: !43, size: 32, align: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", file: !141, line: 9, baseType: !43, size: 32, align: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "Green", file: !141, line: 9, baseType: !43, size: 32, align: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Alpha", file: !141, line: 9, baseType: !43, size: 32, align: 32, offset: 96)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "Items", file: !141, line: 55, baseType: !475, size: 192, align: 64, offset: 448)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**StackBarItem,int,int}", file: !16, size: 192, align: 8, elements: !476)
!476 = !{!477, !24, !26}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "StackBarItem", file: !141, line: 113, size: 512, align: 8, elements: !481)
!481 = !{!482, !483, !484, !497, !498, !499}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "Title", file: !141, line: 114, baseType: !69, size: 128, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "StyledTitle", file: !141, line: 115, baseType: !416, size: 64, align: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Icon", file: !141, line: 116, baseType: !485, size: 64, align: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImageOrResource", file: !141, line: 9, size: 192, align: 8, elements: !487)
!487 = !{!488, !496}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "Image", file: !141, line: 9, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !141, line: 9, size: 384, align: 8, elements: !491)
!491 = !{!492, !493, !494, !495}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Width", file: !141, line: 9, baseType: !245, size: 64, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "Height", file: !141, line: 9, baseType: !245, size: 64, align: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Stride", file: !141, line: 9, baseType: !245, size: 64, align: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "Data", file: !141, line: 9, baseType: !19, size: 192, align: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !141, line: 9, baseType: !69, size: 128, align: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "IconTint", file: !141, line: 117, baseType: !467, size: 64, align: 64, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Disabled", file: !141, line: 118, baseType: !65, size: 8, align: 8, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "OnPressFunc", file: !141, line: 119, baseType: !69, size: 128, align: 64, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "BackButtonHidden", file: !141, line: 56, baseType: !65, size: 8, align: 8, offset: 640)
!501 = !DILocalVariable(name: "r.11", arg: 1, scope: !408, file: !141, line: 62, type: !411)
!502 = !DILocation(line: 62, column: 1, scope: !408)
!503 = !DILocation(line: 62, column: 73, scope: !408)
!504 = !DILocalVariable(name: "$ret23", scope: !408, file: !141, line: 62, type: !197)
!505 = !DILocation(line: 62, column: 40, scope: !408)
!506 = !DILocation(line: 62, column: 49, scope: !408)
!507 = distinct !DISubprogram(name: "android.GetBackButtonHidden..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.GetBackButtonHidden", scope: null, file: !141, line: 106, type: !508, isLocal: false, isDefinition: true, scopeLine: 106, isOptimized: false, unit: !1, retainedNodes: !3)
!508 = !DISubroutineType(types: !509)
!509 = !{!65, !411, !411}
!510 = !DILocalVariable(name: "m", arg: 1, scope: !507, file: !141, line: 106, type: !411)
!511 = !DILocation(line: 106, column: 1, scope: !507)
!512 = !DILocalVariable(name: "$ret30", scope: !507, file: !141, line: 106, type: !65)
!513 = !DILocation(line: 106, column: 42, scope: !507)
!514 = !DILocation(line: 107, column: 7, scope: !507)
!515 = !DILocation(line: 110, column: 2, scope: !507)
!516 = !DILocation(line: 108, column: 11, scope: !507)
!517 = !DILocation(line: 108, column: 3, scope: !507)
!518 = distinct !DISubprogram(name: "android.GetColor..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.GetColor", scope: null, file: !141, line: 92, type: !519, isLocal: false, isDefinition: true, scopeLine: 92, isOptimized: false, unit: !1, retainedNodes: !3)
!519 = !DISubroutineType(types: !520)
!520 = !{!467, !411, !411}
!521 = !DILocalVariable(name: "m", arg: 1, scope: !518, file: !141, line: 92, type: !411)
!522 = !DILocation(line: 92, column: 1, scope: !518)
!523 = !DILocalVariable(name: "$ret28", scope: !518, file: !141, line: 92, type: !467)
!524 = !DILocation(line: 92, column: 31, scope: !518)
!525 = !DILocation(line: 93, column: 7, scope: !518)
!526 = !DILocation(line: 96, column: 2, scope: !518)
!527 = !DILocation(line: 94, column: 11, scope: !518)
!528 = !DILocation(line: 94, column: 3, scope: !518)
!529 = distinct !DISubprogram(name: "android.Descriptor..1command_line_arguments.StackBarItem", linkageName: "command_line_arguments.StackBarItem.Descriptor", scope: null, file: !141, line: 125, type: !530, isLocal: false, isDefinition: true, scopeLine: 125, isOptimized: false, unit: !1, retainedNodes: !3)
!530 = !DISubroutineType(types: !531)
!531 = !{!193, !479, !479}
!532 = !DILocalVariable(name: "r.13", arg: 1, scope: !529, file: !141, line: 125, type: !479)
!533 = !DILocation(line: 125, column: 1, scope: !529)
!534 = !DILocation(line: 125, column: 77, scope: !529)
!535 = !DILocalVariable(name: "$ret33", scope: !529, file: !141, line: 125, type: !197)
!536 = !DILocation(line: 125, column: 44, scope: !529)
!537 = !DILocation(line: 125, column: 53, scope: !529)
!538 = distinct !DISubprogram(name: "android.GetDisabled..1command_line_arguments.StackBarItem", linkageName: "command_line_arguments.StackBarItem.GetDisabled", scope: null, file: !141, line: 155, type: !539, isLocal: false, isDefinition: true, scopeLine: 155, isOptimized: false, unit: !1, retainedNodes: !3)
!539 = !DISubroutineType(types: !540)
!540 = !{!65, !479, !479}
!541 = !DILocalVariable(name: "m", arg: 1, scope: !538, file: !141, line: 155, type: !479)
!542 = !DILocation(line: 155, column: 1, scope: !538)
!543 = !DILocalVariable(name: "$ret38", scope: !538, file: !141, line: 155, type: !65)
!544 = !DILocation(line: 155, column: 38, scope: !538)
!545 = !DILocation(line: 156, column: 7, scope: !538)
!546 = !DILocation(line: 159, column: 2, scope: !538)
!547 = !DILocation(line: 157, column: 11, scope: !538)
!548 = !DILocation(line: 157, column: 3, scope: !538)
!549 = distinct !DISubprogram(name: "android.GetIcon..1command_line_arguments.StackBarItem", linkageName: "command_line_arguments.StackBarItem.GetIcon", scope: null, file: !141, line: 141, type: !550, isLocal: false, isDefinition: true, scopeLine: 141, isOptimized: false, unit: !1, retainedNodes: !3)
!550 = !DISubroutineType(types: !551)
!551 = !{!485, !479, !479}
!552 = !DILocalVariable(name: "m", arg: 1, scope: !549, file: !141, line: 141, type: !479)
!553 = !DILocation(line: 141, column: 1, scope: !549)
!554 = !DILocalVariable(name: "$ret36", scope: !549, file: !141, line: 141, type: !485)
!555 = !DILocation(line: 141, column: 34, scope: !549)
!556 = !DILocation(line: 142, column: 7, scope: !549)
!557 = !DILocation(line: 145, column: 2, scope: !549)
!558 = !DILocation(line: 143, column: 11, scope: !549)
!559 = !DILocation(line: 143, column: 3, scope: !549)
!560 = distinct !DISubprogram(name: "android.GetIconTint..1command_line_arguments.StackBarItem", linkageName: "command_line_arguments.StackBarItem.GetIconTint", scope: null, file: !141, line: 148, type: !561, isLocal: false, isDefinition: true, scopeLine: 148, isOptimized: false, unit: !1, retainedNodes: !3)
!561 = !DISubroutineType(types: !562)
!562 = !{!467, !479, !479}
!563 = !DILocalVariable(name: "m", arg: 1, scope: !560, file: !141, line: 148, type: !479)
!564 = !DILocation(line: 148, column: 1, scope: !560)
!565 = !DILocalVariable(name: "$ret37", scope: !560, file: !141, line: 148, type: !467)
!566 = !DILocation(line: 148, column: 38, scope: !560)
!567 = !DILocation(line: 149, column: 7, scope: !560)
!568 = !DILocation(line: 152, column: 2, scope: !560)
!569 = !DILocation(line: 150, column: 11, scope: !560)
!570 = !DILocation(line: 150, column: 3, scope: !560)
!571 = distinct !DISubprogram(name: "android.GetOnPressFunc..1command_line_arguments.StackBarItem", linkageName: "command_line_arguments.StackBarItem.GetOnPressFunc", scope: null, file: !141, line: 162, type: !572, isLocal: false, isDefinition: true, scopeLine: 162, isOptimized: false, unit: !1, retainedNodes: !3)
!572 = !DISubroutineType(types: !573)
!573 = !{!69, !479, !479}
!574 = !DILocalVariable(name: "m", arg: 1, scope: !571, file: !141, line: 162, type: !479)
!575 = !DILocation(line: 162, column: 1, scope: !571)
!576 = !DILocation(line: 163, column: 7, scope: !571)
!577 = !DILocalVariable(name: "$ret39", scope: !571, file: !141, line: 162, type: !69)
!578 = !DILocation(line: 162, column: 41, scope: !571)
!579 = !DILocation(line: 166, column: 2, scope: !571)
!580 = !DILocation(line: 164, column: 3, scope: !571)
!581 = distinct !DISubprogram(name: "android.GetStyledTitle..1command_line_arguments.StackBarItem", linkageName: "command_line_arguments.StackBarItem.GetStyledTitle", scope: null, file: !141, line: 134, type: !582, isLocal: false, isDefinition: true, scopeLine: 134, isOptimized: false, unit: !1, retainedNodes: !3)
!582 = !DISubroutineType(types: !583)
!583 = !{!416, !479, !479}
!584 = !DILocalVariable(name: "m", arg: 1, scope: !581, file: !141, line: 134, type: !479)
!585 = !DILocation(line: 134, column: 1, scope: !581)
!586 = !DILocalVariable(name: "$ret35", scope: !581, file: !141, line: 134, type: !416)
!587 = !DILocation(line: 134, column: 41, scope: !581)
!588 = !DILocation(line: 135, column: 7, scope: !581)
!589 = !DILocation(line: 138, column: 2, scope: !581)
!590 = !DILocation(line: 136, column: 11, scope: !581)
!591 = !DILocation(line: 136, column: 3, scope: !581)
!592 = distinct !DISubprogram(name: "android.GetTitle..1command_line_arguments.StackBarItem", linkageName: "command_line_arguments.StackBarItem.GetTitle", scope: null, file: !141, line: 127, type: !572, isLocal: false, isDefinition: true, scopeLine: 127, isOptimized: false, unit: !1, retainedNodes: !3)
!593 = !DILocalVariable(name: "m", arg: 1, scope: !592, file: !141, line: 127, type: !479)
!594 = !DILocation(line: 127, column: 1, scope: !592)
!595 = !DILocation(line: 128, column: 7, scope: !592)
!596 = !DILocalVariable(name: "$ret34", scope: !592, file: !141, line: 127, type: !69)
!597 = !DILocation(line: 127, column: 35, scope: !592)
!598 = !DILocation(line: 131, column: 2, scope: !592)
!599 = !DILocation(line: 129, column: 3, scope: !592)
!600 = distinct !DISubprogram(name: "android.Reset..1command_line_arguments.StackBarItem", linkageName: "command_line_arguments.StackBarItem.Reset", scope: null, file: !141, line: 122, type: !601, isLocal: false, isDefinition: true, scopeLine: 122, isOptimized: false, unit: !1, retainedNodes: !3)
!601 = !DISubroutineType(types: !602)
!602 = !{!56, !479, !479}
!603 = !DILocalVariable(name: "m", arg: 1, scope: !600, file: !141, line: 122, type: !479)
!604 = !DILocation(line: 122, column: 1, scope: !600)
!605 = !DILocation(line: 122, column: 56, scope: !600)
!606 = distinct !DISubprogram(name: "android.String..1command_line_arguments.StackBarItem", linkageName: "command_line_arguments.StackBarItem.String", scope: null, file: !141, line: 123, type: !572, isLocal: false, isDefinition: true, scopeLine: 123, isOptimized: false, unit: !1, retainedNodes: !3)
!607 = !DILocalVariable(name: "m", arg: 1, scope: !606, file: !141, line: 123, type: !479)
!608 = !DILocation(line: 123, column: 1, scope: !606)
!609 = !DILocation(line: 123, column: 84, scope: !606)
!610 = !DILocation(line: 123, column: 66, scope: !606)
!611 = !DILocation(line: 123, column: 53, scope: !606)
!612 = distinct !DISubprogram(name: "android.command_line_arguments.StackBarItem..hash", linkageName: "command_line_arguments.command_line_arguments.StackBarItem..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!613 = !DILocalVariable(name: "key", arg: 1, scope: !612, file: !29, line: 1, type: !55)
!614 = !DILocation(line: 1, column: 1, scope: !612)
!615 = !DILocalVariable(name: "seed", arg: 2, scope: !612, file: !29, line: 1, type: !40)
!616 = !DILocalVariable(name: "$ret51", scope: !612, file: !29, line: 1, type: !40)
!617 = distinct !DISubprogram(name: "android.command_line_arguments.StackBarItem..eq", linkageName: "command_line_arguments.command_line_arguments.StackBarItem..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!618 = !DILocalVariable(name: "key1", arg: 1, scope: !617, file: !29, line: 1, type: !55)
!619 = !DILocation(line: 1, column: 1, scope: !617)
!620 = !DILocalVariable(name: "key2", arg: 2, scope: !617, file: !29, line: 1, type: !55)
!621 = !DILocalVariable(name: "$ret52", scope: !617, file: !29, line: 1, type: !65)
!622 = distinct !DISubprogram(name: "android.GetItems..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.GetItems", scope: null, file: !141, line: 99, type: !623, isLocal: false, isDefinition: true, scopeLine: 99, isOptimized: false, unit: !1, retainedNodes: !3)
!623 = !DISubroutineType(types: !624)
!624 = !{!475, !411, !411}
!625 = !DILocalVariable(name: "m", arg: 1, scope: !622, file: !141, line: 99, type: !411)
!626 = !DILocation(line: 99, column: 1, scope: !622)
!627 = !DILocation(line: 100, column: 7, scope: !622)
!628 = !DILocation(line: 103, column: 2, scope: !622)
!629 = !DILocation(line: 101, column: 11, scope: !622)
!630 = !DILocation(line: 101, column: 3, scope: !622)
!631 = distinct !DISubprogram(name: "android.GetStyledSubtitle..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.GetStyledSubtitle", scope: null, file: !141, line: 85, type: !632, isLocal: false, isDefinition: true, scopeLine: 85, isOptimized: false, unit: !1, retainedNodes: !3)
!632 = !DISubroutineType(types: !633)
!633 = !{!416, !411, !411}
!634 = !DILocalVariable(name: "m", arg: 1, scope: !631, file: !141, line: 85, type: !411)
!635 = !DILocation(line: 85, column: 1, scope: !631)
!636 = !DILocalVariable(name: "$ret27", scope: !631, file: !141, line: 85, type: !416)
!637 = !DILocation(line: 85, column: 40, scope: !631)
!638 = !DILocation(line: 86, column: 7, scope: !631)
!639 = !DILocation(line: 89, column: 2, scope: !631)
!640 = !DILocation(line: 87, column: 11, scope: !631)
!641 = !DILocation(line: 87, column: 3, scope: !631)
!642 = distinct !DISubprogram(name: "android.GetStyledTitle..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.GetStyledTitle", scope: null, file: !141, line: 71, type: !632, isLocal: false, isDefinition: true, scopeLine: 71, isOptimized: false, unit: !1, retainedNodes: !3)
!643 = !DILocalVariable(name: "m", arg: 1, scope: !642, file: !141, line: 71, type: !411)
!644 = !DILocation(line: 71, column: 1, scope: !642)
!645 = !DILocalVariable(name: "$ret25", scope: !642, file: !141, line: 71, type: !416)
!646 = !DILocation(line: 71, column: 37, scope: !642)
!647 = !DILocation(line: 72, column: 7, scope: !642)
!648 = !DILocation(line: 75, column: 2, scope: !642)
!649 = !DILocation(line: 73, column: 11, scope: !642)
!650 = !DILocation(line: 73, column: 3, scope: !642)
!651 = distinct !DISubprogram(name: "android.GetSubtitle..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.GetSubtitle", scope: null, file: !141, line: 78, type: !652, isLocal: false, isDefinition: true, scopeLine: 78, isOptimized: false, unit: !1, retainedNodes: !3)
!652 = !DISubroutineType(types: !653)
!653 = !{!69, !411, !411}
!654 = !DILocalVariable(name: "m", arg: 1, scope: !651, file: !141, line: 78, type: !411)
!655 = !DILocation(line: 78, column: 1, scope: !651)
!656 = !DILocation(line: 79, column: 7, scope: !651)
!657 = !DILocalVariable(name: "$ret26", scope: !651, file: !141, line: 78, type: !69)
!658 = !DILocation(line: 78, column: 34, scope: !651)
!659 = !DILocation(line: 82, column: 2, scope: !651)
!660 = !DILocation(line: 80, column: 3, scope: !651)
!661 = distinct !DISubprogram(name: "android.GetTitle..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.GetTitle", scope: null, file: !141, line: 64, type: !652, isLocal: false, isDefinition: true, scopeLine: 64, isOptimized: false, unit: !1, retainedNodes: !3)
!662 = !DILocalVariable(name: "m", arg: 1, scope: !661, file: !141, line: 64, type: !411)
!663 = !DILocation(line: 64, column: 1, scope: !661)
!664 = !DILocation(line: 65, column: 7, scope: !661)
!665 = !DILocalVariable(name: "$ret24", scope: !661, file: !141, line: 64, type: !69)
!666 = !DILocation(line: 64, column: 31, scope: !661)
!667 = !DILocation(line: 68, column: 2, scope: !661)
!668 = !DILocation(line: 66, column: 3, scope: !661)
!669 = distinct !DISubprogram(name: "android.Reset..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.Reset", scope: null, file: !141, line: 59, type: !670, isLocal: false, isDefinition: true, scopeLine: 59, isOptimized: false, unit: !1, retainedNodes: !3)
!670 = !DISubroutineType(types: !671)
!671 = !{!56, !411, !411}
!672 = !DILocalVariable(name: "m", arg: 1, scope: !669, file: !141, line: 59, type: !411)
!673 = !DILocation(line: 59, column: 1, scope: !669)
!674 = !DILocation(line: 59, column: 52, scope: !669)
!675 = distinct !DISubprogram(name: "android.String..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.String", scope: null, file: !141, line: 60, type: !652, isLocal: false, isDefinition: true, scopeLine: 60, isOptimized: false, unit: !1, retainedNodes: !3)
!676 = !DILocalVariable(name: "m", arg: 1, scope: !675, file: !141, line: 60, type: !411)
!677 = !DILocation(line: 60, column: 1, scope: !675)
!678 = !DILocation(line: 60, column: 80, scope: !675)
!679 = !DILocation(line: 60, column: 62, scope: !675)
!680 = !DILocation(line: 60, column: 49, scope: !675)
!681 = distinct !DISubprogram(name: "android.Descriptor..1command_line_arguments.StackEvent", linkageName: "command_line_arguments.StackEvent.Descriptor", scope: null, file: !141, line: 176, type: !682, isLocal: false, isDefinition: true, scopeLine: 176, isOptimized: false, unit: !1, retainedNodes: !3)
!682 = !DISubroutineType(types: !683)
!683 = !{!193, !684, !684}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "StackEvent", file: !141, line: 169, size: 192, align: 8, elements: !686)
!686 = !{!687}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !141, line: 170, baseType: !688, size: 192, align: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int64,int,int}", file: !16, size: 192, align: 8, elements: !689)
!689 = !{!690, !24, !26}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !691, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!692 = !DILocalVariable(name: "r.15", arg: 1, scope: !681, file: !141, line: 176, type: !684)
!693 = !DILocation(line: 176, column: 1, scope: !681)
!694 = !DILocation(line: 176, column: 75, scope: !681)
!695 = !DILocalVariable(name: "$ret42", scope: !681, file: !141, line: 176, type: !197)
!696 = !DILocation(line: 176, column: 42, scope: !681)
!697 = !DILocation(line: 176, column: 51, scope: !681)
!698 = distinct !DISubprogram(name: "android.GetId..1command_line_arguments.StackEvent", linkageName: "command_line_arguments.StackEvent.GetId", scope: null, file: !141, line: 178, type: !699, isLocal: false, isDefinition: true, scopeLine: 178, isOptimized: false, unit: !1, retainedNodes: !3)
!699 = !DISubroutineType(types: !700)
!700 = !{!688, !684, !684}
!701 = !DILocalVariable(name: "m", arg: 1, scope: !698, file: !141, line: 178, type: !684)
!702 = !DILocation(line: 178, column: 1, scope: !698)
!703 = !DILocation(line: 179, column: 7, scope: !698)
!704 = !DILocation(line: 182, column: 2, scope: !698)
!705 = !DILocation(line: 180, column: 3, scope: !698)
!706 = distinct !DISubprogram(name: "android.Reset..1command_line_arguments.StackEvent", linkageName: "command_line_arguments.StackEvent.Reset", scope: null, file: !141, line: 173, type: !707, isLocal: false, isDefinition: true, scopeLine: 173, isOptimized: false, unit: !1, retainedNodes: !3)
!707 = !DISubroutineType(types: !708)
!708 = !{!56, !684, !684}
!709 = !DILocalVariable(name: "m", arg: 1, scope: !706, file: !141, line: 173, type: !684)
!710 = !DILocation(line: 173, column: 1, scope: !706)
!711 = !DILocation(line: 173, column: 54, scope: !706)
!712 = distinct !DISubprogram(name: "android.String..1command_line_arguments.StackEvent", linkageName: "command_line_arguments.StackEvent.String", scope: null, file: !141, line: 174, type: !713, isLocal: false, isDefinition: true, scopeLine: 174, isOptimized: false, unit: !1, retainedNodes: !3)
!713 = !DISubroutineType(types: !714)
!714 = !{!69, !684, !684}
!715 = !DILocalVariable(name: "m", arg: 1, scope: !712, file: !141, line: 174, type: !684)
!716 = !DILocation(line: 174, column: 1, scope: !712)
!717 = !DILocation(line: 174, column: 82, scope: !712)
!718 = !DILocation(line: 174, column: 64, scope: !712)
!719 = !DILocation(line: 174, column: 51, scope: !712)
!720 = distinct !DISubprogram(name: "android.command_line_arguments..init2", linkageName: "command_line_arguments.command_line_arguments..init2", scope: null, file: !141, line: 185, type: !158, isLocal: false, isDefinition: true, scopeLine: 185, isOptimized: false, unit: !1, retainedNodes: !3)
!721 = !DILocation(line: 186, column: 8, scope: !720)
!722 = !DILocation(line: 187, column: 8, scope: !720)
!723 = !DILocation(line: 188, column: 8, scope: !720)
!724 = !DILocation(line: 189, column: 8, scope: !720)
!725 = !DILocation(line: 190, column: 8, scope: !720)
!726 = distinct !DISubprogram(name: "android.command_line_arguments..init3", linkageName: "command_line_arguments.command_line_arguments..init3", scope: null, file: !141, line: 193, type: !158, isLocal: false, isDefinition: true, scopeLine: 193, isOptimized: false, unit: !1, retainedNodes: !3)
!727 = !DILocation(line: 194, column: 8, scope: !726)
!728 = distinct !DISubprogram(name: "android.command_line_arguments.StatusBar..hash", linkageName: "command_line_arguments.command_line_arguments.StatusBar..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!729 = !DILocalVariable(name: "key", arg: 1, scope: !728, file: !29, line: 1, type: !55)
!730 = !DILocation(line: 1, column: 1, scope: !728)
!731 = !DILocalVariable(name: "seed", arg: 2, scope: !728, file: !29, line: 1, type: !40)
!732 = !DILocalVariable(name: "$ret53", scope: !728, file: !29, line: 1, type: !40)
!733 = distinct !DISubprogram(name: "android.command_line_arguments.StatusBar..eq", linkageName: "command_line_arguments.command_line_arguments.StatusBar..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!734 = !DILocalVariable(name: "key1", arg: 1, scope: !733, file: !29, line: 1, type: !55)
!735 = !DILocation(line: 1, column: 1, scope: !733)
!736 = !DILocalVariable(name: "key2", arg: 2, scope: !733, file: !29, line: 1, type: !55)
!737 = !DILocalVariable(name: "$ret54", scope: !733, file: !29, line: 1, type: !65)
!738 = distinct !DISubprogram(name: "android.Descriptor..1command_line_arguments.StatusBar", linkageName: "command_line_arguments.StatusBar.Descriptor", scope: null, file: !150, line: 24, type: !739, isLocal: false, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !1, retainedNodes: !3)
!739 = !DISubroutineType(types: !740)
!740 = !{!193, !741, !741}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "StatusBar", file: !150, line: 16, size: 128, align: 8, elements: !743)
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "Style", file: !150, line: 17, baseType: !65, size: 8, align: 8)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Color", file: !150, line: 18, baseType: !467, size: 64, align: 64, offset: 64)
!746 = !DILocalVariable(name: "r.17", arg: 1, scope: !738, file: !150, line: 24, type: !741)
!747 = !DILocation(line: 24, column: 1, scope: !738)
!748 = !DILocation(line: 24, column: 74, scope: !738)
!749 = !DILocalVariable(name: "$ret46", scope: !738, file: !150, line: 24, type: !197)
!750 = !DILocation(line: 24, column: 41, scope: !738)
!751 = !DILocation(line: 24, column: 50, scope: !738)
!752 = distinct !DISubprogram(name: "android.GetColor..1command_line_arguments.StatusBar", linkageName: "command_line_arguments.StatusBar.GetColor", scope: null, file: !150, line: 33, type: !753, isLocal: false, isDefinition: true, scopeLine: 33, isOptimized: false, unit: !1, retainedNodes: !3)
!753 = !DISubroutineType(types: !754)
!754 = !{!467, !741, !741}
!755 = !DILocalVariable(name: "m", arg: 1, scope: !752, file: !150, line: 33, type: !741)
!756 = !DILocation(line: 33, column: 1, scope: !752)
!757 = !DILocalVariable(name: "$ret48", scope: !752, file: !150, line: 33, type: !467)
!758 = !DILocation(line: 33, column: 32, scope: !752)
!759 = !DILocation(line: 34, column: 7, scope: !752)
!760 = !DILocation(line: 37, column: 2, scope: !752)
!761 = !DILocation(line: 35, column: 11, scope: !752)
!762 = !DILocation(line: 35, column: 3, scope: !752)
!763 = distinct !DISubprogram(name: "android.GetStyle..1command_line_arguments.StatusBar", linkageName: "command_line_arguments.StatusBar.GetStyle", scope: null, file: !150, line: 26, type: !764, isLocal: false, isDefinition: true, scopeLine: 26, isOptimized: false, unit: !1, retainedNodes: !3)
!764 = !DISubroutineType(types: !765)
!765 = !{!65, !741, !741}
!766 = !DILocalVariable(name: "m", arg: 1, scope: !763, file: !150, line: 26, type: !741)
!767 = !DILocation(line: 26, column: 1, scope: !763)
!768 = !DILocalVariable(name: "$ret47", scope: !763, file: !150, line: 26, type: !65)
!769 = !DILocation(line: 26, column: 32, scope: !763)
!770 = !DILocation(line: 27, column: 7, scope: !763)
!771 = !DILocation(line: 30, column: 2, scope: !763)
!772 = !DILocation(line: 28, column: 11, scope: !763)
!773 = !DILocation(line: 28, column: 3, scope: !763)
!774 = distinct !DISubprogram(name: "android.Reset..1command_line_arguments.StatusBar", linkageName: "command_line_arguments.StatusBar.Reset", scope: null, file: !150, line: 21, type: !775, isLocal: false, isDefinition: true, scopeLine: 21, isOptimized: false, unit: !1, retainedNodes: !3)
!775 = !DISubroutineType(types: !776)
!776 = !{!56, !741, !741}
!777 = !DILocalVariable(name: "m", arg: 1, scope: !774, file: !150, line: 21, type: !741)
!778 = !DILocation(line: 21, column: 1, scope: !774)
!779 = !DILocation(line: 21, column: 53, scope: !774)
!780 = distinct !DISubprogram(name: "android.String..1command_line_arguments.StatusBar", linkageName: "command_line_arguments.StatusBar.String", scope: null, file: !150, line: 22, type: !781, isLocal: false, isDefinition: true, scopeLine: 22, isOptimized: false, unit: !1, retainedNodes: !3)
!781 = !DISubroutineType(types: !782)
!782 = !{!69, !741, !741}
!783 = !DILocalVariable(name: "m", arg: 1, scope: !780, file: !150, line: 22, type: !741)
!784 = !DILocation(line: 22, column: 1, scope: !780)
!785 = !DILocation(line: 22, column: 81, scope: !780)
!786 = !DILocation(line: 22, column: 63, scope: !780)
!787 = !DILocation(line: 22, column: 50, scope: !780)
!788 = distinct !DISubprogram(name: "android.command_line_arguments..init4", linkageName: "command_line_arguments.command_line_arguments..init4", scope: null, file: !150, line: 40, type: !158, isLocal: false, isDefinition: true, scopeLine: 40, isOptimized: false, unit: !1, retainedNodes: !3)
!789 = !DILocation(line: 41, column: 8, scope: !788)
