; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22ios\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/golang/protobuf/proto\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/golang/protobuf/proto\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22gomatcha.io/matcha/proto\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22gomatcha.io/matcha/proto\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22text\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22gomatcha.io/matcha/proto/text\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./progressview.pb.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha/proto/view/ios")
!3 = !{}
!4 = !{!5, !109, !111, !127, !137, !139, !142, !144, !146, !148, !151, !153, !155, !157, !160, !162, !164}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments._.0", linkageName: "command_line_arguments._.0", scope: !1, file: !7, line: 34, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "progressview.pb.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 28, size: 64, align: 8, elements: !10)
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 28, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !95}
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !16, size: 320, align: 8, elements: !17)
!16 = !DIFile(filename: "", directory: "")
!17 = !{!18, !27}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 28, baseType: !19, size: 192, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !16, size: 192, align: 8, elements: !20)
!20 = !{!21, !24, !26}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !16, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !16, line: 1, baseType: !25, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 28, baseType: !28, size: 128, align: 64, offset: 192)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !29, line: 1, size: 128, align: 8, elements: !30)
!29 = !DIFile(filename: "<built-in>", directory: "")
!30 = !{!31, !94}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !29, line: 1, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !16, size: 128, align: 8, elements: !34)
!34 = !{!35, !90}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 1, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !29, line: 1, size: 576, align: 8, elements: !38)
!38 = !{!39, !41, !42, !44, !45, !46, !47, !57, !66, !67, !73, !89}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !29, line: 1, baseType: !40, size: 64, align: 64)
!40 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !29, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !29, line: 1, baseType: !43, size: 32, align: 32, offset: 128)
!43 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 168)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 176)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !29, line: 1, baseType: !48, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !29, line: 1, size: 64, align: 8, elements: !50)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !29, line: 1, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!40, !55, !40}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIBasicType(name: "void")
!57 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !29, line: 1, baseType: !58, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !29, line: 1, size: 64, align: 8, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !29, line: 1, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !55, !55}
!65 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !29, line: 1, baseType: !22, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !29, line: 1, baseType: !68, size: 64, align: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !29, line: 1, size: 128, align: 8, elements: !70)
!70 = !{!71, !72}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !29, line: 1, baseType: !22, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !29, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !29, line: 1, baseType: !74, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !29, line: 1, size: 320, align: 8, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !29, line: 1, baseType: !68, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !29, line: 1, baseType: !68, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !29, line: 1, baseType: !80, size: 192, align: 64, offset: 128)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !16, size: 192, align: 8, elements: !81)
!81 = !{!82, !24, !26}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !29, line: 1, size: 320, align: 8, elements: !85)
!85 = !{!77, !78, !86, !87, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !16, line: 1, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!69, !55}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !7, line: 28, size: 128, align: 8, elements: !96)
!96 = !{!97, !108}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 28, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void,*func(*void)string}", file: !16, size: 256, align: 8, elements: !100)
!100 = !{!101, !102, !106, !107}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 28, baseType: !36, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMessage", file: !16, line: 28, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!56, !55}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", file: !16, line: 28, baseType: !103, size: 64, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !16, line: 28, baseType: !91, size: 64, align: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !29, line: 1, type: !43, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "command_line_arguments._.1", linkageName: "command_line_arguments._.1", scope: !1, file: !7, line: 35, type: !113, isLocal: false, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 29, size: 64, align: 8, elements: !115)
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 29, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!28, !69, !120}
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*void},int,int}", file: !16, size: 192, align: 8, elements: !121)
!121 = !{!122, !24, !26}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !16, size: 128, align: 8, elements: !125)
!125 = !{!35, !126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !16, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "command_line_arguments._.2", linkageName: "command_line_arguments._.2", scope: !1, file: !7, line: 36, type: !129, isLocal: false, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 30, size: 64, align: 8, elements: !131)
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 30, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !25}
!136 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor0", linkageName: "command_line_arguments.fileDescriptor0", scope: !1, file: !7, line: 76, type: !19, isLocal: true, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "command_line_arguments._.3", linkageName: "command_line_arguments._.3", scope: !1, file: !141, line: 11, type: !8, isLocal: false, isDefinition: true)
!141 = !DIFile(filename: "segmentview.pb.go", directory: ".")
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "command_line_arguments._.4", linkageName: "command_line_arguments._.4", scope: !1, file: !141, line: 12, type: !113, isLocal: false, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "command_line_arguments._.5", linkageName: "command_line_arguments._.5", scope: !1, file: !141, line: 13, type: !129, isLocal: false, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor1", linkageName: "command_line_arguments.fileDescriptor1", scope: !1, file: !141, line: 80, type: !19, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "command_line_arguments._.6", linkageName: "command_line_arguments._.6", scope: !1, file: !150, line: 13, type: !8, isLocal: false, isDefinition: true)
!150 = !DIFile(filename: "stackview.pb.go", directory: ".")
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "command_line_arguments._.7", linkageName: "command_line_arguments._.7", scope: !1, file: !150, line: 14, type: !113, isLocal: false, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "command_line_arguments._.8", linkageName: "command_line_arguments._.8", scope: !1, file: !150, line: 15, type: !129, isLocal: false, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor2", linkageName: "command_line_arguments.fileDescriptor2", scope: !1, file: !150, line: 251, type: !19, isLocal: true, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "command_line_arguments._.9", linkageName: "command_line_arguments._.9", scope: !1, file: !159, line: 13, type: !8, isLocal: false, isDefinition: true)
!159 = !DIFile(filename: "tabview.pb.go", directory: ".")
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "command_line_arguments._.10", linkageName: "command_line_arguments._.10", scope: !1, file: !159, line: 14, type: !113, isLocal: false, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "command_line_arguments._.11", linkageName: "command_line_arguments._.11", scope: !1, file: !159, line: 15, type: !129, isLocal: false, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor3", linkageName: "command_line_arguments.fileDescriptor3", scope: !1, file: !159, line: 145, type: !19, isLocal: true, isDefinition: true)
!166 = distinct !DISubprogram(name: "ios.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 26, type: !167, isLocal: false, isDefinition: true, scopeLine: 26, isOptimized: false, unit: !1, retainedNodes: !3)
!167 = !DISubroutineType(types: !168)
!168 = !{!56}
!169 = !DILocation(line: 1, column: 1, scope: !170)
!170 = !DILexicalBlockFile(scope: !166, file: !29, discriminator: 0)
!171 = !DILocation(line: 34, column: 5, scope: !172)
!172 = !DILexicalBlockFile(scope: !166, file: !7, discriminator: 0)
!173 = !DILocation(line: 35, column: 5, scope: !172)
!174 = !DILocation(line: 36, column: 5, scope: !172)
!175 = !DILocation(line: 11, column: 5, scope: !176)
!176 = !DILexicalBlockFile(scope: !166, file: !141, discriminator: 0)
!177 = !DILocation(line: 12, column: 5, scope: !176)
!178 = !DILocation(line: 13, column: 5, scope: !176)
!179 = !DILocation(line: 13, column: 5, scope: !180)
!180 = !DILexicalBlockFile(scope: !166, file: !150, discriminator: 0)
!181 = !DILocation(line: 14, column: 5, scope: !180)
!182 = !DILocation(line: 15, column: 5, scope: !180)
!183 = !DILocation(line: 13, column: 5, scope: !184)
!184 = !DILexicalBlockFile(scope: !166, file: !159, discriminator: 0)
!185 = !DILocation(line: 14, column: 5, scope: !184)
!186 = !DILocation(line: 15, column: 5, scope: !184)
!187 = !DILocation(line: 68, column: 1, scope: !172)
!188 = !DILocation(line: 72, column: 1, scope: !172)
!189 = !DILocation(line: 71, column: 1, scope: !176)
!190 = !DILocation(line: 76, column: 1, scope: !176)
!191 = !DILocation(line: 241, column: 1, scope: !180)
!192 = !DILocation(line: 249, column: 1, scope: !180)
!193 = !DILocation(line: 137, column: 1, scope: !184)
!194 = !DILocation(line: 143, column: 1, scope: !184)
!195 = distinct !DISubprogram(name: "ios.command_line_arguments.ProgressView..hash", linkageName: "command_line_arguments.command_line_arguments.ProgressView..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!196 = !DILocalVariable(name: "key", arg: 1, scope: !195, file: !29, line: 1, type: !55)
!197 = !DILocation(line: 1, column: 1, scope: !195)
!198 = !DILocalVariable(name: "seed", arg: 2, scope: !195, file: !29, line: 1, type: !40)
!199 = !DILocalVariable(name: "$ret75", scope: !195, file: !29, line: 1, type: !40)
!200 = distinct !DISubprogram(name: "ios.command_line_arguments.ProgressView..eq", linkageName: "command_line_arguments.command_line_arguments.ProgressView..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!201 = !DILocalVariable(name: "key1", arg: 1, scope: !200, file: !29, line: 1, type: !55)
!202 = !DILocation(line: 1, column: 1, scope: !200)
!203 = !DILocalVariable(name: "key2", arg: 2, scope: !200, file: !29, line: 1, type: !55)
!204 = !DILocalVariable(name: "$ret76", scope: !200, file: !29, line: 1, type: !65)
!205 = distinct !DISubprogram(name: "ios.Descriptor..1command_line_arguments.ProgressView", linkageName: "command_line_arguments.ProgressView.Descriptor", scope: null, file: !7, line: 52, type: !206, isLocal: false, isDefinition: true, scopeLine: 52, isOptimized: false, unit: !1, retainedNodes: !3)
!206 = !DISubroutineType(types: !207)
!207 = !{!208, !216, !216}
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},struct{*int,int,int}}", file: !16, size: 384, align: 8, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 52, baseType: !19, size: 192, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 52, baseType: !212, size: 192, align: 64, offset: 192)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !16, size: 192, align: 8, elements: !213)
!213 = !{!214, !24, !26}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProgressView", file: !7, line: 44, size: 128, align: 8, elements: !218)
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Progress", file: !7, line: 45, baseType: !136, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ProgressColor", file: !7, line: 46, baseType: !221, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", file: !7, line: 31, size: 128, align: 8, elements: !223)
!223 = !{!224, !225, !226, !227}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Red", file: !7, line: 31, baseType: !43, size: 32, align: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", file: !7, line: 31, baseType: !43, size: 32, align: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Green", file: !7, line: 31, baseType: !43, size: 32, align: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Alpha", file: !7, line: 31, baseType: !43, size: 32, align: 32, offset: 96)
!228 = !DILocalVariable(name: "r.1", arg: 1, scope: !205, file: !7, line: 52, type: !216)
!229 = !DILocation(line: 52, column: 1, scope: !205)
!230 = !DILocation(line: 52, column: 77, scope: !205)
!231 = !DILocalVariable(name: "$ret2", scope: !205, file: !7, line: 52, type: !212)
!232 = !DILocation(line: 52, column: 44, scope: !205)
!233 = !DILocation(line: 52, column: 53, scope: !205)
!234 = distinct !DISubprogram(name: "ios.GetProgress..1command_line_arguments.ProgressView", linkageName: "command_line_arguments.ProgressView.GetProgress", scope: null, file: !7, line: 54, type: !235, isLocal: false, isDefinition: true, scopeLine: 54, isOptimized: false, unit: !1, retainedNodes: !3)
!235 = !DISubroutineType(types: !236)
!236 = !{!136, !216, !216}
!237 = !DILocalVariable(name: "m", arg: 1, scope: !234, file: !7, line: 54, type: !216)
!238 = !DILocation(line: 54, column: 1, scope: !234)
!239 = !DILocalVariable(name: "$ret3", scope: !234, file: !7, line: 54, type: !136)
!240 = !DILocation(line: 54, column: 38, scope: !234)
!241 = !DILocation(line: 55, column: 7, scope: !234)
!242 = !DILocation(line: 58, column: 2, scope: !234)
!243 = !DILocation(line: 56, column: 11, scope: !234)
!244 = !DILocation(line: 56, column: 3, scope: !234)
!245 = distinct !DISubprogram(name: "ios.GetProgressColor..1command_line_arguments.ProgressView", linkageName: "command_line_arguments.ProgressView.GetProgressColor", scope: null, file: !7, line: 61, type: !246, isLocal: false, isDefinition: true, scopeLine: 61, isOptimized: false, unit: !1, retainedNodes: !3)
!246 = !DISubroutineType(types: !247)
!247 = !{!221, !216, !216}
!248 = !DILocalVariable(name: "m", arg: 1, scope: !245, file: !7, line: 61, type: !216)
!249 = !DILocation(line: 61, column: 1, scope: !245)
!250 = !DILocalVariable(name: "$ret4", scope: !245, file: !7, line: 61, type: !221)
!251 = !DILocation(line: 61, column: 43, scope: !245)
!252 = !DILocation(line: 62, column: 7, scope: !245)
!253 = !DILocation(line: 65, column: 2, scope: !245)
!254 = !DILocation(line: 63, column: 11, scope: !245)
!255 = !DILocation(line: 63, column: 3, scope: !245)
!256 = distinct !DISubprogram(name: "ios.Reset..1command_line_arguments.ProgressView", linkageName: "command_line_arguments.ProgressView.Reset", scope: null, file: !7, line: 49, type: !257, isLocal: false, isDefinition: true, scopeLine: 49, isOptimized: false, unit: !1, retainedNodes: !3)
!257 = !DISubroutineType(types: !258)
!258 = !{!56, !216, !216}
!259 = !DILocalVariable(name: "m", arg: 1, scope: !256, file: !7, line: 49, type: !216)
!260 = !DILocation(line: 49, column: 1, scope: !256)
!261 = !DILocation(line: 49, column: 56, scope: !256)
!262 = distinct !DISubprogram(name: "ios.String..1command_line_arguments.ProgressView", linkageName: "command_line_arguments.ProgressView.String", scope: null, file: !7, line: 50, type: !263, isLocal: false, isDefinition: true, scopeLine: 50, isOptimized: false, unit: !1, retainedNodes: !3)
!263 = !DISubroutineType(types: !264)
!264 = !{!69, !216, !216}
!265 = !DILocalVariable(name: "m", arg: 1, scope: !262, file: !7, line: 50, type: !216)
!266 = !DILocation(line: 50, column: 1, scope: !262)
!267 = !DILocation(line: 50, column: 84, scope: !262)
!268 = !DILocation(line: 50, column: 66, scope: !262)
!269 = !DILocation(line: 50, column: 53, scope: !262)
!270 = distinct !DISubprogram(name: "ios.command_line_arguments..init0", linkageName: "command_line_arguments.command_line_arguments..init0", scope: null, file: !7, line: 68, type: !167, isLocal: false, isDefinition: true, scopeLine: 68, isOptimized: false, unit: !1, retainedNodes: !3)
!271 = !DILocation(line: 69, column: 8, scope: !270)
!272 = distinct !DISubprogram(name: "ios.command_line_arguments..init1", linkageName: "command_line_arguments.command_line_arguments..init1", scope: null, file: !7, line: 72, type: !167, isLocal: false, isDefinition: true, scopeLine: 72, isOptimized: false, unit: !1, retainedNodes: !3)
!273 = !DILocation(line: 73, column: 8, scope: !272)
!274 = distinct !DISubprogram(name: "ios.Descriptor..1command_line_arguments.SegmentView", linkageName: "command_line_arguments.SegmentView.Descriptor", scope: null, file: !141, line: 25, type: !275, isLocal: false, isDefinition: true, scopeLine: 25, isOptimized: false, unit: !1, retainedNodes: !3)
!275 = !DISubroutineType(types: !276)
!276 = !{!208, !277, !277}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "SegmentView", file: !141, line: 15, size: 320, align: 8, elements: !279)
!279 = !{!280, !282, !286, !287}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !141, line: 16, baseType: !281, size: 64, align: 64)
!281 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Titles", file: !141, line: 17, baseType: !283, size: 192, align: 64, offset: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !16, size: 192, align: 8, elements: !284)
!284 = !{!285, !24, !26}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !68, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Momentary", file: !141, line: 18, baseType: !65, size: 8, align: 8, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", file: !141, line: 19, baseType: !65, size: 8, align: 8, offset: 264)
!288 = !DILocalVariable(name: "r.3", arg: 1, scope: !274, file: !141, line: 25, type: !277)
!289 = !DILocation(line: 25, column: 1, scope: !274)
!290 = !DILocation(line: 25, column: 76, scope: !274)
!291 = !DILocalVariable(name: "$ret7", scope: !274, file: !141, line: 25, type: !212)
!292 = !DILocation(line: 25, column: 43, scope: !274)
!293 = !DILocation(line: 25, column: 52, scope: !274)
!294 = distinct !DISubprogram(name: "ios.GetEnabled..1command_line_arguments.SegmentView", linkageName: "command_line_arguments.SegmentView.GetEnabled", scope: null, file: !141, line: 48, type: !295, isLocal: false, isDefinition: true, scopeLine: 48, isOptimized: false, unit: !1, retainedNodes: !3)
!295 = !DISubroutineType(types: !296)
!296 = !{!65, !277, !277}
!297 = !DILocalVariable(name: "m", arg: 1, scope: !294, file: !141, line: 48, type: !277)
!298 = !DILocation(line: 48, column: 1, scope: !294)
!299 = !DILocalVariable(name: "$ret11", scope: !294, file: !141, line: 48, type: !65)
!300 = !DILocation(line: 48, column: 36, scope: !294)
!301 = !DILocation(line: 49, column: 7, scope: !294)
!302 = !DILocation(line: 52, column: 2, scope: !294)
!303 = !DILocation(line: 50, column: 11, scope: !294)
!304 = !DILocation(line: 50, column: 3, scope: !294)
!305 = distinct !DISubprogram(name: "ios.GetMomentary..1command_line_arguments.SegmentView", linkageName: "command_line_arguments.SegmentView.GetMomentary", scope: null, file: !141, line: 41, type: !295, isLocal: false, isDefinition: true, scopeLine: 41, isOptimized: false, unit: !1, retainedNodes: !3)
!306 = !DILocalVariable(name: "m", arg: 1, scope: !305, file: !141, line: 41, type: !277)
!307 = !DILocation(line: 41, column: 1, scope: !305)
!308 = !DILocalVariable(name: "$ret10", scope: !305, file: !141, line: 41, type: !65)
!309 = !DILocation(line: 41, column: 38, scope: !305)
!310 = !DILocation(line: 42, column: 7, scope: !305)
!311 = !DILocation(line: 45, column: 2, scope: !305)
!312 = !DILocation(line: 43, column: 11, scope: !305)
!313 = !DILocation(line: 43, column: 3, scope: !305)
!314 = distinct !DISubprogram(name: "ios.GetTitles..1command_line_arguments.SegmentView", linkageName: "command_line_arguments.SegmentView.GetTitles", scope: null, file: !141, line: 34, type: !315, isLocal: false, isDefinition: true, scopeLine: 34, isOptimized: false, unit: !1, retainedNodes: !3)
!315 = !DISubroutineType(types: !316)
!316 = !{!283, !277, !277}
!317 = !DILocalVariable(name: "m", arg: 1, scope: !314, file: !141, line: 34, type: !277)
!318 = !DILocation(line: 34, column: 1, scope: !314)
!319 = !DILocation(line: 35, column: 7, scope: !314)
!320 = !DILocation(line: 38, column: 2, scope: !314)
!321 = !DILocation(line: 36, column: 11, scope: !314)
!322 = !DILocation(line: 36, column: 3, scope: !314)
!323 = distinct !DISubprogram(name: "ios.GetValue..1command_line_arguments.SegmentView", linkageName: "command_line_arguments.SegmentView.GetValue", scope: null, file: !141, line: 27, type: !324, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!324 = !DISubroutineType(types: !325)
!325 = !{!281, !277, !277}
!326 = !DILocalVariable(name: "m", arg: 1, scope: !323, file: !141, line: 27, type: !277)
!327 = !DILocation(line: 27, column: 1, scope: !323)
!328 = !DILocalVariable(name: "$ret8", scope: !323, file: !141, line: 27, type: !281)
!329 = !DILocation(line: 27, column: 34, scope: !323)
!330 = !DILocation(line: 28, column: 7, scope: !323)
!331 = !DILocation(line: 31, column: 2, scope: !323)
!332 = !DILocation(line: 29, column: 11, scope: !323)
!333 = !DILocation(line: 29, column: 3, scope: !323)
!334 = distinct !DISubprogram(name: "ios.Reset..1command_line_arguments.SegmentView", linkageName: "command_line_arguments.SegmentView.Reset", scope: null, file: !141, line: 22, type: !335, isLocal: false, isDefinition: true, scopeLine: 22, isOptimized: false, unit: !1, retainedNodes: !3)
!335 = !DISubroutineType(types: !336)
!336 = !{!56, !277, !277}
!337 = !DILocalVariable(name: "m", arg: 1, scope: !334, file: !141, line: 22, type: !277)
!338 = !DILocation(line: 22, column: 1, scope: !334)
!339 = !DILocation(line: 22, column: 55, scope: !334)
!340 = distinct !DISubprogram(name: "ios.String..1command_line_arguments.SegmentView", linkageName: "command_line_arguments.SegmentView.String", scope: null, file: !141, line: 23, type: !341, isLocal: false, isDefinition: true, scopeLine: 23, isOptimized: false, unit: !1, retainedNodes: !3)
!341 = !DISubroutineType(types: !342)
!342 = !{!69, !277, !277}
!343 = !DILocalVariable(name: "m", arg: 1, scope: !340, file: !141, line: 23, type: !277)
!344 = !DILocation(line: 23, column: 1, scope: !340)
!345 = !DILocation(line: 23, column: 83, scope: !340)
!346 = !DILocation(line: 23, column: 65, scope: !340)
!347 = !DILocation(line: 23, column: 52, scope: !340)
!348 = distinct !DISubprogram(name: "ios.Descriptor..1command_line_arguments.SegmentViewEvent", linkageName: "command_line_arguments.SegmentViewEvent.Descriptor", scope: null, file: !141, line: 62, type: !349, isLocal: false, isDefinition: true, scopeLine: 62, isOptimized: false, unit: !1, retainedNodes: !3)
!349 = !DISubroutineType(types: !350)
!350 = !{!208, !351, !351}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "SegmentViewEvent", file: !141, line: 55, size: 64, align: 8, elements: !353)
!353 = !{!354}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !141, line: 56, baseType: !281, size: 64, align: 64)
!355 = !DILocalVariable(name: "r.5", arg: 1, scope: !348, file: !141, line: 62, type: !351)
!356 = !DILocation(line: 62, column: 1, scope: !348)
!357 = !DILocation(line: 62, column: 81, scope: !348)
!358 = !DILocalVariable(name: "$ret14", scope: !348, file: !141, line: 62, type: !212)
!359 = !DILocation(line: 62, column: 48, scope: !348)
!360 = !DILocation(line: 62, column: 57, scope: !348)
!361 = distinct !DISubprogram(name: "ios.GetValue..1command_line_arguments.SegmentViewEvent", linkageName: "command_line_arguments.SegmentViewEvent.GetValue", scope: null, file: !141, line: 64, type: !362, isLocal: false, isDefinition: true, scopeLine: 64, isOptimized: false, unit: !1, retainedNodes: !3)
!362 = !DISubroutineType(types: !363)
!363 = !{!281, !351, !351}
!364 = !DILocalVariable(name: "m", arg: 1, scope: !361, file: !141, line: 64, type: !351)
!365 = !DILocation(line: 64, column: 1, scope: !361)
!366 = !DILocalVariable(name: "$ret15", scope: !361, file: !141, line: 64, type: !281)
!367 = !DILocation(line: 64, column: 39, scope: !361)
!368 = !DILocation(line: 65, column: 7, scope: !361)
!369 = !DILocation(line: 68, column: 2, scope: !361)
!370 = !DILocation(line: 66, column: 11, scope: !361)
!371 = !DILocation(line: 66, column: 3, scope: !361)
!372 = distinct !DISubprogram(name: "ios.Reset..1command_line_arguments.SegmentViewEvent", linkageName: "command_line_arguments.SegmentViewEvent.Reset", scope: null, file: !141, line: 59, type: !373, isLocal: false, isDefinition: true, scopeLine: 59, isOptimized: false, unit: !1, retainedNodes: !3)
!373 = !DISubroutineType(types: !374)
!374 = !{!56, !351, !351}
!375 = !DILocalVariable(name: "m", arg: 1, scope: !372, file: !141, line: 59, type: !351)
!376 = !DILocation(line: 59, column: 1, scope: !372)
!377 = !DILocation(line: 59, column: 57, scope: !372)
!378 = !DILocation(line: 59, column: 60, scope: !372)
!379 = distinct !DISubprogram(name: "ios.String..1command_line_arguments.SegmentViewEvent", linkageName: "command_line_arguments.SegmentViewEvent.String", scope: null, file: !141, line: 60, type: !380, isLocal: false, isDefinition: true, scopeLine: 60, isOptimized: false, unit: !1, retainedNodes: !3)
!380 = !DISubroutineType(types: !381)
!381 = !{!69, !351, !351}
!382 = !DILocalVariable(name: "m", arg: 1, scope: !379, file: !141, line: 60, type: !351)
!383 = !DILocation(line: 60, column: 1, scope: !379)
!384 = !DILocation(line: 60, column: 88, scope: !379)
!385 = !DILocation(line: 60, column: 70, scope: !379)
!386 = !DILocation(line: 60, column: 57, scope: !379)
!387 = distinct !DISubprogram(name: "ios.command_line_arguments..init2", linkageName: "command_line_arguments.command_line_arguments..init2", scope: null, file: !141, line: 71, type: !167, isLocal: false, isDefinition: true, scopeLine: 71, isOptimized: false, unit: !1, retainedNodes: !3)
!388 = !DILocation(line: 72, column: 8, scope: !387)
!389 = !DILocation(line: 73, column: 8, scope: !387)
!390 = distinct !DISubprogram(name: "ios.command_line_arguments..init3", linkageName: "command_line_arguments.command_line_arguments..init3", scope: null, file: !141, line: 76, type: !167, isLocal: false, isDefinition: true, scopeLine: 76, isOptimized: false, unit: !1, retainedNodes: !3)
!391 = !DILocation(line: 77, column: 8, scope: !390)
!392 = distinct !DISubprogram(name: "ios.Descriptor..1command_line_arguments.StackChildView", linkageName: "command_line_arguments.StackChildView.Descriptor", scope: null, file: !150, line: 24, type: !393, isLocal: false, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !1, retainedNodes: !3)
!393 = !DISubroutineType(types: !394)
!394 = !{!208, !395, !395}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "StackChildView", file: !150, line: 17, size: 64, align: 8, elements: !397)
!397 = !{!398}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ScreenId", file: !150, line: 18, baseType: !281, size: 64, align: 64)
!399 = !DILocalVariable(name: "r.7", arg: 1, scope: !392, file: !150, line: 24, type: !395)
!400 = !DILocation(line: 24, column: 1, scope: !392)
!401 = !DILocation(line: 24, column: 79, scope: !392)
!402 = !DILocalVariable(name: "$ret18", scope: !392, file: !150, line: 24, type: !212)
!403 = !DILocation(line: 24, column: 46, scope: !392)
!404 = !DILocation(line: 24, column: 55, scope: !392)
!405 = distinct !DISubprogram(name: "ios.GetScreenId..1command_line_arguments.StackChildView", linkageName: "command_line_arguments.StackChildView.GetScreenId", scope: null, file: !150, line: 26, type: !406, isLocal: false, isDefinition: true, scopeLine: 26, isOptimized: false, unit: !1, retainedNodes: !3)
!406 = !DISubroutineType(types: !407)
!407 = !{!281, !395, !395}
!408 = !DILocalVariable(name: "m", arg: 1, scope: !405, file: !150, line: 26, type: !395)
!409 = !DILocation(line: 26, column: 1, scope: !405)
!410 = !DILocalVariable(name: "$ret19", scope: !405, file: !150, line: 26, type: !281)
!411 = !DILocation(line: 26, column: 40, scope: !405)
!412 = !DILocation(line: 27, column: 7, scope: !405)
!413 = !DILocation(line: 30, column: 2, scope: !405)
!414 = !DILocation(line: 28, column: 11, scope: !405)
!415 = !DILocation(line: 28, column: 3, scope: !405)
!416 = distinct !DISubprogram(name: "ios.Reset..1command_line_arguments.StackChildView", linkageName: "command_line_arguments.StackChildView.Reset", scope: null, file: !150, line: 21, type: !417, isLocal: false, isDefinition: true, scopeLine: 21, isOptimized: false, unit: !1, retainedNodes: !3)
!417 = !DISubroutineType(types: !418)
!418 = !{!56, !395, !395}
!419 = !DILocalVariable(name: "m", arg: 1, scope: !416, file: !150, line: 21, type: !395)
!420 = !DILocation(line: 21, column: 1, scope: !416)
!421 = !DILocation(line: 21, column: 55, scope: !416)
!422 = !DILocation(line: 21, column: 58, scope: !416)
!423 = distinct !DISubprogram(name: "ios.String..1command_line_arguments.StackChildView", linkageName: "command_line_arguments.StackChildView.String", scope: null, file: !150, line: 22, type: !424, isLocal: false, isDefinition: true, scopeLine: 22, isOptimized: false, unit: !1, retainedNodes: !3)
!424 = !DISubroutineType(types: !425)
!425 = !{!69, !395, !395}
!426 = !DILocalVariable(name: "m", arg: 1, scope: !423, file: !150, line: 22, type: !395)
!427 = !DILocation(line: 22, column: 1, scope: !423)
!428 = !DILocation(line: 22, column: 86, scope: !423)
!429 = !DILocation(line: 22, column: 68, scope: !423)
!430 = !DILocation(line: 22, column: 55, scope: !423)
!431 = distinct !DISubprogram(name: "ios.Descriptor..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.Descriptor", scope: null, file: !150, line: 44, type: !432, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!432 = !DISubroutineType(types: !433)
!433 = !{!208, !434, !434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "StackView", file: !150, line: 33, size: 448, align: 8, elements: !436)
!436 = !{!437, !442, !478, !479, !480}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Children", file: !150, line: 34, baseType: !438, size: 192, align: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**StackChildView,int,int}", file: !16, size: 192, align: 8, elements: !439)
!439 = !{!440, !24, !26}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "TitleTextStyle", file: !150, line: 35, baseType: !443, size: 64, align: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "TextStyle", file: !150, line: 10, size: 1280, align: 8, elements: !445)
!445 = !{!446, !447, !449, !451, !452, !453, !454, !455, !456, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !473, !475, !476, !477}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !150, line: 10, baseType: !281, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "TextAlignment", file: !150, line: 10, baseType: !448, size: 32, align: 32, offset: 64)
!448 = !DIBasicType(name: "TextAlignment", size: 32, encoding: DW_ATE_signed)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughStyle", file: !150, line: 10, baseType: !450, size: 32, align: 32, offset: 96)
!450 = !DIBasicType(name: "StrikethroughStyle", size: 32, encoding: DW_ATE_signed)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "HasStrikethroughColor", file: !150, line: 10, baseType: !65, size: 8, align: 8, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorRed", file: !150, line: 10, baseType: !43, size: 32, align: 32, offset: 160)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorGreen", file: !150, line: 10, baseType: !43, size: 32, align: 32, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorBlue", file: !150, line: 10, baseType: !43, size: 32, align: 32, offset: 224)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorAlpha", file: !150, line: 10, baseType: !43, size: 32, align: 32, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineStyle", file: !150, line: 10, baseType: !457, size: 32, align: 32, offset: 288)
!457 = !DIBasicType(name: "UnderlineStyle", size: 32, encoding: DW_ATE_signed)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "HasUnderlineColor", file: !150, line: 10, baseType: !65, size: 8, align: 8, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorRed", file: !150, line: 10, baseType: !43, size: 32, align: 32, offset: 352)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorGreen", file: !150, line: 10, baseType: !43, size: 32, align: 32, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorBlue", file: !150, line: 10, baseType: !43, size: 32, align: 32, offset: 416)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorAlpha", file: !150, line: 10, baseType: !43, size: 32, align: 32, offset: 448)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "Hyphenation", file: !150, line: 10, baseType: !136, size: 64, align: 64, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "LineHeightMultiple", file: !150, line: 10, baseType: !136, size: 64, align: 64, offset: 576)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "MaxLines", file: !150, line: 10, baseType: !281, size: 64, align: 64, offset: 640)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "HasTextColor", file: !150, line: 10, baseType: !65, size: 8, align: 8, offset: 704)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorRed", file: !150, line: 10, baseType: !43, size: 32, align: 32, offset: 736)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorGreen", file: !150, line: 10, baseType: !43, size: 32, align: 32, offset: 768)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorBlue", file: !150, line: 10, baseType: !43, size: 32, align: 32, offset: 800)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorAlpha", file: !150, line: 10, baseType: !43, size: 32, align: 32, offset: 832)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Wrap", file: !150, line: 10, baseType: !472, size: 32, align: 32, offset: 864)
!472 = !DIBasicType(name: "TextWrap", size: 32, encoding: DW_ATE_signed)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Truncation", file: !150, line: 10, baseType: !474, size: 32, align: 32, offset: 896)
!474 = !DIBasicType(name: "Truncation", size: 32, encoding: DW_ATE_signed)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "TruncationString", file: !150, line: 10, baseType: !69, size: 128, align: 64, offset: 960)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "FontName", file: !150, line: 10, baseType: !69, size: 128, align: 64, offset: 1088)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "FontSize", file: !150, line: 10, baseType: !136, size: 64, align: 64, offset: 1216)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "BackTextStyle", file: !150, line: 36, baseType: !443, size: 64, align: 64, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "BarColor", file: !150, line: 37, baseType: !221, size: 64, align: 64, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ItemColor", file: !150, line: 38, baseType: !221, size: 64, align: 64, offset: 384)
!481 = !DILocalVariable(name: "r.9", arg: 1, scope: !431, file: !150, line: 44, type: !434)
!482 = !DILocation(line: 44, column: 1, scope: !431)
!483 = !DILocation(line: 44, column: 74, scope: !431)
!484 = !DILocalVariable(name: "$ret22", scope: !431, file: !150, line: 44, type: !212)
!485 = !DILocation(line: 44, column: 41, scope: !431)
!486 = !DILocation(line: 44, column: 50, scope: !431)
!487 = distinct !DISubprogram(name: "ios.GetBackTextStyle..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.GetBackTextStyle", scope: null, file: !150, line: 60, type: !488, isLocal: false, isDefinition: true, scopeLine: 60, isOptimized: false, unit: !1, retainedNodes: !3)
!488 = !DISubroutineType(types: !489)
!489 = !{!443, !434, !434}
!490 = !DILocalVariable(name: "m", arg: 1, scope: !487, file: !150, line: 60, type: !434)
!491 = !DILocation(line: 60, column: 1, scope: !487)
!492 = !DILocalVariable(name: "$ret25", scope: !487, file: !150, line: 60, type: !443)
!493 = !DILocation(line: 60, column: 40, scope: !487)
!494 = !DILocation(line: 61, column: 7, scope: !487)
!495 = !DILocation(line: 64, column: 2, scope: !487)
!496 = !DILocation(line: 62, column: 11, scope: !487)
!497 = !DILocation(line: 62, column: 3, scope: !487)
!498 = distinct !DISubprogram(name: "ios.GetBarColor..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.GetBarColor", scope: null, file: !150, line: 67, type: !499, isLocal: false, isDefinition: true, scopeLine: 67, isOptimized: false, unit: !1, retainedNodes: !3)
!499 = !DISubroutineType(types: !500)
!500 = !{!221, !434, !434}
!501 = !DILocalVariable(name: "m", arg: 1, scope: !498, file: !150, line: 67, type: !434)
!502 = !DILocation(line: 67, column: 1, scope: !498)
!503 = !DILocalVariable(name: "$ret26", scope: !498, file: !150, line: 67, type: !221)
!504 = !DILocation(line: 67, column: 35, scope: !498)
!505 = !DILocation(line: 68, column: 7, scope: !498)
!506 = !DILocation(line: 71, column: 2, scope: !498)
!507 = !DILocation(line: 69, column: 11, scope: !498)
!508 = !DILocation(line: 69, column: 3, scope: !498)
!509 = distinct !DISubprogram(name: "ios.GetChildren..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.GetChildren", scope: null, file: !150, line: 46, type: !510, isLocal: false, isDefinition: true, scopeLine: 46, isOptimized: false, unit: !1, retainedNodes: !3)
!510 = !DISubroutineType(types: !511)
!511 = !{!438, !434, !434}
!512 = !DILocalVariable(name: "m", arg: 1, scope: !509, file: !150, line: 46, type: !434)
!513 = !DILocation(line: 46, column: 1, scope: !509)
!514 = !DILocation(line: 47, column: 7, scope: !509)
!515 = !DILocation(line: 50, column: 2, scope: !509)
!516 = !DILocation(line: 48, column: 3, scope: !509)
!517 = distinct !DISubprogram(name: "ios.GetItemColor..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.GetItemColor", scope: null, file: !150, line: 74, type: !499, isLocal: false, isDefinition: true, scopeLine: 74, isOptimized: false, unit: !1, retainedNodes: !3)
!518 = !DILocalVariable(name: "m", arg: 1, scope: !517, file: !150, line: 74, type: !434)
!519 = !DILocation(line: 74, column: 1, scope: !517)
!520 = !DILocalVariable(name: "$ret27", scope: !517, file: !150, line: 74, type: !221)
!521 = !DILocation(line: 74, column: 36, scope: !517)
!522 = !DILocation(line: 75, column: 7, scope: !517)
!523 = !DILocation(line: 78, column: 2, scope: !517)
!524 = !DILocation(line: 76, column: 11, scope: !517)
!525 = !DILocation(line: 76, column: 3, scope: !517)
!526 = distinct !DISubprogram(name: "ios.GetTitleTextStyle..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.GetTitleTextStyle", scope: null, file: !150, line: 53, type: !488, isLocal: false, isDefinition: true, scopeLine: 53, isOptimized: false, unit: !1, retainedNodes: !3)
!527 = !DILocalVariable(name: "m", arg: 1, scope: !526, file: !150, line: 53, type: !434)
!528 = !DILocation(line: 53, column: 1, scope: !526)
!529 = !DILocalVariable(name: "$ret24", scope: !526, file: !150, line: 53, type: !443)
!530 = !DILocation(line: 53, column: 41, scope: !526)
!531 = !DILocation(line: 54, column: 7, scope: !526)
!532 = !DILocation(line: 57, column: 2, scope: !526)
!533 = !DILocation(line: 55, column: 11, scope: !526)
!534 = !DILocation(line: 55, column: 3, scope: !526)
!535 = distinct !DISubprogram(name: "ios.Reset..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.Reset", scope: null, file: !150, line: 41, type: !536, isLocal: false, isDefinition: true, scopeLine: 41, isOptimized: false, unit: !1, retainedNodes: !3)
!536 = !DISubroutineType(types: !537)
!537 = !{!56, !434, !434}
!538 = !DILocalVariable(name: "m", arg: 1, scope: !535, file: !150, line: 41, type: !434)
!539 = !DILocation(line: 41, column: 1, scope: !535)
!540 = !DILocation(line: 41, column: 53, scope: !535)
!541 = distinct !DISubprogram(name: "ios.String..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.String", scope: null, file: !150, line: 42, type: !542, isLocal: false, isDefinition: true, scopeLine: 42, isOptimized: false, unit: !1, retainedNodes: !3)
!542 = !DISubroutineType(types: !543)
!543 = !{!69, !434, !434}
!544 = !DILocalVariable(name: "m", arg: 1, scope: !541, file: !150, line: 42, type: !434)
!545 = !DILocation(line: 42, column: 1, scope: !541)
!546 = !DILocation(line: 42, column: 81, scope: !541)
!547 = !DILocation(line: 42, column: 63, scope: !541)
!548 = !DILocation(line: 42, column: 50, scope: !541)
!549 = distinct !DISubprogram(name: "ios.Descriptor..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.Descriptor", scope: null, file: !150, line: 96, type: !550, isLocal: false, isDefinition: true, scopeLine: 96, isOptimized: false, unit: !1, retainedNodes: !3)
!550 = !DISubroutineType(types: !551)
!551 = !{!208, !552, !552}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "StackBar", file: !150, line: 81, size: 896, align: 8, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562, !589}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Title", file: !150, line: 82, baseType: !69, size: 128, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "BackButtonHidden", file: !150, line: 83, baseType: !65, size: 8, align: 8, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "CustomBackButtonTitle", file: !150, line: 84, baseType: !65, size: 8, align: 8, offset: 136)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "BackButtonTitle", file: !150, line: 85, baseType: !69, size: 128, align: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "HasTitleView", file: !150, line: 86, baseType: !65, size: 8, align: 8, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "RightViewCount", file: !150, line: 87, baseType: !281, size: 64, align: 64, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "LeftViewCount", file: !150, line: 88, baseType: !281, size: 64, align: 64, offset: 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "RightItems", file: !150, line: 89, baseType: !563, size: 192, align: 64, offset: 512)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**StackBarItem,int,int}", file: !16, size: 192, align: 8, elements: !564)
!564 = !{!565, !24, !26}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !566, size: 64, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "StackBarItem", file: !150, line: 177, size: 576, align: 8, elements: !569)
!569 = !{!570, !571, !572, !573, !574, !587, !588}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", file: !150, line: 178, baseType: !65, size: 8, align: 8)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "TintColor", file: !150, line: 179, baseType: !221, size: 64, align: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Title", file: !150, line: 180, baseType: !69, size: 128, align: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "TitleStyle", file: !150, line: 181, baseType: !443, size: 64, align: 64, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "Image", file: !150, line: 182, baseType: !575, size: 64, align: 64, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImageOrResource", file: !7, line: 31, size: 192, align: 8, elements: !577)
!577 = !{!578, !586}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Image", file: !7, line: 31, baseType: !579, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !7, line: 31, size: 384, align: 8, elements: !581)
!581 = !{!582, !583, !584, !585}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Width", file: !7, line: 31, baseType: !281, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Height", file: !7, line: 31, baseType: !281, size: 64, align: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Stride", file: !7, line: 31, baseType: !281, size: 64, align: 64, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Data", file: !7, line: 31, baseType: !19, size: 192, align: 64, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !7, line: 31, baseType: !69, size: 128, align: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "TintsImage", file: !150, line: 183, baseType: !65, size: 8, align: 8, offset: 384)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "OnPress", file: !150, line: 184, baseType: !69, size: 128, align: 64, offset: 448)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "LeftItems", file: !150, line: 90, baseType: !563, size: 192, align: 64, offset: 704)
!590 = !DILocalVariable(name: "r.11", arg: 1, scope: !549, file: !150, line: 96, type: !552)
!591 = !DILocation(line: 96, column: 1, scope: !549)
!592 = !DILocation(line: 96, column: 73, scope: !549)
!593 = !DILocalVariable(name: "$ret30", scope: !549, file: !150, line: 96, type: !212)
!594 = !DILocation(line: 96, column: 40, scope: !549)
!595 = !DILocation(line: 96, column: 49, scope: !549)
!596 = distinct !DISubprogram(name: "ios.GetBackButtonHidden..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.GetBackButtonHidden", scope: null, file: !150, line: 105, type: !597, isLocal: false, isDefinition: true, scopeLine: 105, isOptimized: false, unit: !1, retainedNodes: !3)
!597 = !DISubroutineType(types: !598)
!598 = !{!65, !552, !552}
!599 = !DILocalVariable(name: "m", arg: 1, scope: !596, file: !150, line: 105, type: !552)
!600 = !DILocation(line: 105, column: 1, scope: !596)
!601 = !DILocalVariable(name: "$ret32", scope: !596, file: !150, line: 105, type: !65)
!602 = !DILocation(line: 105, column: 42, scope: !596)
!603 = !DILocation(line: 106, column: 7, scope: !596)
!604 = !DILocation(line: 109, column: 2, scope: !596)
!605 = !DILocation(line: 107, column: 11, scope: !596)
!606 = !DILocation(line: 107, column: 3, scope: !596)
!607 = distinct !DISubprogram(name: "ios.GetBackButtonTitle..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.GetBackButtonTitle", scope: null, file: !150, line: 119, type: !608, isLocal: false, isDefinition: true, scopeLine: 119, isOptimized: false, unit: !1, retainedNodes: !3)
!608 = !DISubroutineType(types: !609)
!609 = !{!69, !552, !552}
!610 = !DILocalVariable(name: "m", arg: 1, scope: !607, file: !150, line: 119, type: !552)
!611 = !DILocation(line: 119, column: 1, scope: !607)
!612 = !DILocation(line: 120, column: 7, scope: !607)
!613 = !DILocalVariable(name: "$ret34", scope: !607, file: !150, line: 119, type: !69)
!614 = !DILocation(line: 119, column: 41, scope: !607)
!615 = !DILocation(line: 123, column: 2, scope: !607)
!616 = !DILocation(line: 121, column: 3, scope: !607)
!617 = distinct !DISubprogram(name: "ios.GetCustomBackButtonTitle..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.GetCustomBackButtonTitle", scope: null, file: !150, line: 112, type: !597, isLocal: false, isDefinition: true, scopeLine: 112, isOptimized: false, unit: !1, retainedNodes: !3)
!618 = !DILocalVariable(name: "m", arg: 1, scope: !617, file: !150, line: 112, type: !552)
!619 = !DILocation(line: 112, column: 1, scope: !617)
!620 = !DILocalVariable(name: "$ret33", scope: !617, file: !150, line: 112, type: !65)
!621 = !DILocation(line: 112, column: 47, scope: !617)
!622 = !DILocation(line: 113, column: 7, scope: !617)
!623 = !DILocation(line: 116, column: 2, scope: !617)
!624 = !DILocation(line: 114, column: 11, scope: !617)
!625 = !DILocation(line: 114, column: 3, scope: !617)
!626 = distinct !DISubprogram(name: "ios.GetHasTitleView..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.GetHasTitleView", scope: null, file: !150, line: 126, type: !597, isLocal: false, isDefinition: true, scopeLine: 126, isOptimized: false, unit: !1, retainedNodes: !3)
!627 = !DILocalVariable(name: "m", arg: 1, scope: !626, file: !150, line: 126, type: !552)
!628 = !DILocation(line: 126, column: 1, scope: !626)
!629 = !DILocalVariable(name: "$ret35", scope: !626, file: !150, line: 126, type: !65)
!630 = !DILocation(line: 126, column: 38, scope: !626)
!631 = !DILocation(line: 127, column: 7, scope: !626)
!632 = !DILocation(line: 130, column: 2, scope: !626)
!633 = !DILocation(line: 128, column: 11, scope: !626)
!634 = !DILocation(line: 128, column: 3, scope: !626)
!635 = distinct !DISubprogram(name: "ios.Descriptor..1command_line_arguments.StackBarItem", linkageName: "command_line_arguments.StackBarItem.Descriptor", scope: null, file: !150, line: 190, type: !636, isLocal: false, isDefinition: true, scopeLine: 190, isOptimized: false, unit: !1, retainedNodes: !3)
!636 = !DISubroutineType(types: !637)
!637 = !{!208, !567, !567}
!638 = !DILocalVariable(name: "r.15", arg: 1, scope: !635, file: !150, line: 190, type: !567)
!639 = !DILocation(line: 190, column: 1, scope: !635)
!640 = !DILocation(line: 190, column: 77, scope: !635)
!641 = !DILocalVariable(name: "$ret46", scope: !635, file: !150, line: 190, type: !212)
!642 = !DILocation(line: 190, column: 44, scope: !635)
!643 = !DILocation(line: 190, column: 53, scope: !635)
!644 = distinct !DISubprogram(name: "ios.GetEnabled..1command_line_arguments.StackBarItem", linkageName: "command_line_arguments.StackBarItem.GetEnabled", scope: null, file: !150, line: 192, type: !645, isLocal: false, isDefinition: true, scopeLine: 192, isOptimized: false, unit: !1, retainedNodes: !3)
!645 = !DISubroutineType(types: !646)
!646 = !{!65, !567, !567}
!647 = !DILocalVariable(name: "m", arg: 1, scope: !644, file: !150, line: 192, type: !567)
!648 = !DILocation(line: 192, column: 1, scope: !644)
!649 = !DILocalVariable(name: "$ret47", scope: !644, file: !150, line: 192, type: !65)
!650 = !DILocation(line: 192, column: 37, scope: !644)
!651 = !DILocation(line: 193, column: 7, scope: !644)
!652 = !DILocation(line: 196, column: 2, scope: !644)
!653 = !DILocation(line: 194, column: 11, scope: !644)
!654 = !DILocation(line: 194, column: 3, scope: !644)
!655 = distinct !DISubprogram(name: "ios.GetImage..1command_line_arguments.StackBarItem", linkageName: "command_line_arguments.StackBarItem.GetImage", scope: null, file: !150, line: 220, type: !656, isLocal: false, isDefinition: true, scopeLine: 220, isOptimized: false, unit: !1, retainedNodes: !3)
!656 = !DISubroutineType(types: !657)
!657 = !{!575, !567, !567}
!658 = !DILocalVariable(name: "m", arg: 1, scope: !655, file: !150, line: 220, type: !567)
!659 = !DILocation(line: 220, column: 1, scope: !655)
!660 = !DILocalVariable(name: "$ret51", scope: !655, file: !150, line: 220, type: !575)
!661 = !DILocation(line: 220, column: 35, scope: !655)
!662 = !DILocation(line: 221, column: 7, scope: !655)
!663 = !DILocation(line: 224, column: 2, scope: !655)
!664 = !DILocation(line: 222, column: 11, scope: !655)
!665 = !DILocation(line: 222, column: 3, scope: !655)
!666 = distinct !DISubprogram(name: "ios.GetOnPress..1command_line_arguments.StackBarItem", linkageName: "command_line_arguments.StackBarItem.GetOnPress", scope: null, file: !150, line: 234, type: !667, isLocal: false, isDefinition: true, scopeLine: 234, isOptimized: false, unit: !1, retainedNodes: !3)
!667 = !DISubroutineType(types: !668)
!668 = !{!69, !567, !567}
!669 = !DILocalVariable(name: "m", arg: 1, scope: !666, file: !150, line: 234, type: !567)
!670 = !DILocation(line: 234, column: 1, scope: !666)
!671 = !DILocation(line: 235, column: 7, scope: !666)
!672 = !DILocalVariable(name: "$ret53", scope: !666, file: !150, line: 234, type: !69)
!673 = !DILocation(line: 234, column: 37, scope: !666)
!674 = !DILocation(line: 238, column: 2, scope: !666)
!675 = !DILocation(line: 236, column: 3, scope: !666)
!676 = distinct !DISubprogram(name: "ios.GetTintColor..1command_line_arguments.StackBarItem", linkageName: "command_line_arguments.StackBarItem.GetTintColor", scope: null, file: !150, line: 199, type: !677, isLocal: false, isDefinition: true, scopeLine: 199, isOptimized: false, unit: !1, retainedNodes: !3)
!677 = !DISubroutineType(types: !678)
!678 = !{!221, !567, !567}
!679 = !DILocalVariable(name: "m", arg: 1, scope: !676, file: !150, line: 199, type: !567)
!680 = !DILocation(line: 199, column: 1, scope: !676)
!681 = !DILocalVariable(name: "$ret48", scope: !676, file: !150, line: 199, type: !221)
!682 = !DILocation(line: 199, column: 39, scope: !676)
!683 = !DILocation(line: 200, column: 7, scope: !676)
!684 = !DILocation(line: 203, column: 2, scope: !676)
!685 = !DILocation(line: 201, column: 11, scope: !676)
!686 = !DILocation(line: 201, column: 3, scope: !676)
!687 = distinct !DISubprogram(name: "ios.GetTintsImage..1command_line_arguments.StackBarItem", linkageName: "command_line_arguments.StackBarItem.GetTintsImage", scope: null, file: !150, line: 227, type: !645, isLocal: false, isDefinition: true, scopeLine: 227, isOptimized: false, unit: !1, retainedNodes: !3)
!688 = !DILocalVariable(name: "m", arg: 1, scope: !687, file: !150, line: 227, type: !567)
!689 = !DILocation(line: 227, column: 1, scope: !687)
!690 = !DILocalVariable(name: "$ret52", scope: !687, file: !150, line: 227, type: !65)
!691 = !DILocation(line: 227, column: 40, scope: !687)
!692 = !DILocation(line: 228, column: 7, scope: !687)
!693 = !DILocation(line: 231, column: 2, scope: !687)
!694 = !DILocation(line: 229, column: 11, scope: !687)
!695 = !DILocation(line: 229, column: 3, scope: !687)
!696 = distinct !DISubprogram(name: "ios.GetTitle..1command_line_arguments.StackBarItem", linkageName: "command_line_arguments.StackBarItem.GetTitle", scope: null, file: !150, line: 206, type: !667, isLocal: false, isDefinition: true, scopeLine: 206, isOptimized: false, unit: !1, retainedNodes: !3)
!697 = !DILocalVariable(name: "m", arg: 1, scope: !696, file: !150, line: 206, type: !567)
!698 = !DILocation(line: 206, column: 1, scope: !696)
!699 = !DILocation(line: 207, column: 7, scope: !696)
!700 = !DILocalVariable(name: "$ret49", scope: !696, file: !150, line: 206, type: !69)
!701 = !DILocation(line: 206, column: 35, scope: !696)
!702 = !DILocation(line: 210, column: 2, scope: !696)
!703 = !DILocation(line: 208, column: 3, scope: !696)
!704 = distinct !DISubprogram(name: "ios.GetTitleStyle..1command_line_arguments.StackBarItem", linkageName: "command_line_arguments.StackBarItem.GetTitleStyle", scope: null, file: !150, line: 213, type: !705, isLocal: false, isDefinition: true, scopeLine: 213, isOptimized: false, unit: !1, retainedNodes: !3)
!705 = !DISubroutineType(types: !706)
!706 = !{!443, !567, !567}
!707 = !DILocalVariable(name: "m", arg: 1, scope: !704, file: !150, line: 213, type: !567)
!708 = !DILocation(line: 213, column: 1, scope: !704)
!709 = !DILocalVariable(name: "$ret50", scope: !704, file: !150, line: 213, type: !443)
!710 = !DILocation(line: 213, column: 40, scope: !704)
!711 = !DILocation(line: 214, column: 7, scope: !704)
!712 = !DILocation(line: 217, column: 2, scope: !704)
!713 = !DILocation(line: 215, column: 11, scope: !704)
!714 = !DILocation(line: 215, column: 3, scope: !704)
!715 = distinct !DISubprogram(name: "ios.Reset..1command_line_arguments.StackBarItem", linkageName: "command_line_arguments.StackBarItem.Reset", scope: null, file: !150, line: 187, type: !716, isLocal: false, isDefinition: true, scopeLine: 187, isOptimized: false, unit: !1, retainedNodes: !3)
!716 = !DISubroutineType(types: !717)
!717 = !{!56, !567, !567}
!718 = !DILocalVariable(name: "m", arg: 1, scope: !715, file: !150, line: 187, type: !567)
!719 = !DILocation(line: 187, column: 1, scope: !715)
!720 = !DILocation(line: 187, column: 56, scope: !715)
!721 = distinct !DISubprogram(name: "ios.String..1command_line_arguments.StackBarItem", linkageName: "command_line_arguments.StackBarItem.String", scope: null, file: !150, line: 188, type: !667, isLocal: false, isDefinition: true, scopeLine: 188, isOptimized: false, unit: !1, retainedNodes: !3)
!722 = !DILocalVariable(name: "m", arg: 1, scope: !721, file: !150, line: 188, type: !567)
!723 = !DILocation(line: 188, column: 1, scope: !721)
!724 = !DILocation(line: 188, column: 84, scope: !721)
!725 = !DILocation(line: 188, column: 66, scope: !721)
!726 = !DILocation(line: 188, column: 53, scope: !721)
!727 = distinct !DISubprogram(name: "ios.command_line_arguments.StackBarItem..hash", linkageName: "command_line_arguments.command_line_arguments.StackBarItem..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!728 = !DILocalVariable(name: "key", arg: 1, scope: !727, file: !29, line: 1, type: !55)
!729 = !DILocation(line: 1, column: 1, scope: !727)
!730 = !DILocalVariable(name: "seed", arg: 2, scope: !727, file: !29, line: 1, type: !40)
!731 = !DILocalVariable(name: "$ret77", scope: !727, file: !29, line: 1, type: !40)
!732 = distinct !DISubprogram(name: "ios.command_line_arguments.StackBarItem..eq", linkageName: "command_line_arguments.command_line_arguments.StackBarItem..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!733 = !DILocalVariable(name: "key1", arg: 1, scope: !732, file: !29, line: 1, type: !55)
!734 = !DILocation(line: 1, column: 1, scope: !732)
!735 = !DILocalVariable(name: "key2", arg: 2, scope: !732, file: !29, line: 1, type: !55)
!736 = !DILocalVariable(name: "$ret78", scope: !732, file: !29, line: 1, type: !65)
!737 = distinct !DISubprogram(name: "ios.GetLeftItems..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.GetLeftItems", scope: null, file: !150, line: 154, type: !738, isLocal: false, isDefinition: true, scopeLine: 154, isOptimized: false, unit: !1, retainedNodes: !3)
!738 = !DISubroutineType(types: !739)
!739 = !{!563, !552, !552}
!740 = !DILocalVariable(name: "m", arg: 1, scope: !737, file: !150, line: 154, type: !552)
!741 = !DILocation(line: 154, column: 1, scope: !737)
!742 = !DILocation(line: 155, column: 7, scope: !737)
!743 = !DILocation(line: 158, column: 2, scope: !737)
!744 = !DILocation(line: 156, column: 11, scope: !737)
!745 = !DILocation(line: 156, column: 3, scope: !737)
!746 = distinct !DISubprogram(name: "ios.GetLeftViewCount..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.GetLeftViewCount", scope: null, file: !150, line: 140, type: !747, isLocal: false, isDefinition: true, scopeLine: 140, isOptimized: false, unit: !1, retainedNodes: !3)
!747 = !DISubroutineType(types: !748)
!748 = !{!281, !552, !552}
!749 = !DILocalVariable(name: "m", arg: 1, scope: !746, file: !150, line: 140, type: !552)
!750 = !DILocation(line: 140, column: 1, scope: !746)
!751 = !DILocalVariable(name: "$ret37", scope: !746, file: !150, line: 140, type: !281)
!752 = !DILocation(line: 140, column: 39, scope: !746)
!753 = !DILocation(line: 141, column: 7, scope: !746)
!754 = !DILocation(line: 144, column: 2, scope: !746)
!755 = !DILocation(line: 142, column: 11, scope: !746)
!756 = !DILocation(line: 142, column: 3, scope: !746)
!757 = distinct !DISubprogram(name: "ios.GetRightItems..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.GetRightItems", scope: null, file: !150, line: 147, type: !738, isLocal: false, isDefinition: true, scopeLine: 147, isOptimized: false, unit: !1, retainedNodes: !3)
!758 = !DILocalVariable(name: "m", arg: 1, scope: !757, file: !150, line: 147, type: !552)
!759 = !DILocation(line: 147, column: 1, scope: !757)
!760 = !DILocation(line: 148, column: 7, scope: !757)
!761 = !DILocation(line: 151, column: 2, scope: !757)
!762 = !DILocation(line: 149, column: 11, scope: !757)
!763 = !DILocation(line: 149, column: 3, scope: !757)
!764 = distinct !DISubprogram(name: "ios.GetRightViewCount..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.GetRightViewCount", scope: null, file: !150, line: 133, type: !747, isLocal: false, isDefinition: true, scopeLine: 133, isOptimized: false, unit: !1, retainedNodes: !3)
!765 = !DILocalVariable(name: "m", arg: 1, scope: !764, file: !150, line: 133, type: !552)
!766 = !DILocation(line: 133, column: 1, scope: !764)
!767 = !DILocalVariable(name: "$ret36", scope: !764, file: !150, line: 133, type: !281)
!768 = !DILocation(line: 133, column: 40, scope: !764)
!769 = !DILocation(line: 134, column: 7, scope: !764)
!770 = !DILocation(line: 137, column: 2, scope: !764)
!771 = !DILocation(line: 135, column: 11, scope: !764)
!772 = !DILocation(line: 135, column: 3, scope: !764)
!773 = distinct !DISubprogram(name: "ios.GetTitle..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.GetTitle", scope: null, file: !150, line: 98, type: !608, isLocal: false, isDefinition: true, scopeLine: 98, isOptimized: false, unit: !1, retainedNodes: !3)
!774 = !DILocalVariable(name: "m", arg: 1, scope: !773, file: !150, line: 98, type: !552)
!775 = !DILocation(line: 98, column: 1, scope: !773)
!776 = !DILocation(line: 99, column: 7, scope: !773)
!777 = !DILocalVariable(name: "$ret31", scope: !773, file: !150, line: 98, type: !69)
!778 = !DILocation(line: 98, column: 31, scope: !773)
!779 = !DILocation(line: 102, column: 2, scope: !773)
!780 = !DILocation(line: 100, column: 3, scope: !773)
!781 = distinct !DISubprogram(name: "ios.Reset..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.Reset", scope: null, file: !150, line: 93, type: !782, isLocal: false, isDefinition: true, scopeLine: 93, isOptimized: false, unit: !1, retainedNodes: !3)
!782 = !DISubroutineType(types: !783)
!783 = !{!56, !552, !552}
!784 = !DILocalVariable(name: "m", arg: 1, scope: !781, file: !150, line: 93, type: !552)
!785 = !DILocation(line: 93, column: 1, scope: !781)
!786 = !DILocation(line: 93, column: 52, scope: !781)
!787 = distinct !DISubprogram(name: "ios.String..1command_line_arguments.StackBar", linkageName: "command_line_arguments.StackBar.String", scope: null, file: !150, line: 94, type: !608, isLocal: false, isDefinition: true, scopeLine: 94, isOptimized: false, unit: !1, retainedNodes: !3)
!788 = !DILocalVariable(name: "m", arg: 1, scope: !787, file: !150, line: 94, type: !552)
!789 = !DILocation(line: 94, column: 1, scope: !787)
!790 = !DILocation(line: 94, column: 80, scope: !787)
!791 = !DILocation(line: 94, column: 62, scope: !787)
!792 = !DILocation(line: 94, column: 49, scope: !787)
!793 = distinct !DISubprogram(name: "ios.Descriptor..1command_line_arguments.StackEvent", linkageName: "command_line_arguments.StackEvent.Descriptor", scope: null, file: !150, line: 168, type: !794, isLocal: false, isDefinition: true, scopeLine: 168, isOptimized: false, unit: !1, retainedNodes: !3)
!794 = !DISubroutineType(types: !795)
!795 = !{!208, !796, !796}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "StackEvent", file: !150, line: 161, size: 192, align: 8, elements: !798)
!798 = !{!799}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !150, line: 162, baseType: !800, size: 192, align: 64)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int64,int,int}", file: !16, size: 192, align: 8, elements: !801)
!801 = !{!802, !24, !26}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !803, size: 64, align: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!804 = !DILocalVariable(name: "r.13", arg: 1, scope: !793, file: !150, line: 168, type: !796)
!805 = !DILocation(line: 168, column: 1, scope: !793)
!806 = !DILocation(line: 168, column: 75, scope: !793)
!807 = !DILocalVariable(name: "$ret42", scope: !793, file: !150, line: 168, type: !212)
!808 = !DILocation(line: 168, column: 42, scope: !793)
!809 = !DILocation(line: 168, column: 51, scope: !793)
!810 = distinct !DISubprogram(name: "ios.GetId..1command_line_arguments.StackEvent", linkageName: "command_line_arguments.StackEvent.GetId", scope: null, file: !150, line: 170, type: !811, isLocal: false, isDefinition: true, scopeLine: 170, isOptimized: false, unit: !1, retainedNodes: !3)
!811 = !DISubroutineType(types: !812)
!812 = !{!800, !796, !796}
!813 = !DILocalVariable(name: "m", arg: 1, scope: !810, file: !150, line: 170, type: !796)
!814 = !DILocation(line: 170, column: 1, scope: !810)
!815 = !DILocation(line: 171, column: 7, scope: !810)
!816 = !DILocation(line: 174, column: 2, scope: !810)
!817 = !DILocation(line: 172, column: 3, scope: !810)
!818 = distinct !DISubprogram(name: "ios.Reset..1command_line_arguments.StackEvent", linkageName: "command_line_arguments.StackEvent.Reset", scope: null, file: !150, line: 165, type: !819, isLocal: false, isDefinition: true, scopeLine: 165, isOptimized: false, unit: !1, retainedNodes: !3)
!819 = !DISubroutineType(types: !820)
!820 = !{!56, !796, !796}
!821 = !DILocalVariable(name: "m", arg: 1, scope: !818, file: !150, line: 165, type: !796)
!822 = !DILocation(line: 165, column: 1, scope: !818)
!823 = !DILocation(line: 165, column: 54, scope: !818)
!824 = distinct !DISubprogram(name: "ios.String..1command_line_arguments.StackEvent", linkageName: "command_line_arguments.StackEvent.String", scope: null, file: !150, line: 166, type: !825, isLocal: false, isDefinition: true, scopeLine: 166, isOptimized: false, unit: !1, retainedNodes: !3)
!825 = !DISubroutineType(types: !826)
!826 = !{!69, !796, !796}
!827 = !DILocalVariable(name: "m", arg: 1, scope: !824, file: !150, line: 166, type: !796)
!828 = !DILocation(line: 166, column: 1, scope: !824)
!829 = !DILocation(line: 166, column: 82, scope: !824)
!830 = !DILocation(line: 166, column: 64, scope: !824)
!831 = !DILocation(line: 166, column: 51, scope: !824)
!832 = distinct !DISubprogram(name: "ios.command_line_arguments..init4", linkageName: "command_line_arguments.command_line_arguments..init4", scope: null, file: !150, line: 241, type: !167, isLocal: false, isDefinition: true, scopeLine: 241, isOptimized: false, unit: !1, retainedNodes: !3)
!833 = !DILocation(line: 242, column: 8, scope: !832)
!834 = !DILocation(line: 243, column: 8, scope: !832)
!835 = !DILocation(line: 244, column: 8, scope: !832)
!836 = !DILocation(line: 245, column: 8, scope: !832)
!837 = !DILocation(line: 246, column: 8, scope: !832)
!838 = distinct !DISubprogram(name: "ios.command_line_arguments..init5", linkageName: "command_line_arguments.command_line_arguments..init5", scope: null, file: !150, line: 249, type: !167, isLocal: false, isDefinition: true, scopeLine: 249, isOptimized: false, unit: !1, retainedNodes: !3)
!839 = !DILocation(line: 249, column: 21, scope: !838)
!840 = distinct !DISubprogram(name: "ios.command_line_arguments.TabChildView..hash", linkageName: "command_line_arguments.command_line_arguments.TabChildView..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!841 = !DILocalVariable(name: "key", arg: 1, scope: !840, file: !29, line: 1, type: !55)
!842 = !DILocation(line: 1, column: 1, scope: !840)
!843 = !DILocalVariable(name: "seed", arg: 2, scope: !840, file: !29, line: 1, type: !40)
!844 = !DILocalVariable(name: "$ret79", scope: !840, file: !29, line: 1, type: !40)
!845 = distinct !DISubprogram(name: "ios.command_line_arguments.TabChildView..eq", linkageName: "command_line_arguments.command_line_arguments.TabChildView..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!846 = !DILocalVariable(name: "key1", arg: 1, scope: !845, file: !29, line: 1, type: !55)
!847 = !DILocation(line: 1, column: 1, scope: !845)
!848 = !DILocalVariable(name: "key2", arg: 2, scope: !845, file: !29, line: 1, type: !55)
!849 = !DILocalVariable(name: "$ret80", scope: !845, file: !29, line: 1, type: !65)
!850 = distinct !DISubprogram(name: "ios.Descriptor..1command_line_arguments.TabChildView", linkageName: "command_line_arguments.TabChildView.Descriptor", scope: null, file: !159, line: 27, type: !851, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!851 = !DISubroutineType(types: !852)
!852 = !{!208, !853, !853}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "TabChildView", file: !159, line: 17, size: 384, align: 8, elements: !855)
!855 = !{!856, !857, !858, !859}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "Title", file: !159, line: 18, baseType: !69, size: 128, align: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "Icon", file: !159, line: 19, baseType: !575, size: 64, align: 64, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "SelectedIcon", file: !159, line: 20, baseType: !575, size: 64, align: 64, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "Badge", file: !159, line: 21, baseType: !69, size: 128, align: 64, offset: 256)
!860 = !DILocalVariable(name: "r.17", arg: 1, scope: !850, file: !159, line: 27, type: !853)
!861 = !DILocation(line: 27, column: 1, scope: !850)
!862 = !DILocation(line: 27, column: 77, scope: !850)
!863 = !DILocalVariable(name: "$ret56", scope: !850, file: !159, line: 27, type: !212)
!864 = !DILocation(line: 27, column: 44, scope: !850)
!865 = !DILocation(line: 27, column: 53, scope: !850)
!866 = distinct !DISubprogram(name: "ios.GetBadge..1command_line_arguments.TabChildView", linkageName: "command_line_arguments.TabChildView.GetBadge", scope: null, file: !159, line: 50, type: !867, isLocal: false, isDefinition: true, scopeLine: 50, isOptimized: false, unit: !1, retainedNodes: !3)
!867 = !DISubroutineType(types: !868)
!868 = !{!69, !853, !853}
!869 = !DILocalVariable(name: "m", arg: 1, scope: !866, file: !159, line: 50, type: !853)
!870 = !DILocation(line: 50, column: 1, scope: !866)
!871 = !DILocation(line: 51, column: 7, scope: !866)
!872 = !DILocalVariable(name: "$ret60", scope: !866, file: !159, line: 50, type: !69)
!873 = !DILocation(line: 50, column: 35, scope: !866)
!874 = !DILocation(line: 54, column: 2, scope: !866)
!875 = !DILocation(line: 52, column: 3, scope: !866)
!876 = distinct !DISubprogram(name: "ios.GetIcon..1command_line_arguments.TabChildView", linkageName: "command_line_arguments.TabChildView.GetIcon", scope: null, file: !159, line: 36, type: !877, isLocal: false, isDefinition: true, scopeLine: 36, isOptimized: false, unit: !1, retainedNodes: !3)
!877 = !DISubroutineType(types: !878)
!878 = !{!575, !853, !853}
!879 = !DILocalVariable(name: "m", arg: 1, scope: !876, file: !159, line: 36, type: !853)
!880 = !DILocation(line: 36, column: 1, scope: !876)
!881 = !DILocalVariable(name: "$ret58", scope: !876, file: !159, line: 36, type: !575)
!882 = !DILocation(line: 36, column: 34, scope: !876)
!883 = !DILocation(line: 37, column: 7, scope: !876)
!884 = !DILocation(line: 40, column: 2, scope: !876)
!885 = !DILocation(line: 38, column: 11, scope: !876)
!886 = !DILocation(line: 38, column: 3, scope: !876)
!887 = distinct !DISubprogram(name: "ios.GetSelectedIcon..1command_line_arguments.TabChildView", linkageName: "command_line_arguments.TabChildView.GetSelectedIcon", scope: null, file: !159, line: 43, type: !877, isLocal: false, isDefinition: true, scopeLine: 43, isOptimized: false, unit: !1, retainedNodes: !3)
!888 = !DILocalVariable(name: "m", arg: 1, scope: !887, file: !159, line: 43, type: !853)
!889 = !DILocation(line: 43, column: 1, scope: !887)
!890 = !DILocalVariable(name: "$ret59", scope: !887, file: !159, line: 43, type: !575)
!891 = !DILocation(line: 43, column: 42, scope: !887)
!892 = !DILocation(line: 44, column: 7, scope: !887)
!893 = !DILocation(line: 47, column: 2, scope: !887)
!894 = !DILocation(line: 45, column: 11, scope: !887)
!895 = !DILocation(line: 45, column: 3, scope: !887)
!896 = distinct !DISubprogram(name: "ios.GetTitle..1command_line_arguments.TabChildView", linkageName: "command_line_arguments.TabChildView.GetTitle", scope: null, file: !159, line: 29, type: !867, isLocal: false, isDefinition: true, scopeLine: 29, isOptimized: false, unit: !1, retainedNodes: !3)
!897 = !DILocalVariable(name: "m", arg: 1, scope: !896, file: !159, line: 29, type: !853)
!898 = !DILocation(line: 29, column: 1, scope: !896)
!899 = !DILocation(line: 30, column: 7, scope: !896)
!900 = !DILocalVariable(name: "$ret57", scope: !896, file: !159, line: 29, type: !69)
!901 = !DILocation(line: 29, column: 35, scope: !896)
!902 = !DILocation(line: 33, column: 2, scope: !896)
!903 = !DILocation(line: 31, column: 3, scope: !896)
!904 = distinct !DISubprogram(name: "ios.Reset..1command_line_arguments.TabChildView", linkageName: "command_line_arguments.TabChildView.Reset", scope: null, file: !159, line: 24, type: !905, isLocal: false, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !1, retainedNodes: !3)
!905 = !DISubroutineType(types: !906)
!906 = !{!56, !853, !853}
!907 = !DILocalVariable(name: "m", arg: 1, scope: !904, file: !159, line: 24, type: !853)
!908 = !DILocation(line: 24, column: 1, scope: !904)
!909 = !DILocation(line: 24, column: 56, scope: !904)
!910 = distinct !DISubprogram(name: "ios.String..1command_line_arguments.TabChildView", linkageName: "command_line_arguments.TabChildView.String", scope: null, file: !159, line: 25, type: !867, isLocal: false, isDefinition: true, scopeLine: 25, isOptimized: false, unit: !1, retainedNodes: !3)
!911 = !DILocalVariable(name: "m", arg: 1, scope: !910, file: !159, line: 25, type: !853)
!912 = !DILocation(line: 25, column: 1, scope: !910)
!913 = !DILocation(line: 25, column: 84, scope: !910)
!914 = !DILocation(line: 25, column: 66, scope: !910)
!915 = !DILocation(line: 25, column: 53, scope: !910)
!916 = distinct !DISubprogram(name: "ios.Descriptor..1command_line_arguments.TabView", linkageName: "command_line_arguments.TabView.Descriptor", scope: null, file: !159, line: 70, type: !917, isLocal: false, isDefinition: true, scopeLine: 70, isOptimized: false, unit: !1, retainedNodes: !3)
!917 = !DISubroutineType(types: !918)
!918 = !{!208, !919, !919}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "TabView", file: !159, line: 57, size: 576, align: 8, elements: !921)
!921 = !{!922, !927, !928, !929, !930, !931, !932}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "Screens", file: !159, line: 58, baseType: !923, size: 192, align: 64)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**TabChildView,int,int}", file: !16, size: 192, align: 8, elements: !924)
!924 = !{!925, !24, !26}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "SelectedIndex", file: !159, line: 59, baseType: !281, size: 64, align: 64, offset: 192)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "BarColor", file: !159, line: 60, baseType: !221, size: 64, align: 64, offset: 256)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "SelectedColor", file: !159, line: 61, baseType: !221, size: 64, align: 64, offset: 320)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "UnselectedColor", file: !159, line: 62, baseType: !221, size: 64, align: 64, offset: 384)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "SelectedTextStyle", file: !159, line: 63, baseType: !443, size: 64, align: 64, offset: 448)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "UnselectedTextStyle", file: !159, line: 64, baseType: !443, size: 64, align: 64, offset: 512)
!933 = !DILocalVariable(name: "r.19", arg: 1, scope: !916, file: !159, line: 70, type: !919)
!934 = !DILocation(line: 70, column: 1, scope: !916)
!935 = !DILocation(line: 70, column: 72, scope: !916)
!936 = !DILocalVariable(name: "$ret63", scope: !916, file: !159, line: 70, type: !212)
!937 = !DILocation(line: 70, column: 39, scope: !916)
!938 = !DILocation(line: 70, column: 48, scope: !916)
!939 = distinct !DISubprogram(name: "ios.GetBarColor..1command_line_arguments.TabView", linkageName: "command_line_arguments.TabView.GetBarColor", scope: null, file: !159, line: 86, type: !940, isLocal: false, isDefinition: true, scopeLine: 86, isOptimized: false, unit: !1, retainedNodes: !3)
!940 = !DISubroutineType(types: !941)
!941 = !{!221, !919, !919}
!942 = !DILocalVariable(name: "m", arg: 1, scope: !939, file: !159, line: 86, type: !919)
!943 = !DILocation(line: 86, column: 1, scope: !939)
!944 = !DILocalVariable(name: "$ret66", scope: !939, file: !159, line: 86, type: !221)
!945 = !DILocation(line: 86, column: 33, scope: !939)
!946 = !DILocation(line: 87, column: 7, scope: !939)
!947 = !DILocation(line: 90, column: 2, scope: !939)
!948 = !DILocation(line: 88, column: 11, scope: !939)
!949 = !DILocation(line: 88, column: 3, scope: !939)
!950 = distinct !DISubprogram(name: "ios.GetScreens..1command_line_arguments.TabView", linkageName: "command_line_arguments.TabView.GetScreens", scope: null, file: !159, line: 72, type: !951, isLocal: false, isDefinition: true, scopeLine: 72, isOptimized: false, unit: !1, retainedNodes: !3)
!951 = !DISubroutineType(types: !952)
!952 = !{!923, !919, !919}
!953 = !DILocalVariable(name: "m", arg: 1, scope: !950, file: !159, line: 72, type: !919)
!954 = !DILocation(line: 72, column: 1, scope: !950)
!955 = !DILocation(line: 73, column: 7, scope: !950)
!956 = !DILocation(line: 76, column: 2, scope: !950)
!957 = !DILocation(line: 74, column: 3, scope: !950)
!958 = distinct !DISubprogram(name: "ios.GetSelectedColor..1command_line_arguments.TabView", linkageName: "command_line_arguments.TabView.GetSelectedColor", scope: null, file: !159, line: 93, type: !940, isLocal: false, isDefinition: true, scopeLine: 93, isOptimized: false, unit: !1, retainedNodes: !3)
!959 = !DILocalVariable(name: "m", arg: 1, scope: !958, file: !159, line: 93, type: !919)
!960 = !DILocation(line: 93, column: 1, scope: !958)
!961 = !DILocalVariable(name: "$ret67", scope: !958, file: !159, line: 93, type: !221)
!962 = !DILocation(line: 93, column: 38, scope: !958)
!963 = !DILocation(line: 94, column: 7, scope: !958)
!964 = !DILocation(line: 97, column: 2, scope: !958)
!965 = !DILocation(line: 95, column: 11, scope: !958)
!966 = !DILocation(line: 95, column: 3, scope: !958)
!967 = distinct !DISubprogram(name: "ios.GetSelectedIndex..1command_line_arguments.TabView", linkageName: "command_line_arguments.TabView.GetSelectedIndex", scope: null, file: !159, line: 79, type: !968, isLocal: false, isDefinition: true, scopeLine: 79, isOptimized: false, unit: !1, retainedNodes: !3)
!968 = !DISubroutineType(types: !969)
!969 = !{!281, !919, !919}
!970 = !DILocalVariable(name: "m", arg: 1, scope: !967, file: !159, line: 79, type: !919)
!971 = !DILocation(line: 79, column: 1, scope: !967)
!972 = !DILocalVariable(name: "$ret65", scope: !967, file: !159, line: 79, type: !281)
!973 = !DILocation(line: 79, column: 38, scope: !967)
!974 = !DILocation(line: 80, column: 7, scope: !967)
!975 = !DILocation(line: 83, column: 2, scope: !967)
!976 = !DILocation(line: 81, column: 11, scope: !967)
!977 = !DILocation(line: 81, column: 3, scope: !967)
