; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22text\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/golang/protobuf/proto\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/golang/protobuf/proto\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22layout\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22gomatcha.io/matcha/proto/layout\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22gomatcha.io/matcha/proto/layout\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22math\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./text.pb.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha/proto/text")
!3 = !{}
!4 = !{!5, !109, !111, !127, !137, !152, !154, !156, !158, !160, !162, !164, !166, !168, !170}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments._.0", linkageName: "command_line_arguments._.0", scope: !1, file: !7, line: 25, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "text.pb.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 19, size: 64, align: 8, elements: !10)
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 19, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !95}
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !16, size: 320, align: 8, elements: !17)
!16 = !DIFile(filename: "", directory: "")
!17 = !{!18, !27}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 19, baseType: !19, size: 192, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !16, size: 192, align: 8, elements: !20)
!20 = !{!21, !24, !26}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !16, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !16, line: 1, baseType: !25, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 19, baseType: !28, size: 128, align: 64, offset: 192)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !29, line: 1, size: 128, align: 8, elements: !30)
!29 = !DIFile(filename: "<built-in>", directory: "")
!30 = !{!31, !94}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !29, line: 1, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !16, size: 128, align: 8, elements: !34)
!34 = !{!35, !90}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 1, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !29, line: 1, size: 576, align: 8, elements: !38)
!38 = !{!39, !41, !42, !44, !45, !46, !47, !57, !66, !67, !73, !89}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !29, line: 1, baseType: !40, size: 64, align: 64)
!40 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !29, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !29, line: 1, baseType: !43, size: 32, align: 32, offset: 128)
!43 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 168)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 176)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !29, line: 1, baseType: !48, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !29, line: 1, size: 64, align: 8, elements: !50)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !29, line: 1, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!40, !55, !40}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIBasicType(name: "void")
!57 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !29, line: 1, baseType: !58, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !29, line: 1, size: 64, align: 8, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !29, line: 1, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !55, !55}
!65 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !29, line: 1, baseType: !22, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !29, line: 1, baseType: !68, size: 64, align: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !29, line: 1, size: 128, align: 8, elements: !70)
!70 = !{!71, !72}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !29, line: 1, baseType: !22, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !29, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !29, line: 1, baseType: !74, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !29, line: 1, size: 320, align: 8, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !29, line: 1, baseType: !68, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !29, line: 1, baseType: !68, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !29, line: 1, baseType: !80, size: 192, align: 64, offset: 128)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !16, size: 192, align: 8, elements: !81)
!81 = !{!82, !24, !26}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !29, line: 1, size: 320, align: 8, elements: !85)
!85 = !{!77, !78, !86, !87, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !16, line: 1, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!69, !55}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !7, line: 19, size: 128, align: 8, elements: !96)
!96 = !{!97, !108}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 19, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void,*func(*void)string}", file: !16, size: 256, align: 8, elements: !100)
!100 = !{!101, !102, !106, !107}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 19, baseType: !36, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMessage", file: !16, line: 19, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!56, !55}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", file: !16, line: 19, baseType: !103, size: 64, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !16, line: 19, baseType: !91, size: 64, align: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !29, line: 1, type: !43, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "command_line_arguments._.1", linkageName: "command_line_arguments._.1", scope: !1, file: !7, line: 26, type: !113, isLocal: false, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 20, size: 64, align: 8, elements: !115)
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 20, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!28, !69, !120}
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*void},int,int}", file: !16, size: 192, align: 8, elements: !121)
!121 = !{!122, !24, !26}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !16, size: 128, align: 8, elements: !125)
!125 = !{!35, !126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !16, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "command_line_arguments._.2", linkageName: "command_line_arguments._.2", scope: !1, file: !7, line: 27, type: !129, isLocal: false, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 21, size: 64, align: 8, elements: !131)
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 21, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !25}
!136 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "command_line_arguments.TextAlignment_name", linkageName: "command_line_arguments.TextAlignment_name", scope: !1, file: !7, line: 44, type: !139, isLocal: false, isDefinition: true)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !29, line: 1, size: 384, align: 8, elements: !141)
!141 = !{!142, !143, !144, !145, !147, !148, !149, !150, !151}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !29, line: 1, baseType: !25, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 72)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !29, line: 1, baseType: !146, size: 16, align: 16, offset: 80)
!146 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !29, line: 1, baseType: !43, size: 32, align: 32, offset: 96)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !29, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 320)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "command_line_arguments.TextAlignment_value", linkageName: "command_line_arguments.TextAlignment_value", scope: !1, file: !7, line: 50, type: !139, isLocal: false, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor0", linkageName: "command_line_arguments.fileDescriptor0", scope: !1, file: !7, line: 522, type: !19, isLocal: true, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "command_line_arguments.StrikethroughStyle_name", linkageName: "command_line_arguments.StrikethroughStyle_name", scope: !1, file: !7, line: 73, type: !139, isLocal: false, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "command_line_arguments.StrikethroughStyle_value", linkageName: "command_line_arguments.StrikethroughStyle_value", scope: !1, file: !7, line: 81, type: !139, isLocal: false, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "command_line_arguments.UnderlineStyle_name", linkageName: "command_line_arguments.UnderlineStyle_name", scope: !1, file: !7, line: 106, type: !139, isLocal: false, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "command_line_arguments.UnderlineStyle_value", linkageName: "command_line_arguments.UnderlineStyle_value", scope: !1, file: !7, line: 114, type: !139, isLocal: false, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "command_line_arguments.TextWrap_name", linkageName: "command_line_arguments.TextWrap_name", scope: !1, file: !7, line: 136, type: !139, isLocal: false, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "command_line_arguments.TextWrap_value", linkageName: "command_line_arguments.TextWrap_value", scope: !1, file: !7, line: 141, type: !139, isLocal: false, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "command_line_arguments.Truncation_name", linkageName: "command_line_arguments.Truncation_name", scope: !1, file: !7, line: 161, type: !139, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "command_line_arguments.Truncation_value", linkageName: "command_line_arguments.Truncation_value", scope: !1, file: !7, line: 167, type: !139, isLocal: false, isDefinition: true)
!172 = distinct !DISubprogram(name: "text.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 17, type: !173, isLocal: false, isDefinition: true, scopeLine: 17, isOptimized: false, unit: !1, retainedNodes: !3)
!173 = !DISubroutineType(types: !174)
!174 = !{!56}
!175 = !DILocation(line: 1, column: 1, scope: !176)
!176 = !DILexicalBlockFile(scope: !172, file: !29, discriminator: 0)
!177 = !DILocation(line: 25, column: 5, scope: !178)
!178 = !DILexicalBlockFile(scope: !172, file: !7, discriminator: 0)
!179 = !DILocation(line: 26, column: 5, scope: !178)
!180 = !DILocation(line: 27, column: 5, scope: !178)
!181 = !DILocation(line: 44, column: 26, scope: !178)
!182 = !DILocation(line: 44, column: 5, scope: !178)
!183 = !DILocation(line: 50, column: 27, scope: !178)
!184 = !DILocation(line: 50, column: 5, scope: !178)
!185 = !DILocation(line: 73, column: 31, scope: !178)
!186 = !DILocation(line: 73, column: 5, scope: !178)
!187 = !DILocation(line: 81, column: 32, scope: !178)
!188 = !DILocation(line: 81, column: 5, scope: !178)
!189 = !DILocation(line: 106, column: 27, scope: !178)
!190 = !DILocation(line: 106, column: 5, scope: !178)
!191 = !DILocation(line: 114, column: 28, scope: !178)
!192 = !DILocation(line: 114, column: 5, scope: !178)
!193 = !DILocation(line: 136, column: 21, scope: !178)
!194 = !DILocation(line: 136, column: 5, scope: !178)
!195 = !DILocation(line: 141, column: 22, scope: !178)
!196 = !DILocation(line: 141, column: 5, scope: !178)
!197 = !DILocation(line: 161, column: 23, scope: !178)
!198 = !DILocation(line: 161, column: 5, scope: !178)
!199 = !DILocation(line: 167, column: 24, scope: !178)
!200 = !DILocation(line: 167, column: 5, scope: !178)
!201 = !DILocation(line: 507, column: 1, scope: !178)
!202 = !DILocation(line: 520, column: 1, scope: !178)
!203 = distinct !DISubprogram(name: "text.EnumDescriptor.command_line_arguments.TextAlignment", linkageName: "command_line_arguments.TextAlignment.EnumDescriptor", scope: null, file: !7, line: 60, type: !204, isLocal: false, isDefinition: true, scopeLine: 60, isOptimized: false, unit: !1, retainedNodes: !3)
!204 = !DISubroutineType(types: !205)
!205 = !{!206, !214, !214}
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},struct{*int,int,int}}", file: !16, size: 384, align: 8, elements: !207)
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 60, baseType: !19, size: 192, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 60, baseType: !210, size: 192, align: 64, offset: 192)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !16, size: 192, align: 8, elements: !211)
!211 = !{!212, !24, !26}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIBasicType(name: "TextAlignment", size: 32, encoding: DW_ATE_signed)
!216 = !DILocalVariable(name: "r.0.pointer", arg: 1, scope: !203, file: !7, line: 60, type: !214)
!217 = !DILocation(line: 60, column: 1, scope: !203)
!218 = !DILocalVariable(name: "r.0", scope: !203, file: !7, line: 60, type: !215)
!219 = !DILocation(line: 60, column: 81, scope: !203)
!220 = !DILocalVariable(name: "$ret2", scope: !203, file: !7, line: 60, type: !210)
!221 = !DILocation(line: 60, column: 48, scope: !203)
!222 = !DILocation(line: 60, column: 57, scope: !203)
!223 = distinct !DISubprogram(name: "text.String.command_line_arguments.TextAlignment", linkageName: "command_line_arguments.TextAlignment.String", scope: null, file: !7, line: 57, type: !224, isLocal: false, isDefinition: true, scopeLine: 57, isOptimized: false, unit: !1, retainedNodes: !3)
!224 = !DISubroutineType(types: !225)
!225 = !{!69, !214, !214}
!226 = !DILocalVariable(name: "pointer", arg: 1, scope: !223, file: !7, line: 57, type: !214)
!227 = !DILocation(line: 57, column: 1, scope: !223)
!228 = !DILocalVariable(name: "x", scope: !223, file: !7, line: 57, type: !215)
!229 = !DILocation(line: 58, column: 24, scope: !223)
!230 = !DILocation(line: 58, column: 15, scope: !223)
!231 = !DILocation(line: 58, column: 2, scope: !223)
!232 = distinct !DISubprogram(name: "text.EnumDescriptor.command_line_arguments.StrikethroughStyle", linkageName: "command_line_arguments.StrikethroughStyle.EnumDescriptor", scope: null, file: !7, line: 93, type: !233, isLocal: false, isDefinition: true, scopeLine: 93, isOptimized: false, unit: !1, retainedNodes: !3)
!233 = !DISubroutineType(types: !234)
!234 = !{!206, !235, !235}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIBasicType(name: "StrikethroughStyle", size: 32, encoding: DW_ATE_signed)
!237 = !DILocalVariable(name: "r.1.pointer", arg: 1, scope: !232, file: !7, line: 93, type: !235)
!238 = !DILocation(line: 93, column: 1, scope: !232)
!239 = !DILocalVariable(name: "r.1", scope: !232, file: !7, line: 93, type: !236)
!240 = !DILocation(line: 93, column: 86, scope: !232)
!241 = !DILocalVariable(name: "$ret5", scope: !232, file: !7, line: 93, type: !210)
!242 = !DILocation(line: 93, column: 53, scope: !232)
!243 = !DILocation(line: 93, column: 62, scope: !232)
!244 = distinct !DISubprogram(name: "text.String.command_line_arguments.StrikethroughStyle", linkageName: "command_line_arguments.StrikethroughStyle.String", scope: null, file: !7, line: 90, type: !245, isLocal: false, isDefinition: true, scopeLine: 90, isOptimized: false, unit: !1, retainedNodes: !3)
!245 = !DISubroutineType(types: !246)
!246 = !{!69, !235, !235}
!247 = !DILocalVariable(name: "pointer", arg: 1, scope: !244, file: !7, line: 90, type: !235)
!248 = !DILocation(line: 90, column: 1, scope: !244)
!249 = !DILocalVariable(name: "x", scope: !244, file: !7, line: 90, type: !236)
!250 = !DILocation(line: 91, column: 24, scope: !244)
!251 = !DILocation(line: 91, column: 15, scope: !244)
!252 = !DILocation(line: 91, column: 2, scope: !244)
!253 = distinct !DISubprogram(name: "text.EnumDescriptor.command_line_arguments.UnderlineStyle", linkageName: "command_line_arguments.UnderlineStyle.EnumDescriptor", scope: null, file: !7, line: 126, type: !254, isLocal: false, isDefinition: true, scopeLine: 126, isOptimized: false, unit: !1, retainedNodes: !3)
!254 = !DISubroutineType(types: !255)
!255 = !{!206, !256, !256}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIBasicType(name: "UnderlineStyle", size: 32, encoding: DW_ATE_signed)
!258 = !DILocalVariable(name: "r.2.pointer", arg: 1, scope: !253, file: !7, line: 126, type: !256)
!259 = !DILocation(line: 126, column: 1, scope: !253)
!260 = !DILocalVariable(name: "r.2", scope: !253, file: !7, line: 126, type: !257)
!261 = !DILocation(line: 126, column: 82, scope: !253)
!262 = !DILocalVariable(name: "$ret8", scope: !253, file: !7, line: 126, type: !210)
!263 = !DILocation(line: 126, column: 49, scope: !253)
!264 = !DILocation(line: 126, column: 58, scope: !253)
!265 = distinct !DISubprogram(name: "text.String.command_line_arguments.UnderlineStyle", linkageName: "command_line_arguments.UnderlineStyle.String", scope: null, file: !7, line: 123, type: !266, isLocal: false, isDefinition: true, scopeLine: 123, isOptimized: false, unit: !1, retainedNodes: !3)
!266 = !DISubroutineType(types: !267)
!267 = !{!69, !256, !256}
!268 = !DILocalVariable(name: "pointer", arg: 1, scope: !265, file: !7, line: 123, type: !256)
!269 = !DILocation(line: 123, column: 1, scope: !265)
!270 = !DILocalVariable(name: "x", scope: !265, file: !7, line: 123, type: !257)
!271 = !DILocation(line: 124, column: 24, scope: !265)
!272 = !DILocation(line: 124, column: 15, scope: !265)
!273 = !DILocation(line: 124, column: 2, scope: !265)
!274 = distinct !DISubprogram(name: "text.EnumDescriptor.command_line_arguments.TextWrap", linkageName: "command_line_arguments.TextWrap.EnumDescriptor", scope: null, file: !7, line: 150, type: !275, isLocal: false, isDefinition: true, scopeLine: 150, isOptimized: false, unit: !1, retainedNodes: !3)
!275 = !DISubroutineType(types: !276)
!276 = !{!206, !277, !277}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIBasicType(name: "TextWrap", size: 32, encoding: DW_ATE_signed)
!279 = !DILocalVariable(name: "r.3.pointer", arg: 1, scope: !274, file: !7, line: 150, type: !277)
!280 = !DILocation(line: 150, column: 1, scope: !274)
!281 = !DILocalVariable(name: "r.3", scope: !274, file: !7, line: 150, type: !278)
!282 = !DILocation(line: 150, column: 76, scope: !274)
!283 = !DILocalVariable(name: "$ret11", scope: !274, file: !7, line: 150, type: !210)
!284 = !DILocation(line: 150, column: 43, scope: !274)
!285 = !DILocation(line: 150, column: 52, scope: !274)
!286 = distinct !DISubprogram(name: "text.String.command_line_arguments.TextWrap", linkageName: "command_line_arguments.TextWrap.String", scope: null, file: !7, line: 147, type: !287, isLocal: false, isDefinition: true, scopeLine: 147, isOptimized: false, unit: !1, retainedNodes: !3)
!287 = !DISubroutineType(types: !288)
!288 = !{!69, !277, !277}
!289 = !DILocalVariable(name: "pointer", arg: 1, scope: !286, file: !7, line: 147, type: !277)
!290 = !DILocation(line: 147, column: 1, scope: !286)
!291 = !DILocalVariable(name: "x", scope: !286, file: !7, line: 147, type: !278)
!292 = !DILocation(line: 148, column: 24, scope: !286)
!293 = !DILocation(line: 148, column: 15, scope: !286)
!294 = !DILocation(line: 148, column: 2, scope: !286)
!295 = distinct !DISubprogram(name: "text.EnumDescriptor.command_line_arguments.Truncation", linkageName: "command_line_arguments.Truncation.EnumDescriptor", scope: null, file: !7, line: 177, type: !296, isLocal: false, isDefinition: true, scopeLine: 177, isOptimized: false, unit: !1, retainedNodes: !3)
!296 = !DISubroutineType(types: !297)
!297 = !{!206, !298, !298}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIBasicType(name: "Truncation", size: 32, encoding: DW_ATE_signed)
!300 = !DILocalVariable(name: "r.4.pointer", arg: 1, scope: !295, file: !7, line: 177, type: !298)
!301 = !DILocation(line: 177, column: 1, scope: !295)
!302 = !DILocalVariable(name: "r.4", scope: !295, file: !7, line: 177, type: !299)
!303 = !DILocation(line: 177, column: 78, scope: !295)
!304 = !DILocalVariable(name: "$ret14", scope: !295, file: !7, line: 177, type: !210)
!305 = !DILocation(line: 177, column: 45, scope: !295)
!306 = !DILocation(line: 177, column: 54, scope: !295)
!307 = distinct !DISubprogram(name: "text.String.command_line_arguments.Truncation", linkageName: "command_line_arguments.Truncation.String", scope: null, file: !7, line: 174, type: !308, isLocal: false, isDefinition: true, scopeLine: 174, isOptimized: false, unit: !1, retainedNodes: !3)
!308 = !DISubroutineType(types: !309)
!309 = !{!69, !298, !298}
!310 = !DILocalVariable(name: "pointer", arg: 1, scope: !307, file: !7, line: 174, type: !298)
!311 = !DILocation(line: 174, column: 1, scope: !307)
!312 = !DILocalVariable(name: "x", scope: !307, file: !7, line: 174, type: !299)
!313 = !DILocation(line: 175, column: 24, scope: !307)
!314 = !DILocation(line: 175, column: 15, scope: !307)
!315 = !DILocation(line: 175, column: 2, scope: !307)
!316 = distinct !DISubprogram(name: "text.command_line_arguments.SizeFunc..hash", linkageName: "command_line_arguments.command_line_arguments.SizeFunc..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!317 = !DILocalVariable(name: "key", arg: 1, scope: !316, file: !29, line: 1, type: !55)
!318 = !DILocation(line: 1, column: 1, scope: !316)
!319 = !DILocalVariable(name: "seed", arg: 2, scope: !316, file: !29, line: 1, type: !40)
!320 = !DILocalVariable(name: "$ret66", scope: !316, file: !29, line: 1, type: !40)
!321 = distinct !DISubprogram(name: "text.command_line_arguments.SizeFunc..eq", linkageName: "command_line_arguments.command_line_arguments.SizeFunc..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!322 = !DILocalVariable(name: "key1", arg: 1, scope: !321, file: !29, line: 1, type: !55)
!323 = !DILocation(line: 1, column: 1, scope: !321)
!324 = !DILocalVariable(name: "key2", arg: 2, scope: !321, file: !29, line: 1, type: !55)
!325 = !DILocalVariable(name: "$ret67", scope: !321, file: !29, line: 1, type: !65)
!326 = distinct !DISubprogram(name: "text.Descriptor..1command_line_arguments.SizeFunc", linkageName: "command_line_arguments.SizeFunc.Descriptor", scope: null, file: !7, line: 188, type: !327, isLocal: false, isDefinition: true, scopeLine: 188, isOptimized: false, unit: !1, retainedNodes: !3)
!327 = !DISubroutineType(types: !328)
!328 = !{!206, !329, !329}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "SizeFunc", file: !7, line: 179, size: 192, align: 8, elements: !331)
!331 = !{!332, !377, !383}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Text", file: !7, line: 180, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "StyledText", file: !7, line: 227, size: 256, align: 8, elements: !335)
!335 = !{!336, !372}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Styles", file: !7, line: 228, baseType: !337, size: 192, align: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**TextStyle,int,int}", file: !16, size: 192, align: 8, elements: !338)
!338 = !{!339, !24, !26}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "TextStyle", file: !7, line: 283, size: 1280, align: 8, elements: !343)
!343 = !{!344, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !7, line: 284, baseType: !345, size: 64, align: 64)
!345 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "TextAlignment", file: !7, line: 285, baseType: !215, size: 32, align: 32, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughStyle", file: !7, line: 286, baseType: !236, size: 32, align: 32, offset: 96)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "HasStrikethroughColor", file: !7, line: 287, baseType: !65, size: 8, align: 8, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorRed", file: !7, line: 288, baseType: !43, size: 32, align: 32, offset: 160)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorGreen", file: !7, line: 289, baseType: !43, size: 32, align: 32, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorBlue", file: !7, line: 290, baseType: !43, size: 32, align: 32, offset: 224)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorAlpha", file: !7, line: 291, baseType: !43, size: 32, align: 32, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineStyle", file: !7, line: 292, baseType: !257, size: 32, align: 32, offset: 288)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "HasUnderlineColor", file: !7, line: 293, baseType: !65, size: 8, align: 8, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorRed", file: !7, line: 294, baseType: !43, size: 32, align: 32, offset: 352)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorGreen", file: !7, line: 295, baseType: !43, size: 32, align: 32, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorBlue", file: !7, line: 296, baseType: !43, size: 32, align: 32, offset: 416)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorAlpha", file: !7, line: 297, baseType: !43, size: 32, align: 32, offset: 448)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Hyphenation", file: !7, line: 298, baseType: !136, size: 64, align: 64, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "LineHeightMultiple", file: !7, line: 299, baseType: !136, size: 64, align: 64, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "MaxLines", file: !7, line: 300, baseType: !345, size: 64, align: 64, offset: 640)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "HasTextColor", file: !7, line: 301, baseType: !65, size: 8, align: 8, offset: 704)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorRed", file: !7, line: 302, baseType: !43, size: 32, align: 32, offset: 736)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorGreen", file: !7, line: 303, baseType: !43, size: 32, align: 32, offset: 768)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorBlue", file: !7, line: 304, baseType: !43, size: 32, align: 32, offset: 800)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorAlpha", file: !7, line: 305, baseType: !43, size: 32, align: 32, offset: 832)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Wrap", file: !7, line: 306, baseType: !278, size: 32, align: 32, offset: 864)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Truncation", file: !7, line: 307, baseType: !299, size: 32, align: 32, offset: 896)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "TruncationString", file: !7, line: 308, baseType: !69, size: 128, align: 64, offset: 960)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "FontName", file: !7, line: 309, baseType: !69, size: 128, align: 64, offset: 1088)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "FontSize", file: !7, line: 310, baseType: !136, size: 64, align: 64, offset: 1216)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Text", file: !7, line: 229, baseType: !373, size: 64, align: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "Text", file: !7, line: 211, size: 128, align: 8, elements: !375)
!375 = !{!376}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Text", file: !7, line: 212, baseType: !69, size: 128, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "MinSize", file: !7, line: 181, baseType: !378, size: 64, align: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "Point", file: !7, line: 22, size: 128, align: 8, elements: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "X", file: !7, line: 22, baseType: !136, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Y", file: !7, line: 22, baseType: !136, size: 64, align: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "MaxSize", file: !7, line: 182, baseType: !378, size: 64, align: 64, offset: 128)
!384 = !DILocalVariable(name: "r.6", arg: 1, scope: !326, file: !7, line: 188, type: !329)
!385 = !DILocation(line: 188, column: 1, scope: !326)
!386 = !DILocation(line: 188, column: 73, scope: !326)
!387 = !DILocalVariable(name: "$ret17", scope: !326, file: !7, line: 188, type: !210)
!388 = !DILocation(line: 188, column: 40, scope: !326)
!389 = !DILocation(line: 188, column: 49, scope: !326)
!390 = distinct !DISubprogram(name: "text.GetMaxSize..1command_line_arguments.SizeFunc", linkageName: "command_line_arguments.SizeFunc.GetMaxSize", scope: null, file: !7, line: 204, type: !391, isLocal: false, isDefinition: true, scopeLine: 204, isOptimized: false, unit: !1, retainedNodes: !3)
!391 = !DISubroutineType(types: !392)
!392 = !{!378, !329, !329}
!393 = !DILocalVariable(name: "m", arg: 1, scope: !390, file: !7, line: 204, type: !329)
!394 = !DILocation(line: 204, column: 1, scope: !390)
!395 = !DILocalVariable(name: "$ret20", scope: !390, file: !7, line: 204, type: !378)
!396 = !DILocation(line: 204, column: 33, scope: !390)
!397 = !DILocation(line: 205, column: 7, scope: !390)
!398 = !DILocation(line: 208, column: 2, scope: !390)
!399 = !DILocation(line: 206, column: 11, scope: !390)
!400 = !DILocation(line: 206, column: 3, scope: !390)
!401 = distinct !DISubprogram(name: "text.GetMinSize..1command_line_arguments.SizeFunc", linkageName: "command_line_arguments.SizeFunc.GetMinSize", scope: null, file: !7, line: 197, type: !391, isLocal: false, isDefinition: true, scopeLine: 197, isOptimized: false, unit: !1, retainedNodes: !3)
!402 = !DILocalVariable(name: "m", arg: 1, scope: !401, file: !7, line: 197, type: !329)
!403 = !DILocation(line: 197, column: 1, scope: !401)
!404 = !DILocalVariable(name: "$ret19", scope: !401, file: !7, line: 197, type: !378)
!405 = !DILocation(line: 197, column: 33, scope: !401)
!406 = !DILocation(line: 198, column: 7, scope: !401)
!407 = !DILocation(line: 201, column: 2, scope: !401)
!408 = !DILocation(line: 199, column: 11, scope: !401)
!409 = !DILocation(line: 199, column: 3, scope: !401)
!410 = distinct !DISubprogram(name: "text.Descriptor..1command_line_arguments.StyledText", linkageName: "command_line_arguments.StyledText.Descriptor", scope: null, file: !7, line: 235, type: !411, isLocal: false, isDefinition: true, scopeLine: 235, isOptimized: false, unit: !1, retainedNodes: !3)
!411 = !DISubroutineType(types: !412)
!412 = !{!206, !333, !333}
!413 = !DILocalVariable(name: "r.10", arg: 1, scope: !410, file: !7, line: 235, type: !333)
!414 = !DILocation(line: 235, column: 1, scope: !410)
!415 = !DILocation(line: 235, column: 75, scope: !410)
!416 = !DILocalVariable(name: "$ret27", scope: !410, file: !7, line: 235, type: !210)
!417 = !DILocation(line: 235, column: 42, scope: !410)
!418 = !DILocation(line: 235, column: 51, scope: !410)
!419 = distinct !DISubprogram(name: "text.Descriptor..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.Descriptor", scope: null, file: !7, line: 316, type: !420, isLocal: false, isDefinition: true, scopeLine: 316, isOptimized: false, unit: !1, retainedNodes: !3)
!420 = !DISubroutineType(types: !421)
!421 = !{!206, !341, !341}
!422 = !DILocalVariable(name: "r.14", arg: 1, scope: !419, file: !7, line: 316, type: !341)
!423 = !DILocation(line: 316, column: 1, scope: !419)
!424 = !DILocation(line: 316, column: 74, scope: !419)
!425 = !DILocalVariable(name: "$ret38", scope: !419, file: !7, line: 316, type: !210)
!426 = !DILocation(line: 316, column: 41, scope: !419)
!427 = !DILocation(line: 316, column: 50, scope: !419)
!428 = distinct !DISubprogram(name: "text.GetFontName..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetFontName", scope: null, file: !7, line: 493, type: !429, isLocal: false, isDefinition: true, scopeLine: 493, isOptimized: false, unit: !1, retainedNodes: !3)
!429 = !DISubroutineType(types: !430)
!430 = !{!69, !341, !341}
!431 = !DILocalVariable(name: "m", arg: 1, scope: !428, file: !7, line: 493, type: !341)
!432 = !DILocation(line: 493, column: 1, scope: !428)
!433 = !DILocation(line: 494, column: 7, scope: !428)
!434 = !DILocalVariable(name: "$ret64", scope: !428, file: !7, line: 493, type: !69)
!435 = !DILocation(line: 493, column: 35, scope: !428)
!436 = !DILocation(line: 497, column: 2, scope: !428)
!437 = !DILocation(line: 495, column: 3, scope: !428)
!438 = distinct !DISubprogram(name: "text.GetFontSize..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetFontSize", scope: null, file: !7, line: 500, type: !439, isLocal: false, isDefinition: true, scopeLine: 500, isOptimized: false, unit: !1, retainedNodes: !3)
!439 = !DISubroutineType(types: !440)
!440 = !{!136, !341, !341}
!441 = !DILocalVariable(name: "m", arg: 1, scope: !438, file: !7, line: 500, type: !341)
!442 = !DILocation(line: 500, column: 1, scope: !438)
!443 = !DILocalVariable(name: "$ret65", scope: !438, file: !7, line: 500, type: !136)
!444 = !DILocation(line: 500, column: 35, scope: !438)
!445 = !DILocation(line: 501, column: 7, scope: !438)
!446 = !DILocation(line: 504, column: 2, scope: !438)
!447 = !DILocation(line: 502, column: 11, scope: !438)
!448 = !DILocation(line: 502, column: 3, scope: !438)
!449 = distinct !DISubprogram(name: "text.GetHasStrikethroughColor..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetHasStrikethroughColor", scope: null, file: !7, line: 339, type: !450, isLocal: false, isDefinition: true, scopeLine: 339, isOptimized: false, unit: !1, retainedNodes: !3)
!450 = !DISubroutineType(types: !451)
!451 = !{!65, !341, !341}
!452 = !DILocalVariable(name: "m", arg: 1, scope: !449, file: !7, line: 339, type: !341)
!453 = !DILocation(line: 339, column: 1, scope: !449)
!454 = !DILocalVariable(name: "$ret42", scope: !449, file: !7, line: 339, type: !65)
!455 = !DILocation(line: 339, column: 48, scope: !449)
!456 = !DILocation(line: 340, column: 7, scope: !449)
!457 = !DILocation(line: 343, column: 2, scope: !449)
!458 = !DILocation(line: 341, column: 11, scope: !449)
!459 = !DILocation(line: 341, column: 3, scope: !449)
!460 = distinct !DISubprogram(name: "text.GetHasTextColor..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetHasTextColor", scope: null, file: !7, line: 437, type: !450, isLocal: false, isDefinition: true, scopeLine: 437, isOptimized: false, unit: !1, retainedNodes: !3)
!461 = !DILocalVariable(name: "m", arg: 1, scope: !460, file: !7, line: 437, type: !341)
!462 = !DILocation(line: 437, column: 1, scope: !460)
!463 = !DILocalVariable(name: "$ret56", scope: !460, file: !7, line: 437, type: !65)
!464 = !DILocation(line: 437, column: 39, scope: !460)
!465 = !DILocation(line: 438, column: 7, scope: !460)
!466 = !DILocation(line: 441, column: 2, scope: !460)
!467 = !DILocation(line: 439, column: 11, scope: !460)
!468 = !DILocation(line: 439, column: 3, scope: !460)
!469 = distinct !DISubprogram(name: "text.GetHasUnderlineColor..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetHasUnderlineColor", scope: null, file: !7, line: 381, type: !450, isLocal: false, isDefinition: true, scopeLine: 381, isOptimized: false, unit: !1, retainedNodes: !3)
!470 = !DILocalVariable(name: "m", arg: 1, scope: !469, file: !7, line: 381, type: !341)
!471 = !DILocation(line: 381, column: 1, scope: !469)
!472 = !DILocalVariable(name: "$ret48", scope: !469, file: !7, line: 381, type: !65)
!473 = !DILocation(line: 381, column: 44, scope: !469)
!474 = !DILocation(line: 382, column: 7, scope: !469)
!475 = !DILocation(line: 385, column: 2, scope: !469)
!476 = !DILocation(line: 383, column: 11, scope: !469)
!477 = !DILocation(line: 383, column: 3, scope: !469)
!478 = distinct !DISubprogram(name: "text.GetHyphenation..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetHyphenation", scope: null, file: !7, line: 416, type: !439, isLocal: false, isDefinition: true, scopeLine: 416, isOptimized: false, unit: !1, retainedNodes: !3)
!479 = !DILocalVariable(name: "m", arg: 1, scope: !478, file: !7, line: 416, type: !341)
!480 = !DILocation(line: 416, column: 1, scope: !478)
!481 = !DILocalVariable(name: "$ret53", scope: !478, file: !7, line: 416, type: !136)
!482 = !DILocation(line: 416, column: 38, scope: !478)
!483 = !DILocation(line: 417, column: 7, scope: !478)
!484 = !DILocation(line: 420, column: 2, scope: !478)
!485 = !DILocation(line: 418, column: 11, scope: !478)
!486 = !DILocation(line: 418, column: 3, scope: !478)
!487 = distinct !DISubprogram(name: "text.GetIndex..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetIndex", scope: null, file: !7, line: 318, type: !488, isLocal: false, isDefinition: true, scopeLine: 318, isOptimized: false, unit: !1, retainedNodes: !3)
!488 = !DISubroutineType(types: !489)
!489 = !{!345, !341, !341}
!490 = !DILocalVariable(name: "m", arg: 1, scope: !487, file: !7, line: 318, type: !341)
!491 = !DILocation(line: 318, column: 1, scope: !487)
!492 = !DILocalVariable(name: "$ret39", scope: !487, file: !7, line: 318, type: !345)
!493 = !DILocation(line: 318, column: 32, scope: !487)
!494 = !DILocation(line: 319, column: 7, scope: !487)
!495 = !DILocation(line: 322, column: 2, scope: !487)
!496 = !DILocation(line: 320, column: 11, scope: !487)
!497 = !DILocation(line: 320, column: 3, scope: !487)
!498 = distinct !DISubprogram(name: "text.GetLineHeightMultiple..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetLineHeightMultiple", scope: null, file: !7, line: 423, type: !439, isLocal: false, isDefinition: true, scopeLine: 423, isOptimized: false, unit: !1, retainedNodes: !3)
!499 = !DILocalVariable(name: "m", arg: 1, scope: !498, file: !7, line: 423, type: !341)
!500 = !DILocation(line: 423, column: 1, scope: !498)
!501 = !DILocalVariable(name: "$ret54", scope: !498, file: !7, line: 423, type: !136)
!502 = !DILocation(line: 423, column: 45, scope: !498)
!503 = !DILocation(line: 424, column: 7, scope: !498)
!504 = !DILocation(line: 427, column: 2, scope: !498)
!505 = !DILocation(line: 425, column: 11, scope: !498)
!506 = !DILocation(line: 425, column: 3, scope: !498)
!507 = distinct !DISubprogram(name: "text.GetMaxLines..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetMaxLines", scope: null, file: !7, line: 430, type: !488, isLocal: false, isDefinition: true, scopeLine: 430, isOptimized: false, unit: !1, retainedNodes: !3)
!508 = !DILocalVariable(name: "m", arg: 1, scope: !507, file: !7, line: 430, type: !341)
!509 = !DILocation(line: 430, column: 1, scope: !507)
!510 = !DILocalVariable(name: "$ret55", scope: !507, file: !7, line: 430, type: !345)
!511 = !DILocation(line: 430, column: 35, scope: !507)
!512 = !DILocation(line: 431, column: 7, scope: !507)
!513 = !DILocation(line: 434, column: 2, scope: !507)
!514 = !DILocation(line: 432, column: 11, scope: !507)
!515 = !DILocation(line: 432, column: 3, scope: !507)
!516 = distinct !DISubprogram(name: "text.GetStrikethroughColorAlpha..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetStrikethroughColorAlpha", scope: null, file: !7, line: 367, type: !517, isLocal: false, isDefinition: true, scopeLine: 367, isOptimized: false, unit: !1, retainedNodes: !3)
!517 = !DISubroutineType(types: !518)
!518 = !{!43, !341, !341}
!519 = !DILocalVariable(name: "m", arg: 1, scope: !516, file: !7, line: 367, type: !341)
!520 = !DILocation(line: 367, column: 1, scope: !516)
!521 = !DILocalVariable(name: "$ret46", scope: !516, file: !7, line: 367, type: !43)
!522 = !DILocation(line: 367, column: 50, scope: !516)
!523 = !DILocation(line: 368, column: 7, scope: !516)
!524 = !DILocation(line: 371, column: 2, scope: !516)
!525 = !DILocation(line: 369, column: 11, scope: !516)
!526 = !DILocation(line: 369, column: 3, scope: !516)
!527 = distinct !DISubprogram(name: "text.GetStrikethroughColorBlue..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetStrikethroughColorBlue", scope: null, file: !7, line: 360, type: !517, isLocal: false, isDefinition: true, scopeLine: 360, isOptimized: false, unit: !1, retainedNodes: !3)
!528 = !DILocalVariable(name: "m", arg: 1, scope: !527, file: !7, line: 360, type: !341)
!529 = !DILocation(line: 360, column: 1, scope: !527)
!530 = !DILocalVariable(name: "$ret45", scope: !527, file: !7, line: 360, type: !43)
!531 = !DILocation(line: 360, column: 49, scope: !527)
!532 = !DILocation(line: 361, column: 7, scope: !527)
!533 = !DILocation(line: 364, column: 2, scope: !527)
!534 = !DILocation(line: 362, column: 11, scope: !527)
!535 = !DILocation(line: 362, column: 3, scope: !527)
!536 = distinct !DISubprogram(name: "text.GetStrikethroughColorGreen..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetStrikethroughColorGreen", scope: null, file: !7, line: 353, type: !517, isLocal: false, isDefinition: true, scopeLine: 353, isOptimized: false, unit: !1, retainedNodes: !3)
!537 = !DILocalVariable(name: "m", arg: 1, scope: !536, file: !7, line: 353, type: !341)
!538 = !DILocation(line: 353, column: 1, scope: !536)
!539 = !DILocalVariable(name: "$ret44", scope: !536, file: !7, line: 353, type: !43)
!540 = !DILocation(line: 353, column: 50, scope: !536)
!541 = !DILocation(line: 354, column: 7, scope: !536)
!542 = !DILocation(line: 357, column: 2, scope: !536)
!543 = !DILocation(line: 355, column: 11, scope: !536)
!544 = !DILocation(line: 355, column: 3, scope: !536)
!545 = distinct !DISubprogram(name: "text.GetStrikethroughColorRed..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetStrikethroughColorRed", scope: null, file: !7, line: 346, type: !517, isLocal: false, isDefinition: true, scopeLine: 346, isOptimized: false, unit: !1, retainedNodes: !3)
!546 = !DILocalVariable(name: "m", arg: 1, scope: !545, file: !7, line: 346, type: !341)
!547 = !DILocation(line: 346, column: 1, scope: !545)
!548 = !DILocalVariable(name: "$ret43", scope: !545, file: !7, line: 346, type: !43)
!549 = !DILocation(line: 346, column: 48, scope: !545)
!550 = !DILocation(line: 347, column: 7, scope: !545)
!551 = !DILocation(line: 350, column: 2, scope: !545)
!552 = !DILocation(line: 348, column: 11, scope: !545)
!553 = !DILocation(line: 348, column: 3, scope: !545)
!554 = distinct !DISubprogram(name: "text.GetStrikethroughStyle..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetStrikethroughStyle", scope: null, file: !7, line: 332, type: !555, isLocal: false, isDefinition: true, scopeLine: 332, isOptimized: false, unit: !1, retainedNodes: !3)
!555 = !DISubroutineType(types: !556)
!556 = !{!236, !341, !341}
!557 = !DILocalVariable(name: "m", arg: 1, scope: !554, file: !7, line: 332, type: !341)
!558 = !DILocation(line: 332, column: 1, scope: !554)
!559 = !DILocalVariable(name: "$ret41", scope: !554, file: !7, line: 332, type: !236)
!560 = !DILocation(line: 332, column: 45, scope: !554)
!561 = !DILocation(line: 333, column: 7, scope: !554)
!562 = !DILocation(line: 336, column: 2, scope: !554)
!563 = !DILocation(line: 334, column: 11, scope: !554)
!564 = !DILocation(line: 334, column: 3, scope: !554)
!565 = distinct !DISubprogram(name: "text.GetTextAlignment..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetTextAlignment", scope: null, file: !7, line: 325, type: !566, isLocal: false, isDefinition: true, scopeLine: 325, isOptimized: false, unit: !1, retainedNodes: !3)
!566 = !DISubroutineType(types: !567)
!567 = !{!215, !341, !341}
!568 = !DILocalVariable(name: "m", arg: 1, scope: !565, file: !7, line: 325, type: !341)
!569 = !DILocation(line: 325, column: 1, scope: !565)
!570 = !DILocalVariable(name: "$ret40", scope: !565, file: !7, line: 325, type: !215)
!571 = !DILocation(line: 325, column: 40, scope: !565)
!572 = !DILocation(line: 326, column: 7, scope: !565)
!573 = !DILocation(line: 329, column: 2, scope: !565)
!574 = !DILocation(line: 327, column: 11, scope: !565)
!575 = !DILocation(line: 327, column: 3, scope: !565)
!576 = distinct !DISubprogram(name: "text.GetTextColorAlpha..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetTextColorAlpha", scope: null, file: !7, line: 465, type: !517, isLocal: false, isDefinition: true, scopeLine: 465, isOptimized: false, unit: !1, retainedNodes: !3)
!577 = !DILocalVariable(name: "m", arg: 1, scope: !576, file: !7, line: 465, type: !341)
!578 = !DILocation(line: 465, column: 1, scope: !576)
!579 = !DILocalVariable(name: "$ret60", scope: !576, file: !7, line: 465, type: !43)
!580 = !DILocation(line: 465, column: 41, scope: !576)
!581 = !DILocation(line: 466, column: 7, scope: !576)
!582 = !DILocation(line: 469, column: 2, scope: !576)
!583 = !DILocation(line: 467, column: 11, scope: !576)
!584 = !DILocation(line: 467, column: 3, scope: !576)
!585 = distinct !DISubprogram(name: "text.GetTextColorBlue..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetTextColorBlue", scope: null, file: !7, line: 458, type: !517, isLocal: false, isDefinition: true, scopeLine: 458, isOptimized: false, unit: !1, retainedNodes: !3)
!586 = !DILocalVariable(name: "m", arg: 1, scope: !585, file: !7, line: 458, type: !341)
!587 = !DILocation(line: 458, column: 1, scope: !585)
!588 = !DILocalVariable(name: "$ret59", scope: !585, file: !7, line: 458, type: !43)
!589 = !DILocation(line: 458, column: 40, scope: !585)
!590 = !DILocation(line: 459, column: 7, scope: !585)
!591 = !DILocation(line: 462, column: 2, scope: !585)
!592 = !DILocation(line: 460, column: 11, scope: !585)
!593 = !DILocation(line: 460, column: 3, scope: !585)
!594 = distinct !DISubprogram(name: "text.GetTextColorGreen..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetTextColorGreen", scope: null, file: !7, line: 451, type: !517, isLocal: false, isDefinition: true, scopeLine: 451, isOptimized: false, unit: !1, retainedNodes: !3)
!595 = !DILocalVariable(name: "m", arg: 1, scope: !594, file: !7, line: 451, type: !341)
!596 = !DILocation(line: 451, column: 1, scope: !594)
!597 = !DILocalVariable(name: "$ret58", scope: !594, file: !7, line: 451, type: !43)
!598 = !DILocation(line: 451, column: 41, scope: !594)
!599 = !DILocation(line: 452, column: 7, scope: !594)
!600 = !DILocation(line: 455, column: 2, scope: !594)
!601 = !DILocation(line: 453, column: 11, scope: !594)
!602 = !DILocation(line: 453, column: 3, scope: !594)
!603 = distinct !DISubprogram(name: "text.GetTextColorRed..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetTextColorRed", scope: null, file: !7, line: 444, type: !517, isLocal: false, isDefinition: true, scopeLine: 444, isOptimized: false, unit: !1, retainedNodes: !3)
!604 = !DILocalVariable(name: "m", arg: 1, scope: !603, file: !7, line: 444, type: !341)
!605 = !DILocation(line: 444, column: 1, scope: !603)
!606 = !DILocalVariable(name: "$ret57", scope: !603, file: !7, line: 444, type: !43)
!607 = !DILocation(line: 444, column: 39, scope: !603)
!608 = !DILocation(line: 445, column: 7, scope: !603)
!609 = !DILocation(line: 448, column: 2, scope: !603)
!610 = !DILocation(line: 446, column: 11, scope: !603)
!611 = !DILocation(line: 446, column: 3, scope: !603)
!612 = distinct !DISubprogram(name: "text.GetTruncation..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetTruncation", scope: null, file: !7, line: 479, type: !613, isLocal: false, isDefinition: true, scopeLine: 479, isOptimized: false, unit: !1, retainedNodes: !3)
!613 = !DISubroutineType(types: !614)
!614 = !{!299, !341, !341}
!615 = !DILocalVariable(name: "m", arg: 1, scope: !612, file: !7, line: 479, type: !341)
!616 = !DILocation(line: 479, column: 1, scope: !612)
!617 = !DILocalVariable(name: "$ret62", scope: !612, file: !7, line: 479, type: !299)
!618 = !DILocation(line: 479, column: 37, scope: !612)
!619 = !DILocation(line: 480, column: 7, scope: !612)
!620 = !DILocation(line: 483, column: 2, scope: !612)
!621 = !DILocation(line: 481, column: 11, scope: !612)
!622 = !DILocation(line: 481, column: 3, scope: !612)
!623 = distinct !DISubprogram(name: "text.GetTruncationString..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetTruncationString", scope: null, file: !7, line: 486, type: !429, isLocal: false, isDefinition: true, scopeLine: 486, isOptimized: false, unit: !1, retainedNodes: !3)
!624 = !DILocalVariable(name: "m", arg: 1, scope: !623, file: !7, line: 486, type: !341)
!625 = !DILocation(line: 486, column: 1, scope: !623)
!626 = !DILocation(line: 487, column: 7, scope: !623)
!627 = !DILocalVariable(name: "$ret63", scope: !623, file: !7, line: 486, type: !69)
!628 = !DILocation(line: 486, column: 43, scope: !623)
!629 = !DILocation(line: 490, column: 2, scope: !623)
!630 = !DILocation(line: 488, column: 3, scope: !623)
!631 = distinct !DISubprogram(name: "text.GetUnderlineColorAlpha..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetUnderlineColorAlpha", scope: null, file: !7, line: 409, type: !517, isLocal: false, isDefinition: true, scopeLine: 409, isOptimized: false, unit: !1, retainedNodes: !3)
!632 = !DILocalVariable(name: "m", arg: 1, scope: !631, file: !7, line: 409, type: !341)
!633 = !DILocation(line: 409, column: 1, scope: !631)
!634 = !DILocalVariable(name: "$ret52", scope: !631, file: !7, line: 409, type: !43)
!635 = !DILocation(line: 409, column: 46, scope: !631)
!636 = !DILocation(line: 410, column: 7, scope: !631)
!637 = !DILocation(line: 413, column: 2, scope: !631)
!638 = !DILocation(line: 411, column: 11, scope: !631)
!639 = !DILocation(line: 411, column: 3, scope: !631)
!640 = distinct !DISubprogram(name: "text.GetUnderlineColorBlue..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetUnderlineColorBlue", scope: null, file: !7, line: 402, type: !517, isLocal: false, isDefinition: true, scopeLine: 402, isOptimized: false, unit: !1, retainedNodes: !3)
!641 = !DILocalVariable(name: "m", arg: 1, scope: !640, file: !7, line: 402, type: !341)
!642 = !DILocation(line: 402, column: 1, scope: !640)
!643 = !DILocalVariable(name: "$ret51", scope: !640, file: !7, line: 402, type: !43)
!644 = !DILocation(line: 402, column: 45, scope: !640)
!645 = !DILocation(line: 403, column: 7, scope: !640)
!646 = !DILocation(line: 406, column: 2, scope: !640)
!647 = !DILocation(line: 404, column: 11, scope: !640)
!648 = !DILocation(line: 404, column: 3, scope: !640)
!649 = distinct !DISubprogram(name: "text.GetUnderlineColorGreen..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetUnderlineColorGreen", scope: null, file: !7, line: 395, type: !517, isLocal: false, isDefinition: true, scopeLine: 395, isOptimized: false, unit: !1, retainedNodes: !3)
!650 = !DILocalVariable(name: "m", arg: 1, scope: !649, file: !7, line: 395, type: !341)
!651 = !DILocation(line: 395, column: 1, scope: !649)
!652 = !DILocalVariable(name: "$ret50", scope: !649, file: !7, line: 395, type: !43)
!653 = !DILocation(line: 395, column: 46, scope: !649)
!654 = !DILocation(line: 396, column: 7, scope: !649)
!655 = !DILocation(line: 399, column: 2, scope: !649)
!656 = !DILocation(line: 397, column: 11, scope: !649)
!657 = !DILocation(line: 397, column: 3, scope: !649)
!658 = distinct !DISubprogram(name: "text.GetUnderlineColorRed..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetUnderlineColorRed", scope: null, file: !7, line: 388, type: !517, isLocal: false, isDefinition: true, scopeLine: 388, isOptimized: false, unit: !1, retainedNodes: !3)
!659 = !DILocalVariable(name: "m", arg: 1, scope: !658, file: !7, line: 388, type: !341)
!660 = !DILocation(line: 388, column: 1, scope: !658)
!661 = !DILocalVariable(name: "$ret49", scope: !658, file: !7, line: 388, type: !43)
!662 = !DILocation(line: 388, column: 44, scope: !658)
!663 = !DILocation(line: 389, column: 7, scope: !658)
!664 = !DILocation(line: 392, column: 2, scope: !658)
!665 = !DILocation(line: 390, column: 11, scope: !658)
!666 = !DILocation(line: 390, column: 3, scope: !658)
!667 = distinct !DISubprogram(name: "text.GetUnderlineStyle..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetUnderlineStyle", scope: null, file: !7, line: 374, type: !668, isLocal: false, isDefinition: true, scopeLine: 374, isOptimized: false, unit: !1, retainedNodes: !3)
!668 = !DISubroutineType(types: !669)
!669 = !{!257, !341, !341}
!670 = !DILocalVariable(name: "m", arg: 1, scope: !667, file: !7, line: 374, type: !341)
!671 = !DILocation(line: 374, column: 1, scope: !667)
!672 = !DILocalVariable(name: "$ret47", scope: !667, file: !7, line: 374, type: !257)
!673 = !DILocation(line: 374, column: 41, scope: !667)
!674 = !DILocation(line: 375, column: 7, scope: !667)
!675 = !DILocation(line: 378, column: 2, scope: !667)
!676 = !DILocation(line: 376, column: 11, scope: !667)
!677 = !DILocation(line: 376, column: 3, scope: !667)
!678 = distinct !DISubprogram(name: "text.GetWrap..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.GetWrap", scope: null, file: !7, line: 472, type: !679, isLocal: false, isDefinition: true, scopeLine: 472, isOptimized: false, unit: !1, retainedNodes: !3)
!679 = !DISubroutineType(types: !680)
!680 = !{!278, !341, !341}
!681 = !DILocalVariable(name: "m", arg: 1, scope: !678, file: !7, line: 472, type: !341)
!682 = !DILocation(line: 472, column: 1, scope: !678)
!683 = !DILocalVariable(name: "$ret61", scope: !678, file: !7, line: 472, type: !278)
!684 = !DILocation(line: 472, column: 31, scope: !678)
!685 = !DILocation(line: 473, column: 7, scope: !678)
!686 = !DILocation(line: 476, column: 2, scope: !678)
!687 = !DILocation(line: 474, column: 11, scope: !678)
!688 = !DILocation(line: 474, column: 3, scope: !678)
!689 = distinct !DISubprogram(name: "text.Reset..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.Reset", scope: null, file: !7, line: 313, type: !690, isLocal: false, isDefinition: true, scopeLine: 313, isOptimized: false, unit: !1, retainedNodes: !3)
!690 = !DISubroutineType(types: !691)
!691 = !{!56, !341, !341}
!692 = !DILocalVariable(name: "m", arg: 1, scope: !689, file: !7, line: 313, type: !341)
!693 = !DILocation(line: 313, column: 1, scope: !689)
!694 = !DILocation(line: 313, column: 53, scope: !689)
!695 = distinct !DISubprogram(name: "text.String..1command_line_arguments.TextStyle", linkageName: "command_line_arguments.TextStyle.String", scope: null, file: !7, line: 314, type: !429, isLocal: false, isDefinition: true, scopeLine: 314, isOptimized: false, unit: !1, retainedNodes: !3)
!696 = !DILocalVariable(name: "m", arg: 1, scope: !695, file: !7, line: 314, type: !341)
!697 = !DILocation(line: 314, column: 1, scope: !695)
!698 = !DILocation(line: 314, column: 81, scope: !695)
!699 = !DILocation(line: 314, column: 63, scope: !695)
!700 = !DILocation(line: 314, column: 50, scope: !695)
!701 = distinct !DISubprogram(name: "text.command_line_arguments.TextStyle..hash", linkageName: "command_line_arguments.command_line_arguments.TextStyle..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!702 = !DILocalVariable(name: "key", arg: 1, scope: !701, file: !29, line: 1, type: !55)
!703 = !DILocation(line: 1, column: 1, scope: !701)
!704 = !DILocalVariable(name: "seed", arg: 2, scope: !701, file: !29, line: 1, type: !40)
!705 = !DILocalVariable(name: "$ret68", scope: !701, file: !29, line: 1, type: !40)
!706 = distinct !DISubprogram(name: "text.command_line_arguments.TextStyle..eq", linkageName: "command_line_arguments.command_line_arguments.TextStyle..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!707 = !DILocalVariable(name: "key1", arg: 1, scope: !706, file: !29, line: 1, type: !55)
!708 = !DILocation(line: 1, column: 1, scope: !706)
!709 = !DILocalVariable(name: "key2", arg: 2, scope: !706, file: !29, line: 1, type: !55)
!710 = !DILocalVariable(name: "$ret69", scope: !706, file: !29, line: 1, type: !65)
!711 = distinct !DISubprogram(name: "text.GetStyles..1command_line_arguments.StyledText", linkageName: "command_line_arguments.StyledText.GetStyles", scope: null, file: !7, line: 237, type: !712, isLocal: false, isDefinition: true, scopeLine: 237, isOptimized: false, unit: !1, retainedNodes: !3)
!712 = !DISubroutineType(types: !713)
!713 = !{!337, !333, !333}
!714 = !DILocalVariable(name: "m", arg: 1, scope: !711, file: !7, line: 237, type: !333)
!715 = !DILocation(line: 237, column: 1, scope: !711)
!716 = !DILocation(line: 238, column: 7, scope: !711)
!717 = !DILocation(line: 241, column: 2, scope: !711)
!718 = !DILocation(line: 239, column: 3, scope: !711)
!719 = distinct !DISubprogram(name: "text.Descriptor..1command_line_arguments.Text", linkageName: "command_line_arguments.Text.Descriptor", scope: null, file: !7, line: 218, type: !720, isLocal: false, isDefinition: true, scopeLine: 218, isOptimized: false, unit: !1, retainedNodes: !3)
!720 = !DISubroutineType(types: !721)
!721 = !{!206, !373, !373}
!722 = !DILocalVariable(name: "r.8", arg: 1, scope: !719, file: !7, line: 218, type: !373)
!723 = !DILocation(line: 218, column: 1, scope: !719)
!724 = !DILocation(line: 218, column: 69, scope: !719)
!725 = !DILocalVariable(name: "$ret23", scope: !719, file: !7, line: 218, type: !210)
!726 = !DILocation(line: 218, column: 36, scope: !719)
!727 = !DILocation(line: 218, column: 45, scope: !719)
!728 = distinct !DISubprogram(name: "text.GetText..1command_line_arguments.Text", linkageName: "command_line_arguments.Text.GetText", scope: null, file: !7, line: 220, type: !729, isLocal: false, isDefinition: true, scopeLine: 220, isOptimized: false, unit: !1, retainedNodes: !3)
!729 = !DISubroutineType(types: !730)
!730 = !{!69, !373, !373}
!731 = !DILocalVariable(name: "m", arg: 1, scope: !728, file: !7, line: 220, type: !373)
!732 = !DILocation(line: 220, column: 1, scope: !728)
!733 = !DILocation(line: 221, column: 7, scope: !728)
!734 = !DILocalVariable(name: "$ret24", scope: !728, file: !7, line: 220, type: !69)
!735 = !DILocation(line: 220, column: 26, scope: !728)
!736 = !DILocation(line: 224, column: 2, scope: !728)
!737 = !DILocation(line: 222, column: 3, scope: !728)
!738 = distinct !DISubprogram(name: "text.Reset..1command_line_arguments.Text", linkageName: "command_line_arguments.Text.Reset", scope: null, file: !7, line: 215, type: !739, isLocal: false, isDefinition: true, scopeLine: 215, isOptimized: false, unit: !1, retainedNodes: !3)
!739 = !DISubroutineType(types: !740)
!740 = !{!56, !373, !373}
!741 = !DILocalVariable(name: "m", arg: 1, scope: !738, file: !7, line: 215, type: !373)
!742 = !DILocation(line: 215, column: 1, scope: !738)
!743 = !DILocation(line: 215, column: 48, scope: !738)
!744 = distinct !DISubprogram(name: "text.String..1command_line_arguments.Text", linkageName: "command_line_arguments.Text.String", scope: null, file: !7, line: 216, type: !729, isLocal: false, isDefinition: true, scopeLine: 216, isOptimized: false, unit: !1, retainedNodes: !3)
!745 = !DILocalVariable(name: "m", arg: 1, scope: !744, file: !7, line: 216, type: !373)
!746 = !DILocation(line: 216, column: 1, scope: !744)
!747 = !DILocation(line: 216, column: 76, scope: !744)
!748 = !DILocation(line: 216, column: 58, scope: !744)
!749 = !DILocation(line: 216, column: 45, scope: !744)
!750 = distinct !DISubprogram(name: "text.command_line_arguments.Text..hash", linkageName: "command_line_arguments.command_line_arguments.Text..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!751 = !DILocalVariable(name: "key", arg: 1, scope: !750, file: !29, line: 1, type: !55)
!752 = !DILocation(line: 1, column: 1, scope: !750)
!753 = !DILocalVariable(name: "seed", arg: 2, scope: !750, file: !29, line: 1, type: !40)
!754 = !DILocalVariable(name: "$ret70", scope: !750, file: !29, line: 1, type: !40)
!755 = distinct !DISubprogram(name: "text.command_line_arguments.Text..eq", linkageName: "command_line_arguments.command_line_arguments.Text..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!756 = !DILocalVariable(name: "key1", arg: 1, scope: !755, file: !29, line: 1, type: !55)
!757 = !DILocation(line: 1, column: 1, scope: !755)
!758 = !DILocalVariable(name: "key2", arg: 2, scope: !755, file: !29, line: 1, type: !55)
!759 = !DILocalVariable(name: "$ret71", scope: !755, file: !29, line: 1, type: !65)
!760 = distinct !DISubprogram(name: "text.GetText..1command_line_arguments.StyledText", linkageName: "command_line_arguments.StyledText.GetText", scope: null, file: !7, line: 244, type: !761, isLocal: false, isDefinition: true, scopeLine: 244, isOptimized: false, unit: !1, retainedNodes: !3)
!761 = !DISubroutineType(types: !762)
!762 = !{!373, !333, !333}
!763 = !DILocalVariable(name: "m", arg: 1, scope: !760, file: !7, line: 244, type: !333)
!764 = !DILocation(line: 244, column: 1, scope: !760)
!765 = !DILocalVariable(name: "$ret29", scope: !760, file: !7, line: 244, type: !373)
!766 = !DILocation(line: 244, column: 32, scope: !760)
!767 = !DILocation(line: 245, column: 7, scope: !760)
!768 = !DILocation(line: 248, column: 2, scope: !760)
!769 = !DILocation(line: 246, column: 11, scope: !760)
!770 = !DILocation(line: 246, column: 3, scope: !760)
!771 = distinct !DISubprogram(name: "text.Reset..1command_line_arguments.StyledText", linkageName: "command_line_arguments.StyledText.Reset", scope: null, file: !7, line: 232, type: !772, isLocal: false, isDefinition: true, scopeLine: 232, isOptimized: false, unit: !1, retainedNodes: !3)
!772 = !DISubroutineType(types: !773)
!773 = !{!56, !333, !333}
!774 = !DILocalVariable(name: "m", arg: 1, scope: !771, file: !7, line: 232, type: !333)
!775 = !DILocation(line: 232, column: 1, scope: !771)
!776 = !DILocation(line: 232, column: 54, scope: !771)
!777 = distinct !DISubprogram(name: "text.String..1command_line_arguments.StyledText", linkageName: "command_line_arguments.StyledText.String", scope: null, file: !7, line: 233, type: !778, isLocal: false, isDefinition: true, scopeLine: 233, isOptimized: false, unit: !1, retainedNodes: !3)
!778 = !DISubroutineType(types: !779)
!779 = !{!69, !333, !333}
!780 = !DILocalVariable(name: "m", arg: 1, scope: !777, file: !7, line: 233, type: !333)
!781 = !DILocation(line: 233, column: 1, scope: !777)
!782 = !DILocation(line: 233, column: 82, scope: !777)
!783 = !DILocation(line: 233, column: 64, scope: !777)
!784 = !DILocation(line: 233, column: 51, scope: !777)
!785 = distinct !DISubprogram(name: "text.GetText..1command_line_arguments.SizeFunc", linkageName: "command_line_arguments.SizeFunc.GetText", scope: null, file: !7, line: 190, type: !786, isLocal: false, isDefinition: true, scopeLine: 190, isOptimized: false, unit: !1, retainedNodes: !3)
!786 = !DISubroutineType(types: !787)
!787 = !{!333, !329, !329}
!788 = !DILocalVariable(name: "m", arg: 1, scope: !785, file: !7, line: 190, type: !329)
!789 = !DILocation(line: 190, column: 1, scope: !785)
!790 = !DILocalVariable(name: "$ret18", scope: !785, file: !7, line: 190, type: !333)
!791 = !DILocation(line: 190, column: 30, scope: !785)
!792 = !DILocation(line: 191, column: 7, scope: !785)
!793 = !DILocation(line: 194, column: 2, scope: !785)
!794 = !DILocation(line: 192, column: 11, scope: !785)
!795 = !DILocation(line: 192, column: 3, scope: !785)
!796 = distinct !DISubprogram(name: "text.Reset..1command_line_arguments.SizeFunc", linkageName: "command_line_arguments.SizeFunc.Reset", scope: null, file: !7, line: 185, type: !797, isLocal: false, isDefinition: true, scopeLine: 185, isOptimized: false, unit: !1, retainedNodes: !3)
!797 = !DISubroutineType(types: !798)
!798 = !{!56, !329, !329}
!799 = !DILocalVariable(name: "m", arg: 1, scope: !796, file: !7, line: 185, type: !329)
!800 = !DILocation(line: 185, column: 1, scope: !796)
!801 = !DILocation(line: 185, column: 52, scope: !796)
!802 = distinct !DISubprogram(name: "text.String..1command_line_arguments.SizeFunc", linkageName: "command_line_arguments.SizeFunc.String", scope: null, file: !7, line: 186, type: !803, isLocal: false, isDefinition: true, scopeLine: 186, isOptimized: false, unit: !1, retainedNodes: !3)
!803 = !DISubroutineType(types: !804)
!804 = !{!69, !329, !329}
!805 = !DILocalVariable(name: "m", arg: 1, scope: !802, file: !7, line: 186, type: !329)
!806 = !DILocation(line: 186, column: 1, scope: !802)
!807 = !DILocation(line: 186, column: 80, scope: !802)
!808 = !DILocation(line: 186, column: 62, scope: !802)
!809 = !DILocation(line: 186, column: 49, scope: !802)
!810 = distinct !DISubprogram(name: "text.command_line_arguments.Font..hash", linkageName: "command_line_arguments.command_line_arguments.Font..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!811 = !DILocalVariable(name: "key", arg: 1, scope: !810, file: !29, line: 1, type: !55)
!812 = !DILocation(line: 1, column: 1, scope: !810)
!813 = !DILocalVariable(name: "seed", arg: 2, scope: !810, file: !29, line: 1, type: !40)
!814 = !DILocalVariable(name: "$ret72", scope: !810, file: !29, line: 1, type: !40)
!815 = distinct !DISubprogram(name: "text.command_line_arguments.Font..eq", linkageName: "command_line_arguments.command_line_arguments.Font..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!816 = !DILocalVariable(name: "key1", arg: 1, scope: !815, file: !29, line: 1, type: !55)
!817 = !DILocation(line: 1, column: 1, scope: !815)
!818 = !DILocalVariable(name: "key2", arg: 2, scope: !815, file: !29, line: 1, type: !55)
!819 = !DILocalVariable(name: "$ret73", scope: !815, file: !29, line: 1, type: !65)
!820 = distinct !DISubprogram(name: "text.Descriptor..1command_line_arguments.Font", linkageName: "command_line_arguments.Font.Descriptor", scope: null, file: !7, line: 260, type: !821, isLocal: false, isDefinition: true, scopeLine: 260, isOptimized: false, unit: !1, retainedNodes: !3)
!821 = !DISubroutineType(types: !822)
!822 = !{!206, !823, !823}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "Font", file: !7, line: 251, size: 320, align: 8, elements: !825)
!825 = !{!826, !827, !828}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Family", file: !7, line: 252, baseType: !69, size: 128, align: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "Face", file: !7, line: 253, baseType: !69, size: 128, align: 64, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !7, line: 254, baseType: !136, size: 64, align: 64, offset: 256)
!829 = !DILocalVariable(name: "r.12", arg: 1, scope: !820, file: !7, line: 260, type: !823)
!830 = !DILocation(line: 260, column: 1, scope: !820)
!831 = !DILocation(line: 260, column: 69, scope: !820)
!832 = !DILocalVariable(name: "$ret32", scope: !820, file: !7, line: 260, type: !210)
!833 = !DILocation(line: 260, column: 36, scope: !820)
!834 = !DILocation(line: 260, column: 45, scope: !820)
!835 = distinct !DISubprogram(name: "text.GetFace..1command_line_arguments.Font", linkageName: "command_line_arguments.Font.GetFace", scope: null, file: !7, line: 269, type: !836, isLocal: false, isDefinition: true, scopeLine: 269, isOptimized: false, unit: !1, retainedNodes: !3)
!836 = !DISubroutineType(types: !837)
!837 = !{!69, !823, !823}
!838 = !DILocalVariable(name: "m", arg: 1, scope: !835, file: !7, line: 269, type: !823)
!839 = !DILocation(line: 269, column: 1, scope: !835)
!840 = !DILocation(line: 270, column: 7, scope: !835)
!841 = !DILocalVariable(name: "$ret34", scope: !835, file: !7, line: 269, type: !69)
!842 = !DILocation(line: 269, column: 26, scope: !835)
!843 = !DILocation(line: 273, column: 2, scope: !835)
!844 = !DILocation(line: 271, column: 3, scope: !835)
!845 = distinct !DISubprogram(name: "text.GetFamily..1command_line_arguments.Font", linkageName: "command_line_arguments.Font.GetFamily", scope: null, file: !7, line: 262, type: !836, isLocal: false, isDefinition: true, scopeLine: 262, isOptimized: false, unit: !1, retainedNodes: !3)
!846 = !DILocalVariable(name: "m", arg: 1, scope: !845, file: !7, line: 262, type: !823)
!847 = !DILocation(line: 262, column: 1, scope: !845)
!848 = !DILocation(line: 263, column: 7, scope: !845)
!849 = !DILocalVariable(name: "$ret33", scope: !845, file: !7, line: 262, type: !69)
!850 = !DILocation(line: 262, column: 28, scope: !845)
!851 = !DILocation(line: 266, column: 2, scope: !845)
!852 = !DILocation(line: 264, column: 3, scope: !845)
!853 = distinct !DISubprogram(name: "text.GetSize..1command_line_arguments.Font", linkageName: "command_line_arguments.Font.GetSize", scope: null, file: !7, line: 276, type: !854, isLocal: false, isDefinition: true, scopeLine: 276, isOptimized: false, unit: !1, retainedNodes: !3)
!854 = !DISubroutineType(types: !855)
!855 = !{!136, !823, !823}
!856 = !DILocalVariable(name: "m", arg: 1, scope: !853, file: !7, line: 276, type: !823)
!857 = !DILocation(line: 276, column: 1, scope: !853)
!858 = !DILocalVariable(name: "$ret35", scope: !853, file: !7, line: 276, type: !136)
!859 = !DILocation(line: 276, column: 26, scope: !853)
!860 = !DILocation(line: 277, column: 7, scope: !853)
!861 = !DILocation(line: 280, column: 2, scope: !853)
!862 = !DILocation(line: 278, column: 11, scope: !853)
!863 = !DILocation(line: 278, column: 3, scope: !853)
!864 = distinct !DISubprogram(name: "text.Reset..1command_line_arguments.Font", linkageName: "command_line_arguments.Font.Reset", scope: null, file: !7, line: 257, type: !865, isLocal: false, isDefinition: true, scopeLine: 257, isOptimized: false, unit: !1, retainedNodes: !3)
!865 = !DISubroutineType(types: !866)
!866 = !{!56, !823, !823}
!867 = !DILocalVariable(name: "m", arg: 1, scope: !864, file: !7, line: 257, type: !823)
!868 = !DILocation(line: 257, column: 1, scope: !864)
!869 = !DILocation(line: 257, column: 48, scope: !864)
!870 = distinct !DISubprogram(name: "text.String..1command_line_arguments.Font", linkageName: "command_line_arguments.Font.String", scope: null, file: !7, line: 258, type: !836, isLocal: false, isDefinition: true, scopeLine: 258, isOptimized: false, unit: !1, retainedNodes: !3)
!871 = !DILocalVariable(name: "m", arg: 1, scope: !870, file: !7, line: 258, type: !823)
!872 = !DILocation(line: 258, column: 1, scope: !870)
!873 = !DILocation(line: 258, column: 76, scope: !870)
!874 = !DILocation(line: 258, column: 58, scope: !870)
!875 = !DILocation(line: 258, column: 45, scope: !870)
