; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22app\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/golang/protobuf/proto\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/golang/protobuf/proto\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22math\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22math\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22app\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22command_line_arguments..import\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./statusbar.pb.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha/proto/app")
!3 = !{}
!4 = !{!5, !109, !111, !127, !137, !152, !154}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments._.0", linkageName: "command_line_arguments._.0", scope: !1, file: !7, line: 21, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "statusbar.pb.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 16, size: 64, align: 8, elements: !10)
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 16, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !95}
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !16, size: 320, align: 8, elements: !17)
!16 = !DIFile(filename: "", directory: "")
!17 = !{!18, !27}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 16, baseType: !19, size: 192, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !16, size: 192, align: 8, elements: !20)
!20 = !{!21, !24, !26}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !16, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !16, line: 1, baseType: !25, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 16, baseType: !28, size: 128, align: 64, offset: 192)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !29, line: 1, size: 128, align: 8, elements: !30)
!29 = !DIFile(filename: "<built-in>", directory: "")
!30 = !{!31, !94}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !29, line: 1, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !16, size: 128, align: 8, elements: !34)
!34 = !{!35, !90}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 1, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !29, line: 1, size: 576, align: 8, elements: !38)
!38 = !{!39, !41, !42, !44, !45, !46, !47, !57, !66, !67, !73, !89}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !29, line: 1, baseType: !40, size: 64, align: 64)
!40 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !29, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !29, line: 1, baseType: !43, size: 32, align: 32, offset: 128)
!43 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 168)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 176)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !29, line: 1, baseType: !48, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !29, line: 1, size: 64, align: 8, elements: !50)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !29, line: 1, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!40, !55, !40}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIBasicType(name: "void")
!57 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !29, line: 1, baseType: !58, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !29, line: 1, size: 64, align: 8, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !29, line: 1, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !55, !55}
!65 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !29, line: 1, baseType: !22, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !29, line: 1, baseType: !68, size: 64, align: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !29, line: 1, size: 128, align: 8, elements: !70)
!70 = !{!71, !72}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !29, line: 1, baseType: !22, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !29, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !29, line: 1, baseType: !74, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !29, line: 1, size: 320, align: 8, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !29, line: 1, baseType: !68, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !29, line: 1, baseType: !68, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !29, line: 1, baseType: !80, size: 192, align: 64, offset: 128)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !16, size: 192, align: 8, elements: !81)
!81 = !{!82, !24, !26}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !29, line: 1, size: 320, align: 8, elements: !85)
!85 = !{!77, !78, !86, !87, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !16, line: 1, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!69, !55}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !7, line: 16, size: 128, align: 8, elements: !96)
!96 = !{!97, !108}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 16, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void,*func(*void)string}", file: !16, size: 256, align: 8, elements: !100)
!100 = !{!101, !102, !106, !107}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 16, baseType: !36, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMessage", file: !16, line: 16, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!56, !55}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", file: !16, line: 16, baseType: !103, size: 64, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !16, line: 16, baseType: !91, size: 64, align: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !29, line: 1, type: !43, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "command_line_arguments._.1", linkageName: "command_line_arguments._.1", scope: !1, file: !7, line: 22, type: !113, isLocal: false, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 17, size: 64, align: 8, elements: !115)
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 17, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!28, !69, !120}
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*void},int,int}", file: !16, size: 192, align: 8, elements: !121)
!121 = !{!122, !24, !26}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !16, size: 128, align: 8, elements: !125)
!125 = !{!35, !126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !16, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "command_line_arguments._.2", linkageName: "command_line_arguments._.2", scope: !1, file: !7, line: 23, type: !129, isLocal: false, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 18, size: 64, align: 8, elements: !131)
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 18, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !25}
!136 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "command_line_arguments.StatusBarStyle_name", linkageName: "command_line_arguments.StatusBarStyle_name", scope: !1, file: !7, line: 39, type: !139, isLocal: false, isDefinition: true)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !29, line: 1, size: 384, align: 8, elements: !141)
!141 = !{!142, !143, !144, !145, !147, !148, !149, !150, !151}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !29, line: 1, baseType: !25, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 72)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !29, line: 1, baseType: !146, size: 16, align: 16, offset: 80)
!146 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !29, line: 1, baseType: !43, size: 32, align: 32, offset: 96)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !29, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 320)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "command_line_arguments.StatusBarStyle_value", linkageName: "command_line_arguments.StatusBarStyle_value", scope: !1, file: !7, line: 44, type: !139, isLocal: false, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor0", linkageName: "command_line_arguments.fileDescriptor0", scope: !1, file: !7, line: 103, type: !19, isLocal: true, isDefinition: true)
!156 = distinct !DISubprogram(name: "app.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 14, type: !157, isLocal: false, isDefinition: true, scopeLine: 14, isOptimized: false, unit: !1, retainedNodes: !3)
!157 = !DISubroutineType(types: !158)
!158 = !{!56}
!159 = !DILocation(line: 1, column: 1, scope: !160)
!160 = !DILexicalBlockFile(scope: !156, file: !29, discriminator: 0)
!161 = !DILocation(line: 21, column: 5, scope: !162)
!162 = !DILexicalBlockFile(scope: !156, file: !7, discriminator: 0)
!163 = !DILocation(line: 22, column: 5, scope: !162)
!164 = !DILocation(line: 23, column: 5, scope: !162)
!165 = !DILocation(line: 39, column: 27, scope: !162)
!166 = !DILocation(line: 39, column: 5, scope: !162)
!167 = !DILocation(line: 44, column: 28, scope: !162)
!168 = !DILocation(line: 44, column: 5, scope: !162)
!169 = !DILocation(line: 95, column: 1, scope: !162)
!170 = !DILocation(line: 101, column: 1, scope: !162)
!171 = distinct !DISubprogram(name: "app.EnumDescriptor.command_line_arguments.StatusBarStyle", linkageName: "command_line_arguments.StatusBarStyle.EnumDescriptor", scope: null, file: !7, line: 53, type: !172, isLocal: false, isDefinition: true, scopeLine: 53, isOptimized: false, unit: !1, retainedNodes: !3)
!172 = !DISubroutineType(types: !173)
!173 = !{!174, !182, !182}
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},struct{*int,int,int}}", file: !16, size: 384, align: 8, elements: !175)
!175 = !{!176, !177}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 53, baseType: !19, size: 192, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 53, baseType: !178, size: 192, align: 64, offset: 192)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !16, size: 192, align: 8, elements: !179)
!179 = !{!180, !24, !26}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIBasicType(name: "StatusBarStyle", size: 32, encoding: DW_ATE_signed)
!184 = !DILocalVariable(name: "r.0.pointer", arg: 1, scope: !171, file: !7, line: 53, type: !182)
!185 = !DILocation(line: 53, column: 1, scope: !171)
!186 = !DILocalVariable(name: "r.0", scope: !171, file: !7, line: 53, type: !183)
!187 = !DILocation(line: 53, column: 82, scope: !171)
!188 = !DILocalVariable(name: "$ret2", scope: !171, file: !7, line: 53, type: !178)
!189 = !DILocation(line: 53, column: 49, scope: !171)
!190 = !DILocation(line: 53, column: 58, scope: !171)
!191 = distinct !DISubprogram(name: "app.String.command_line_arguments.StatusBarStyle", linkageName: "command_line_arguments.StatusBarStyle.String", scope: null, file: !7, line: 50, type: !192, isLocal: false, isDefinition: true, scopeLine: 50, isOptimized: false, unit: !1, retainedNodes: !3)
!192 = !DISubroutineType(types: !193)
!193 = !{!69, !182, !182}
!194 = !DILocalVariable(name: "pointer", arg: 1, scope: !191, file: !7, line: 50, type: !182)
!195 = !DILocation(line: 50, column: 1, scope: !191)
!196 = !DILocalVariable(name: "x", scope: !191, file: !7, line: 50, type: !183)
!197 = !DILocation(line: 51, column: 24, scope: !191)
!198 = !DILocation(line: 51, column: 15, scope: !191)
!199 = !DILocation(line: 51, column: 2, scope: !191)
!200 = distinct !DISubprogram(name: "app.Descriptor..1command_line_arguments.ActivityIndicator", linkageName: "command_line_arguments.ActivityIndicator.Descriptor", scope: null, file: !7, line: 62, type: !201, isLocal: false, isDefinition: true, scopeLine: 62, isOptimized: false, unit: !1, retainedNodes: !3)
!201 = !DISubroutineType(types: !202)
!202 = !{!174, !203, !203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "ActivityIndicator", file: !7, line: 55, size: 8, align: 8, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Visible", file: !7, line: 56, baseType: !65, size: 8, align: 8)
!207 = !DILocalVariable(name: "r.2", arg: 1, scope: !200, file: !7, line: 62, type: !203)
!208 = !DILocation(line: 62, column: 1, scope: !200)
!209 = !DILocation(line: 62, column: 82, scope: !200)
!210 = !DILocalVariable(name: "$ret5", scope: !200, file: !7, line: 62, type: !178)
!211 = !DILocation(line: 62, column: 49, scope: !200)
!212 = !DILocation(line: 62, column: 58, scope: !200)
!213 = distinct !DISubprogram(name: "app.GetVisible..1command_line_arguments.ActivityIndicator", linkageName: "command_line_arguments.ActivityIndicator.GetVisible", scope: null, file: !7, line: 64, type: !214, isLocal: false, isDefinition: true, scopeLine: 64, isOptimized: false, unit: !1, retainedNodes: !3)
!214 = !DISubroutineType(types: !215)
!215 = !{!65, !203, !203}
!216 = !DILocalVariable(name: "m", arg: 1, scope: !213, file: !7, line: 64, type: !203)
!217 = !DILocation(line: 64, column: 1, scope: !213)
!218 = !DILocalVariable(name: "$ret6", scope: !213, file: !7, line: 64, type: !65)
!219 = !DILocation(line: 64, column: 42, scope: !213)
!220 = !DILocation(line: 65, column: 7, scope: !213)
!221 = !DILocation(line: 68, column: 2, scope: !213)
!222 = !DILocation(line: 66, column: 11, scope: !213)
!223 = !DILocation(line: 66, column: 3, scope: !213)
!224 = distinct !DISubprogram(name: "app.Reset..1command_line_arguments.ActivityIndicator", linkageName: "command_line_arguments.ActivityIndicator.Reset", scope: null, file: !7, line: 59, type: !225, isLocal: false, isDefinition: true, scopeLine: 59, isOptimized: false, unit: !1, retainedNodes: !3)
!225 = !DISubroutineType(types: !226)
!226 = !{!56, !203, !203}
!227 = !DILocalVariable(name: "m", arg: 1, scope: !224, file: !7, line: 59, type: !203)
!228 = !DILocation(line: 59, column: 1, scope: !224)
!229 = !DILocation(line: 59, column: 58, scope: !224)
!230 = !DILocation(line: 59, column: 61, scope: !224)
!231 = distinct !DISubprogram(name: "app.String..1command_line_arguments.ActivityIndicator", linkageName: "command_line_arguments.ActivityIndicator.String", scope: null, file: !7, line: 60, type: !232, isLocal: false, isDefinition: true, scopeLine: 60, isOptimized: false, unit: !1, retainedNodes: !3)
!232 = !DISubroutineType(types: !233)
!233 = !{!69, !203, !203}
!234 = !DILocalVariable(name: "m", arg: 1, scope: !231, file: !7, line: 60, type: !203)
!235 = !DILocation(line: 60, column: 1, scope: !231)
!236 = !DILocation(line: 60, column: 89, scope: !231)
!237 = !DILocation(line: 60, column: 71, scope: !231)
!238 = !DILocation(line: 60, column: 58, scope: !231)
!239 = distinct !DISubprogram(name: "app.command_line_arguments.StatusBar..hash", linkageName: "command_line_arguments.command_line_arguments.StatusBar..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!240 = !DILocalVariable(name: "key", arg: 1, scope: !239, file: !29, line: 1, type: !55)
!241 = !DILocation(line: 1, column: 1, scope: !239)
!242 = !DILocalVariable(name: "seed", arg: 2, scope: !239, file: !29, line: 1, type: !40)
!243 = !DILocalVariable(name: "$ret12", scope: !239, file: !29, line: 1, type: !40)
!244 = distinct !DISubprogram(name: "app.command_line_arguments.StatusBar..eq", linkageName: "command_line_arguments.command_line_arguments.StatusBar..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!245 = !DILocalVariable(name: "key1", arg: 1, scope: !244, file: !29, line: 1, type: !55)
!246 = !DILocation(line: 1, column: 1, scope: !244)
!247 = !DILocalVariable(name: "key2", arg: 2, scope: !244, file: !29, line: 1, type: !55)
!248 = !DILocalVariable(name: "$ret13", scope: !244, file: !29, line: 1, type: !65)
!249 = distinct !DISubprogram(name: "app.Descriptor..1command_line_arguments.StatusBar", linkageName: "command_line_arguments.StatusBar.Descriptor", scope: null, file: !7, line: 79, type: !250, isLocal: false, isDefinition: true, scopeLine: 79, isOptimized: false, unit: !1, retainedNodes: !3)
!250 = !DISubroutineType(types: !251)
!251 = !{!174, !252, !252}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "StatusBar", file: !7, line: 71, size: 64, align: 8, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Hidden", file: !7, line: 72, baseType: !65, size: 8, align: 8)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Style", file: !7, line: 73, baseType: !183, size: 32, align: 32, offset: 32)
!257 = !DILocalVariable(name: "r.4", arg: 1, scope: !249, file: !7, line: 79, type: !252)
!258 = !DILocation(line: 79, column: 1, scope: !249)
!259 = !DILocation(line: 79, column: 74, scope: !249)
!260 = !DILocalVariable(name: "$ret9", scope: !249, file: !7, line: 79, type: !178)
!261 = !DILocation(line: 79, column: 41, scope: !249)
!262 = !DILocation(line: 79, column: 50, scope: !249)
!263 = distinct !DISubprogram(name: "app.GetHidden..1command_line_arguments.StatusBar", linkageName: "command_line_arguments.StatusBar.GetHidden", scope: null, file: !7, line: 81, type: !264, isLocal: false, isDefinition: true, scopeLine: 81, isOptimized: false, unit: !1, retainedNodes: !3)
!264 = !DISubroutineType(types: !265)
!265 = !{!65, !252, !252}
!266 = !DILocalVariable(name: "m", arg: 1, scope: !263, file: !7, line: 81, type: !252)
!267 = !DILocation(line: 81, column: 1, scope: !263)
!268 = !DILocalVariable(name: "$ret10", scope: !263, file: !7, line: 81, type: !65)
!269 = !DILocation(line: 81, column: 33, scope: !263)
!270 = !DILocation(line: 82, column: 7, scope: !263)
!271 = !DILocation(line: 85, column: 2, scope: !263)
!272 = !DILocation(line: 83, column: 11, scope: !263)
!273 = !DILocation(line: 83, column: 3, scope: !263)
!274 = distinct !DISubprogram(name: "app.GetStyle..1command_line_arguments.StatusBar", linkageName: "command_line_arguments.StatusBar.GetStyle", scope: null, file: !7, line: 88, type: !275, isLocal: false, isDefinition: true, scopeLine: 88, isOptimized: false, unit: !1, retainedNodes: !3)
!275 = !DISubroutineType(types: !276)
!276 = !{!183, !252, !252}
!277 = !DILocalVariable(name: "m", arg: 1, scope: !274, file: !7, line: 88, type: !252)
!278 = !DILocation(line: 88, column: 1, scope: !274)
!279 = !DILocalVariable(name: "$ret11", scope: !274, file: !7, line: 88, type: !183)
!280 = !DILocation(line: 88, column: 32, scope: !274)
!281 = !DILocation(line: 89, column: 7, scope: !274)
!282 = !DILocation(line: 92, column: 2, scope: !274)
!283 = !DILocation(line: 90, column: 11, scope: !274)
!284 = !DILocation(line: 90, column: 3, scope: !274)
!285 = distinct !DISubprogram(name: "app.Reset..1command_line_arguments.StatusBar", linkageName: "command_line_arguments.StatusBar.Reset", scope: null, file: !7, line: 76, type: !286, isLocal: false, isDefinition: true, scopeLine: 76, isOptimized: false, unit: !1, retainedNodes: !3)
!286 = !DISubroutineType(types: !287)
!287 = !{!56, !252, !252}
!288 = !DILocalVariable(name: "m", arg: 1, scope: !285, file: !7, line: 76, type: !252)
!289 = !DILocation(line: 76, column: 1, scope: !285)
!290 = !DILocation(line: 76, column: 50, scope: !285)
!291 = !DILocation(line: 76, column: 53, scope: !285)
!292 = distinct !DISubprogram(name: "app.String..1command_line_arguments.StatusBar", linkageName: "command_line_arguments.StatusBar.String", scope: null, file: !7, line: 77, type: !293, isLocal: false, isDefinition: true, scopeLine: 77, isOptimized: false, unit: !1, retainedNodes: !3)
!293 = !DISubroutineType(types: !294)
!294 = !{!69, !252, !252}
!295 = !DILocalVariable(name: "m", arg: 1, scope: !292, file: !7, line: 77, type: !252)
!296 = !DILocation(line: 77, column: 1, scope: !292)
!297 = !DILocation(line: 77, column: 81, scope: !292)
!298 = !DILocation(line: 77, column: 63, scope: !292)
!299 = !DILocation(line: 77, column: 50, scope: !292)
!300 = distinct !DISubprogram(name: "app.command_line_arguments..init0", linkageName: "command_line_arguments.command_line_arguments..init0", scope: null, file: !7, line: 95, type: !157, isLocal: false, isDefinition: true, scopeLine: 95, isOptimized: false, unit: !1, retainedNodes: !3)
!301 = !DILocation(line: 96, column: 8, scope: !300)
!302 = !DILocation(line: 97, column: 8, scope: !300)
!303 = !DILocation(line: 98, column: 43, scope: !300)
!304 = !DILocation(line: 98, column: 64, scope: !300)
!305 = !DILocation(line: 98, column: 8, scope: !300)
