; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/golang/protobuf/proto\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/golang/protobuf/proto\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22image\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22image\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22image\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22color\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22image/color\22"
module asm "\09.ascii \22 \5C\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./gen.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha/proto")
!3 = !{}
!4 = !{!5, !109, !111, !127, !137}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments._.0", linkageName: "command_line_arguments._.0", scope: !1, file: !7, line: 23, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "image.pb.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 18, size: 64, align: 8, elements: !10)
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 18, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !95}
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !16, size: 320, align: 8, elements: !17)
!16 = !DIFile(filename: "", directory: "")
!17 = !{!18, !27}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 18, baseType: !19, size: 192, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !16, size: 192, align: 8, elements: !20)
!20 = !{!21, !24, !26}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !16, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !16, line: 1, baseType: !25, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 18, baseType: !28, size: 128, align: 64, offset: 192)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !29, line: 1, size: 128, align: 8, elements: !30)
!29 = !DIFile(filename: "<built-in>", directory: "")
!30 = !{!31, !94}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !29, line: 1, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !16, size: 128, align: 8, elements: !34)
!34 = !{!35, !90}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 1, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !29, line: 1, size: 576, align: 8, elements: !38)
!38 = !{!39, !41, !42, !44, !45, !46, !47, !57, !66, !67, !73, !89}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !29, line: 1, baseType: !40, size: 64, align: 64)
!40 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !29, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !29, line: 1, baseType: !43, size: 32, align: 32, offset: 128)
!43 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 168)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 176)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !29, line: 1, baseType: !48, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !29, line: 1, size: 64, align: 8, elements: !50)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !29, line: 1, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!40, !55, !40}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIBasicType(name: "void")
!57 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !29, line: 1, baseType: !58, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !29, line: 1, size: 64, align: 8, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !29, line: 1, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !55, !55}
!65 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !29, line: 1, baseType: !22, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !29, line: 1, baseType: !68, size: 64, align: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !29, line: 1, size: 128, align: 8, elements: !70)
!70 = !{!71, !72}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !29, line: 1, baseType: !22, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !29, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !29, line: 1, baseType: !74, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !29, line: 1, size: 320, align: 8, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !29, line: 1, baseType: !68, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !29, line: 1, baseType: !68, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !29, line: 1, baseType: !80, size: 192, align: 64, offset: 128)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !16, size: 192, align: 8, elements: !81)
!81 = !{!82, !24, !26}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !29, line: 1, size: 320, align: 8, elements: !85)
!85 = !{!77, !78, !86, !87, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !16, line: 1, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!69, !55}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !7, line: 18, size: 128, align: 8, elements: !96)
!96 = !{!97, !108}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 18, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void,*func(*void)string}", file: !16, size: 256, align: 8, elements: !100)
!100 = !{!101, !102, !106, !107}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 18, baseType: !36, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMessage", file: !16, line: 18, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!56, !55}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", file: !16, line: 18, baseType: !103, size: 64, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !16, line: 18, baseType: !91, size: 64, align: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !29, line: 1, type: !43, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "command_line_arguments._.1", linkageName: "command_line_arguments._.1", scope: !1, file: !7, line: 24, type: !113, isLocal: false, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 19, size: 64, align: 8, elements: !115)
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 19, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!28, !69, !120}
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*void},int,int}", file: !16, size: 192, align: 8, elements: !121)
!121 = !{!122, !24, !26}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !16, size: 128, align: 8, elements: !125)
!125 = !{!35, !126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !16, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "command_line_arguments._.2", linkageName: "command_line_arguments._.2", scope: !1, file: !7, line: 25, type: !129, isLocal: false, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 20, size: 64, align: 8, elements: !131)
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 20, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !25}
!136 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor0", linkageName: "command_line_arguments.fileDescriptor0", scope: !1, file: !7, line: 178, type: !19, isLocal: true, isDefinition: true)
!139 = distinct !DISubprogram(name: "proto.ColorEncode", linkageName: "command_line_arguments.ColorEncode", scope: null, file: !140, line: 8, type: !141, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!140 = !DIFile(filename: "image.go", directory: ".")
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !150}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", file: !7, line: 129, size: 128, align: 8, elements: !145)
!145 = !{!146, !147, !148, !149}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Red", file: !7, line: 130, baseType: !43, size: 32, align: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", file: !7, line: 131, baseType: !43, size: 32, align: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Green", file: !7, line: 132, baseType: !43, size: 32, align: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Alpha", file: !7, line: 133, baseType: !43, size: 32, align: 32, offset: 96)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", file: !140, line: 4, size: 128, align: 8, elements: !151)
!151 = !{!152, !167}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !140, line: 4, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{uint32,uint32,uint32,uint32}}", file: !16, size: 128, align: 8, elements: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 4, baseType: !36, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "RGBA", file: !16, line: 4, baseType: !158, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!161, !55}
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{uint32,uint32,uint32,uint32}", file: !16, size: 128, align: 8, elements: !162)
!162 = !{!163, !164, !165, !166}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !16, line: 4, baseType: !43, size: 32, align: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !16, line: 4, baseType: !43, size: 32, align: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !16, line: 4, baseType: !43, size: 32, align: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "a", file: !16, line: 4, baseType: !43, size: 32, align: 32, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !140, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!168 = !DILocalVariable(name: "c", arg: 1, scope: !139, file: !140, line: 8, type: !150)
!169 = !DILocation(line: 8, column: 18, scope: !139)
!170 = !DILocalVariable(name: "$ret0", scope: !139, file: !140, line: 8, type: !143)
!171 = !DILocation(line: 8, column: 33, scope: !139)
!172 = !DILocation(line: 9, column: 7, scope: !173)
!173 = distinct !DILexicalBlock(scope: !139, file: !140, line: 8, column: 1)
!174 = !DILocation(line: 10, column: 3, scope: !173)
!175 = !DILocation(line: 12, column: 17, scope: !173)
!176 = !DILocalVariable(name: "r", scope: !173, file: !140, line: 12, type: !43)
!177 = !DILocation(line: 12, column: 2, scope: !139)
!178 = !DILocalVariable(name: "g", scope: !173, file: !140, line: 12, type: !43)
!179 = !DILocalVariable(name: "b", scope: !173, file: !140, line: 12, type: !43)
!180 = !DILocalVariable(name: "a", scope: !173, file: !140, line: 12, type: !43)
!181 = !DILocation(line: 13, column: 9, scope: !173)
!182 = !DILocation(line: 13, column: 10, scope: !173)
!183 = !DILocation(line: 13, column: 2, scope: !173)
!184 = distinct !DISubprogram(name: "proto.command_line_arguments.Color..hash", linkageName: "command_line_arguments.command_line_arguments.Color..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!185 = !DILocalVariable(name: "key", arg: 1, scope: !184, file: !29, line: 1, type: !55)
!186 = !DILocation(line: 1, column: 1, scope: !184)
!187 = !DILocalVariable(name: "seed", arg: 2, scope: !184, file: !29, line: 1, type: !40)
!188 = !DILocalVariable(name: "$ret28", scope: !184, file: !29, line: 1, type: !40)
!189 = distinct !DISubprogram(name: "proto.command_line_arguments.Color..eq", linkageName: "command_line_arguments.command_line_arguments.Color..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!190 = !DILocalVariable(name: "key1", arg: 1, scope: !189, file: !29, line: 1, type: !55)
!191 = !DILocation(line: 1, column: 1, scope: !189)
!192 = !DILocalVariable(name: "key2", arg: 2, scope: !189, file: !29, line: 1, type: !55)
!193 = !DILocalVariable(name: "$ret29", scope: !189, file: !29, line: 1, type: !65)
!194 = distinct !DISubprogram(name: "proto.Descriptor..1command_line_arguments.Color", linkageName: "command_line_arguments.Color.Descriptor", scope: null, file: !7, line: 139, type: !195, isLocal: false, isDefinition: true, scopeLine: 139, isOptimized: false, unit: !1, retainedNodes: !3)
!195 = !DISubroutineType(types: !196)
!196 = !{!197, !143, !143}
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},struct{*int,int,int}}", file: !16, size: 384, align: 8, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 139, baseType: !19, size: 192, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 139, baseType: !201, size: 192, align: 64, offset: 192)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !16, size: 192, align: 8, elements: !202)
!202 = !{!203, !24, !26}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!205 = !DILocalVariable(name: "r.7", arg: 1, scope: !194, file: !7, line: 139, type: !143)
!206 = !DILocation(line: 139, column: 1, scope: !194)
!207 = !DILocation(line: 139, column: 70, scope: !194)
!208 = !DILocalVariable(name: "$ret23", scope: !194, file: !7, line: 139, type: !201)
!209 = !DILocation(line: 139, column: 37, scope: !194)
!210 = !DILocation(line: 139, column: 46, scope: !194)
!211 = distinct !DISubprogram(name: "proto.GetAlpha..1command_line_arguments.Color", linkageName: "command_line_arguments.Color.GetAlpha", scope: null, file: !7, line: 162, type: !212, isLocal: false, isDefinition: true, scopeLine: 162, isOptimized: false, unit: !1, retainedNodes: !3)
!212 = !DISubroutineType(types: !213)
!213 = !{!43, !143, !143}
!214 = !DILocalVariable(name: "m", arg: 1, scope: !211, file: !7, line: 162, type: !143)
!215 = !DILocation(line: 162, column: 1, scope: !211)
!216 = !DILocalVariable(name: "$ret27", scope: !211, file: !7, line: 162, type: !43)
!217 = !DILocation(line: 162, column: 28, scope: !211)
!218 = !DILocation(line: 163, column: 7, scope: !211)
!219 = !DILocation(line: 166, column: 2, scope: !211)
!220 = !DILocation(line: 164, column: 11, scope: !211)
!221 = !DILocation(line: 164, column: 3, scope: !211)
!222 = distinct !DISubprogram(name: "proto.GetBlue..1command_line_arguments.Color", linkageName: "command_line_arguments.Color.GetBlue", scope: null, file: !7, line: 148, type: !212, isLocal: false, isDefinition: true, scopeLine: 148, isOptimized: false, unit: !1, retainedNodes: !3)
!223 = !DILocalVariable(name: "m", arg: 1, scope: !222, file: !7, line: 148, type: !143)
!224 = !DILocation(line: 148, column: 1, scope: !222)
!225 = !DILocalVariable(name: "$ret25", scope: !222, file: !7, line: 148, type: !43)
!226 = !DILocation(line: 148, column: 27, scope: !222)
!227 = !DILocation(line: 149, column: 7, scope: !222)
!228 = !DILocation(line: 152, column: 2, scope: !222)
!229 = !DILocation(line: 150, column: 11, scope: !222)
!230 = !DILocation(line: 150, column: 3, scope: !222)
!231 = distinct !DISubprogram(name: "proto.GetGreen..1command_line_arguments.Color", linkageName: "command_line_arguments.Color.GetGreen", scope: null, file: !7, line: 155, type: !212, isLocal: false, isDefinition: true, scopeLine: 155, isOptimized: false, unit: !1, retainedNodes: !3)
!232 = !DILocalVariable(name: "m", arg: 1, scope: !231, file: !7, line: 155, type: !143)
!233 = !DILocation(line: 155, column: 1, scope: !231)
!234 = !DILocalVariable(name: "$ret26", scope: !231, file: !7, line: 155, type: !43)
!235 = !DILocation(line: 155, column: 28, scope: !231)
!236 = !DILocation(line: 156, column: 7, scope: !231)
!237 = !DILocation(line: 159, column: 2, scope: !231)
!238 = !DILocation(line: 157, column: 11, scope: !231)
!239 = !DILocation(line: 157, column: 3, scope: !231)
!240 = distinct !DISubprogram(name: "proto.GetRed..1command_line_arguments.Color", linkageName: "command_line_arguments.Color.GetRed", scope: null, file: !7, line: 141, type: !212, isLocal: false, isDefinition: true, scopeLine: 141, isOptimized: false, unit: !1, retainedNodes: !3)
!241 = !DILocalVariable(name: "m", arg: 1, scope: !240, file: !7, line: 141, type: !143)
!242 = !DILocation(line: 141, column: 1, scope: !240)
!243 = !DILocalVariable(name: "$ret24", scope: !240, file: !7, line: 141, type: !43)
!244 = !DILocation(line: 141, column: 26, scope: !240)
!245 = !DILocation(line: 142, column: 7, scope: !240)
!246 = !DILocation(line: 145, column: 2, scope: !240)
!247 = !DILocation(line: 143, column: 11, scope: !240)
!248 = !DILocation(line: 143, column: 3, scope: !240)
!249 = distinct !DISubprogram(name: "proto.Reset..1command_line_arguments.Color", linkageName: "command_line_arguments.Color.Reset", scope: null, file: !7, line: 136, type: !250, isLocal: false, isDefinition: true, scopeLine: 136, isOptimized: false, unit: !1, retainedNodes: !3)
!250 = !DISubroutineType(types: !251)
!251 = !{!56, !143, !143}
!252 = !DILocalVariable(name: "m", arg: 1, scope: !249, file: !7, line: 136, type: !143)
!253 = !DILocation(line: 136, column: 1, scope: !249)
!254 = !DILocation(line: 136, column: 46, scope: !249)
!255 = !DILocation(line: 136, column: 49, scope: !249)
!256 = distinct !DISubprogram(name: "proto.String..1command_line_arguments.Color", linkageName: "command_line_arguments.Color.String", scope: null, file: !7, line: 137, type: !257, isLocal: false, isDefinition: true, scopeLine: 137, isOptimized: false, unit: !1, retainedNodes: !3)
!257 = !DISubroutineType(types: !258)
!258 = !{!69, !143, !143}
!259 = !DILocalVariable(name: "m", arg: 1, scope: !256, file: !7, line: 137, type: !143)
!260 = !DILocation(line: 137, column: 1, scope: !256)
!261 = !DILocation(line: 137, column: 78, scope: !256)
!262 = !DILocation(line: 137, column: 60, scope: !256)
!263 = !DILocation(line: 137, column: 46, scope: !256)
!264 = distinct !DISubprogram(name: "proto.ImageEncode", linkageName: "command_line_arguments.ImageEncode", scope: null, file: !140, line: 21, type: !265, isLocal: false, isDefinition: true, scopeLine: 21, isOptimized: false, unit: !1, retainedNodes: !3)
!265 = !DISubroutineType(types: !266)
!266 = !{!267, !275}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !7, line: 33, size: 384, align: 8, elements: !269)
!269 = !{!270, !272, !273, !274}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Width", file: !7, line: 34, baseType: !271, size: 64, align: 64)
!271 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Height", file: !7, line: 35, baseType: !271, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Stride", file: !7, line: 36, baseType: !271, size: 64, align: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Data", file: !7, line: 37, baseType: !19, size: 192, align: 64, offset: 192)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !140, line: 4, size: 128, align: 8, elements: !276)
!276 = !{!277, !167}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !140, line: 4, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,int,int)Color,*func(*void)Rectangle,*func(*void)Model}", file: !16, size: 256, align: 8, elements: !280)
!280 = !{!156, !281, !285, !297}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "At", file: !16, line: 4, baseType: !282, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!150, !55, !25, !25}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Bounds", file: !16, line: 4, baseType: !286, size: 64, align: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!289, !55}
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rectangle", file: !140, line: 4, size: 256, align: 8, elements: !290)
!290 = !{!291, !296}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Min", file: !140, line: 4, baseType: !292, size: 128, align: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "Point", file: !140, line: 4, size: 128, align: 8, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "X", file: !140, line: 4, baseType: !25, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Y", file: !140, line: 4, baseType: !25, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Max", file: !140, line: 4, baseType: !292, size: 128, align: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ColorModel", file: !16, line: 4, baseType: !298, size: 64, align: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!301, !55}
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "Model", file: !140, line: 4, size: 128, align: 8, elements: !302)
!302 = !{!303, !167}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !140, line: 4, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Color)Color}", file: !16, size: 128, align: 8, elements: !306)
!306 = !{!156, !307}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Convert", file: !16, line: 4, baseType: !308, size: 64, align: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!150, !55, !150}
!311 = !DILocalVariable(name: "img", arg: 1, scope: !264, file: !140, line: 21, type: !275)
!312 = !DILocation(line: 21, column: 18, scope: !264)
!313 = !DILocalVariable(name: "$ret1", scope: !264, file: !140, line: 21, type: !267)
!314 = !DILocation(line: 21, column: 35, scope: !264)
!315 = !DILocation(line: 22, column: 9, scope: !316)
!316 = distinct !DILexicalBlock(scope: !264, file: !140, line: 21, column: 1)
!317 = !DILocation(line: 23, column: 3, scope: !316)
!318 = !DILocation(line: 26, column: 15, scope: !316)
!319 = !DILocalVariable(name: "bounds", scope: !316, file: !140, line: 26, type: !289)
!320 = !DILocation(line: 26, column: 2, scope: !264)
!321 = !DILocation(line: 27, column: 18, scope: !316)
!322 = !DILocalVariable(name: "newImg", scope: !316, file: !140, line: 27, type: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "RGBA", file: !140, line: 4, size: 512, align: 8, elements: !325)
!325 = !{!326, !327, !328}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Pix", file: !140, line: 4, baseType: !19, size: 192, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Stride", file: !140, line: 4, baseType: !25, size: 64, align: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Rect", file: !140, line: 4, baseType: !289, size: 256, align: 64, offset: 256)
!329 = !DILocation(line: 27, column: 2, scope: !264)
!330 = !DILocation(line: 28, column: 21, scope: !331)
!331 = distinct !DILexicalBlock(scope: !316, file: !140, line: 28, column: 2)
!332 = !DILocalVariable(name: "x", scope: !331, file: !140, line: 28, type: !25)
!333 = !DILocation(line: 28, column: 6, scope: !316)
!334 = !DILocation(line: 28, column: 39, scope: !331)
!335 = !DILocation(line: 28, column: 27, scope: !331)
!336 = !DILocation(line: 29, column: 40, scope: !337)
!337 = distinct !DILexicalBlock(scope: !331, file: !140, line: 29, column: 3)
!338 = !DILocalVariable(name: "y", scope: !337, file: !140, line: 29, type: !25)
!339 = !DILocation(line: 29, column: 7, scope: !331)
!340 = !DILocation(line: 30, column: 24, scope: !337)
!341 = !DILocation(line: 30, column: 10, scope: !337)
!342 = !DILocation(line: 29, column: 44, scope: !337)
!343 = !DILocation(line: 29, column: 28, scope: !337)
!344 = !DILocation(line: 28, column: 43, scope: !331)
!345 = !DILocation(line: 29, column: 22, scope: !337)
!346 = !DILocation(line: 36, column: 23, scope: !316)
!347 = !DILocation(line: 35, column: 27, scope: !316)
!348 = !DILocation(line: 35, column: 42, scope: !316)
!349 = !DILocation(line: 35, column: 30, scope: !316)
!350 = !DILocation(line: 34, column: 42, scope: !316)
!351 = !DILocation(line: 34, column: 30, scope: !316)
!352 = !DILocation(line: 33, column: 9, scope: !316)
!353 = !DILocation(line: 33, column: 10, scope: !316)
!354 = !DILocation(line: 33, column: 2, scope: !316)
!355 = distinct !DISubprogram(name: "proto.Descriptor..1command_line_arguments.Image", linkageName: "command_line_arguments.Image.Descriptor", scope: null, file: !7, line: 43, type: !356, isLocal: false, isDefinition: true, scopeLine: 43, isOptimized: false, unit: !1, retainedNodes: !3)
!356 = !DISubroutineType(types: !357)
!357 = !{!197, !267, !267}
!358 = !DILocalVariable(name: "r.1", arg: 1, scope: !355, file: !7, line: 43, type: !267)
!359 = !DILocation(line: 43, column: 1, scope: !355)
!360 = !DILocation(line: 43, column: 70, scope: !355)
!361 = !DILocalVariable(name: "$ret5", scope: !355, file: !7, line: 43, type: !201)
!362 = !DILocation(line: 43, column: 37, scope: !355)
!363 = !DILocation(line: 43, column: 46, scope: !355)
!364 = distinct !DISubprogram(name: "proto.GetData..1command_line_arguments.Image", linkageName: "command_line_arguments.Image.GetData", scope: null, file: !7, line: 66, type: !365, isLocal: false, isDefinition: true, scopeLine: 66, isOptimized: false, unit: !1, retainedNodes: !3)
!365 = !DISubroutineType(types: !366)
!366 = !{!19, !267, !267}
!367 = !DILocalVariable(name: "m", arg: 1, scope: !364, file: !7, line: 66, type: !267)
!368 = !DILocation(line: 66, column: 1, scope: !364)
!369 = !DILocation(line: 67, column: 7, scope: !364)
!370 = !DILocation(line: 70, column: 2, scope: !364)
!371 = !DILocation(line: 68, column: 11, scope: !364)
!372 = !DILocation(line: 68, column: 3, scope: !364)
!373 = distinct !DISubprogram(name: "proto.GetHeight..1command_line_arguments.Image", linkageName: "command_line_arguments.Image.GetHeight", scope: null, file: !7, line: 52, type: !374, isLocal: false, isDefinition: true, scopeLine: 52, isOptimized: false, unit: !1, retainedNodes: !3)
!374 = !DISubroutineType(types: !375)
!375 = !{!271, !267, !267}
!376 = !DILocalVariable(name: "m", arg: 1, scope: !373, file: !7, line: 52, type: !267)
!377 = !DILocation(line: 52, column: 1, scope: !373)
!378 = !DILocalVariable(name: "$ret7", scope: !373, file: !7, line: 52, type: !271)
!379 = !DILocation(line: 52, column: 29, scope: !373)
!380 = !DILocation(line: 53, column: 7, scope: !373)
!381 = !DILocation(line: 56, column: 2, scope: !373)
!382 = !DILocation(line: 54, column: 11, scope: !373)
!383 = !DILocation(line: 54, column: 3, scope: !373)
!384 = distinct !DISubprogram(name: "proto.GetStride..1command_line_arguments.Image", linkageName: "command_line_arguments.Image.GetStride", scope: null, file: !7, line: 59, type: !374, isLocal: false, isDefinition: true, scopeLine: 59, isOptimized: false, unit: !1, retainedNodes: !3)
!385 = !DILocalVariable(name: "m", arg: 1, scope: !384, file: !7, line: 59, type: !267)
!386 = !DILocation(line: 59, column: 1, scope: !384)
!387 = !DILocalVariable(name: "$ret8", scope: !384, file: !7, line: 59, type: !271)
!388 = !DILocation(line: 59, column: 29, scope: !384)
!389 = !DILocation(line: 60, column: 7, scope: !384)
!390 = !DILocation(line: 63, column: 2, scope: !384)
!391 = !DILocation(line: 61, column: 11, scope: !384)
!392 = !DILocation(line: 61, column: 3, scope: !384)
!393 = distinct !DISubprogram(name: "proto.GetWidth..1command_line_arguments.Image", linkageName: "command_line_arguments.Image.GetWidth", scope: null, file: !7, line: 45, type: !374, isLocal: false, isDefinition: true, scopeLine: 45, isOptimized: false, unit: !1, retainedNodes: !3)
!394 = !DILocalVariable(name: "m", arg: 1, scope: !393, file: !7, line: 45, type: !267)
!395 = !DILocation(line: 45, column: 1, scope: !393)
!396 = !DILocalVariable(name: "$ret6", scope: !393, file: !7, line: 45, type: !271)
!397 = !DILocation(line: 45, column: 28, scope: !393)
!398 = !DILocation(line: 46, column: 7, scope: !393)
!399 = !DILocation(line: 49, column: 2, scope: !393)
!400 = !DILocation(line: 47, column: 11, scope: !393)
!401 = !DILocation(line: 47, column: 3, scope: !393)
!402 = distinct !DISubprogram(name: "proto.Reset..1command_line_arguments.Image", linkageName: "command_line_arguments.Image.Reset", scope: null, file: !7, line: 40, type: !403, isLocal: false, isDefinition: true, scopeLine: 40, isOptimized: false, unit: !1, retainedNodes: !3)
!403 = !DISubroutineType(types: !404)
!404 = !{!56, !267, !267}
!405 = !DILocalVariable(name: "m", arg: 1, scope: !402, file: !7, line: 40, type: !267)
!406 = !DILocation(line: 40, column: 1, scope: !402)
!407 = !DILocation(line: 40, column: 49, scope: !402)
!408 = distinct !DISubprogram(name: "proto.String..1command_line_arguments.Image", linkageName: "command_line_arguments.Image.String", scope: null, file: !7, line: 41, type: !409, isLocal: false, isDefinition: true, scopeLine: 41, isOptimized: false, unit: !1, retainedNodes: !3)
!409 = !DISubroutineType(types: !410)
!410 = !{!69, !267, !267}
!411 = !DILocalVariable(name: "m", arg: 1, scope: !408, file: !7, line: 41, type: !267)
!412 = !DILocation(line: 41, column: 1, scope: !408)
!413 = !DILocation(line: 41, column: 78, scope: !408)
!414 = !DILocation(line: 41, column: 60, scope: !408)
!415 = !DILocation(line: 41, column: 46, scope: !408)
!416 = distinct !DISubprogram(name: "proto.ImageDecode", linkageName: "command_line_arguments.ImageDecode", scope: null, file: !140, line: 41, type: !417, isLocal: false, isDefinition: true, scopeLine: 41, isOptimized: false, unit: !1, retainedNodes: !3)
!417 = !DISubroutineType(types: !418)
!418 = !{!275, !267}
!419 = !DILocalVariable(name: "img", arg: 1, scope: !416, file: !140, line: 41, type: !267)
!420 = !DILocation(line: 41, column: 18, scope: !416)
!421 = !DILocation(line: 45, column: 35, scope: !416)
!422 = !DILocation(line: 45, column: 51, scope: !416)
!423 = !DILocation(line: 45, column: 17, scope: !416)
!424 = !DILocation(line: 43, column: 14, scope: !416)
!425 = !DILocation(line: 44, column: 18, scope: !416)
!426 = !DILocation(line: 42, column: 9, scope: !416)
!427 = !DILocation(line: 42, column: 16, scope: !416)
!428 = !DILocalVariable(name: "$ret2", scope: !416, file: !140, line: 41, type: !275)
!429 = !DILocation(line: 41, column: 30, scope: !416)
!430 = !DILocation(line: 42, column: 2, scope: !416)
!431 = distinct !DISubprogram(name: "proto.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !432, line: 1, type: !433, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!432 = !DIFile(filename: "gen.go", directory: ".")
!433 = !DISubroutineType(types: !434)
!434 = !{!56}
!435 = !DILocation(line: 1, column: 1, scope: !436)
!436 = !DILexicalBlockFile(scope: !431, file: !29, discriminator: 0)
!437 = !DILocation(line: 23, column: 5, scope: !438)
!438 = !DILexicalBlockFile(scope: !431, file: !7, discriminator: 0)
!439 = !DILocation(line: 24, column: 5, scope: !438)
!440 = !DILocation(line: 25, column: 5, scope: !438)
!441 = !DILocation(line: 169, column: 1, scope: !438)
!442 = !DILocation(line: 176, column: 1, scope: !438)
!443 = distinct !DISubprogram(name: "proto.command_line_arguments.ImageProperties..hash", linkageName: "command_line_arguments.command_line_arguments.ImageProperties..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!444 = !DILocalVariable(name: "key", arg: 1, scope: !443, file: !29, line: 1, type: !55)
!445 = !DILocation(line: 1, column: 1, scope: !443)
!446 = !DILocalVariable(name: "seed", arg: 2, scope: !443, file: !29, line: 1, type: !40)
!447 = !DILocalVariable(name: "$ret30", scope: !443, file: !29, line: 1, type: !40)
!448 = distinct !DISubprogram(name: "proto.command_line_arguments.ImageProperties..eq", linkageName: "command_line_arguments.command_line_arguments.ImageProperties..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!449 = !DILocalVariable(name: "key1", arg: 1, scope: !448, file: !29, line: 1, type: !55)
!450 = !DILocation(line: 1, column: 1, scope: !448)
!451 = !DILocalVariable(name: "key2", arg: 2, scope: !448, file: !29, line: 1, type: !55)
!452 = !DILocalVariable(name: "$ret31", scope: !448, file: !29, line: 1, type: !65)
!453 = distinct !DISubprogram(name: "proto.Descriptor..1command_line_arguments.ImageProperties", linkageName: "command_line_arguments.ImageProperties.Descriptor", scope: null, file: !7, line: 82, type: !454, isLocal: false, isDefinition: true, scopeLine: 82, isOptimized: false, unit: !1, retainedNodes: !3)
!454 = !DISubroutineType(types: !455)
!455 = !{!197, !456, !456}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImageProperties", file: !7, line: 73, size: 192, align: 8, elements: !458)
!458 = !{!459, !460, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Width", file: !7, line: 74, baseType: !271, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Height", file: !7, line: 75, baseType: !271, size: 64, align: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Scale", file: !7, line: 76, baseType: !136, size: 64, align: 64, offset: 128)
!462 = !DILocalVariable(name: "r.3", arg: 1, scope: !453, file: !7, line: 82, type: !456)
!463 = !DILocation(line: 82, column: 1, scope: !453)
!464 = !DILocation(line: 82, column: 80, scope: !453)
!465 = !DILocalVariable(name: "$ret12", scope: !453, file: !7, line: 82, type: !201)
!466 = !DILocation(line: 82, column: 47, scope: !453)
!467 = !DILocation(line: 82, column: 56, scope: !453)
!468 = distinct !DISubprogram(name: "proto.GetHeight..1command_line_arguments.ImageProperties", linkageName: "command_line_arguments.ImageProperties.GetHeight", scope: null, file: !7, line: 91, type: !469, isLocal: false, isDefinition: true, scopeLine: 91, isOptimized: false, unit: !1, retainedNodes: !3)
!469 = !DISubroutineType(types: !470)
!470 = !{!271, !456, !456}
!471 = !DILocalVariable(name: "m", arg: 1, scope: !468, file: !7, line: 91, type: !456)
!472 = !DILocation(line: 91, column: 1, scope: !468)
!473 = !DILocalVariable(name: "$ret14", scope: !468, file: !7, line: 91, type: !271)
!474 = !DILocation(line: 91, column: 39, scope: !468)
!475 = !DILocation(line: 92, column: 7, scope: !468)
!476 = !DILocation(line: 95, column: 2, scope: !468)
!477 = !DILocation(line: 93, column: 11, scope: !468)
!478 = !DILocation(line: 93, column: 3, scope: !468)
!479 = distinct !DISubprogram(name: "proto.GetScale..1command_line_arguments.ImageProperties", linkageName: "command_line_arguments.ImageProperties.GetScale", scope: null, file: !7, line: 98, type: !480, isLocal: false, isDefinition: true, scopeLine: 98, isOptimized: false, unit: !1, retainedNodes: !3)
!480 = !DISubroutineType(types: !481)
!481 = !{!136, !456, !456}
!482 = !DILocalVariable(name: "m", arg: 1, scope: !479, file: !7, line: 98, type: !456)
!483 = !DILocation(line: 98, column: 1, scope: !479)
!484 = !DILocalVariable(name: "$ret15", scope: !479, file: !7, line: 98, type: !136)
!485 = !DILocation(line: 98, column: 38, scope: !479)
!486 = !DILocation(line: 99, column: 7, scope: !479)
!487 = !DILocation(line: 102, column: 2, scope: !479)
!488 = !DILocation(line: 100, column: 11, scope: !479)
!489 = !DILocation(line: 100, column: 3, scope: !479)
!490 = distinct !DISubprogram(name: "proto.GetWidth..1command_line_arguments.ImageProperties", linkageName: "command_line_arguments.ImageProperties.GetWidth", scope: null, file: !7, line: 84, type: !469, isLocal: false, isDefinition: true, scopeLine: 84, isOptimized: false, unit: !1, retainedNodes: !3)
!491 = !DILocalVariable(name: "m", arg: 1, scope: !490, file: !7, line: 84, type: !456)
!492 = !DILocation(line: 84, column: 1, scope: !490)
!493 = !DILocalVariable(name: "$ret13", scope: !490, file: !7, line: 84, type: !271)
!494 = !DILocation(line: 84, column: 38, scope: !490)
!495 = !DILocation(line: 85, column: 7, scope: !490)
!496 = !DILocation(line: 88, column: 2, scope: !490)
!497 = !DILocation(line: 86, column: 11, scope: !490)
!498 = !DILocation(line: 86, column: 3, scope: !490)
!499 = distinct !DISubprogram(name: "proto.Reset..1command_line_arguments.ImageProperties", linkageName: "command_line_arguments.ImageProperties.Reset", scope: null, file: !7, line: 79, type: !500, isLocal: false, isDefinition: true, scopeLine: 79, isOptimized: false, unit: !1, retainedNodes: !3)
!500 = !DISubroutineType(types: !501)
!501 = !{!56, !456, !456}
!502 = !DILocalVariable(name: "m", arg: 1, scope: !499, file: !7, line: 79, type: !456)
!503 = !DILocation(line: 79, column: 1, scope: !499)
!504 = !DILocation(line: 79, column: 56, scope: !499)
!505 = !DILocation(line: 79, column: 59, scope: !499)
!506 = distinct !DISubprogram(name: "proto.String..1command_line_arguments.ImageProperties", linkageName: "command_line_arguments.ImageProperties.String", scope: null, file: !7, line: 80, type: !507, isLocal: false, isDefinition: true, scopeLine: 80, isOptimized: false, unit: !1, retainedNodes: !3)
!507 = !DISubroutineType(types: !508)
!508 = !{!69, !456, !456}
!509 = !DILocalVariable(name: "m", arg: 1, scope: !506, file: !7, line: 80, type: !456)
!510 = !DILocation(line: 80, column: 1, scope: !506)
!511 = !DILocation(line: 80, column: 88, scope: !506)
!512 = !DILocation(line: 80, column: 70, scope: !506)
!513 = !DILocation(line: 80, column: 56, scope: !506)
!514 = distinct !DISubprogram(name: "proto.command_line_arguments.ImageOrResource..hash", linkageName: "command_line_arguments.command_line_arguments.ImageOrResource..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!515 = !DILocalVariable(name: "key", arg: 1, scope: !514, file: !29, line: 1, type: !55)
!516 = !DILocation(line: 1, column: 1, scope: !514)
!517 = !DILocalVariable(name: "seed", arg: 2, scope: !514, file: !29, line: 1, type: !40)
!518 = !DILocalVariable(name: "$ret32", scope: !514, file: !29, line: 1, type: !40)
!519 = distinct !DISubprogram(name: "proto.command_line_arguments.ImageOrResource..eq", linkageName: "command_line_arguments.command_line_arguments.ImageOrResource..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!520 = !DILocalVariable(name: "key1", arg: 1, scope: !519, file: !29, line: 1, type: !55)
!521 = !DILocation(line: 1, column: 1, scope: !519)
!522 = !DILocalVariable(name: "key2", arg: 2, scope: !519, file: !29, line: 1, type: !55)
!523 = !DILocalVariable(name: "$ret33", scope: !519, file: !29, line: 1, type: !65)
!524 = distinct !DISubprogram(name: "proto.Descriptor..1command_line_arguments.ImageOrResource", linkageName: "command_line_arguments.ImageOrResource.Descriptor", scope: null, file: !7, line: 113, type: !525, isLocal: false, isDefinition: true, scopeLine: 113, isOptimized: false, unit: !1, retainedNodes: !3)
!525 = !DISubroutineType(types: !526)
!526 = !{!197, !527, !527}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImageOrResource", file: !7, line: 105, size: 192, align: 8, elements: !529)
!529 = !{!530, !531}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Image", file: !7, line: 106, baseType: !267, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !7, line: 107, baseType: !69, size: 128, align: 64, offset: 64)
!532 = !DILocalVariable(name: "r.5", arg: 1, scope: !524, file: !7, line: 113, type: !527)
!533 = !DILocation(line: 113, column: 1, scope: !524)
!534 = !DILocation(line: 113, column: 80, scope: !524)
!535 = !DILocalVariable(name: "$ret18", scope: !524, file: !7, line: 113, type: !201)
!536 = !DILocation(line: 113, column: 47, scope: !524)
!537 = !DILocation(line: 113, column: 56, scope: !524)
!538 = distinct !DISubprogram(name: "proto.GetImage..1command_line_arguments.ImageOrResource", linkageName: "command_line_arguments.ImageOrResource.GetImage", scope: null, file: !7, line: 115, type: !539, isLocal: false, isDefinition: true, scopeLine: 115, isOptimized: false, unit: !1, retainedNodes: !3)
!539 = !DISubroutineType(types: !540)
!540 = !{!267, !527, !527}
!541 = !DILocalVariable(name: "m", arg: 1, scope: !538, file: !7, line: 115, type: !527)
!542 = !DILocation(line: 115, column: 1, scope: !538)
!543 = !DILocalVariable(name: "$ret19", scope: !538, file: !7, line: 115, type: !267)
!544 = !DILocation(line: 115, column: 38, scope: !538)
!545 = !DILocation(line: 116, column: 7, scope: !538)
!546 = !DILocation(line: 119, column: 2, scope: !538)
!547 = !DILocation(line: 117, column: 11, scope: !538)
!548 = !DILocation(line: 117, column: 3, scope: !538)
!549 = distinct !DISubprogram(name: "proto.GetPath..1command_line_arguments.ImageOrResource", linkageName: "command_line_arguments.ImageOrResource.GetPath", scope: null, file: !7, line: 122, type: !550, isLocal: false, isDefinition: true, scopeLine: 122, isOptimized: false, unit: !1, retainedNodes: !3)
!550 = !DISubroutineType(types: !551)
!551 = !{!69, !527, !527}
!552 = !DILocalVariable(name: "m", arg: 1, scope: !549, file: !7, line: 122, type: !527)
!553 = !DILocation(line: 122, column: 1, scope: !549)
!554 = !DILocation(line: 123, column: 7, scope: !549)
!555 = !DILocalVariable(name: "$ret20", scope: !549, file: !7, line: 122, type: !69)
!556 = !DILocation(line: 122, column: 37, scope: !549)
!557 = !DILocation(line: 126, column: 2, scope: !549)
!558 = !DILocation(line: 124, column: 3, scope: !549)
!559 = distinct !DISubprogram(name: "proto.Reset..1command_line_arguments.ImageOrResource", linkageName: "command_line_arguments.ImageOrResource.Reset", scope: null, file: !7, line: 110, type: !560, isLocal: false, isDefinition: true, scopeLine: 110, isOptimized: false, unit: !1, retainedNodes: !3)
!560 = !DISubroutineType(types: !561)
!561 = !{!56, !527, !527}
!562 = !DILocalVariable(name: "m", arg: 1, scope: !559, file: !7, line: 110, type: !527)
!563 = !DILocation(line: 110, column: 1, scope: !559)
!564 = !DILocation(line: 110, column: 59, scope: !559)
!565 = distinct !DISubprogram(name: "proto.String..1command_line_arguments.ImageOrResource", linkageName: "command_line_arguments.ImageOrResource.String", scope: null, file: !7, line: 111, type: !550, isLocal: false, isDefinition: true, scopeLine: 111, isOptimized: false, unit: !1, retainedNodes: !3)
!566 = !DILocalVariable(name: "m", arg: 1, scope: !565, file: !7, line: 111, type: !527)
!567 = !DILocation(line: 111, column: 1, scope: !565)
!568 = !DILocation(line: 111, column: 88, scope: !565)
!569 = !DILocation(line: 111, column: 70, scope: !565)
!570 = !DILocation(line: 111, column: 56, scope: !565)
!571 = distinct !DISubprogram(name: "proto.command_line_arguments..init0", linkageName: "command_line_arguments.command_line_arguments..init0", scope: null, file: !7, line: 169, type: !433, isLocal: false, isDefinition: true, scopeLine: 169, isOptimized: false, unit: !1, retainedNodes: !3)
!572 = !DILocation(line: 170, column: 9, scope: !571)
!573 = !DILocation(line: 171, column: 9, scope: !571)
!574 = !DILocation(line: 172, column: 9, scope: !571)
!575 = !DILocation(line: 173, column: 9, scope: !571)
