; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22view\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/golang/protobuf/proto\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/golang/protobuf/proto\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22any\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/golang/protobuf/ptypes/any\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/golang/protobuf/ptypes/any\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./alert.pb.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha/proto/view")
!3 = !{}
!4 = !{!5, !109, !111, !127, !137, !139, !142, !144, !146, !148, !151, !153, !155, !170, !172, !174, !177, !179, !181, !183, !186, !188, !190, !192, !195, !197, !199, !201, !204, !206, !208, !210, !213, !215, !217}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments._.0", linkageName: "command_line_arguments._.0", scope: !1, file: !7, line: 43, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "alert.pb.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 38, size: 64, align: 8, elements: !10)
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 38, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !95}
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !16, size: 320, align: 8, elements: !17)
!16 = !DIFile(filename: "", directory: "")
!17 = !{!18, !27}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 38, baseType: !19, size: 192, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !16, size: 192, align: 8, elements: !20)
!20 = !{!21, !24, !26}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !16, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !16, line: 1, baseType: !25, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 38, baseType: !28, size: 128, align: 64, offset: 192)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !29, line: 1, size: 128, align: 8, elements: !30)
!29 = !DIFile(filename: "<built-in>", directory: "")
!30 = !{!31, !94}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !29, line: 1, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !16, size: 128, align: 8, elements: !34)
!34 = !{!35, !90}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 1, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !29, line: 1, size: 576, align: 8, elements: !38)
!38 = !{!39, !41, !42, !44, !45, !46, !47, !57, !66, !67, !73, !89}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !29, line: 1, baseType: !40, size: 64, align: 64)
!40 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !29, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !29, line: 1, baseType: !43, size: 32, align: 32, offset: 128)
!43 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 168)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 176)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !29, line: 1, baseType: !48, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !29, line: 1, size: 64, align: 8, elements: !50)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !29, line: 1, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!40, !55, !40}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIBasicType(name: "void")
!57 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !29, line: 1, baseType: !58, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !29, line: 1, size: 64, align: 8, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !29, line: 1, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !55, !55}
!65 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !29, line: 1, baseType: !22, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !29, line: 1, baseType: !68, size: 64, align: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !29, line: 1, size: 128, align: 8, elements: !70)
!70 = !{!71, !72}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !29, line: 1, baseType: !22, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !29, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !29, line: 1, baseType: !74, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !29, line: 1, size: 320, align: 8, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !29, line: 1, baseType: !68, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !29, line: 1, baseType: !68, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !29, line: 1, baseType: !80, size: 192, align: 64, offset: 128)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !16, size: 192, align: 8, elements: !81)
!81 = !{!82, !24, !26}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !29, line: 1, size: 320, align: 8, elements: !85)
!85 = !{!77, !78, !86, !87, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !16, line: 1, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!69, !55}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !7, line: 38, size: 128, align: 8, elements: !96)
!96 = !{!97, !108}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 38, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void,*func(*void)string}", file: !16, size: 256, align: 8, elements: !100)
!100 = !{!101, !102, !106, !107}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 38, baseType: !36, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMessage", file: !16, line: 38, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!56, !55}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", file: !16, line: 38, baseType: !103, size: 64, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !16, line: 38, baseType: !91, size: 64, align: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !29, line: 1, type: !43, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "command_line_arguments._.1", linkageName: "command_line_arguments._.1", scope: !1, file: !7, line: 44, type: !113, isLocal: false, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 39, size: 64, align: 8, elements: !115)
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 39, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!28, !69, !120}
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*void},int,int}", file: !16, size: 192, align: 8, elements: !121)
!121 = !{!122, !24, !26}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !16, size: 128, align: 8, elements: !125)
!125 = !{!35, !126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !16, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "command_line_arguments._.2", linkageName: "command_line_arguments._.2", scope: !1, file: !7, line: 45, type: !129, isLocal: false, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 40, size: 64, align: 8, elements: !131)
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 40, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !25}
!136 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor0", linkageName: "command_line_arguments.fileDescriptor0", scope: !1, file: !7, line: 116, type: !19, isLocal: true, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "command_line_arguments._.3", linkageName: "command_line_arguments._.3", scope: !1, file: !141, line: 12, type: !8, isLocal: false, isDefinition: true)
!141 = !DIFile(filename: "button.pb.go", directory: ".")
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "command_line_arguments._.4", linkageName: "command_line_arguments._.4", scope: !1, file: !141, line: 13, type: !113, isLocal: false, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "command_line_arguments._.5", linkageName: "command_line_arguments._.5", scope: !1, file: !141, line: 14, type: !129, isLocal: false, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor1", linkageName: "command_line_arguments.fileDescriptor1", scope: !1, file: !141, line: 54, type: !19, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "command_line_arguments._.6", linkageName: "command_line_arguments._.6", scope: !1, file: !150, line: 12, type: !8, isLocal: false, isDefinition: true)
!150 = !DIFile(filename: "imageview.pb.go", directory: ".")
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "command_line_arguments._.7", linkageName: "command_line_arguments._.7", scope: !1, file: !150, line: 13, type: !113, isLocal: false, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "command_line_arguments._.8", linkageName: "command_line_arguments._.8", scope: !1, file: !150, line: 14, type: !129, isLocal: false, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "command_line_arguments.ImageResizeMode_name", linkageName: "command_line_arguments.ImageResizeMode_name", scope: !1, file: !150, line: 25, type: !157, isLocal: false, isDefinition: true)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !29, line: 1, size: 384, align: 8, elements: !159)
!159 = !{!160, !161, !162, !163, !165, !166, !167, !168, !169}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !29, line: 1, baseType: !25, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 72)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !29, line: 1, baseType: !164, size: 16, align: 16, offset: 80)
!164 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !29, line: 1, baseType: !43, size: 32, align: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !29, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 320)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "command_line_arguments.ImageResizeMode_value", linkageName: "command_line_arguments.ImageResizeMode_value", scope: !1, file: !150, line: 31, type: !157, isLocal: false, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor2", linkageName: "command_line_arguments.fileDescriptor2", scope: !1, file: !150, line: 90, type: !19, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "command_line_arguments._.9", linkageName: "command_line_arguments._.9", scope: !1, file: !176, line: 12, type: !8, isLocal: false, isDefinition: true)
!176 = !DIFile(filename: "scrollview.pb.go", directory: ".")
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "command_line_arguments._.10", linkageName: "command_line_arguments._.10", scope: !1, file: !176, line: 13, type: !113, isLocal: false, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "command_line_arguments._.11", linkageName: "command_line_arguments._.11", scope: !1, file: !176, line: 14, type: !129, isLocal: false, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor3", linkageName: "command_line_arguments.fileDescriptor3", scope: !1, file: !176, line: 87, type: !19, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "command_line_arguments._.12", linkageName: "command_line_arguments._.12", scope: !1, file: !185, line: 11, type: !8, isLocal: false, isDefinition: true)
!185 = !DIFile(filename: "slider.pb.go", directory: ".")
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "command_line_arguments._.13", linkageName: "command_line_arguments._.13", scope: !1, file: !185, line: 12, type: !113, isLocal: false, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "command_line_arguments._.14", linkageName: "command_line_arguments._.14", scope: !1, file: !185, line: 13, type: !129, isLocal: false, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor4", linkageName: "command_line_arguments.fileDescriptor4", scope: !1, file: !185, line: 78, type: !19, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "command_line_arguments._.15", linkageName: "command_line_arguments._.15", scope: !1, file: !194, line: 11, type: !8, isLocal: false, isDefinition: true)
!194 = !DIFile(filename: "switchview.pb.go", directory: ".")
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "command_line_arguments._.16", linkageName: "command_line_arguments._.16", scope: !1, file: !194, line: 12, type: !113, isLocal: false, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "command_line_arguments._.17", linkageName: "command_line_arguments._.17", scope: !1, file: !194, line: 13, type: !129, isLocal: false, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor5", linkageName: "command_line_arguments.fileDescriptor5", scope: !1, file: !194, line: 62, type: !19, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "command_line_arguments._.18", linkageName: "command_line_arguments._.18", scope: !1, file: !203, line: 13, type: !8, isLocal: false, isDefinition: true)
!203 = !DIFile(filename: "textinput.pb.go", directory: ".")
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "command_line_arguments._.19", linkageName: "command_line_arguments._.19", scope: !1, file: !203, line: 14, type: !113, isLocal: false, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "command_line_arguments._.20", linkageName: "command_line_arguments._.20", scope: !1, file: !203, line: 15, type: !129, isLocal: false, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor6", linkageName: "command_line_arguments.fileDescriptor6", scope: !1, file: !203, line: 146, type: !19, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "command_line_arguments._.21", linkageName: "command_line_arguments._.21", scope: !1, file: !212, line: 12, type: !8, isLocal: false, isDefinition: true)
!212 = !DIFile(filename: "view.pb.go", directory: ".")
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "command_line_arguments._.22", linkageName: "command_line_arguments._.22", scope: !1, file: !212, line: 13, type: !113, isLocal: false, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "command_line_arguments._.23", linkageName: "command_line_arguments._.23", scope: !1, file: !212, line: 14, type: !129, isLocal: false, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor7", linkageName: "command_line_arguments.fileDescriptor7", scope: !1, file: !212, line: 362, type: !19, isLocal: true, isDefinition: true)
!219 = distinct !DISubprogram(name: "view.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 36, type: !220, isLocal: false, isDefinition: true, scopeLine: 36, isOptimized: false, unit: !1, retainedNodes: !3)
!220 = !DISubroutineType(types: !221)
!221 = !{!56}
!222 = !DILocation(line: 1, column: 1, scope: !223)
!223 = !DILexicalBlockFile(scope: !219, file: !29, discriminator: 0)
!224 = !DILocation(line: 43, column: 5, scope: !225)
!225 = !DILexicalBlockFile(scope: !219, file: !7, discriminator: 0)
!226 = !DILocation(line: 44, column: 5, scope: !225)
!227 = !DILocation(line: 45, column: 5, scope: !225)
!228 = !DILocation(line: 12, column: 5, scope: !229)
!229 = !DILexicalBlockFile(scope: !219, file: !141, discriminator: 0)
!230 = !DILocation(line: 13, column: 5, scope: !229)
!231 = !DILocation(line: 14, column: 5, scope: !229)
!232 = !DILocation(line: 12, column: 5, scope: !233)
!233 = !DILexicalBlockFile(scope: !219, file: !150, discriminator: 0)
!234 = !DILocation(line: 13, column: 5, scope: !233)
!235 = !DILocation(line: 14, column: 5, scope: !233)
!236 = !DILocation(line: 25, column: 28, scope: !233)
!237 = !DILocation(line: 25, column: 5, scope: !233)
!238 = !DILocation(line: 31, column: 29, scope: !233)
!239 = !DILocation(line: 31, column: 5, scope: !233)
!240 = !DILocation(line: 12, column: 5, scope: !241)
!241 = !DILexicalBlockFile(scope: !219, file: !176, discriminator: 0)
!242 = !DILocation(line: 13, column: 5, scope: !241)
!243 = !DILocation(line: 14, column: 5, scope: !241)
!244 = !DILocation(line: 11, column: 5, scope: !245)
!245 = !DILexicalBlockFile(scope: !219, file: !185, discriminator: 0)
!246 = !DILocation(line: 12, column: 5, scope: !245)
!247 = !DILocation(line: 13, column: 5, scope: !245)
!248 = !DILocation(line: 11, column: 5, scope: !249)
!249 = !DILexicalBlockFile(scope: !219, file: !194, discriminator: 0)
!250 = !DILocation(line: 12, column: 5, scope: !249)
!251 = !DILocation(line: 13, column: 5, scope: !249)
!252 = !DILocation(line: 13, column: 5, scope: !253)
!253 = !DILexicalBlockFile(scope: !219, file: !203, discriminator: 0)
!254 = !DILocation(line: 14, column: 5, scope: !253)
!255 = !DILocation(line: 15, column: 5, scope: !253)
!256 = !DILocation(line: 12, column: 5, scope: !257)
!257 = !DILexicalBlockFile(scope: !219, file: !212, discriminator: 0)
!258 = !DILocation(line: 13, column: 5, scope: !257)
!259 = !DILocation(line: 14, column: 5, scope: !257)
!260 = !DILocation(line: 109, column: 1, scope: !225)
!261 = !DILocation(line: 114, column: 1, scope: !225)
!262 = !DILocation(line: 48, column: 1, scope: !229)
!263 = !DILocation(line: 52, column: 1, scope: !229)
!264 = !DILocation(line: 83, column: 1, scope: !233)
!265 = !DILocation(line: 88, column: 1, scope: !233)
!266 = !DILocation(line: 80, column: 1, scope: !241)
!267 = !DILocation(line: 85, column: 1, scope: !241)
!268 = !DILocation(line: 71, column: 1, scope: !245)
!269 = !DILocation(line: 76, column: 1, scope: !245)
!270 = !DILocation(line: 55, column: 1, scope: !249)
!271 = !DILocation(line: 60, column: 1, scope: !249)
!272 = !DILocation(line: 137, column: 1, scope: !253)
!273 = !DILocation(line: 144, column: 1, scope: !253)
!274 = !DILocation(line: 354, column: 1, scope: !257)
!275 = !DILocation(line: 360, column: 1, scope: !257)
!276 = distinct !DISubprogram(name: "view.Descriptor..1command_line_arguments.Alert", linkageName: "command_line_arguments.Alert.Descriptor", scope: null, file: !7, line: 63, type: !277, isLocal: false, isDefinition: true, scopeLine: 63, isOptimized: false, unit: !1, retainedNodes: !3)
!277 = !DISubroutineType(types: !278)
!278 = !{!279, !287, !287}
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},struct{*int,int,int}}", file: !16, size: 384, align: 8, elements: !280)
!280 = !{!281, !282}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 63, baseType: !19, size: 192, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 63, baseType: !283, size: 192, align: 64, offset: 192)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !16, size: 192, align: 8, elements: !284)
!284 = !{!285, !24, !26}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "Alert", file: !7, line: 53, size: 512, align: 8, elements: !289)
!289 = !{!290, !292, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !7, line: 54, baseType: !291, size: 64, align: 64)
!291 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Title", file: !7, line: 55, baseType: !69, size: 128, align: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !7, line: 56, baseType: !69, size: 128, align: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Buttons", file: !7, line: 57, baseType: !295, size: 192, align: 64, offset: 320)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**AlertButton,int,int}", file: !16, size: 192, align: 8, elements: !296)
!296 = !{!297, !24, !26}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "AlertButton", file: !7, line: 93, size: 128, align: 8, elements: !301)
!301 = !{!302}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Title", file: !7, line: 94, baseType: !69, size: 128, align: 64)
!303 = !DILocalVariable(name: "r.1", arg: 1, scope: !276, file: !7, line: 63, type: !287)
!304 = !DILocation(line: 63, column: 1, scope: !276)
!305 = !DILocation(line: 63, column: 70, scope: !276)
!306 = !DILocalVariable(name: "$ret2", scope: !276, file: !7, line: 63, type: !283)
!307 = !DILocation(line: 63, column: 37, scope: !276)
!308 = !DILocation(line: 63, column: 46, scope: !276)
!309 = distinct !DISubprogram(name: "view.Descriptor..1command_line_arguments.AlertButton", linkageName: "command_line_arguments.AlertButton.Descriptor", scope: null, file: !7, line: 100, type: !310, isLocal: false, isDefinition: true, scopeLine: 100, isOptimized: false, unit: !1, retainedNodes: !3)
!310 = !DISubroutineType(types: !311)
!311 = !{!279, !299, !299}
!312 = !DILocalVariable(name: "r.3", arg: 1, scope: !309, file: !7, line: 100, type: !299)
!313 = !DILocation(line: 100, column: 1, scope: !309)
!314 = !DILocation(line: 100, column: 76, scope: !309)
!315 = !DILocalVariable(name: "$ret9", scope: !309, file: !7, line: 100, type: !283)
!316 = !DILocation(line: 100, column: 43, scope: !309)
!317 = !DILocation(line: 100, column: 52, scope: !309)
!318 = distinct !DISubprogram(name: "view.GetTitle..1command_line_arguments.AlertButton", linkageName: "command_line_arguments.AlertButton.GetTitle", scope: null, file: !7, line: 102, type: !319, isLocal: false, isDefinition: true, scopeLine: 102, isOptimized: false, unit: !1, retainedNodes: !3)
!319 = !DISubroutineType(types: !320)
!320 = !{!69, !299, !299}
!321 = !DILocalVariable(name: "m", arg: 1, scope: !318, file: !7, line: 102, type: !299)
!322 = !DILocation(line: 102, column: 1, scope: !318)
!323 = !DILocation(line: 103, column: 7, scope: !318)
!324 = !DILocalVariable(name: "$ret10", scope: !318, file: !7, line: 102, type: !69)
!325 = !DILocation(line: 102, column: 34, scope: !318)
!326 = !DILocation(line: 106, column: 2, scope: !318)
!327 = !DILocation(line: 104, column: 3, scope: !318)
!328 = distinct !DISubprogram(name: "view.Reset..1command_line_arguments.AlertButton", linkageName: "command_line_arguments.AlertButton.Reset", scope: null, file: !7, line: 97, type: !329, isLocal: false, isDefinition: true, scopeLine: 97, isOptimized: false, unit: !1, retainedNodes: !3)
!329 = !DISubroutineType(types: !330)
!330 = !{!56, !299, !299}
!331 = !DILocalVariable(name: "m", arg: 1, scope: !328, file: !7, line: 97, type: !299)
!332 = !DILocation(line: 97, column: 1, scope: !328)
!333 = !DILocation(line: 97, column: 55, scope: !328)
!334 = distinct !DISubprogram(name: "view.String..1command_line_arguments.AlertButton", linkageName: "command_line_arguments.AlertButton.String", scope: null, file: !7, line: 98, type: !319, isLocal: false, isDefinition: true, scopeLine: 98, isOptimized: false, unit: !1, retainedNodes: !3)
!335 = !DILocalVariable(name: "m", arg: 1, scope: !334, file: !7, line: 98, type: !299)
!336 = !DILocation(line: 98, column: 1, scope: !334)
!337 = !DILocation(line: 98, column: 83, scope: !334)
!338 = !DILocation(line: 98, column: 65, scope: !334)
!339 = !DILocation(line: 98, column: 52, scope: !334)
!340 = distinct !DISubprogram(name: "view.command_line_arguments.AlertButton..hash", linkageName: "command_line_arguments.command_line_arguments.AlertButton..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!341 = !DILocalVariable(name: "key", arg: 1, scope: !340, file: !29, line: 1, type: !55)
!342 = !DILocation(line: 1, column: 1, scope: !340)
!343 = !DILocalVariable(name: "seed", arg: 2, scope: !340, file: !29, line: 1, type: !40)
!344 = !DILocalVariable(name: "$ret130", scope: !340, file: !29, line: 1, type: !40)
!345 = distinct !DISubprogram(name: "view.command_line_arguments.AlertButton..eq", linkageName: "command_line_arguments.command_line_arguments.AlertButton..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!346 = !DILocalVariable(name: "key1", arg: 1, scope: !345, file: !29, line: 1, type: !55)
!347 = !DILocation(line: 1, column: 1, scope: !345)
!348 = !DILocalVariable(name: "key2", arg: 2, scope: !345, file: !29, line: 1, type: !55)
!349 = !DILocalVariable(name: "$ret131", scope: !345, file: !29, line: 1, type: !65)
!350 = distinct !DISubprogram(name: "view.GetButtons..1command_line_arguments.Alert", linkageName: "command_line_arguments.Alert.GetButtons", scope: null, file: !7, line: 86, type: !351, isLocal: false, isDefinition: true, scopeLine: 86, isOptimized: false, unit: !1, retainedNodes: !3)
!351 = !DISubroutineType(types: !352)
!352 = !{!295, !287, !287}
!353 = !DILocalVariable(name: "m", arg: 1, scope: !350, file: !7, line: 86, type: !287)
!354 = !DILocation(line: 86, column: 1, scope: !350)
!355 = !DILocation(line: 87, column: 7, scope: !350)
!356 = !DILocation(line: 90, column: 2, scope: !350)
!357 = !DILocation(line: 88, column: 11, scope: !350)
!358 = !DILocation(line: 88, column: 3, scope: !350)
!359 = distinct !DISubprogram(name: "view.GetId..1command_line_arguments.Alert", linkageName: "command_line_arguments.Alert.GetId", scope: null, file: !7, line: 65, type: !360, isLocal: false, isDefinition: true, scopeLine: 65, isOptimized: false, unit: !1, retainedNodes: !3)
!360 = !DISubroutineType(types: !361)
!361 = !{!291, !287, !287}
!362 = !DILocalVariable(name: "m", arg: 1, scope: !359, file: !7, line: 65, type: !287)
!363 = !DILocation(line: 65, column: 1, scope: !359)
!364 = !DILocalVariable(name: "$ret3", scope: !359, file: !7, line: 65, type: !291)
!365 = !DILocation(line: 65, column: 25, scope: !359)
!366 = !DILocation(line: 66, column: 7, scope: !359)
!367 = !DILocation(line: 69, column: 2, scope: !359)
!368 = !DILocation(line: 67, column: 11, scope: !359)
!369 = !DILocation(line: 67, column: 3, scope: !359)
!370 = distinct !DISubprogram(name: "view.GetMessage..1command_line_arguments.Alert", linkageName: "command_line_arguments.Alert.GetMessage", scope: null, file: !7, line: 79, type: !371, isLocal: false, isDefinition: true, scopeLine: 79, isOptimized: false, unit: !1, retainedNodes: !3)
!371 = !DISubroutineType(types: !372)
!372 = !{!69, !287, !287}
!373 = !DILocalVariable(name: "m", arg: 1, scope: !370, file: !7, line: 79, type: !287)
!374 = !DILocation(line: 79, column: 1, scope: !370)
!375 = !DILocation(line: 80, column: 7, scope: !370)
!376 = !DILocalVariable(name: "$ret5", scope: !370, file: !7, line: 79, type: !69)
!377 = !DILocation(line: 79, column: 30, scope: !370)
!378 = !DILocation(line: 83, column: 2, scope: !370)
!379 = !DILocation(line: 81, column: 3, scope: !370)
!380 = distinct !DISubprogram(name: "view.GetTitle..1command_line_arguments.Alert", linkageName: "command_line_arguments.Alert.GetTitle", scope: null, file: !7, line: 72, type: !371, isLocal: false, isDefinition: true, scopeLine: 72, isOptimized: false, unit: !1, retainedNodes: !3)
!381 = !DILocalVariable(name: "m", arg: 1, scope: !380, file: !7, line: 72, type: !287)
!382 = !DILocation(line: 72, column: 1, scope: !380)
!383 = !DILocation(line: 73, column: 7, scope: !380)
!384 = !DILocalVariable(name: "$ret4", scope: !380, file: !7, line: 72, type: !69)
!385 = !DILocation(line: 72, column: 28, scope: !380)
!386 = !DILocation(line: 76, column: 2, scope: !380)
!387 = !DILocation(line: 74, column: 3, scope: !380)
!388 = distinct !DISubprogram(name: "view.Reset..1command_line_arguments.Alert", linkageName: "command_line_arguments.Alert.Reset", scope: null, file: !7, line: 60, type: !389, isLocal: false, isDefinition: true, scopeLine: 60, isOptimized: false, unit: !1, retainedNodes: !3)
!389 = !DISubroutineType(types: !390)
!390 = !{!56, !287, !287}
!391 = !DILocalVariable(name: "m", arg: 1, scope: !388, file: !7, line: 60, type: !287)
!392 = !DILocation(line: 60, column: 1, scope: !388)
!393 = !DILocation(line: 60, column: 49, scope: !388)
!394 = distinct !DISubprogram(name: "view.String..1command_line_arguments.Alert", linkageName: "command_line_arguments.Alert.String", scope: null, file: !7, line: 61, type: !371, isLocal: false, isDefinition: true, scopeLine: 61, isOptimized: false, unit: !1, retainedNodes: !3)
!395 = !DILocalVariable(name: "m", arg: 1, scope: !394, file: !7, line: 61, type: !287)
!396 = !DILocation(line: 61, column: 1, scope: !394)
!397 = !DILocation(line: 61, column: 77, scope: !394)
!398 = !DILocation(line: 61, column: 59, scope: !394)
!399 = !DILocation(line: 61, column: 46, scope: !394)
!400 = distinct !DISubprogram(name: "view.command_line_arguments..init0", linkageName: "command_line_arguments.command_line_arguments..init0", scope: null, file: !7, line: 109, type: !220, isLocal: false, isDefinition: true, scopeLine: 109, isOptimized: false, unit: !1, retainedNodes: !3)
!401 = !DILocation(line: 110, column: 8, scope: !400)
!402 = !DILocation(line: 111, column: 8, scope: !400)
!403 = distinct !DISubprogram(name: "view.command_line_arguments..init1", linkageName: "command_line_arguments.command_line_arguments..init1", scope: null, file: !7, line: 114, type: !220, isLocal: false, isDefinition: true, scopeLine: 114, isOptimized: false, unit: !1, retainedNodes: !3)
!404 = !DILocation(line: 114, column: 21, scope: !403)
!405 = distinct !DISubprogram(name: "view.command_line_arguments.Button..hash", linkageName: "command_line_arguments.command_line_arguments.Button..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!406 = !DILocalVariable(name: "key", arg: 1, scope: !405, file: !29, line: 1, type: !55)
!407 = !DILocation(line: 1, column: 1, scope: !405)
!408 = !DILocalVariable(name: "seed", arg: 2, scope: !405, file: !29, line: 1, type: !40)
!409 = !DILocalVariable(name: "$ret132", scope: !405, file: !29, line: 1, type: !40)
!410 = distinct !DISubprogram(name: "view.command_line_arguments.Button..eq", linkageName: "command_line_arguments.command_line_arguments.Button..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!411 = !DILocalVariable(name: "key1", arg: 1, scope: !410, file: !29, line: 1, type: !55)
!412 = !DILocation(line: 1, column: 1, scope: !410)
!413 = !DILocalVariable(name: "key2", arg: 2, scope: !410, file: !29, line: 1, type: !55)
!414 = !DILocalVariable(name: "$ret133", scope: !410, file: !29, line: 1, type: !65)
!415 = distinct !DISubprogram(name: "view.Descriptor..1command_line_arguments.Button", linkageName: "command_line_arguments.Button.Descriptor", scope: null, file: !141, line: 25, type: !416, isLocal: false, isDefinition: true, scopeLine: 25, isOptimized: false, unit: !1, retainedNodes: !3)
!416 = !DISubroutineType(types: !417)
!417 = !{!279, !418, !418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "Button", file: !141, line: 16, size: 256, align: 8, elements: !420)
!420 = !{!421, !422, !423}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Str", file: !141, line: 17, baseType: !69, size: 128, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", file: !141, line: 18, baseType: !65, size: 8, align: 8, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Color", file: !141, line: 19, baseType: !424, size: 64, align: 64, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", file: !141, line: 9, size: 128, align: 8, elements: !426)
!426 = !{!427, !428, !429, !430}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Red", file: !141, line: 9, baseType: !43, size: 32, align: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", file: !141, line: 9, baseType: !43, size: 32, align: 32, offset: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Green", file: !141, line: 9, baseType: !43, size: 32, align: 32, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "Alpha", file: !141, line: 9, baseType: !43, size: 32, align: 32, offset: 96)
!431 = !DILocalVariable(name: "r.5", arg: 1, scope: !415, file: !141, line: 25, type: !418)
!432 = !DILocation(line: 25, column: 1, scope: !415)
!433 = !DILocation(line: 25, column: 71, scope: !415)
!434 = !DILocalVariable(name: "$ret13", scope: !415, file: !141, line: 25, type: !283)
!435 = !DILocation(line: 25, column: 38, scope: !415)
!436 = !DILocation(line: 25, column: 47, scope: !415)
!437 = distinct !DISubprogram(name: "view.GetColor..1command_line_arguments.Button", linkageName: "command_line_arguments.Button.GetColor", scope: null, file: !141, line: 41, type: !438, isLocal: false, isDefinition: true, scopeLine: 41, isOptimized: false, unit: !1, retainedNodes: !3)
!438 = !DISubroutineType(types: !439)
!439 = !{!424, !418, !418}
!440 = !DILocalVariable(name: "m", arg: 1, scope: !437, file: !141, line: 41, type: !418)
!441 = !DILocation(line: 41, column: 1, scope: !437)
!442 = !DILocalVariable(name: "$ret16", scope: !437, file: !141, line: 41, type: !424)
!443 = !DILocation(line: 41, column: 29, scope: !437)
!444 = !DILocation(line: 42, column: 7, scope: !437)
!445 = !DILocation(line: 45, column: 2, scope: !437)
!446 = !DILocation(line: 43, column: 11, scope: !437)
!447 = !DILocation(line: 43, column: 3, scope: !437)
!448 = distinct !DISubprogram(name: "view.GetEnabled..1command_line_arguments.Button", linkageName: "command_line_arguments.Button.GetEnabled", scope: null, file: !141, line: 34, type: !449, isLocal: false, isDefinition: true, scopeLine: 34, isOptimized: false, unit: !1, retainedNodes: !3)
!449 = !DISubroutineType(types: !450)
!450 = !{!65, !418, !418}
!451 = !DILocalVariable(name: "m", arg: 1, scope: !448, file: !141, line: 34, type: !418)
!452 = !DILocation(line: 34, column: 1, scope: !448)
!453 = !DILocalVariable(name: "$ret15", scope: !448, file: !141, line: 34, type: !65)
!454 = !DILocation(line: 34, column: 31, scope: !448)
!455 = !DILocation(line: 35, column: 7, scope: !448)
!456 = !DILocation(line: 38, column: 2, scope: !448)
!457 = !DILocation(line: 36, column: 11, scope: !448)
!458 = !DILocation(line: 36, column: 3, scope: !448)
!459 = distinct !DISubprogram(name: "view.GetStr..1command_line_arguments.Button", linkageName: "command_line_arguments.Button.GetStr", scope: null, file: !141, line: 27, type: !460, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!460 = !DISubroutineType(types: !461)
!461 = !{!69, !418, !418}
!462 = !DILocalVariable(name: "m", arg: 1, scope: !459, file: !141, line: 27, type: !418)
!463 = !DILocation(line: 27, column: 1, scope: !459)
!464 = !DILocation(line: 28, column: 7, scope: !459)
!465 = !DILocalVariable(name: "$ret14", scope: !459, file: !141, line: 27, type: !69)
!466 = !DILocation(line: 27, column: 27, scope: !459)
!467 = !DILocation(line: 31, column: 2, scope: !459)
!468 = !DILocation(line: 29, column: 3, scope: !459)
!469 = distinct !DISubprogram(name: "view.Reset..1command_line_arguments.Button", linkageName: "command_line_arguments.Button.Reset", scope: null, file: !141, line: 22, type: !470, isLocal: false, isDefinition: true, scopeLine: 22, isOptimized: false, unit: !1, retainedNodes: !3)
!470 = !DISubroutineType(types: !471)
!471 = !{!56, !418, !418}
!472 = !DILocalVariable(name: "m", arg: 1, scope: !469, file: !141, line: 22, type: !418)
!473 = !DILocation(line: 22, column: 1, scope: !469)
!474 = !DILocation(line: 22, column: 50, scope: !469)
!475 = distinct !DISubprogram(name: "view.String..1command_line_arguments.Button", linkageName: "command_line_arguments.Button.String", scope: null, file: !141, line: 23, type: !460, isLocal: false, isDefinition: true, scopeLine: 23, isOptimized: false, unit: !1, retainedNodes: !3)
!476 = !DILocalVariable(name: "m", arg: 1, scope: !475, file: !141, line: 23, type: !418)
!477 = !DILocation(line: 23, column: 1, scope: !475)
!478 = !DILocation(line: 23, column: 78, scope: !475)
!479 = !DILocation(line: 23, column: 60, scope: !475)
!480 = !DILocation(line: 23, column: 47, scope: !475)
!481 = distinct !DISubprogram(name: "view.command_line_arguments..init2", linkageName: "command_line_arguments.command_line_arguments..init2", scope: null, file: !141, line: 48, type: !220, isLocal: false, isDefinition: true, scopeLine: 48, isOptimized: false, unit: !1, retainedNodes: !3)
!482 = !DILocation(line: 49, column: 8, scope: !481)
!483 = distinct !DISubprogram(name: "view.command_line_arguments..init3", linkageName: "command_line_arguments.command_line_arguments..init3", scope: null, file: !141, line: 52, type: !220, isLocal: false, isDefinition: true, scopeLine: 52, isOptimized: false, unit: !1, retainedNodes: !3)
!484 = !DILocation(line: 52, column: 21, scope: !483)
!485 = distinct !DISubprogram(name: "view.EnumDescriptor.command_line_arguments.ImageResizeMode", linkageName: "command_line_arguments.ImageResizeMode.EnumDescriptor", scope: null, file: !150, line: 41, type: !486, isLocal: false, isDefinition: true, scopeLine: 41, isOptimized: false, unit: !1, retainedNodes: !3)
!486 = !DISubroutineType(types: !487)
!487 = !{!279, !488, !488}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIBasicType(name: "ImageResizeMode", size: 32, encoding: DW_ATE_signed)
!490 = !DILocalVariable(name: "r.6.pointer", arg: 1, scope: !485, file: !150, line: 41, type: !488)
!491 = !DILocation(line: 41, column: 1, scope: !485)
!492 = !DILocalVariable(name: "r.6", scope: !485, file: !150, line: 41, type: !489)
!493 = !DILocation(line: 41, column: 83, scope: !485)
!494 = !DILocalVariable(name: "$ret19", scope: !485, file: !150, line: 41, type: !283)
!495 = !DILocation(line: 41, column: 50, scope: !485)
!496 = !DILocation(line: 41, column: 59, scope: !485)
!497 = distinct !DISubprogram(name: "view.String.command_line_arguments.ImageResizeMode", linkageName: "command_line_arguments.ImageResizeMode.String", scope: null, file: !150, line: 38, type: !498, isLocal: false, isDefinition: true, scopeLine: 38, isOptimized: false, unit: !1, retainedNodes: !3)
!498 = !DISubroutineType(types: !499)
!499 = !{!69, !488, !488}
!500 = !DILocalVariable(name: "pointer", arg: 1, scope: !497, file: !150, line: 38, type: !488)
!501 = !DILocation(line: 38, column: 1, scope: !497)
!502 = !DILocalVariable(name: "x", scope: !497, file: !150, line: 38, type: !489)
!503 = !DILocation(line: 39, column: 24, scope: !497)
!504 = !DILocation(line: 39, column: 15, scope: !497)
!505 = !DILocation(line: 39, column: 2, scope: !497)
!506 = distinct !DISubprogram(name: "view.command_line_arguments.ImageView..hash", linkageName: "command_line_arguments.command_line_arguments.ImageView..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!507 = !DILocalVariable(name: "key", arg: 1, scope: !506, file: !29, line: 1, type: !55)
!508 = !DILocation(line: 1, column: 1, scope: !506)
!509 = !DILocalVariable(name: "seed", arg: 2, scope: !506, file: !29, line: 1, type: !40)
!510 = !DILocalVariable(name: "$ret134", scope: !506, file: !29, line: 1, type: !40)
!511 = distinct !DISubprogram(name: "view.command_line_arguments.ImageView..eq", linkageName: "command_line_arguments.command_line_arguments.ImageView..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!512 = !DILocalVariable(name: "key1", arg: 1, scope: !511, file: !29, line: 1, type: !55)
!513 = !DILocation(line: 1, column: 1, scope: !511)
!514 = !DILocalVariable(name: "key2", arg: 2, scope: !511, file: !29, line: 1, type: !55)
!515 = !DILocalVariable(name: "$ret135", scope: !511, file: !29, line: 1, type: !65)
!516 = distinct !DISubprogram(name: "view.Descriptor..1command_line_arguments.ImageView", linkageName: "command_line_arguments.ImageView.Descriptor", scope: null, file: !150, line: 53, type: !517, isLocal: false, isDefinition: true, scopeLine: 53, isOptimized: false, unit: !1, retainedNodes: !3)
!517 = !DISubroutineType(types: !518)
!518 = !{!279, !519, !519}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImageView", file: !150, line: 43, size: 256, align: 8, elements: !521)
!521 = !{!522, !535, !536, !537}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Image", file: !150, line: 44, baseType: !523, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImageOrResource", file: !141, line: 9, size: 192, align: 8, elements: !525)
!525 = !{!526, !534}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Image", file: !141, line: 9, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !141, line: 9, size: 384, align: 8, elements: !529)
!529 = !{!530, !531, !532, !533}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Width", file: !141, line: 9, baseType: !291, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Height", file: !141, line: 9, baseType: !291, size: 64, align: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Stride", file: !141, line: 9, baseType: !291, size: 64, align: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Data", file: !141, line: 9, baseType: !19, size: 192, align: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !141, line: 9, baseType: !69, size: 128, align: 64, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ResizeMode", file: !150, line: 45, baseType: !489, size: 32, align: 32, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Tint", file: !150, line: 46, baseType: !424, size: 64, align: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Scale", file: !150, line: 47, baseType: !136, size: 64, align: 64, offset: 192)
!538 = !DILocalVariable(name: "r.8", arg: 1, scope: !516, file: !150, line: 53, type: !519)
!539 = !DILocation(line: 53, column: 1, scope: !516)
!540 = !DILocation(line: 53, column: 74, scope: !516)
!541 = !DILocalVariable(name: "$ret22", scope: !516, file: !150, line: 53, type: !283)
!542 = !DILocation(line: 53, column: 41, scope: !516)
!543 = !DILocation(line: 53, column: 50, scope: !516)
!544 = distinct !DISubprogram(name: "view.GetImage..1command_line_arguments.ImageView", linkageName: "command_line_arguments.ImageView.GetImage", scope: null, file: !150, line: 55, type: !545, isLocal: false, isDefinition: true, scopeLine: 55, isOptimized: false, unit: !1, retainedNodes: !3)
!545 = !DISubroutineType(types: !546)
!546 = !{!523, !519, !519}
!547 = !DILocalVariable(name: "m", arg: 1, scope: !544, file: !150, line: 55, type: !519)
!548 = !DILocation(line: 55, column: 1, scope: !544)
!549 = !DILocalVariable(name: "$ret23", scope: !544, file: !150, line: 55, type: !523)
!550 = !DILocation(line: 55, column: 32, scope: !544)
!551 = !DILocation(line: 56, column: 7, scope: !544)
!552 = !DILocation(line: 59, column: 2, scope: !544)
!553 = !DILocation(line: 57, column: 11, scope: !544)
!554 = !DILocation(line: 57, column: 3, scope: !544)
!555 = distinct !DISubprogram(name: "view.GetResizeMode..1command_line_arguments.ImageView", linkageName: "command_line_arguments.ImageView.GetResizeMode", scope: null, file: !150, line: 62, type: !556, isLocal: false, isDefinition: true, scopeLine: 62, isOptimized: false, unit: !1, retainedNodes: !3)
!556 = !DISubroutineType(types: !557)
!557 = !{!489, !519, !519}
!558 = !DILocalVariable(name: "m", arg: 1, scope: !555, file: !150, line: 62, type: !519)
!559 = !DILocation(line: 62, column: 1, scope: !555)
!560 = !DILocalVariable(name: "$ret24", scope: !555, file: !150, line: 62, type: !489)
!561 = !DILocation(line: 62, column: 37, scope: !555)
!562 = !DILocation(line: 63, column: 7, scope: !555)
!563 = !DILocation(line: 66, column: 2, scope: !555)
!564 = !DILocation(line: 64, column: 11, scope: !555)
!565 = !DILocation(line: 64, column: 3, scope: !555)
!566 = distinct !DISubprogram(name: "view.GetScale..1command_line_arguments.ImageView", linkageName: "command_line_arguments.ImageView.GetScale", scope: null, file: !150, line: 76, type: !567, isLocal: false, isDefinition: true, scopeLine: 76, isOptimized: false, unit: !1, retainedNodes: !3)
!567 = !DISubroutineType(types: !568)
!568 = !{!136, !519, !519}
!569 = !DILocalVariable(name: "m", arg: 1, scope: !566, file: !150, line: 76, type: !519)
!570 = !DILocation(line: 76, column: 1, scope: !566)
!571 = !DILocalVariable(name: "$ret26", scope: !566, file: !150, line: 76, type: !136)
!572 = !DILocation(line: 76, column: 32, scope: !566)
!573 = !DILocation(line: 77, column: 7, scope: !566)
!574 = !DILocation(line: 80, column: 2, scope: !566)
!575 = !DILocation(line: 78, column: 11, scope: !566)
!576 = !DILocation(line: 78, column: 3, scope: !566)
!577 = distinct !DISubprogram(name: "view.GetTint..1command_line_arguments.ImageView", linkageName: "command_line_arguments.ImageView.GetTint", scope: null, file: !150, line: 69, type: !578, isLocal: false, isDefinition: true, scopeLine: 69, isOptimized: false, unit: !1, retainedNodes: !3)
!578 = !DISubroutineType(types: !579)
!579 = !{!424, !519, !519}
!580 = !DILocalVariable(name: "m", arg: 1, scope: !577, file: !150, line: 69, type: !519)
!581 = !DILocation(line: 69, column: 1, scope: !577)
!582 = !DILocalVariable(name: "$ret25", scope: !577, file: !150, line: 69, type: !424)
!583 = !DILocation(line: 69, column: 31, scope: !577)
!584 = !DILocation(line: 70, column: 7, scope: !577)
!585 = !DILocation(line: 73, column: 2, scope: !577)
!586 = !DILocation(line: 71, column: 11, scope: !577)
!587 = !DILocation(line: 71, column: 3, scope: !577)
!588 = distinct !DISubprogram(name: "view.Reset..1command_line_arguments.ImageView", linkageName: "command_line_arguments.ImageView.Reset", scope: null, file: !150, line: 50, type: !589, isLocal: false, isDefinition: true, scopeLine: 50, isOptimized: false, unit: !1, retainedNodes: !3)
!589 = !DISubroutineType(types: !590)
!590 = !{!56, !519, !519}
!591 = !DILocalVariable(name: "m", arg: 1, scope: !588, file: !150, line: 50, type: !519)
!592 = !DILocation(line: 50, column: 1, scope: !588)
!593 = !DILocation(line: 50, column: 53, scope: !588)
!594 = distinct !DISubprogram(name: "view.String..1command_line_arguments.ImageView", linkageName: "command_line_arguments.ImageView.String", scope: null, file: !150, line: 51, type: !595, isLocal: false, isDefinition: true, scopeLine: 51, isOptimized: false, unit: !1, retainedNodes: !3)
!595 = !DISubroutineType(types: !596)
!596 = !{!69, !519, !519}
!597 = !DILocalVariable(name: "m", arg: 1, scope: !594, file: !150, line: 51, type: !519)
!598 = !DILocation(line: 51, column: 1, scope: !594)
!599 = !DILocation(line: 51, column: 81, scope: !594)
!600 = !DILocation(line: 51, column: 63, scope: !594)
!601 = !DILocation(line: 51, column: 50, scope: !594)
!602 = distinct !DISubprogram(name: "view.command_line_arguments..init4", linkageName: "command_line_arguments.command_line_arguments..init4", scope: null, file: !150, line: 83, type: !220, isLocal: false, isDefinition: true, scopeLine: 83, isOptimized: false, unit: !1, retainedNodes: !3)
!603 = !DILocation(line: 84, column: 8, scope: !602)
!604 = !DILocation(line: 85, column: 52, scope: !602)
!605 = !DILocation(line: 85, column: 74, scope: !602)
!606 = !DILocation(line: 85, column: 8, scope: !602)
!607 = distinct !DISubprogram(name: "view.command_line_arguments..init5", linkageName: "command_line_arguments.command_line_arguments..init5", scope: null, file: !150, line: 88, type: !220, isLocal: false, isDefinition: true, scopeLine: 88, isOptimized: false, unit: !1, retainedNodes: !3)
!608 = !DILocation(line: 88, column: 21, scope: !607)
!609 = distinct !DISubprogram(name: "view.command_line_arguments.ScrollView..hash", linkageName: "command_line_arguments.command_line_arguments.ScrollView..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!610 = !DILocalVariable(name: "key", arg: 1, scope: !609, file: !29, line: 1, type: !55)
!611 = !DILocation(line: 1, column: 1, scope: !609)
!612 = !DILocalVariable(name: "seed", arg: 2, scope: !609, file: !29, line: 1, type: !40)
!613 = !DILocalVariable(name: "$ret136", scope: !609, file: !29, line: 1, type: !40)
!614 = distinct !DISubprogram(name: "view.command_line_arguments.ScrollView..eq", linkageName: "command_line_arguments.command_line_arguments.ScrollView..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!615 = !DILocalVariable(name: "key1", arg: 1, scope: !614, file: !29, line: 1, type: !55)
!616 = !DILocation(line: 1, column: 1, scope: !614)
!617 = !DILocalVariable(name: "key2", arg: 2, scope: !614, file: !29, line: 1, type: !55)
!618 = !DILocalVariable(name: "$ret137", scope: !614, file: !29, line: 1, type: !65)
!619 = distinct !DISubprogram(name: "view.Descriptor..1command_line_arguments.ScrollView", linkageName: "command_line_arguments.ScrollView.Descriptor", scope: null, file: !176, line: 27, type: !620, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!620 = !DISubroutineType(types: !621)
!621 = !{!279, !622, !622}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScrollView", file: !176, line: 16, size: 40, align: 8, elements: !624)
!624 = !{!625, !626, !627, !628, !629}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ScrollEnabled", file: !176, line: 17, baseType: !65, size: 8, align: 8)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "Horizontal", file: !176, line: 18, baseType: !65, size: 8, align: 8, offset: 8)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Vertical", file: !176, line: 19, baseType: !65, size: 8, align: 8, offset: 16)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ShowsHorizontalScrollIndicator", file: !176, line: 20, baseType: !65, size: 8, align: 8, offset: 24)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ShowsVerticalScrollIndicator", file: !176, line: 21, baseType: !65, size: 8, align: 8, offset: 32)
!630 = !DILocalVariable(name: "r.10", arg: 1, scope: !619, file: !176, line: 27, type: !622)
!631 = !DILocation(line: 27, column: 1, scope: !619)
!632 = !DILocation(line: 27, column: 75, scope: !619)
!633 = !DILocalVariable(name: "$ret29", scope: !619, file: !176, line: 27, type: !283)
!634 = !DILocation(line: 27, column: 42, scope: !619)
!635 = !DILocation(line: 27, column: 51, scope: !619)
!636 = distinct !DISubprogram(name: "view.GetHorizontal..1command_line_arguments.ScrollView", linkageName: "command_line_arguments.ScrollView.GetHorizontal", scope: null, file: !176, line: 36, type: !637, isLocal: false, isDefinition: true, scopeLine: 36, isOptimized: false, unit: !1, retainedNodes: !3)
!637 = !DISubroutineType(types: !638)
!638 = !{!65, !622, !622}
!639 = !DILocalVariable(name: "m", arg: 1, scope: !636, file: !176, line: 36, type: !622)
!640 = !DILocation(line: 36, column: 1, scope: !636)
!641 = !DILocalVariable(name: "$ret31", scope: !636, file: !176, line: 36, type: !65)
!642 = !DILocation(line: 36, column: 38, scope: !636)
!643 = !DILocation(line: 37, column: 7, scope: !636)
!644 = !DILocation(line: 40, column: 2, scope: !636)
!645 = !DILocation(line: 38, column: 11, scope: !636)
!646 = !DILocation(line: 38, column: 3, scope: !636)
!647 = distinct !DISubprogram(name: "view.GetScrollEnabled..1command_line_arguments.ScrollView", linkageName: "command_line_arguments.ScrollView.GetScrollEnabled", scope: null, file: !176, line: 29, type: !637, isLocal: false, isDefinition: true, scopeLine: 29, isOptimized: false, unit: !1, retainedNodes: !3)
!648 = !DILocalVariable(name: "m", arg: 1, scope: !647, file: !176, line: 29, type: !622)
!649 = !DILocation(line: 29, column: 1, scope: !647)
!650 = !DILocalVariable(name: "$ret30", scope: !647, file: !176, line: 29, type: !65)
!651 = !DILocation(line: 29, column: 41, scope: !647)
!652 = !DILocation(line: 30, column: 7, scope: !647)
!653 = !DILocation(line: 33, column: 2, scope: !647)
!654 = !DILocation(line: 31, column: 11, scope: !647)
!655 = !DILocation(line: 31, column: 3, scope: !647)
!656 = distinct !DISubprogram(name: "view.GetShowsHorizontalScrollIndicator..1command_line_arguments.ScrollView", linkageName: "command_line_arguments.ScrollView.GetShowsHorizontalScrollIndicator", scope: null, file: !176, line: 50, type: !637, isLocal: false, isDefinition: true, scopeLine: 50, isOptimized: false, unit: !1, retainedNodes: !3)
!657 = !DILocalVariable(name: "m", arg: 1, scope: !656, file: !176, line: 50, type: !622)
!658 = !DILocation(line: 50, column: 1, scope: !656)
!659 = !DILocalVariable(name: "$ret33", scope: !656, file: !176, line: 50, type: !65)
!660 = !DILocation(line: 50, column: 58, scope: !656)
!661 = !DILocation(line: 51, column: 7, scope: !656)
!662 = !DILocation(line: 54, column: 2, scope: !656)
!663 = !DILocation(line: 52, column: 11, scope: !656)
!664 = !DILocation(line: 52, column: 3, scope: !656)
!665 = distinct !DISubprogram(name: "view.GetShowsVerticalScrollIndicator..1command_line_arguments.ScrollView", linkageName: "command_line_arguments.ScrollView.GetShowsVerticalScrollIndicator", scope: null, file: !176, line: 57, type: !637, isLocal: false, isDefinition: true, scopeLine: 57, isOptimized: false, unit: !1, retainedNodes: !3)
!666 = !DILocalVariable(name: "m", arg: 1, scope: !665, file: !176, line: 57, type: !622)
!667 = !DILocation(line: 57, column: 1, scope: !665)
!668 = !DILocalVariable(name: "$ret34", scope: !665, file: !176, line: 57, type: !65)
!669 = !DILocation(line: 57, column: 56, scope: !665)
!670 = !DILocation(line: 58, column: 7, scope: !665)
!671 = !DILocation(line: 61, column: 2, scope: !665)
!672 = !DILocation(line: 59, column: 11, scope: !665)
!673 = !DILocation(line: 59, column: 3, scope: !665)
!674 = distinct !DISubprogram(name: "view.GetVertical..1command_line_arguments.ScrollView", linkageName: "command_line_arguments.ScrollView.GetVertical", scope: null, file: !176, line: 43, type: !637, isLocal: false, isDefinition: true, scopeLine: 43, isOptimized: false, unit: !1, retainedNodes: !3)
!675 = !DILocalVariable(name: "m", arg: 1, scope: !674, file: !176, line: 43, type: !622)
!676 = !DILocation(line: 43, column: 1, scope: !674)
!677 = !DILocalVariable(name: "$ret32", scope: !674, file: !176, line: 43, type: !65)
!678 = !DILocation(line: 43, column: 36, scope: !674)
!679 = !DILocation(line: 44, column: 7, scope: !674)
!680 = !DILocation(line: 47, column: 2, scope: !674)
!681 = !DILocation(line: 45, column: 11, scope: !674)
!682 = !DILocation(line: 45, column: 3, scope: !674)
!683 = distinct !DISubprogram(name: "view.Reset..1command_line_arguments.ScrollView", linkageName: "command_line_arguments.ScrollView.Reset", scope: null, file: !176, line: 24, type: !684, isLocal: false, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !1, retainedNodes: !3)
!684 = !DISubroutineType(types: !685)
!685 = !{!56, !622, !622}
!686 = !DILocalVariable(name: "m", arg: 1, scope: !683, file: !176, line: 24, type: !622)
!687 = !DILocation(line: 24, column: 1, scope: !683)
!688 = !DILocation(line: 24, column: 51, scope: !683)
!689 = !DILocation(line: 24, column: 54, scope: !683)
!690 = distinct !DISubprogram(name: "view.String..1command_line_arguments.ScrollView", linkageName: "command_line_arguments.ScrollView.String", scope: null, file: !176, line: 25, type: !691, isLocal: false, isDefinition: true, scopeLine: 25, isOptimized: false, unit: !1, retainedNodes: !3)
!691 = !DISubroutineType(types: !692)
!692 = !{!69, !622, !622}
!693 = !DILocalVariable(name: "m", arg: 1, scope: !690, file: !176, line: 25, type: !622)
!694 = !DILocation(line: 25, column: 1, scope: !690)
!695 = !DILocation(line: 25, column: 82, scope: !690)
!696 = !DILocation(line: 25, column: 64, scope: !690)
!697 = !DILocation(line: 25, column: 51, scope: !690)
!698 = distinct !DISubprogram(name: "view.Descriptor..1command_line_arguments.ScrollEvent", linkageName: "command_line_arguments.ScrollEvent.Descriptor", scope: null, file: !176, line: 71, type: !699, isLocal: false, isDefinition: true, scopeLine: 71, isOptimized: false, unit: !1, retainedNodes: !3)
!699 = !DISubroutineType(types: !700)
!700 = !{!279, !701, !701}
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScrollEvent", file: !176, line: 64, size: 64, align: 8, elements: !703)
!703 = !{!704}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ContentOffset", file: !176, line: 65, baseType: !705, size: 64, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "Point", file: !176, line: 9, size: 128, align: 8, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "X", file: !176, line: 9, baseType: !136, size: 64, align: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "Y", file: !176, line: 9, baseType: !136, size: 64, align: 64, offset: 64)
!710 = !DILocalVariable(name: "r.12", arg: 1, scope: !698, file: !176, line: 71, type: !701)
!711 = !DILocation(line: 71, column: 1, scope: !698)
!712 = !DILocation(line: 71, column: 76, scope: !698)
!713 = !DILocalVariable(name: "$ret37", scope: !698, file: !176, line: 71, type: !283)
!714 = !DILocation(line: 71, column: 43, scope: !698)
!715 = !DILocation(line: 71, column: 52, scope: !698)
!716 = distinct !DISubprogram(name: "view.GetContentOffset..1command_line_arguments.ScrollEvent", linkageName: "command_line_arguments.ScrollEvent.GetContentOffset", scope: null, file: !176, line: 73, type: !717, isLocal: false, isDefinition: true, scopeLine: 73, isOptimized: false, unit: !1, retainedNodes: !3)
!717 = !DISubroutineType(types: !718)
!718 = !{!705, !701, !701}
!719 = !DILocalVariable(name: "m", arg: 1, scope: !716, file: !176, line: 73, type: !701)
!720 = !DILocation(line: 73, column: 1, scope: !716)
!721 = !DILocalVariable(name: "$ret38", scope: !716, file: !176, line: 73, type: !705)
!722 = !DILocation(line: 73, column: 42, scope: !716)
!723 = !DILocation(line: 74, column: 7, scope: !716)
!724 = !DILocation(line: 77, column: 2, scope: !716)
!725 = !DILocation(line: 75, column: 11, scope: !716)
!726 = !DILocation(line: 75, column: 3, scope: !716)
!727 = distinct !DISubprogram(name: "view.Reset..1command_line_arguments.ScrollEvent", linkageName: "command_line_arguments.ScrollEvent.Reset", scope: null, file: !176, line: 68, type: !728, isLocal: false, isDefinition: true, scopeLine: 68, isOptimized: false, unit: !1, retainedNodes: !3)
!728 = !DISubroutineType(types: !729)
!729 = !{!56, !701, !701}
!730 = !DILocalVariable(name: "m", arg: 1, scope: !727, file: !176, line: 68, type: !701)
!731 = !DILocation(line: 68, column: 1, scope: !727)
!732 = !DILocation(line: 68, column: 55, scope: !727)
!733 = distinct !DISubprogram(name: "view.String..1command_line_arguments.ScrollEvent", linkageName: "command_line_arguments.ScrollEvent.String", scope: null, file: !176, line: 69, type: !734, isLocal: false, isDefinition: true, scopeLine: 69, isOptimized: false, unit: !1, retainedNodes: !3)
!734 = !DISubroutineType(types: !735)
!735 = !{!69, !701, !701}
!736 = !DILocalVariable(name: "m", arg: 1, scope: !733, file: !176, line: 69, type: !701)
!737 = !DILocation(line: 69, column: 1, scope: !733)
!738 = !DILocation(line: 69, column: 83, scope: !733)
!739 = !DILocation(line: 69, column: 65, scope: !733)
!740 = !DILocation(line: 69, column: 52, scope: !733)
!741 = distinct !DISubprogram(name: "view.command_line_arguments..init6", linkageName: "command_line_arguments.command_line_arguments..init6", scope: null, file: !176, line: 80, type: !220, isLocal: false, isDefinition: true, scopeLine: 80, isOptimized: false, unit: !1, retainedNodes: !3)
!742 = !DILocation(line: 81, column: 8, scope: !741)
!743 = !DILocation(line: 82, column: 8, scope: !741)
!744 = distinct !DISubprogram(name: "view.command_line_arguments..init7", linkageName: "command_line_arguments.command_line_arguments..init7", scope: null, file: !176, line: 85, type: !220, isLocal: false, isDefinition: true, scopeLine: 85, isOptimized: false, unit: !1, retainedNodes: !3)
!745 = !DILocation(line: 85, column: 21, scope: !744)
!746 = distinct !DISubprogram(name: "view.command_line_arguments.Slider..hash", linkageName: "command_line_arguments.command_line_arguments.Slider..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!747 = !DILocalVariable(name: "key", arg: 1, scope: !746, file: !29, line: 1, type: !55)
!748 = !DILocation(line: 1, column: 1, scope: !746)
!749 = !DILocalVariable(name: "seed", arg: 2, scope: !746, file: !29, line: 1, type: !40)
!750 = !DILocalVariable(name: "$ret138", scope: !746, file: !29, line: 1, type: !40)
!751 = distinct !DISubprogram(name: "view.command_line_arguments.Slider..eq", linkageName: "command_line_arguments.command_line_arguments.Slider..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!752 = !DILocalVariable(name: "key1", arg: 1, scope: !751, file: !29, line: 1, type: !55)
!753 = !DILocation(line: 1, column: 1, scope: !751)
!754 = !DILocalVariable(name: "key2", arg: 2, scope: !751, file: !29, line: 1, type: !55)
!755 = !DILocalVariable(name: "$ret139", scope: !751, file: !29, line: 1, type: !65)
!756 = distinct !DISubprogram(name: "view.Descriptor..1command_line_arguments.Slider", linkageName: "command_line_arguments.Slider.Descriptor", scope: null, file: !185, line: 25, type: !757, isLocal: false, isDefinition: true, scopeLine: 25, isOptimized: false, unit: !1, retainedNodes: !3)
!757 = !DISubroutineType(types: !758)
!758 = !{!279, !759, !759}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "Slider", file: !185, line: 15, size: 256, align: 8, elements: !761)
!761 = !{!762, !763, !764, !765}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !185, line: 16, baseType: !136, size: 64, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "MaxValue", file: !185, line: 17, baseType: !136, size: 64, align: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "MinValue", file: !185, line: 18, baseType: !136, size: 64, align: 64, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", file: !185, line: 19, baseType: !65, size: 8, align: 8, offset: 192)
!766 = !DILocalVariable(name: "r.14", arg: 1, scope: !756, file: !185, line: 25, type: !759)
!767 = !DILocation(line: 25, column: 1, scope: !756)
!768 = !DILocation(line: 25, column: 71, scope: !756)
!769 = !DILocalVariable(name: "$ret41", scope: !756, file: !185, line: 25, type: !283)
!770 = !DILocation(line: 25, column: 38, scope: !756)
!771 = !DILocation(line: 25, column: 47, scope: !756)
!772 = distinct !DISubprogram(name: "view.GetEnabled..1command_line_arguments.Slider", linkageName: "command_line_arguments.Slider.GetEnabled", scope: null, file: !185, line: 48, type: !773, isLocal: false, isDefinition: true, scopeLine: 48, isOptimized: false, unit: !1, retainedNodes: !3)
!773 = !DISubroutineType(types: !774)
!774 = !{!65, !759, !759}
!775 = !DILocalVariable(name: "m", arg: 1, scope: !772, file: !185, line: 48, type: !759)
!776 = !DILocation(line: 48, column: 1, scope: !772)
!777 = !DILocalVariable(name: "$ret45", scope: !772, file: !185, line: 48, type: !65)
!778 = !DILocation(line: 48, column: 31, scope: !772)
!779 = !DILocation(line: 49, column: 7, scope: !772)
!780 = !DILocation(line: 52, column: 2, scope: !772)
!781 = !DILocation(line: 50, column: 11, scope: !772)
!782 = !DILocation(line: 50, column: 3, scope: !772)
!783 = distinct !DISubprogram(name: "view.GetMaxValue..1command_line_arguments.Slider", linkageName: "command_line_arguments.Slider.GetMaxValue", scope: null, file: !185, line: 34, type: !784, isLocal: false, isDefinition: true, scopeLine: 34, isOptimized: false, unit: !1, retainedNodes: !3)
!784 = !DISubroutineType(types: !785)
!785 = !{!136, !759, !759}
!786 = !DILocalVariable(name: "m", arg: 1, scope: !783, file: !185, line: 34, type: !759)
!787 = !DILocation(line: 34, column: 1, scope: !783)
!788 = !DILocalVariable(name: "$ret43", scope: !783, file: !185, line: 34, type: !136)
!789 = !DILocation(line: 34, column: 32, scope: !783)
!790 = !DILocation(line: 35, column: 7, scope: !783)
!791 = !DILocation(line: 38, column: 2, scope: !783)
!792 = !DILocation(line: 36, column: 11, scope: !783)
!793 = !DILocation(line: 36, column: 3, scope: !783)
!794 = distinct !DISubprogram(name: "view.GetMinValue..1command_line_arguments.Slider", linkageName: "command_line_arguments.Slider.GetMinValue", scope: null, file: !185, line: 41, type: !784, isLocal: false, isDefinition: true, scopeLine: 41, isOptimized: false, unit: !1, retainedNodes: !3)
!795 = !DILocalVariable(name: "m", arg: 1, scope: !794, file: !185, line: 41, type: !759)
!796 = !DILocation(line: 41, column: 1, scope: !794)
!797 = !DILocalVariable(name: "$ret44", scope: !794, file: !185, line: 41, type: !136)
!798 = !DILocation(line: 41, column: 32, scope: !794)
!799 = !DILocation(line: 42, column: 7, scope: !794)
!800 = !DILocation(line: 45, column: 2, scope: !794)
!801 = !DILocation(line: 43, column: 11, scope: !794)
!802 = !DILocation(line: 43, column: 3, scope: !794)
!803 = distinct !DISubprogram(name: "view.GetValue..1command_line_arguments.Slider", linkageName: "command_line_arguments.Slider.GetValue", scope: null, file: !185, line: 27, type: !784, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!804 = !DILocalVariable(name: "m", arg: 1, scope: !803, file: !185, line: 27, type: !759)
!805 = !DILocation(line: 27, column: 1, scope: !803)
!806 = !DILocalVariable(name: "$ret42", scope: !803, file: !185, line: 27, type: !136)
!807 = !DILocation(line: 27, column: 29, scope: !803)
!808 = !DILocation(line: 28, column: 7, scope: !803)
!809 = !DILocation(line: 31, column: 2, scope: !803)
!810 = !DILocation(line: 29, column: 11, scope: !803)
!811 = !DILocation(line: 29, column: 3, scope: !803)
!812 = distinct !DISubprogram(name: "view.Reset..1command_line_arguments.Slider", linkageName: "command_line_arguments.Slider.Reset", scope: null, file: !185, line: 22, type: !813, isLocal: false, isDefinition: true, scopeLine: 22, isOptimized: false, unit: !1, retainedNodes: !3)
!813 = !DISubroutineType(types: !814)
!814 = !{!56, !759, !759}
!815 = !DILocalVariable(name: "m", arg: 1, scope: !812, file: !185, line: 22, type: !759)
!816 = !DILocation(line: 22, column: 1, scope: !812)
!817 = !DILocation(line: 22, column: 47, scope: !812)
!818 = !DILocation(line: 22, column: 50, scope: !812)
!819 = distinct !DISubprogram(name: "view.String..1command_line_arguments.Slider", linkageName: "command_line_arguments.Slider.String", scope: null, file: !185, line: 23, type: !820, isLocal: false, isDefinition: true, scopeLine: 23, isOptimized: false, unit: !1, retainedNodes: !3)
!820 = !DISubroutineType(types: !821)
!821 = !{!69, !759, !759}
!822 = !DILocalVariable(name: "m", arg: 1, scope: !819, file: !185, line: 23, type: !759)
!823 = !DILocation(line: 23, column: 1, scope: !819)
!824 = !DILocation(line: 23, column: 78, scope: !819)
!825 = !DILocation(line: 23, column: 60, scope: !819)
!826 = !DILocation(line: 23, column: 47, scope: !819)
!827 = distinct !DISubprogram(name: "view.command_line_arguments.SliderEvent..hash", linkageName: "command_line_arguments.command_line_arguments.SliderEvent..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!828 = !DILocalVariable(name: "key", arg: 1, scope: !827, file: !29, line: 1, type: !55)
!829 = !DILocation(line: 1, column: 1, scope: !827)
!830 = !DILocalVariable(name: "seed", arg: 2, scope: !827, file: !29, line: 1, type: !40)
!831 = !DILocalVariable(name: "$ret140", scope: !827, file: !29, line: 1, type: !40)
!832 = distinct !DISubprogram(name: "view.command_line_arguments.SliderEvent..eq", linkageName: "command_line_arguments.command_line_arguments.SliderEvent..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!833 = !DILocalVariable(name: "key1", arg: 1, scope: !832, file: !29, line: 1, type: !55)
!834 = !DILocation(line: 1, column: 1, scope: !832)
!835 = !DILocalVariable(name: "key2", arg: 2, scope: !832, file: !29, line: 1, type: !55)
!836 = !DILocalVariable(name: "$ret141", scope: !832, file: !29, line: 1, type: !65)
!837 = distinct !DISubprogram(name: "view.Descriptor..1command_line_arguments.SliderEvent", linkageName: "command_line_arguments.SliderEvent.Descriptor", scope: null, file: !185, line: 62, type: !838, isLocal: false, isDefinition: true, scopeLine: 62, isOptimized: false, unit: !1, retainedNodes: !3)
!838 = !DISubroutineType(types: !839)
!839 = !{!279, !840, !840}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "SliderEvent", file: !185, line: 55, size: 64, align: 8, elements: !842)
!842 = !{!843}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !185, line: 56, baseType: !136, size: 64, align: 64)
!844 = !DILocalVariable(name: "r.16", arg: 1, scope: !837, file: !185, line: 62, type: !840)
!845 = !DILocation(line: 62, column: 1, scope: !837)
!846 = !DILocation(line: 62, column: 76, scope: !837)
!847 = !DILocalVariable(name: "$ret48", scope: !837, file: !185, line: 62, type: !283)
!848 = !DILocation(line: 62, column: 43, scope: !837)
!849 = !DILocation(line: 62, column: 52, scope: !837)
!850 = distinct !DISubprogram(name: "view.GetValue..1command_line_arguments.SliderEvent", linkageName: "command_line_arguments.SliderEvent.GetValue", scope: null, file: !185, line: 64, type: !851, isLocal: false, isDefinition: true, scopeLine: 64, isOptimized: false, unit: !1, retainedNodes: !3)
!851 = !DISubroutineType(types: !852)
!852 = !{!136, !840, !840}
!853 = !DILocalVariable(name: "m", arg: 1, scope: !850, file: !185, line: 64, type: !840)
!854 = !DILocation(line: 64, column: 1, scope: !850)
!855 = !DILocalVariable(name: "$ret49", scope: !850, file: !185, line: 64, type: !136)
!856 = !DILocation(line: 64, column: 34, scope: !850)
!857 = !DILocation(line: 65, column: 7, scope: !850)
!858 = !DILocation(line: 68, column: 2, scope: !850)
!859 = !DILocation(line: 66, column: 11, scope: !850)
!860 = !DILocation(line: 66, column: 3, scope: !850)
!861 = distinct !DISubprogram(name: "view.Reset..1command_line_arguments.SliderEvent", linkageName: "command_line_arguments.SliderEvent.Reset", scope: null, file: !185, line: 59, type: !862, isLocal: false, isDefinition: true, scopeLine: 59, isOptimized: false, unit: !1, retainedNodes: !3)
!862 = !DISubroutineType(types: !863)
!863 = !{!56, !840, !840}
!864 = !DILocalVariable(name: "m", arg: 1, scope: !861, file: !185, line: 59, type: !840)
!865 = !DILocation(line: 59, column: 1, scope: !861)
!866 = !DILocation(line: 59, column: 52, scope: !861)
!867 = !DILocation(line: 59, column: 55, scope: !861)
!868 = distinct !DISubprogram(name: "view.String..1command_line_arguments.SliderEvent", linkageName: "command_line_arguments.SliderEvent.String", scope: null, file: !185, line: 60, type: !869, isLocal: false, isDefinition: true, scopeLine: 60, isOptimized: false, unit: !1, retainedNodes: !3)
!869 = !DISubroutineType(types: !870)
!870 = !{!69, !840, !840}
!871 = !DILocalVariable(name: "m", arg: 1, scope: !868, file: !185, line: 60, type: !840)
!872 = !DILocation(line: 60, column: 1, scope: !868)
!873 = !DILocation(line: 60, column: 83, scope: !868)
!874 = !DILocation(line: 60, column: 65, scope: !868)
!875 = !DILocation(line: 60, column: 52, scope: !868)
!876 = distinct !DISubprogram(name: "view.command_line_arguments..init8", linkageName: "command_line_arguments.command_line_arguments..init8", scope: null, file: !185, line: 71, type: !220, isLocal: false, isDefinition: true, scopeLine: 71, isOptimized: false, unit: !1, retainedNodes: !3)
!877 = !DILocation(line: 72, column: 8, scope: !876)
!878 = !DILocation(line: 73, column: 8, scope: !876)
!879 = distinct !DISubprogram(name: "view.command_line_arguments..init9", linkageName: "command_line_arguments.command_line_arguments..init9", scope: null, file: !185, line: 76, type: !220, isLocal: false, isDefinition: true, scopeLine: 76, isOptimized: false, unit: !1, retainedNodes: !3)
!880 = !DILocation(line: 76, column: 21, scope: !879)
!881 = distinct !DISubprogram(name: "view.command_line_arguments.SwitchView..hash", linkageName: "command_line_arguments.command_line_arguments.SwitchView..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!882 = !DILocalVariable(name: "key", arg: 1, scope: !881, file: !29, line: 1, type: !55)
!883 = !DILocation(line: 1, column: 1, scope: !881)
!884 = !DILocalVariable(name: "seed", arg: 2, scope: !881, file: !29, line: 1, type: !40)
!885 = !DILocalVariable(name: "$ret142", scope: !881, file: !29, line: 1, type: !40)
!886 = distinct !DISubprogram(name: "view.command_line_arguments.SwitchView..eq", linkageName: "command_line_arguments.command_line_arguments.SwitchView..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!887 = !DILocalVariable(name: "key1", arg: 1, scope: !886, file: !29, line: 1, type: !55)
!888 = !DILocation(line: 1, column: 1, scope: !886)
!889 = !DILocalVariable(name: "key2", arg: 2, scope: !886, file: !29, line: 1, type: !55)
!890 = !DILocalVariable(name: "$ret143", scope: !886, file: !29, line: 1, type: !65)
!891 = distinct !DISubprogram(name: "view.Descriptor..1command_line_arguments.SwitchView", linkageName: "command_line_arguments.SwitchView.Descriptor", scope: null, file: !194, line: 23, type: !892, isLocal: false, isDefinition: true, scopeLine: 23, isOptimized: false, unit: !1, retainedNodes: !3)
!892 = !DISubroutineType(types: !893)
!893 = !{!279, !894, !894}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "SwitchView", file: !194, line: 15, size: 16, align: 8, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !194, line: 16, baseType: !65, size: 8, align: 8)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", file: !194, line: 17, baseType: !65, size: 8, align: 8, offset: 8)
!899 = !DILocalVariable(name: "r.18", arg: 1, scope: !891, file: !194, line: 23, type: !894)
!900 = !DILocation(line: 23, column: 1, scope: !891)
!901 = !DILocation(line: 23, column: 75, scope: !891)
!902 = !DILocalVariable(name: "$ret52", scope: !891, file: !194, line: 23, type: !283)
!903 = !DILocation(line: 23, column: 42, scope: !891)
!904 = !DILocation(line: 23, column: 51, scope: !891)
!905 = distinct !DISubprogram(name: "view.GetEnabled..1command_line_arguments.SwitchView", linkageName: "command_line_arguments.SwitchView.GetEnabled", scope: null, file: !194, line: 32, type: !906, isLocal: false, isDefinition: true, scopeLine: 32, isOptimized: false, unit: !1, retainedNodes: !3)
!906 = !DISubroutineType(types: !907)
!907 = !{!65, !894, !894}
!908 = !DILocalVariable(name: "m", arg: 1, scope: !905, file: !194, line: 32, type: !894)
!909 = !DILocation(line: 32, column: 1, scope: !905)
!910 = !DILocalVariable(name: "$ret54", scope: !905, file: !194, line: 32, type: !65)
!911 = !DILocation(line: 32, column: 35, scope: !905)
!912 = !DILocation(line: 33, column: 7, scope: !905)
!913 = !DILocation(line: 36, column: 2, scope: !905)
!914 = !DILocation(line: 34, column: 11, scope: !905)
!915 = !DILocation(line: 34, column: 3, scope: !905)
!916 = distinct !DISubprogram(name: "view.GetValue..1command_line_arguments.SwitchView", linkageName: "command_line_arguments.SwitchView.GetValue", scope: null, file: !194, line: 25, type: !906, isLocal: false, isDefinition: true, scopeLine: 25, isOptimized: false, unit: !1, retainedNodes: !3)
!917 = !DILocalVariable(name: "m", arg: 1, scope: !916, file: !194, line: 25, type: !894)
!918 = !DILocation(line: 25, column: 1, scope: !916)
!919 = !DILocalVariable(name: "$ret53", scope: !916, file: !194, line: 25, type: !65)
!920 = !DILocation(line: 25, column: 33, scope: !916)
!921 = !DILocation(line: 26, column: 7, scope: !916)
!922 = !DILocation(line: 29, column: 2, scope: !916)
!923 = !DILocation(line: 27, column: 11, scope: !916)
!924 = !DILocation(line: 27, column: 3, scope: !916)
!925 = distinct !DISubprogram(name: "view.Reset..1command_line_arguments.SwitchView", linkageName: "command_line_arguments.SwitchView.Reset", scope: null, file: !194, line: 20, type: !926, isLocal: false, isDefinition: true, scopeLine: 20, isOptimized: false, unit: !1, retainedNodes: !3)
!926 = !DISubroutineType(types: !927)
!927 = !{!56, !894, !894}
!928 = !DILocalVariable(name: "m", arg: 1, scope: !925, file: !194, line: 20, type: !894)
!929 = !DILocation(line: 20, column: 1, scope: !925)
!930 = !DILocation(line: 20, column: 51, scope: !925)
!931 = !DILocation(line: 20, column: 54, scope: !925)
!932 = distinct !DISubprogram(name: "view.String..1command_line_arguments.SwitchView", linkageName: "command_line_arguments.SwitchView.String", scope: null, file: !194, line: 21, type: !933, isLocal: false, isDefinition: true, scopeLine: 21, isOptimized: false, unit: !1, retainedNodes: !3)
!933 = !DISubroutineType(types: !934)
!934 = !{!69, !894, !894}
!935 = !DILocalVariable(name: "m", arg: 1, scope: !932, file: !194, line: 21, type: !894)
!936 = !DILocation(line: 21, column: 1, scope: !932)
!937 = !DILocation(line: 21, column: 82, scope: !932)
!938 = !DILocation(line: 21, column: 64, scope: !932)
!939 = !DILocation(line: 21, column: 51, scope: !932)
!940 = distinct !DISubprogram(name: "view.Descriptor..1command_line_arguments.SwitchEvent", linkageName: "command_line_arguments.SwitchEvent.Descriptor", scope: null, file: !194, line: 46, type: !941, isLocal: false, isDefinition: true, scopeLine: 46, isOptimized: false, unit: !1, retainedNodes: !3)
!941 = !DISubroutineType(types: !942)
!942 = !{!279, !943, !943}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "SwitchEvent", file: !194, line: 39, size: 8, align: 8, elements: !945)
!945 = !{!946}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !194, line: 40, baseType: !65, size: 8, align: 8)
!947 = !DILocalVariable(name: "r.20", arg: 1, scope: !940, file: !194, line: 46, type: !943)
!948 = !DILocation(line: 46, column: 1, scope: !940)
!949 = !DILocation(line: 46, column: 76, scope: !940)
!950 = !DILocalVariable(name: "$ret57", scope: !940, file: !194, line: 46, type: !283)
!951 = !DILocation(line: 46, column: 43, scope: !940)
!952 = !DILocation(line: 46, column: 52, scope: !940)
!953 = distinct !DISubprogram(name: "view.GetValue..1command_line_arguments.SwitchEvent", linkageName: "command_line_arguments.SwitchEvent.GetValue", scope: null, file: !194, line: 48, type: !954, isLocal: false, isDefinition: true, scopeLine: 48, isOptimized: false, unit: !1, retainedNodes: !3)
!954 = !DISubroutineType(types: !955)
!955 = !{!65, !943, !943}
!956 = !DILocalVariable(name: "m", arg: 1, scope: !953, file: !194, line: 48, type: !943)
!957 = !DILocation(line: 48, column: 1, scope: !953)
!958 = !DILocalVariable(name: "$ret58", scope: !953, file: !194, line: 48, type: !65)
!959 = !DILocation(line: 48, column: 34, scope: !953)
!960 = !DILocation(line: 49, column: 7, scope: !953)
!961 = !DILocation(line: 52, column: 2, scope: !953)
!962 = !DILocation(line: 50, column: 11, scope: !953)
!963 = !DILocation(line: 50, column: 3, scope: !953)
!964 = distinct !DISubprogram(name: "view.Reset..1command_line_arguments.SwitchEvent", linkageName: "command_line_arguments.SwitchEvent.Reset", scope: null, file: !194, line: 43, type: !965, isLocal: false, isDefinition: true, scopeLine: 43, isOptimized: false, unit: !1, retainedNodes: !3)
!965 = !DISubroutineType(types: !966)
!966 = !{!56, !943, !943}
!967 = !DILocalVariable(name: "m", arg: 1, scope: !964, file: !194, line: 43, type: !943)
!968 = !DILocation(line: 43, column: 1, scope: !964)
!969 = !DILocation(line: 43, column: 52, scope: !964)
!970 = !DILocation(line: 43, column: 55, scope: !964)
!971 = distinct !DISubprogram(name: "view.String..1command_line_arguments.SwitchEvent", linkageName: "command_line_arguments.SwitchEvent.String", scope: null, file: !194, line: 44, type: !972, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!972 = !DISubroutineType(types: !973)
!973 = !{!69, !943, !943}
!974 = !DILocalVariable(name: "m", arg: 1, scope: !971, file: !194, line: 44, type: !943)
!975 = !DILocation(line: 44, column: 1, scope: !971)
!976 = !DILocation(line: 44, column: 83, scope: !971)
!977 = !DILocation(line: 44, column: 65, scope: !971)
!978 = !DILocation(line: 44, column: 52, scope: !971)
!979 = distinct !DISubprogram(name: "view.command_line_arguments..init10", linkageName: "command_line_arguments.command_line_arguments..init10", scope: null, file: !194, line: 55, type: !220, isLocal: false, isDefinition: true, scopeLine: 55, isOptimized: false, unit: !1, retainedNodes: !3)
!980 = !DILocation(line: 56, column: 8, scope: !979)
!981 = !DILocation(line: 57, column: 8, scope: !979)
!982 = distinct !DISubprogram(name: "view.command_line_arguments..init11", linkageName: "command_line_arguments.command_line_arguments..init11", scope: null, file: !194, line: 60, type: !220, isLocal: false, isDefinition: true, scopeLine: 60, isOptimized: false, unit: !1, retainedNodes: !3)
!983 = !DILocation(line: 60, column: 21, scope: !982)
!984 = distinct !DISubprogram(name: "view.command_line_arguments.TextInput..hash", linkageName: "command_line_arguments.command_line_arguments.TextInput..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!985 = !DILocalVariable(name: "key", arg: 1, scope: !984, file: !29, line: 1, type: !55)
!986 = !DILocation(line: 1, column: 1, scope: !984)
!987 = !DILocalVariable(name: "seed", arg: 2, scope: !984, file: !29, line: 1, type: !40)
!988 = !DILocalVariable(name: "$ret144", scope: !984, file: !29, line: 1, type: !40)
!989 = distinct !DISubprogram(name: "view.command_line_arguments.TextInput..eq", linkageName: "command_line_arguments.command_line_arguments.TextInput..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!990 = !DILocalVariable(name: "key1", arg: 1, scope: !989, file: !29, line: 1, type: !55)
!991 = !DILocation(line: 1, column: 1, scope: !989)
!992 = !DILocalVariable(name: "key2", arg: 2, scope: !989, file: !29, line: 1, type: !55)
!993 = !DILocalVariable(name: "$ret145", scope: !989, file: !29, line: 1, type: !65)
!994 = distinct !DISubprogram(name: "view.Descriptor..1command_line_arguments.TextInput", linkageName: "command_line_arguments.TextInput.Descriptor", scope: null, file: !203, line: 32, type: !995, isLocal: false, isDefinition: true, scopeLine: 32, isOptimized: false, unit: !1, retainedNodes: !3)
!995 = !DISubroutineType(types: !996)
!996 = !{!279, !997, !997}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DICompositeType(tag: DW_TAG_structure_type, name: "TextInput", file: !203, line: 17, size: 448, align: 8, elements: !999)
!999 = !{!1000, !1049, !1050, !1057, !1058, !1060, !1062, !1064, !1065}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "StyledText", file: !203, line: 18, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DICompositeType(tag: DW_TAG_structure_type, name: "StyledText", file: !203, line: 9, size: 256, align: 8, elements: !1003)
!1003 = !{!1004, !1044}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "Styles", file: !203, line: 9, baseType: !1005, size: 192, align: 64)
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**TextStyle,int,int}", file: !16, size: 192, align: 8, elements: !1006)
!1006 = !{!1007, !24, !26}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DICompositeType(tag: DW_TAG_structure_type, name: "TextStyle", file: !203, line: 9, size: 1280, align: 8, elements: !1011)
!1011 = !{!1012, !1013, !1015, !1017, !1018, !1019, !1020, !1021, !1022, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1039, !1041, !1042, !1043}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !203, line: 9, baseType: !291, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "TextAlignment", file: !203, line: 9, baseType: !1014, size: 32, align: 32, offset: 64)
!1014 = !DIBasicType(name: "TextAlignment", size: 32, encoding: DW_ATE_signed)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughStyle", file: !203, line: 9, baseType: !1016, size: 32, align: 32, offset: 96)
!1016 = !DIBasicType(name: "StrikethroughStyle", size: 32, encoding: DW_ATE_signed)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "HasStrikethroughColor", file: !203, line: 9, baseType: !65, size: 8, align: 8, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorRed", file: !203, line: 9, baseType: !43, size: 32, align: 32, offset: 160)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorGreen", file: !203, line: 9, baseType: !43, size: 32, align: 32, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorBlue", file: !203, line: 9, baseType: !43, size: 32, align: 32, offset: 224)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorAlpha", file: !203, line: 9, baseType: !43, size: 32, align: 32, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineStyle", file: !203, line: 9, baseType: !1023, size: 32, align: 32, offset: 288)
!1023 = !DIBasicType(name: "UnderlineStyle", size: 32, encoding: DW_ATE_signed)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "HasUnderlineColor", file: !203, line: 9, baseType: !65, size: 8, align: 8, offset: 320)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorRed", file: !203, line: 9, baseType: !43, size: 32, align: 32, offset: 352)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorGreen", file: !203, line: 9, baseType: !43, size: 32, align: 32, offset: 384)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorBlue", file: !203, line: 9, baseType: !43, size: 32, align: 32, offset: 416)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorAlpha", file: !203, line: 9, baseType: !43, size: 32, align: 32, offset: 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "Hyphenation", file: !203, line: 9, baseType: !136, size: 64, align: 64, offset: 512)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "LineHeightMultiple", file: !203, line: 9, baseType: !136, size: 64, align: 64, offset: 576)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "MaxLines", file: !203, line: 9, baseType: !291, size: 64, align: 64, offset: 640)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "HasTextColor", file: !203, line: 9, baseType: !65, size: 8, align: 8, offset: 704)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorRed", file: !203, line: 9, baseType: !43, size: 32, align: 32, offset: 736)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorGreen", file: !203, line: 9, baseType: !43, size: 32, align: 32, offset: 768)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorBlue", file: !203, line: 9, baseType: !43, size: 32, align: 32, offset: 800)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorAlpha", file: !203, line: 9, baseType: !43, size: 32, align: 32, offset: 832)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "Wrap", file: !203, line: 9, baseType: !1038, size: 32, align: 32, offset: 864)
!1038 = !DIBasicType(name: "TextWrap", size: 32, encoding: DW_ATE_signed)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "Truncation", file: !203, line: 9, baseType: !1040, size: 32, align: 32, offset: 896)
!1040 = !DIBasicType(name: "Truncation", size: 32, encoding: DW_ATE_signed)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "TruncationString", file: !203, line: 9, baseType: !69, size: 128, align: 64, offset: 960)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "FontName", file: !203, line: 9, baseType: !69, size: 128, align: 64, offset: 1088)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "FontSize", file: !203, line: 9, baseType: !136, size: 64, align: 64, offset: 1216)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "Text", file: !203, line: 9, baseType: !1045, size: 64, align: 64, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "Text", file: !203, line: 9, size: 128, align: 8, elements: !1047)
!1047 = !{!1048}
