; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22layout\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/golang/protobuf/proto\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/golang/protobuf/proto\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22math\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22math\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22layout\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22command_line_arguments..import\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./layout.pb.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha/proto/layout")
!3 = !{}
!4 = !{!5, !109, !111, !127, !137}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments._.0", linkageName: "command_line_arguments._.0", scope: !1, file: !7, line: 23, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "layout.pb.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 18, size: 64, align: 8, elements: !10)
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 18, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !95}
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !16, size: 320, align: 8, elements: !17)
!16 = !DIFile(filename: "", directory: "")
!17 = !{!18, !27}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 18, baseType: !19, size: 192, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !16, size: 192, align: 8, elements: !20)
!20 = !{!21, !24, !26}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !16, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !16, line: 1, baseType: !25, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 18, baseType: !28, size: 128, align: 64, offset: 192)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !29, line: 1, size: 128, align: 8, elements: !30)
!29 = !DIFile(filename: "<built-in>", directory: "")
!30 = !{!31, !94}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !29, line: 1, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !16, size: 128, align: 8, elements: !34)
!34 = !{!35, !90}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 1, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !29, line: 1, size: 576, align: 8, elements: !38)
!38 = !{!39, !41, !42, !44, !45, !46, !47, !57, !66, !67, !73, !89}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !29, line: 1, baseType: !40, size: 64, align: 64)
!40 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !29, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !29, line: 1, baseType: !43, size: 32, align: 32, offset: 128)
!43 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 168)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 176)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !29, line: 1, baseType: !48, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !29, line: 1, size: 64, align: 8, elements: !50)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !29, line: 1, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!40, !55, !40}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIBasicType(name: "void")
!57 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !29, line: 1, baseType: !58, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !29, line: 1, size: 64, align: 8, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !29, line: 1, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !55, !55}
!65 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !29, line: 1, baseType: !22, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !29, line: 1, baseType: !68, size: 64, align: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !29, line: 1, size: 128, align: 8, elements: !70)
!70 = !{!71, !72}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !29, line: 1, baseType: !22, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !29, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !29, line: 1, baseType: !74, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !29, line: 1, size: 320, align: 8, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !29, line: 1, baseType: !68, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !29, line: 1, baseType: !68, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !29, line: 1, baseType: !80, size: 192, align: 64, offset: 128)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !16, size: 192, align: 8, elements: !81)
!81 = !{!82, !24, !26}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !29, line: 1, size: 320, align: 8, elements: !85)
!85 = !{!77, !78, !86, !87, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !16, line: 1, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!69, !55}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !7, line: 18, size: 128, align: 8, elements: !96)
!96 = !{!97, !108}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 18, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void,*func(*void)string}", file: !16, size: 256, align: 8, elements: !100)
!100 = !{!101, !102, !106, !107}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 18, baseType: !36, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMessage", file: !16, line: 18, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!56, !55}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", file: !16, line: 18, baseType: !103, size: 64, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !16, line: 18, baseType: !91, size: 64, align: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !29, line: 1, type: !43, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "command_line_arguments._.1", linkageName: "command_line_arguments._.1", scope: !1, file: !7, line: 24, type: !113, isLocal: false, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 19, size: 64, align: 8, elements: !115)
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 19, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!28, !69, !120}
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*void},int,int}", file: !16, size: 192, align: 8, elements: !121)
!121 = !{!122, !24, !26}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !16, size: 128, align: 8, elements: !125)
!125 = !{!35, !126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !16, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "command_line_arguments._.2", linkageName: "command_line_arguments._.2", scope: !1, file: !7, line: 25, type: !129, isLocal: false, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 20, size: 64, align: 8, elements: !131)
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 20, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !25}
!136 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "command_line_arguments.fileDescriptor0", linkageName: "command_line_arguments.fileDescriptor0", scope: !1, file: !7, line: 154, type: !19, isLocal: true, isDefinition: true)
!139 = distinct !DISubprogram(name: "layout.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 16, type: !140, isLocal: false, isDefinition: true, scopeLine: 16, isOptimized: false, unit: !1, retainedNodes: !3)
!140 = !DISubroutineType(types: !141)
!141 = !{!56}
!142 = !DILocation(line: 1, column: 1, scope: !143)
!143 = !DILexicalBlockFile(scope: !139, file: !29, discriminator: 0)
!144 = !DILocation(line: 23, column: 5, scope: !145)
!145 = !DILexicalBlockFile(scope: !139, file: !7, discriminator: 0)
!146 = !DILocation(line: 24, column: 5, scope: !145)
!147 = !DILocation(line: 25, column: 5, scope: !145)
!148 = !DILocation(line: 145, column: 1, scope: !145)
!149 = !DILocation(line: 152, column: 1, scope: !145)
!150 = distinct !DISubprogram(name: "layout.command_line_arguments.Point..hash", linkageName: "command_line_arguments.command_line_arguments.Point..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!151 = !DILocalVariable(name: "key", arg: 1, scope: !150, file: !29, line: 1, type: !55)
!152 = !DILocation(line: 1, column: 1, scope: !150)
!153 = !DILocalVariable(name: "seed", arg: 2, scope: !150, file: !29, line: 1, type: !40)
!154 = !DILocalVariable(name: "$ret22", scope: !150, file: !29, line: 1, type: !40)
!155 = distinct !DISubprogram(name: "layout.command_line_arguments.Point..eq", linkageName: "command_line_arguments.command_line_arguments.Point..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!156 = !DILocalVariable(name: "key1", arg: 1, scope: !155, file: !29, line: 1, type: !55)
!157 = !DILocation(line: 1, column: 1, scope: !155)
!158 = !DILocalVariable(name: "key2", arg: 2, scope: !155, file: !29, line: 1, type: !55)
!159 = !DILocalVariable(name: "$ret23", scope: !155, file: !29, line: 1, type: !65)
!160 = distinct !DISubprogram(name: "layout.Descriptor..1command_line_arguments.Point", linkageName: "command_line_arguments.Point.Descriptor", scope: null, file: !7, line: 41, type: !161, isLocal: false, isDefinition: true, scopeLine: 41, isOptimized: false, unit: !1, retainedNodes: !3)
!161 = !DISubroutineType(types: !162)
!162 = !{!163, !171, !171}
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},struct{*int,int,int}}", file: !16, size: 384, align: 8, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 41, baseType: !19, size: 192, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 41, baseType: !167, size: 192, align: 64, offset: 192)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !16, size: 192, align: 8, elements: !168)
!168 = !{!169, !24, !26}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "Point", file: !7, line: 33, size: 128, align: 8, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "X", file: !7, line: 34, baseType: !136, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Y", file: !7, line: 35, baseType: !136, size: 64, align: 64, offset: 64)
!176 = !DILocalVariable(name: "r.1", arg: 1, scope: !160, file: !7, line: 41, type: !171)
!177 = !DILocation(line: 41, column: 1, scope: !160)
!178 = !DILocation(line: 41, column: 70, scope: !160)
!179 = !DILocalVariable(name: "$ret2", scope: !160, file: !7, line: 41, type: !167)
!180 = !DILocation(line: 41, column: 37, scope: !160)
!181 = !DILocation(line: 41, column: 46, scope: !160)
!182 = distinct !DISubprogram(name: "layout.GetX..1command_line_arguments.Point", linkageName: "command_line_arguments.Point.GetX", scope: null, file: !7, line: 43, type: !183, isLocal: false, isDefinition: true, scopeLine: 43, isOptimized: false, unit: !1, retainedNodes: !3)
!183 = !DISubroutineType(types: !184)
!184 = !{!136, !171, !171}
!185 = !DILocalVariable(name: "m", arg: 1, scope: !182, file: !7, line: 43, type: !171)
!186 = !DILocation(line: 43, column: 1, scope: !182)
!187 = !DILocalVariable(name: "$ret3", scope: !182, file: !7, line: 43, type: !136)
!188 = !DILocation(line: 43, column: 24, scope: !182)
!189 = !DILocation(line: 44, column: 7, scope: !182)
!190 = !DILocation(line: 47, column: 2, scope: !182)
!191 = !DILocation(line: 45, column: 11, scope: !182)
!192 = !DILocation(line: 45, column: 3, scope: !182)
!193 = distinct !DISubprogram(name: "layout.GetY..1command_line_arguments.Point", linkageName: "command_line_arguments.Point.GetY", scope: null, file: !7, line: 50, type: !183, isLocal: false, isDefinition: true, scopeLine: 50, isOptimized: false, unit: !1, retainedNodes: !3)
!194 = !DILocalVariable(name: "m", arg: 1, scope: !193, file: !7, line: 50, type: !171)
!195 = !DILocation(line: 50, column: 1, scope: !193)
!196 = !DILocalVariable(name: "$ret4", scope: !193, file: !7, line: 50, type: !136)
!197 = !DILocation(line: 50, column: 24, scope: !193)
!198 = !DILocation(line: 51, column: 7, scope: !193)
!199 = !DILocation(line: 54, column: 2, scope: !193)
!200 = !DILocation(line: 52, column: 11, scope: !193)
!201 = !DILocation(line: 52, column: 3, scope: !193)
!202 = distinct !DISubprogram(name: "layout.Reset..1command_line_arguments.Point", linkageName: "command_line_arguments.Point.Reset", scope: null, file: !7, line: 38, type: !203, isLocal: false, isDefinition: true, scopeLine: 38, isOptimized: false, unit: !1, retainedNodes: !3)
!203 = !DISubroutineType(types: !204)
!204 = !{!56, !171, !171}
!205 = !DILocalVariable(name: "m", arg: 1, scope: !202, file: !7, line: 38, type: !171)
!206 = !DILocation(line: 38, column: 1, scope: !202)
!207 = !DILocation(line: 38, column: 46, scope: !202)
!208 = !DILocation(line: 38, column: 49, scope: !202)
!209 = distinct !DISubprogram(name: "layout.String..1command_line_arguments.Point", linkageName: "command_line_arguments.Point.String", scope: null, file: !7, line: 39, type: !210, isLocal: false, isDefinition: true, scopeLine: 39, isOptimized: false, unit: !1, retainedNodes: !3)
!210 = !DISubroutineType(types: !211)
!211 = !{!69, !171, !171}
!212 = !DILocalVariable(name: "m", arg: 1, scope: !209, file: !7, line: 39, type: !171)
!213 = !DILocation(line: 39, column: 1, scope: !209)
!214 = !DILocation(line: 39, column: 77, scope: !209)
!215 = !DILocation(line: 39, column: 59, scope: !209)
!216 = !DILocation(line: 39, column: 46, scope: !209)
!217 = distinct !DISubprogram(name: "layout.Descriptor..1command_line_arguments.Rect", linkageName: "command_line_arguments.Rect.Descriptor", scope: null, file: !7, line: 65, type: !218, isLocal: false, isDefinition: true, scopeLine: 65, isOptimized: false, unit: !1, retainedNodes: !3)
!218 = !DISubroutineType(types: !219)
!219 = !{!163, !220, !220}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rect", file: !7, line: 57, size: 128, align: 8, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Min", file: !7, line: 58, baseType: !171, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Max", file: !7, line: 59, baseType: !171, size: 64, align: 64, offset: 64)
!225 = !DILocalVariable(name: "r.3", arg: 1, scope: !217, file: !7, line: 65, type: !220)
!226 = !DILocation(line: 65, column: 1, scope: !217)
!227 = !DILocation(line: 65, column: 69, scope: !217)
!228 = !DILocalVariable(name: "$ret7", scope: !217, file: !7, line: 65, type: !167)
!229 = !DILocation(line: 65, column: 36, scope: !217)
!230 = !DILocation(line: 65, column: 45, scope: !217)
!231 = distinct !DISubprogram(name: "layout.GetMax..1command_line_arguments.Rect", linkageName: "command_line_arguments.Rect.GetMax", scope: null, file: !7, line: 74, type: !232, isLocal: false, isDefinition: true, scopeLine: 74, isOptimized: false, unit: !1, retainedNodes: !3)
!232 = !DISubroutineType(types: !233)
!233 = !{!171, !220, !220}
!234 = !DILocalVariable(name: "m", arg: 1, scope: !231, file: !7, line: 74, type: !220)
!235 = !DILocation(line: 74, column: 1, scope: !231)
!236 = !DILocalVariable(name: "$ret9", scope: !231, file: !7, line: 74, type: !171)
!237 = !DILocation(line: 74, column: 25, scope: !231)
!238 = !DILocation(line: 75, column: 7, scope: !231)
!239 = !DILocation(line: 78, column: 2, scope: !231)
!240 = !DILocation(line: 76, column: 11, scope: !231)
!241 = !DILocation(line: 76, column: 3, scope: !231)
!242 = distinct !DISubprogram(name: "layout.GetMin..1command_line_arguments.Rect", linkageName: "command_line_arguments.Rect.GetMin", scope: null, file: !7, line: 67, type: !232, isLocal: false, isDefinition: true, scopeLine: 67, isOptimized: false, unit: !1, retainedNodes: !3)
!243 = !DILocalVariable(name: "m", arg: 1, scope: !242, file: !7, line: 67, type: !220)
!244 = !DILocation(line: 67, column: 1, scope: !242)
!245 = !DILocalVariable(name: "$ret8", scope: !242, file: !7, line: 67, type: !171)
!246 = !DILocation(line: 67, column: 25, scope: !242)
!247 = !DILocation(line: 68, column: 7, scope: !242)
!248 = !DILocation(line: 71, column: 2, scope: !242)
!249 = !DILocation(line: 69, column: 11, scope: !242)
!250 = !DILocation(line: 69, column: 3, scope: !242)
!251 = distinct !DISubprogram(name: "layout.Reset..1command_line_arguments.Rect", linkageName: "command_line_arguments.Rect.Reset", scope: null, file: !7, line: 62, type: !252, isLocal: false, isDefinition: true, scopeLine: 62, isOptimized: false, unit: !1, retainedNodes: !3)
!252 = !DISubroutineType(types: !253)
!253 = !{!56, !220, !220}
!254 = !DILocalVariable(name: "m", arg: 1, scope: !251, file: !7, line: 62, type: !220)
!255 = !DILocation(line: 62, column: 1, scope: !251)
!256 = !DILocation(line: 62, column: 48, scope: !251)
!257 = distinct !DISubprogram(name: "layout.String..1command_line_arguments.Rect", linkageName: "command_line_arguments.Rect.String", scope: null, file: !7, line: 63, type: !258, isLocal: false, isDefinition: true, scopeLine: 63, isOptimized: false, unit: !1, retainedNodes: !3)
!258 = !DISubroutineType(types: !259)
!259 = !{!69, !220, !220}
!260 = !DILocalVariable(name: "m", arg: 1, scope: !257, file: !7, line: 63, type: !220)
!261 = !DILocation(line: 63, column: 1, scope: !257)
!262 = !DILocation(line: 63, column: 76, scope: !257)
!263 = !DILocation(line: 63, column: 58, scope: !257)
!264 = !DILocation(line: 63, column: 45, scope: !257)
!265 = distinct !DISubprogram(name: "layout.command_line_arguments.Insets..hash", linkageName: "command_line_arguments.command_line_arguments.Insets..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!266 = !DILocalVariable(name: "key", arg: 1, scope: !265, file: !29, line: 1, type: !55)
!267 = !DILocation(line: 1, column: 1, scope: !265)
!268 = !DILocalVariable(name: "seed", arg: 2, scope: !265, file: !29, line: 1, type: !40)
!269 = !DILocalVariable(name: "$ret24", scope: !265, file: !29, line: 1, type: !40)
!270 = distinct !DISubprogram(name: "layout.command_line_arguments.Insets..eq", linkageName: "command_line_arguments.command_line_arguments.Insets..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!271 = !DILocalVariable(name: "key1", arg: 1, scope: !270, file: !29, line: 1, type: !55)
!272 = !DILocation(line: 1, column: 1, scope: !270)
!273 = !DILocalVariable(name: "key2", arg: 2, scope: !270, file: !29, line: 1, type: !55)
!274 = !DILocalVariable(name: "$ret25", scope: !270, file: !29, line: 1, type: !65)
!275 = distinct !DISubprogram(name: "layout.Descriptor..1command_line_arguments.Insets", linkageName: "command_line_arguments.Insets.Descriptor", scope: null, file: !7, line: 91, type: !276, isLocal: false, isDefinition: true, scopeLine: 91, isOptimized: false, unit: !1, retainedNodes: !3)
!276 = !DISubroutineType(types: !277)
!277 = !{!163, !278, !278}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "Insets", file: !7, line: 81, size: 256, align: 8, elements: !280)
!280 = !{!281, !282, !283, !284}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Top", file: !7, line: 82, baseType: !136, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Left", file: !7, line: 83, baseType: !136, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Bottom", file: !7, line: 84, baseType: !136, size: 64, align: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Right", file: !7, line: 85, baseType: !136, size: 64, align: 64, offset: 192)
!285 = !DILocalVariable(name: "r.5", arg: 1, scope: !275, file: !7, line: 91, type: !278)
!286 = !DILocation(line: 91, column: 1, scope: !275)
!287 = !DILocation(line: 91, column: 71, scope: !275)
!288 = !DILocalVariable(name: "$ret12", scope: !275, file: !7, line: 91, type: !167)
!289 = !DILocation(line: 91, column: 38, scope: !275)
!290 = !DILocation(line: 91, column: 47, scope: !275)
!291 = distinct !DISubprogram(name: "layout.GetBottom..1command_line_arguments.Insets", linkageName: "command_line_arguments.Insets.GetBottom", scope: null, file: !7, line: 107, type: !292, isLocal: false, isDefinition: true, scopeLine: 107, isOptimized: false, unit: !1, retainedNodes: !3)
!292 = !DISubroutineType(types: !293)
!293 = !{!136, !278, !278}
!294 = !DILocalVariable(name: "m", arg: 1, scope: !291, file: !7, line: 107, type: !278)
!295 = !DILocation(line: 107, column: 1, scope: !291)
!296 = !DILocalVariable(name: "$ret15", scope: !291, file: !7, line: 107, type: !136)
!297 = !DILocation(line: 107, column: 30, scope: !291)
!298 = !DILocation(line: 108, column: 7, scope: !291)
!299 = !DILocation(line: 111, column: 2, scope: !291)
!300 = !DILocation(line: 109, column: 11, scope: !291)
!301 = !DILocation(line: 109, column: 3, scope: !291)
!302 = distinct !DISubprogram(name: "layout.GetLeft..1command_line_arguments.Insets", linkageName: "command_line_arguments.Insets.GetLeft", scope: null, file: !7, line: 100, type: !292, isLocal: false, isDefinition: true, scopeLine: 100, isOptimized: false, unit: !1, retainedNodes: !3)
!303 = !DILocalVariable(name: "m", arg: 1, scope: !302, file: !7, line: 100, type: !278)
!304 = !DILocation(line: 100, column: 1, scope: !302)
!305 = !DILocalVariable(name: "$ret14", scope: !302, file: !7, line: 100, type: !136)
!306 = !DILocation(line: 100, column: 28, scope: !302)
!307 = !DILocation(line: 101, column: 7, scope: !302)
!308 = !DILocation(line: 104, column: 2, scope: !302)
!309 = !DILocation(line: 102, column: 11, scope: !302)
!310 = !DILocation(line: 102, column: 3, scope: !302)
!311 = distinct !DISubprogram(name: "layout.GetRight..1command_line_arguments.Insets", linkageName: "command_line_arguments.Insets.GetRight", scope: null, file: !7, line: 114, type: !292, isLocal: false, isDefinition: true, scopeLine: 114, isOptimized: false, unit: !1, retainedNodes: !3)
!312 = !DILocalVariable(name: "m", arg: 1, scope: !311, file: !7, line: 114, type: !278)
!313 = !DILocation(line: 114, column: 1, scope: !311)
!314 = !DILocalVariable(name: "$ret16", scope: !311, file: !7, line: 114, type: !136)
!315 = !DILocation(line: 114, column: 29, scope: !311)
!316 = !DILocation(line: 115, column: 7, scope: !311)
!317 = !DILocation(line: 118, column: 2, scope: !311)
!318 = !DILocation(line: 116, column: 11, scope: !311)
!319 = !DILocation(line: 116, column: 3, scope: !311)
!320 = distinct !DISubprogram(name: "layout.GetTop..1command_line_arguments.Insets", linkageName: "command_line_arguments.Insets.GetTop", scope: null, file: !7, line: 93, type: !292, isLocal: false, isDefinition: true, scopeLine: 93, isOptimized: false, unit: !1, retainedNodes: !3)
!321 = !DILocalVariable(name: "m", arg: 1, scope: !320, file: !7, line: 93, type: !278)
!322 = !DILocation(line: 93, column: 1, scope: !320)
!323 = !DILocalVariable(name: "$ret13", scope: !320, file: !7, line: 93, type: !136)
!324 = !DILocation(line: 93, column: 27, scope: !320)
!325 = !DILocation(line: 94, column: 7, scope: !320)
!326 = !DILocation(line: 97, column: 2, scope: !320)
!327 = !DILocation(line: 95, column: 11, scope: !320)
!328 = !DILocation(line: 95, column: 3, scope: !320)
!329 = distinct !DISubprogram(name: "layout.Reset..1command_line_arguments.Insets", linkageName: "command_line_arguments.Insets.Reset", scope: null, file: !7, line: 88, type: !330, isLocal: false, isDefinition: true, scopeLine: 88, isOptimized: false, unit: !1, retainedNodes: !3)
!330 = !DISubroutineType(types: !331)
!331 = !{!56, !278, !278}
!332 = !DILocalVariable(name: "m", arg: 1, scope: !329, file: !7, line: 88, type: !278)
!333 = !DILocation(line: 88, column: 1, scope: !329)
!334 = !DILocation(line: 88, column: 47, scope: !329)
!335 = !DILocation(line: 88, column: 50, scope: !329)
!336 = distinct !DISubprogram(name: "layout.String..1command_line_arguments.Insets", linkageName: "command_line_arguments.Insets.String", scope: null, file: !7, line: 89, type: !337, isLocal: false, isDefinition: true, scopeLine: 89, isOptimized: false, unit: !1, retainedNodes: !3)
!337 = !DISubroutineType(types: !338)
!338 = !{!69, !278, !278}
!339 = !DILocalVariable(name: "m", arg: 1, scope: !336, file: !7, line: 89, type: !278)
!340 = !DILocation(line: 89, column: 1, scope: !336)
!341 = !DILocation(line: 89, column: 78, scope: !336)
!342 = !DILocation(line: 89, column: 60, scope: !336)
!343 = !DILocation(line: 89, column: 47, scope: !336)
!344 = distinct !DISubprogram(name: "layout.Descriptor..1command_line_arguments.Guide", linkageName: "command_line_arguments.Guide.Descriptor", scope: null, file: !7, line: 129, type: !345, isLocal: false, isDefinition: true, scopeLine: 129, isOptimized: false, unit: !1, retainedNodes: !3)
!345 = !DISubroutineType(types: !346)
!346 = !{!163, !347, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "Guide", file: !7, line: 121, size: 128, align: 8, elements: !349)
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Frame", file: !7, line: 122, baseType: !220, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ZIndex", file: !7, line: 123, baseType: !352, size: 64, align: 64, offset: 64)
!352 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!353 = !DILocalVariable(name: "r.7", arg: 1, scope: !344, file: !7, line: 129, type: !347)
!354 = !DILocation(line: 129, column: 1, scope: !344)
!355 = !DILocation(line: 129, column: 70, scope: !344)
!356 = !DILocalVariable(name: "$ret19", scope: !344, file: !7, line: 129, type: !167)
!357 = !DILocation(line: 129, column: 37, scope: !344)
!358 = !DILocation(line: 129, column: 46, scope: !344)
!359 = distinct !DISubprogram(name: "layout.GetFrame..1command_line_arguments.Guide", linkageName: "command_line_arguments.Guide.GetFrame", scope: null, file: !7, line: 131, type: !360, isLocal: false, isDefinition: true, scopeLine: 131, isOptimized: false, unit: !1, retainedNodes: !3)
!360 = !DISubroutineType(types: !361)
!361 = !{!220, !347, !347}
!362 = !DILocalVariable(name: "m", arg: 1, scope: !359, file: !7, line: 131, type: !347)
!363 = !DILocation(line: 131, column: 1, scope: !359)
!364 = !DILocalVariable(name: "$ret20", scope: !359, file: !7, line: 131, type: !220)
!365 = !DILocation(line: 131, column: 28, scope: !359)
!366 = !DILocation(line: 132, column: 7, scope: !359)
!367 = !DILocation(line: 135, column: 2, scope: !359)
!368 = !DILocation(line: 133, column: 11, scope: !359)
!369 = !DILocation(line: 133, column: 3, scope: !359)
!370 = distinct !DISubprogram(name: "layout.GetZIndex..1command_line_arguments.Guide", linkageName: "command_line_arguments.Guide.GetZIndex", scope: null, file: !7, line: 138, type: !371, isLocal: false, isDefinition: true, scopeLine: 138, isOptimized: false, unit: !1, retainedNodes: !3)
!371 = !DISubroutineType(types: !372)
!372 = !{!352, !347, !347}
!373 = !DILocalVariable(name: "m", arg: 1, scope: !370, file: !7, line: 138, type: !347)
!374 = !DILocation(line: 138, column: 1, scope: !370)
!375 = !DILocalVariable(name: "$ret21", scope: !370, file: !7, line: 138, type: !352)
!376 = !DILocation(line: 138, column: 29, scope: !370)
!377 = !DILocation(line: 139, column: 7, scope: !370)
!378 = !DILocation(line: 142, column: 2, scope: !370)
!379 = !DILocation(line: 140, column: 11, scope: !370)
!380 = !DILocation(line: 140, column: 3, scope: !370)
!381 = distinct !DISubprogram(name: "layout.Reset..1command_line_arguments.Guide", linkageName: "command_line_arguments.Guide.Reset", scope: null, file: !7, line: 126, type: !382, isLocal: false, isDefinition: true, scopeLine: 126, isOptimized: false, unit: !1, retainedNodes: !3)
!382 = !DISubroutineType(types: !383)
!383 = !{!56, !347, !347}
!384 = !DILocalVariable(name: "m", arg: 1, scope: !381, file: !7, line: 126, type: !347)
!385 = !DILocation(line: 126, column: 1, scope: !381)
!386 = !DILocation(line: 126, column: 49, scope: !381)
!387 = distinct !DISubprogram(name: "layout.String..1command_line_arguments.Guide", linkageName: "command_line_arguments.Guide.String", scope: null, file: !7, line: 127, type: !388, isLocal: false, isDefinition: true, scopeLine: 127, isOptimized: false, unit: !1, retainedNodes: !3)
!388 = !DISubroutineType(types: !389)
!389 = !{!69, !347, !347}
!390 = !DILocalVariable(name: "m", arg: 1, scope: !387, file: !7, line: 127, type: !347)
!391 = !DILocation(line: 127, column: 1, scope: !387)
!392 = !DILocation(line: 127, column: 77, scope: !387)
!393 = !DILocation(line: 127, column: 59, scope: !387)
!394 = !DILocation(line: 127, column: 46, scope: !387)
!395 = distinct !DISubprogram(name: "layout.command_line_arguments..init0", linkageName: "command_line_arguments.command_line_arguments..init0", scope: null, file: !7, line: 145, type: !140, isLocal: false, isDefinition: true, scopeLine: 145, isOptimized: false, unit: !1, retainedNodes: !3)
!396 = !DILocation(line: 146, column: 8, scope: !395)
!397 = !DILocation(line: 147, column: 8, scope: !395)
!398 = !DILocation(line: 148, column: 8, scope: !395)
!399 = !DILocation(line: 149, column: 8, scope: !395)
