; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22matcha\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bridge\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22gomatcha.io/matcha/bridge\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22gomatcha.io/matcha/bridge\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22sync\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22sync\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22sync\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22matcha\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22command_line_arguments..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22sys\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./id.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha")
!3 = !{}
!4 = !{!5, !82}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.MainLocker", linkageName: "command_line_arguments.MainLocker", scope: !1, file: !7, line: 9, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "id.go", directory: ".")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "Locker", file: !7, line: 4, size: 128, align: 8, elements: !9)
!9 = !{!10, !81}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 4, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void}", file: !13, size: 192, align: 8, elements: !14)
!13 = !DIFile(filename: "", directory: "")
!14 = !{!15, !76, !80}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !13, line: 4, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !18, line: 1, size: 576, align: 8, elements: !19)
!18 = !DIFile(filename: "<built-in>", directory: "")
!19 = !{!20, !22, !23, !25, !27, !28, !29, !39, !48, !50, !57, !75}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !18, line: 1, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !18, line: 1, baseType: !21, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !18, line: 1, baseType: !24, size: 32, align: 32, offset: 128)
!24 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !18, line: 1, baseType: !26, size: 8, align: 8, offset: 160)
!26 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !18, line: 1, baseType: !26, size: 8, align: 8, offset: 168)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !18, line: 1, baseType: !26, size: 8, align: 8, offset: 176)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !18, line: 1, baseType: !30, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !18, line: 1, size: 64, align: 8, elements: !32)
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !18, line: 1, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{!21, !37, !21}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIBasicType(name: "void")
!39 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !18, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !18, line: 1, size: 64, align: 8, elements: !42)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !18, line: 1, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !37, !37}
!47 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !18, line: 1, baseType: !49, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !18, line: 1, baseType: !51, size: 64, align: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !18, line: 1, size: 128, align: 8, elements: !53)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !18, line: 1, baseType: !49, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !18, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !18, line: 1, baseType: !58, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !18, line: 1, size: 320, align: 8, elements: !60)
!60 = !{!61, !62, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !18, line: 1, baseType: !51, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !18, line: 1, baseType: !51, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !18, line: 1, baseType: !64, size: 192, align: 64, offset: 128)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !13, size: 192, align: 8, elements: !65)
!65 = !{!66, !73, !74}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !13, line: 1, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !18, line: 1, size: 320, align: 8, elements: !69)
!69 = !{!61, !62, !70, !71, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !18, line: 1, baseType: !37, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !18, line: 1, baseType: !37, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !18, line: 1, baseType: !37, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !13, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !13, line: 1, baseType: !56, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !18, line: 1, baseType: !37, size: 64, align: 64, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", file: !13, line: 4, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!38, !37}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Unlock", file: !13, line: 4, baseType: !77, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !18, line: 1, type: !24, isLocal: false, isDefinition: true)
!84 = distinct !DISubprogram(name: "matcha.command_line_arguments..init0", linkageName: "command_line_arguments.command_line_arguments..init0", scope: null, file: !7, line: 11, type: !85, isLocal: false, isDefinition: true, scopeLine: 11, isOptimized: false, unit: !1, retainedNodes: !3)
!85 = !DISubroutineType(types: !86)
!86 = !{!38}
!87 = !DILocation(line: 12, column: 15, scope: !84)
!88 = !DILocation(line: 12, column: 13, scope: !84)
!89 = distinct !DISubprogram(name: "matcha.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 1, type: !85, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!90 = !DILocation(line: 1, column: 1, scope: !91)
!91 = !DILexicalBlockFile(scope: !89, file: !18, discriminator: 0)
!92 = !DILocation(line: 11, column: 1, scope: !93)
!93 = !DILexicalBlockFile(scope: !89, file: !7, discriminator: 0)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "matcha"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "command-line-arguments"
	.ascii ";\n"
	.ascii "import "
	.ascii "bridge"
	.ascii " "
	.ascii "gomatcha.io/matcha/bridge"
	.ascii " \""
	.ascii "gomatcha.io/matcha/bridge"
	.ascii "\";\n"
	.ascii "import "
	.ascii "sync"
	.ascii " "
	.ascii "sync"
	.ascii " \""
	.ascii "sync"
	.ascii "\";\n"
	.ascii "init"
	.ascii " "
	.ascii "matcha"
	.ascii " "
	.ascii "command_line_arguments..import"
	.ascii " "
	.ascii "runtime"
	.ascii " "
	.ascii "runtime..import"
	.ascii " "
	.ascii "sys"
	.ascii " "
	.ascii "runtime_internal_sys..import"
	.ascii " "
	.ascii "sync"
	.ascii " "
	.ascii "sync..import"
	.ascii ";\n"
	.ascii "init_graph"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "2"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "3"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "2"
	.ascii " "
	.ascii "3"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "3"
	.ascii " "
	.ascii "2"
	.ascii ";\n"
	.ascii "var "
	.ascii "MainLocker"
	.ascii " "
	.ascii "<type 1 "
	.ascii "\"sync.Locker\" "
	.ascii "<type 2 "
	.ascii "interface { "
	.ascii "Lock"
	.ascii " ("
	.ascii ")"
	.ascii "; "
	.ascii "Unlock"
	.ascii " ("
	.ascii ")"
	.ascii "; "
	.ascii "}"
	.ascii ">"
	.ascii ">"
	.ascii ";\n"
	.ascii "func "
	.ascii "command_line_arguments..init0"
	.ascii " ("
	.ascii ")"
	.ascii ";\n"
	.ascii "checksum 7964992C781F8FCDEFE39705308C14EEBD3DBC94;\n"
	.text


	.file	1 "<built-in>"
	.file	2 "<stdin>"
	.file	3 "./id.go"
	.section	.text.command_line_arguments.command_line_arguments..init0,"ax",@progbits
	.globl	command_line_arguments.command_line_arguments..init0
	.p2align	4, 0x90
	.type	command_line_arguments.command_line_arguments..init0,@function
command_line_arguments.command_line_arguments..init0:
.Lfunc_begin0:
	.loc	3 11 0
	.cfi_startproc
	cmpq	%fs:112, %rsp
	ja	.LBB0_2
	movq	%r10, %rax
	movabsq	$24, %r10
	movabsq	$0, %r11
	callq	__morestack
	retq
	movq	%rax, %r10
.LBB0_2:
	subq	$24, %rsp
	.cfi_def_cfa_offset 32
.Ltmp0:
	.loc	3 12 15 prologue_end
	movl	$sync.Mutex..d, %edi
	callq	runtime.newobject
	movq	$0, (%rax)
	.loc	3 12 13 is_stmt 0
	movq	$pimt..interface.4Lock.0func.8.9.8.9.2Unlock.0func.8.9.8.9.5..sync.Mutex, 8(%rsp)
	movq	%rax, 16(%rsp)
	cmpl	$0, runtime.writeBarrier(%rip)
	je	.LBB0_5
	.loc	3 0 13
	leaq	8(%rsp), %rdx
	.loc	3 12 13
	movl	$sync.Locker..d, %edi
	movl	$command_line_arguments.MainLocker, %esi
	callq	runtime.typedmemmove
	addq	$24, %rsp
	.cfi_def_cfa_offset 8
	retq
.LBB0_5:
	.cfi_def_cfa_offset 32
	movups	8(%rsp), %xmm0
	movups	%xmm0, command_line_arguments.MainLocker(%rip)
