; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22text\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/gogo/protobuf/proto\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/gogo/protobuf/proto\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bridge\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22gomatcha.io/matcha/bridge\22"
module asm "\09.ascii \22 \5C\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./styledtext.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha/text")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "text.MarshalProtobuf.command_line_arguments.Alignment", linkageName: "command_line_arguments.Alignment.MarshalProtobuf", scope: null, file: !10, line: 21, type: !11, isLocal: false, isDefinition: true, scopeLine: 21, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DIFile(filename: "style.go", directory: ".")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !14}
!13 = !DIBasicType(name: "TextAlignment", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIBasicType(name: "Alignment", size: 64, encoding: DW_ATE_signed)
!16 = !DILocalVariable(name: "pointer", arg: 1, scope: !9, file: !10, line: 21, type: !14)
!17 = !DILocation(line: 21, column: 1, scope: !9)
!18 = !DILocalVariable(name: "a", scope: !9, file: !10, line: 21, type: !15)
!19 = !DILocalVariable(name: "$ret8", scope: !9, file: !10, line: 21, type: !13)
!20 = !DILocation(line: 21, column: 38, scope: !9)
!21 = !DILocation(line: 22, column: 29, scope: !9)
!22 = !DILocation(line: 22, column: 2, scope: !9)
!23 = distinct !DISubprogram(name: "text.Alignment..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.Alignment", scope: null, file: !10, line: 297, type: !24, isLocal: false, isDefinition: true, scopeLine: 297, isOptimized: false, unit: !1, retainedNodes: !3)
!24 = !DISubroutineType(types: !25)
!25 = !{!15, !26, !26}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "Style", file: !10, line: 150, size: 128, align: 8, elements: !28)
!28 = !{!29, !48}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", file: !10, line: 151, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !32)
!32 = !{!33, !35, !37, !38, !40, !41, !44, !45, !47}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !34, size: 64, align: 64)
!34 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !36, size: 8, align: 8, offset: 64)
!36 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !36, size: 8, align: 8, offset: 72)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !39, size: 16, align: 16, offset: 80)
!39 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !42, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "void")
!44 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !42, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !46, size: 64, align: 64, offset: 256)
!46 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !42, size: 64, align: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "cleared", file: !10, line: 152, baseType: !30, size: 64, align: 64, offset: 64)
!49 = !DILocalVariable(name: "f", arg: 1, scope: !23, file: !10, line: 297, type: !26)
!50 = !DILocation(line: 297, column: 1, scope: !23)
!51 = !DILocalVariable(name: "$ret23", scope: !23, file: !10, line: 297, type: !15)
!52 = !DILocation(line: 297, column: 29, scope: !23)
!53 = !DILocation(line: 298, column: 10, scope: !23)
!54 = !DILocation(line: 298, column: 33, scope: !23)
!55 = !DILocation(line: 298, column: 2, scope: !23)
!56 = distinct !DISubprogram(name: "text.ClearAlignment..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.ClearAlignment", scope: null, file: !10, line: 305, type: !57, isLocal: false, isDefinition: true, scopeLine: 305, isOptimized: false, unit: !1, retainedNodes: !3)
!57 = !DISubroutineType(types: !58)
!58 = !{!43, !26, !26}
!59 = !DILocalVariable(name: "f", arg: 1, scope: !56, file: !10, line: 305, type: !26)
!60 = !DILocation(line: 305, column: 1, scope: !56)
!61 = !DILocation(line: 306, column: 3, scope: !56)
!62 = distinct !DISubprogram(name: "text.ClearFont..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.ClearFont", scope: null, file: !10, line: 365, type: !57, isLocal: false, isDefinition: true, scopeLine: 365, isOptimized: false, unit: !1, retainedNodes: !3)
!63 = !DILocalVariable(name: "f", arg: 1, scope: !62, file: !10, line: 365, type: !26)
!64 = !DILocation(line: 365, column: 1, scope: !62)
!65 = !DILocation(line: 366, column: 3, scope: !62)
!66 = distinct !DISubprogram(name: "text.ClearHyphenation..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.ClearHyphenation", scope: null, file: !10, line: 377, type: !57, isLocal: false, isDefinition: true, scopeLine: 377, isOptimized: false, unit: !1, retainedNodes: !3)
!67 = !DILocalVariable(name: "f", arg: 1, scope: !66, file: !10, line: 377, type: !26)
!68 = !DILocation(line: 377, column: 1, scope: !66)
!69 = !DILocation(line: 378, column: 3, scope: !66)
!70 = distinct !DISubprogram(name: "text.ClearLineHeightMultiple..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.ClearLineHeightMultiple", scope: null, file: !10, line: 389, type: !57, isLocal: false, isDefinition: true, scopeLine: 389, isOptimized: false, unit: !1, retainedNodes: !3)
!71 = !DILocalVariable(name: "f", arg: 1, scope: !70, file: !10, line: 389, type: !26)
!72 = !DILocation(line: 389, column: 1, scope: !70)
!73 = !DILocation(line: 390, column: 3, scope: !70)
!74 = distinct !DISubprogram(name: "text.ClearStrikethroughColor..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.ClearStrikethroughColor", scope: null, file: !10, line: 329, type: !57, isLocal: false, isDefinition: true, scopeLine: 329, isOptimized: false, unit: !1, retainedNodes: !3)
!75 = !DILocalVariable(name: "f", arg: 1, scope: !74, file: !10, line: 329, type: !26)
!76 = !DILocation(line: 329, column: 1, scope: !74)
!77 = !DILocation(line: 330, column: 3, scope: !74)
!78 = distinct !DISubprogram(name: "text.ClearStrikethroughStyle..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.ClearStrikethroughStyle", scope: null, file: !10, line: 317, type: !57, isLocal: false, isDefinition: true, scopeLine: 317, isOptimized: false, unit: !1, retainedNodes: !3)
!79 = !DILocalVariable(name: "f", arg: 1, scope: !78, file: !10, line: 317, type: !26)
!80 = !DILocation(line: 317, column: 1, scope: !78)
!81 = !DILocation(line: 318, column: 3, scope: !78)
!82 = distinct !DISubprogram(name: "text.ClearTextColor..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.ClearTextColor", scope: null, file: !10, line: 401, type: !57, isLocal: false, isDefinition: true, scopeLine: 401, isOptimized: false, unit: !1, retainedNodes: !3)
!83 = !DILocalVariable(name: "f", arg: 1, scope: !82, file: !10, line: 401, type: !26)
!84 = !DILocation(line: 401, column: 1, scope: !82)
!85 = !DILocation(line: 402, column: 3, scope: !82)
!86 = distinct !DISubprogram(name: "text.ClearTruncation..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.ClearTruncation", scope: null, file: !10, line: 425, type: !57, isLocal: false, isDefinition: true, scopeLine: 425, isOptimized: false, unit: !1, retainedNodes: !3)
!87 = !DILocalVariable(name: "f", arg: 1, scope: !86, file: !10, line: 425, type: !26)
!88 = !DILocation(line: 425, column: 1, scope: !86)
!89 = !DILocation(line: 426, column: 3, scope: !86)
!90 = distinct !DISubprogram(name: "text.ClearTruncationString..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.ClearTruncationString", scope: null, file: !10, line: 437, type: !57, isLocal: false, isDefinition: true, scopeLine: 437, isOptimized: false, unit: !1, retainedNodes: !3)
!91 = !DILocalVariable(name: "f", arg: 1, scope: !90, file: !10, line: 437, type: !26)
!92 = !DILocation(line: 437, column: 1, scope: !90)
!93 = !DILocation(line: 438, column: 3, scope: !90)
!94 = distinct !DISubprogram(name: "text.ClearUnderlineColor..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.ClearUnderlineColor", scope: null, file: !10, line: 353, type: !57, isLocal: false, isDefinition: true, scopeLine: 353, isOptimized: false, unit: !1, retainedNodes: !3)
!95 = !DILocalVariable(name: "f", arg: 1, scope: !94, file: !10, line: 353, type: !26)
!96 = !DILocation(line: 353, column: 1, scope: !94)
!97 = !DILocation(line: 354, column: 3, scope: !94)
!98 = distinct !DISubprogram(name: "text.ClearUnderlineStyle..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.ClearUnderlineStyle", scope: null, file: !10, line: 341, type: !57, isLocal: false, isDefinition: true, scopeLine: 341, isOptimized: false, unit: !1, retainedNodes: !3)
!99 = !DILocalVariable(name: "f", arg: 1, scope: !98, file: !10, line: 341, type: !26)
!100 = !DILocation(line: 341, column: 1, scope: !98)
!101 = !DILocation(line: 342, column: 3, scope: !98)
!102 = distinct !DISubprogram(name: "text.ClearWrap..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.ClearWrap", scope: null, file: !10, line: 413, type: !57, isLocal: false, isDefinition: true, scopeLine: 413, isOptimized: false, unit: !1, retainedNodes: !3)
!103 = !DILocalVariable(name: "f", arg: 1, scope: !102, file: !10, line: 413, type: !26)
!104 = !DILocation(line: 413, column: 1, scope: !102)
!105 = !DILocation(line: 414, column: 3, scope: !102)
!106 = distinct !DISubprogram(name: "text.Copy..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.Copy", scope: null, file: !10, line: 219, type: !107, isLocal: false, isDefinition: true, scopeLine: 219, isOptimized: false, unit: !1, retainedNodes: !3)
!107 = !DISubroutineType(types: !108)
!108 = !{!26, !26, !26}
!109 = !DILocalVariable(name: "f", arg: 1, scope: !106, file: !10, line: 219, type: !26)
!110 = !DILocation(line: 219, column: 1, scope: !106)
!111 = !DILocalVariable(name: "$ret21", scope: !106, file: !10, line: 219, type: !26)
!112 = !DILocation(line: 219, column: 24, scope: !106)
!113 = !DILocation(line: 220, column: 7, scope: !114)
!114 = distinct !DILexicalBlock(scope: !106, file: !10, line: 219, column: 1)
!115 = !DILocation(line: 221, column: 3, scope: !114)
!116 = !DILocation(line: 224, column: 7, scope: !114)
!117 = !DILocalVariable(name: "c", scope: !114, file: !10, line: 224, type: !26)
!118 = !DILocation(line: 224, column: 2, scope: !106)
!119 = !DILocation(line: 225, column: 6, scope: !114)
!120 = !DILocation(line: 225, column: 18, scope: !114)
!121 = !DILocation(line: 226, column: 4, scope: !114)
!122 = !DILocation(line: 226, column: 18, scope: !114)
!123 = !DILocation(line: 226, column: 16, scope: !114)
!124 = !DILocalVariable(name: "k", scope: !125, file: !10, line: 227, type: !126)
!125 = distinct !DILexicalBlock(scope: !114, file: !10, line: 227, column: 3)
!126 = !DIBasicType(name: ".command-line-arguments.styleKey", size: 64, encoding: DW_ATE_signed)
!127 = !DILocation(line: 227, column: 7, scope: !114)
!128 = !DILocation(line: 227, column: 22, scope: !125)
!129 = !DILocation(line: 227, column: 3, scope: !125)
!130 = !DILocation(line: 228, column: 20, scope: !125)
!131 = !DILocation(line: 228, column: 5, scope: !125)
!132 = !DILocation(line: 231, column: 6, scope: !114)
!133 = !DILocation(line: 231, column: 15, scope: !114)
!134 = !DILocation(line: 232, column: 4, scope: !114)
!135 = !DILocation(line: 232, column: 15, scope: !114)
!136 = !DILocation(line: 232, column: 13, scope: !114)
!137 = !DILocalVariable(name: "k", scope: !138, file: !10, line: 233, type: !126)
!138 = distinct !DILexicalBlock(scope: !114, file: !10, line: 233, column: 3)
!139 = !DILocation(line: 233, column: 7, scope: !114)
!140 = !DILocalVariable(name: "v", scope: !138, file: !10, line: 233, type: !141)
!141 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!142 = !DILocation(line: 233, column: 22, scope: !138)
!143 = !DILocation(line: 233, column: 3, scope: !138)
!144 = !DILocation(line: 234, column: 5, scope: !138)
!145 = !DILocation(line: 234, column: 17, scope: !138)
!146 = distinct !DISubprogram(name: "text.Equal..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.Equal", scope: null, file: !10, line: 215, type: !147, isLocal: false, isDefinition: true, scopeLine: 215, isOptimized: false, unit: !1, retainedNodes: !3)
!147 = !DISubroutineType(types: !148)
!148 = !{!141, !26, !26, !26}
!149 = !DILocalVariable(name: "f", arg: 1, scope: !146, file: !10, line: 215, type: !26)
!150 = !DILocation(line: 215, column: 1, scope: !146)
!151 = !DILocalVariable(name: "f2", arg: 2, scope: !146, file: !10, line: 215, type: !26)
!152 = !DILocation(line: 215, column: 23, scope: !146)
!153 = !DILocalVariable(name: "$ret20", scope: !146, file: !10, line: 215, type: !141)
!154 = !DILocation(line: 215, column: 34, scope: !146)
!155 = !DILocation(line: 216, column: 27, scope: !146)
!156 = !DILocation(line: 216, column: 30, scope: !146)
!157 = !DILocation(line: 216, column: 17, scope: !146)
!158 = !DILocation(line: 216, column: 2, scope: !146)
!159 = distinct !DISubprogram(name: "text.MarshalProtobuf..1command_line_arguments.Font", linkageName: "command_line_arguments.Font.MarshalProtobuf", scope: null, file: !10, line: 97, type: !160, isLocal: false, isDefinition: true, scopeLine: 97, isOptimized: false, unit: !1, retainedNodes: !3)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !175, !175}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "Font", file: !164, line: 12, size: 320, align: 8, elements: !165)
!164 = !DIFile(filename: "styledtext.go", directory: ".")
!165 = !{!166, !172, !173}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Family", file: !164, line: 12, baseType: !167, size: 128, align: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !168)
!168 = !{!169, !171}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !34, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Face", file: !164, line: 12, baseType: !167, size: 128, align: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !164, line: 12, baseType: !174, size: 64, align: 64, offset: 256)
!174 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "Font", file: !10, line: 92, size: 192, align: 8, elements: !177)
!177 = !{!178, !179}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !10, line: 93, baseType: !167, size: 128, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !10, line: 94, baseType: !174, size: 64, align: 64, offset: 128)
!180 = !DILocalVariable(name: "f", arg: 1, scope: !159, file: !10, line: 97, type: !175)
!181 = !DILocation(line: 97, column: 1, scope: !159)
!182 = !DILocalVariable(name: "$ret15", scope: !159, file: !10, line: 97, type: !162)
!183 = !DILocation(line: 97, column: 34, scope: !159)
!184 = !DILocation(line: 99, column: 12, scope: !159)
!185 = !DILocation(line: 100, column: 12, scope: !159)
!186 = !DILocation(line: 98, column: 9, scope: !159)
!187 = !DILocation(line: 98, column: 17, scope: !159)
!188 = !DILocation(line: 98, column: 2, scope: !159)
!189 = distinct !DISubprogram(name: "text.command_line_arguments.Font..hash", linkageName: "command_line_arguments.command_line_arguments.Font..hash", scope: null, file: !7, line: 1, type: !190, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!190 = !DISubroutineType(types: !191)
!191 = !{!46, !42, !46}
!192 = !DILocalVariable(name: "key", arg: 1, scope: !189, file: !7, line: 1, type: !42)
!193 = !DILocation(line: 1, column: 1, scope: !189)
!194 = !DILocalVariable(name: "seed", arg: 2, scope: !189, file: !7, line: 1, type: !46)
!195 = !DILocalVariable(name: "$ret42", scope: !189, file: !7, line: 1, type: !46)
!196 = distinct !DISubprogram(name: "text.command_line_arguments.Font..eq", linkageName: "command_line_arguments.command_line_arguments.Font..eq", scope: null, file: !7, line: 1, type: !197, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!197 = !DISubroutineType(types: !198)
!198 = !{!141, !42, !42}
!199 = !DILocalVariable(name: "key1", arg: 1, scope: !196, file: !7, line: 1, type: !42)
!200 = !DILocation(line: 1, column: 1, scope: !196)
!201 = !DILocalVariable(name: "key2", arg: 2, scope: !196, file: !7, line: 1, type: !42)
!202 = !DILocalVariable(name: "$ret43", scope: !196, file: !7, line: 1, type: !141)
!203 = distinct !DISubprogram(name: "text.Font..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.Font", scope: null, file: !10, line: 357, type: !204, isLocal: false, isDefinition: true, scopeLine: 357, isOptimized: false, unit: !1, retainedNodes: !3)
!204 = !DISubroutineType(types: !205)
!205 = !{!175, !26, !26}
!206 = !DILocalVariable(name: "f", arg: 1, scope: !203, file: !10, line: 357, type: !26)
!207 = !DILocation(line: 357, column: 1, scope: !203)
!208 = !DILocalVariable(name: "$ret28", scope: !203, file: !10, line: 357, type: !175)
!209 = !DILocation(line: 357, column: 24, scope: !203)
!210 = !DILocation(line: 358, column: 10, scope: !203)
!211 = !DILocation(line: 358, column: 28, scope: !203)
!212 = !DILocation(line: 358, column: 2, scope: !203)
!213 = distinct !DISubprogram(name: "text.Hyphenation..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.Hyphenation", scope: null, file: !10, line: 369, type: !214, isLocal: false, isDefinition: true, scopeLine: 369, isOptimized: false, unit: !1, retainedNodes: !3)
!214 = !DISubroutineType(types: !215)
!215 = !{!174, !26, !26}
!216 = !DILocalVariable(name: "f", arg: 1, scope: !213, file: !10, line: 369, type: !26)
!217 = !DILocation(line: 369, column: 1, scope: !213)
!218 = !DILocalVariable(name: "$ret29", scope: !213, file: !10, line: 369, type: !174)
!219 = !DILocation(line: 369, column: 31, scope: !213)
!220 = !DILocation(line: 370, column: 10, scope: !213)
!221 = !DILocation(line: 370, column: 35, scope: !213)
!222 = !DILocation(line: 370, column: 2, scope: !213)
!223 = distinct !DISubprogram(name: "text.LineHeightMultiple..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.LineHeightMultiple", scope: null, file: !10, line: 381, type: !214, isLocal: false, isDefinition: true, scopeLine: 381, isOptimized: false, unit: !1, retainedNodes: !3)
!224 = !DILocalVariable(name: "f", arg: 1, scope: !223, file: !10, line: 381, type: !26)
!225 = !DILocation(line: 381, column: 1, scope: !223)
!226 = !DILocalVariable(name: "$ret30", scope: !223, file: !10, line: 381, type: !174)
!227 = !DILocation(line: 381, column: 38, scope: !223)
!228 = !DILocation(line: 382, column: 10, scope: !223)
!229 = !DILocation(line: 382, column: 42, scope: !223)
!230 = !DILocation(line: 382, column: 2, scope: !223)
!231 = distinct !DISubprogram(name: "text.MarshalProtobuf..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.MarshalProtobuf", scope: null, file: !10, line: 250, type: !232, isLocal: false, isDefinition: true, scopeLine: 250, isOptimized: false, unit: !1, retainedNodes: !3)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !26, !26}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "TextStyle", file: !164, line: 12, size: 1280, align: 8, elements: !236)
!236 = !{!237, !239, !240, !242, !243, !244, !245, !246, !247, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !264, !266, !267, !268}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !164, line: 12, baseType: !238, size: 64, align: 64)
!238 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "TextAlignment", file: !164, line: 12, baseType: !13, size: 32, align: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughStyle", file: !164, line: 12, baseType: !241, size: 32, align: 32, offset: 96)
!241 = !DIBasicType(name: "StrikethroughStyle", size: 32, encoding: DW_ATE_signed)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "HasStrikethroughColor", file: !164, line: 12, baseType: !141, size: 8, align: 8, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorRed", file: !164, line: 12, baseType: !8, size: 32, align: 32, offset: 160)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorGreen", file: !164, line: 12, baseType: !8, size: 32, align: 32, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorBlue", file: !164, line: 12, baseType: !8, size: 32, align: 32, offset: 224)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorAlpha", file: !164, line: 12, baseType: !8, size: 32, align: 32, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineStyle", file: !164, line: 12, baseType: !248, size: 32, align: 32, offset: 288)
!248 = !DIBasicType(name: "UnderlineStyle", size: 32, encoding: DW_ATE_signed)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "HasUnderlineColor", file: !164, line: 12, baseType: !141, size: 8, align: 8, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorRed", file: !164, line: 12, baseType: !8, size: 32, align: 32, offset: 352)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorGreen", file: !164, line: 12, baseType: !8, size: 32, align: 32, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorBlue", file: !164, line: 12, baseType: !8, size: 32, align: 32, offset: 416)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorAlpha", file: !164, line: 12, baseType: !8, size: 32, align: 32, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Hyphenation", file: !164, line: 12, baseType: !174, size: 64, align: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "LineHeightMultiple", file: !164, line: 12, baseType: !174, size: 64, align: 64, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "MaxLines", file: !164, line: 12, baseType: !238, size: 64, align: 64, offset: 640)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "HasTextColor", file: !164, line: 12, baseType: !141, size: 8, align: 8, offset: 704)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorRed", file: !164, line: 12, baseType: !8, size: 32, align: 32, offset: 736)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorGreen", file: !164, line: 12, baseType: !8, size: 32, align: 32, offset: 768)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorBlue", file: !164, line: 12, baseType: !8, size: 32, align: 32, offset: 800)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorAlpha", file: !164, line: 12, baseType: !8, size: 32, align: 32, offset: 832)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Wrap", file: !164, line: 12, baseType: !263, size: 32, align: 32, offset: 864)
!263 = !DIBasicType(name: "TextWrap", size: 32, encoding: DW_ATE_signed)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Truncation", file: !164, line: 12, baseType: !265, size: 32, align: 32, offset: 896)
!265 = !DIBasicType(name: "Truncation", size: 32, encoding: DW_ATE_signed)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "TruncationString", file: !164, line: 12, baseType: !167, size: 128, align: 64, offset: 960)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "FontName", file: !164, line: 12, baseType: !167, size: 128, align: 64, offset: 1088)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "FontSize", file: !164, line: 12, baseType: !174, size: 64, align: 64, offset: 1216)
!269 = !DILocalVariable(name: "f", arg: 1, scope: !231, file: !10, line: 250, type: !26)
!270 = !DILocation(line: 250, column: 1, scope: !231)
!271 = !DILocalVariable(name: "$ret22", scope: !231, file: !10, line: 250, type: !234)
!272 = !DILocation(line: 250, column: 35, scope: !231)
!273 = !DILocation(line: 251, column: 7, scope: !274)
!274 = distinct !DILexicalBlock(scope: !231, file: !10, line: 250, column: 1)
!275 = !DILocation(line: 252, column: 7, scope: !274)
!276 = !DILocation(line: 256, column: 24, scope: !274)
!277 = !DILocation(line: 256, column: 47, scope: !274)
!278 = !DILocation(line: 21, column: 1, scope: !9, inlinedAt: !279)
!279 = distinct !DILocation(line: 256, column: 59, scope: !274)
!280 = !DILocation(line: 21, column: 38, scope: !9, inlinedAt: !279)
!281 = !DILocation(line: 22, column: 29, scope: !9, inlinedAt: !279)
!282 = !DILocation(line: 257, column: 24, scope: !274)
!283 = !DILocation(line: 257, column: 56, scope: !274)
!284 = !DILocalVariable(name: "a", scope: !285, file: !10, line: 37, type: !289)
!285 = distinct !DISubprogram(name: "text.MarshalProtobuf.command_line_arguments.StrikethroughStyle", linkageName: "command_line_arguments.StrikethroughStyle.MarshalProtobuf", scope: null, file: !10, line: 37, type: !286, isLocal: false, isDefinition: true, scopeLine: 37, isOptimized: false, unit: !1, retainedNodes: !3)
!286 = !DISubroutineType(types: !287)
!287 = !{!241, !288, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIBasicType(name: "StrikethroughStyle", size: 64, encoding: DW_ATE_signed)
!290 = !DILocation(line: 37, column: 1, scope: !285, inlinedAt: !291)
!291 = distinct !DILocation(line: 257, column: 77, scope: !274)
!292 = !DILocalVariable(name: "$ret9", scope: !285, file: !10, line: 37, type: !241)
!293 = !DILocation(line: 37, column: 47, scope: !285, inlinedAt: !291)
!294 = !DILocation(line: 38, column: 34, scope: !285, inlinedAt: !291)
!295 = !DILocation(line: 258, column: 24, scope: !274)
!296 = !DILocation(line: 258, column: 52, scope: !274)
!297 = !DILocalVariable(name: "a", scope: !298, file: !10, line: 53, type: !302)
!298 = distinct !DISubprogram(name: "text.MarshalProtobuf.command_line_arguments.UnderlineStyle", linkageName: "command_line_arguments.UnderlineStyle.MarshalProtobuf", scope: null, file: !10, line: 53, type: !299, isLocal: false, isDefinition: true, scopeLine: 53, isOptimized: false, unit: !1, retainedNodes: !3)
!299 = !DISubroutineType(types: !300)
!300 = !{!248, !301, !301}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIBasicType(name: "UnderlineStyle", size: 64, encoding: DW_ATE_signed)
!303 = !DILocation(line: 53, column: 1, scope: !298, inlinedAt: !304)
!304 = distinct !DILocation(line: 258, column: 69, scope: !274)
!305 = !DILocalVariable(name: "$ret10", scope: !298, file: !10, line: 53, type: !248)
!306 = !DILocation(line: 53, column: 43, scope: !298, inlinedAt: !304)
!307 = !DILocation(line: 54, column: 30, scope: !298, inlinedAt: !304)
!308 = !DILocation(line: 259, column: 24, scope: !274)
!309 = !DILocation(line: 260, column: 24, scope: !274)
!310 = !DILocation(line: 261, column: 24, scope: !274)
!311 = !DILocation(line: 261, column: 42, scope: !274)
!312 = !DILocalVariable(name: "a", scope: !313, file: !10, line: 113, type: !317)
!313 = distinct !DISubprogram(name: "text.MarshalProtobuf.command_line_arguments.Wrap", linkageName: "command_line_arguments.Wrap.MarshalProtobuf", scope: null, file: !10, line: 113, type: !314, isLocal: false, isDefinition: true, scopeLine: 113, isOptimized: false, unit: !1, retainedNodes: !3)
!314 = !DISubroutineType(types: !315)
!315 = !{!263, !316, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIBasicType(name: "Wrap", size: 64, encoding: DW_ATE_signed)
!318 = !DILocation(line: 113, column: 1, scope: !313, inlinedAt: !319)
!319 = distinct !DILocation(line: 261, column: 49, scope: !274)
!320 = !DILocalVariable(name: "$ret16", scope: !313, file: !10, line: 113, type: !263)
!321 = !DILocation(line: 113, column: 33, scope: !313, inlinedAt: !319)
!322 = !DILocation(line: 114, column: 24, scope: !313, inlinedAt: !319)
!323 = !DILocation(line: 262, column: 24, scope: !274)
!324 = !DILocation(line: 262, column: 48, scope: !274)
!325 = !DILocalVariable(name: "a", scope: !326, file: !10, line: 127, type: !330)
!326 = distinct !DISubprogram(name: "text.MarshalProtobuf.command_line_arguments.Truncation", linkageName: "command_line_arguments.Truncation.MarshalProtobuf", scope: null, file: !10, line: 127, type: !327, isLocal: false, isDefinition: true, scopeLine: 127, isOptimized: false, unit: !1, retainedNodes: !3)
!327 = !DISubroutineType(types: !328)
!328 = !{!265, !329, !329}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIBasicType(name: "Truncation", size: 64, encoding: DW_ATE_signed)
!331 = !DILocation(line: 127, column: 1, scope: !326, inlinedAt: !332)
!332 = distinct !DILocation(line: 262, column: 61, scope: !274)
!333 = !DILocalVariable(name: "$ret17", scope: !326, file: !10, line: 127, type: !265)
!334 = !DILocation(line: 127, column: 39, scope: !326, inlinedAt: !332)
!335 = !DILocation(line: 128, column: 26, scope: !326, inlinedAt: !332)
!336 = !DILocation(line: 263, column: 24, scope: !274)
!337 = !DILocation(line: 259, column: 49, scope: !274)
!338 = !DILocation(line: 260, column: 56, scope: !274)
!339 = !DILocation(line: 263, column: 54, scope: !274)
!340 = !DILocation(line: 255, column: 7, scope: !274)
!341 = !DILocation(line: 255, column: 15, scope: !274)
!342 = !DILocalVariable(name: "s", scope: !274, file: !10, line: 255, type: !234)
!343 = !DILocation(line: 255, column: 2, scope: !231)
!344 = !DILocation(line: 266, column: 12, scope: !345)
!345 = distinct !DILexicalBlock(scope: !274, file: !10, line: 265, column: 2)
!346 = !DILocation(line: 266, column: 30, scope: !345)
!347 = !DILocalVariable(name: "font", scope: !345, file: !10, line: 266, type: !175)
!348 = !DILocation(line: 266, column: 3, scope: !274)
!349 = !DILocation(line: 267, column: 4, scope: !345)
!350 = !DILocation(line: 267, column: 20, scope: !345)
!351 = !DILocation(line: 267, column: 14, scope: !345)
!352 = !DILocation(line: 268, column: 4, scope: !345)
!353 = !DILocation(line: 268, column: 20, scope: !345)
!354 = !DILocation(line: 268, column: 14, scope: !345)
!355 = !DILocation(line: 271, column: 18, scope: !356)
!356 = distinct !DILexicalBlock(scope: !274, file: !10, line: 270, column: 2)
!357 = !DILocation(line: 271, column: 41, scope: !356)
!358 = !DILocation(line: 271, column: 55, scope: !356)
!359 = !DILocalVariable(name: "r", scope: !356, file: !10, line: 271, type: !8)
!360 = !DILocation(line: 271, column: 3, scope: !274)
!361 = !DILocalVariable(name: "g", scope: !356, file: !10, line: 271, type: !8)
!362 = !DILocalVariable(name: "b", scope: !356, file: !10, line: 271, type: !8)
!363 = !DILocalVariable(name: "a", scope: !356, file: !10, line: 271, type: !8)
!364 = !DILocation(line: 272, column: 4, scope: !356)
!365 = !DILocation(line: 272, column: 18, scope: !356)
!366 = !DILocation(line: 273, column: 4, scope: !356)
!367 = !DILocation(line: 273, column: 18, scope: !356)
!368 = !DILocation(line: 274, column: 4, scope: !356)
!369 = !DILocation(line: 274, column: 20, scope: !356)
!370 = !DILocation(line: 275, column: 4, scope: !356)
!371 = !DILocation(line: 275, column: 19, scope: !356)
!372 = !DILocation(line: 276, column: 4, scope: !356)
!373 = !DILocation(line: 276, column: 20, scope: !356)
!374 = !DILocation(line: 279, column: 18, scope: !375)
!375 = distinct !DILexicalBlock(scope: !274, file: !10, line: 278, column: 2)
!376 = !DILocation(line: 279, column: 50, scope: !375)
!377 = !DILocation(line: 279, column: 64, scope: !375)
!378 = !DILocalVariable(name: "r", scope: !375, file: !10, line: 279, type: !8)
!379 = !DILocation(line: 279, column: 3, scope: !274)
!380 = !DILocalVariable(name: "g", scope: !375, file: !10, line: 279, type: !8)
!381 = !DILocalVariable(name: "b", scope: !375, file: !10, line: 279, type: !8)
!382 = !DILocalVariable(name: "a", scope: !375, file: !10, line: 279, type: !8)
!383 = !DILocation(line: 280, column: 4, scope: !375)
!384 = !DILocation(line: 280, column: 27, scope: !375)
!385 = !DILocation(line: 281, column: 4, scope: !375)
!386 = !DILocation(line: 281, column: 27, scope: !375)
!387 = !DILocation(line: 282, column: 4, scope: !375)
!388 = !DILocation(line: 282, column: 29, scope: !375)
!389 = !DILocation(line: 283, column: 4, scope: !375)
!390 = !DILocation(line: 283, column: 28, scope: !375)
!391 = !DILocation(line: 284, column: 4, scope: !375)
!392 = !DILocation(line: 284, column: 29, scope: !375)
!393 = !DILocation(line: 287, column: 18, scope: !394)
!394 = distinct !DILexicalBlock(scope: !274, file: !10, line: 286, column: 2)
!395 = !DILocation(line: 287, column: 46, scope: !394)
!396 = !DILocation(line: 287, column: 60, scope: !394)
!397 = !DILocalVariable(name: "r", scope: !394, file: !10, line: 287, type: !8)
!398 = !DILocation(line: 287, column: 3, scope: !274)
!399 = !DILocalVariable(name: "g", scope: !394, file: !10, line: 287, type: !8)
!400 = !DILocalVariable(name: "b", scope: !394, file: !10, line: 287, type: !8)
!401 = !DILocalVariable(name: "a", scope: !394, file: !10, line: 287, type: !8)
!402 = !DILocation(line: 288, column: 4, scope: !394)
!403 = !DILocation(line: 288, column: 23, scope: !394)
!404 = !DILocation(line: 289, column: 4, scope: !394)
!405 = !DILocation(line: 289, column: 23, scope: !394)
!406 = !DILocation(line: 290, column: 4, scope: !394)
!407 = !DILocation(line: 290, column: 25, scope: !394)
!408 = !DILocation(line: 291, column: 4, scope: !394)
!409 = !DILocation(line: 291, column: 24, scope: !394)
!410 = !DILocation(line: 292, column: 4, scope: !394)
!411 = !DILocation(line: 292, column: 25, scope: !394)
!412 = !DILocation(line: 294, column: 2, scope: !274)
!413 = distinct !DISubprogram(name: "text.SetAlignment..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.SetAlignment", scope: null, file: !10, line: 301, type: !414, isLocal: false, isDefinition: true, scopeLine: 301, isOptimized: false, unit: !1, retainedNodes: !3)
!414 = !DISubroutineType(types: !415)
!415 = !{!43, !26, !26, !15}
!416 = !DILocalVariable(name: "f", arg: 1, scope: !413, file: !10, line: 301, type: !26)
!417 = !DILocation(line: 301, column: 1, scope: !413)
!418 = !DILocalVariable(name: "v", arg: 2, scope: !413, file: !10, line: 301, type: !15)
!419 = !DILocation(line: 301, column: 30, scope: !413)
!420 = !DILocation(line: 302, column: 27, scope: !413)
!421 = !DILocation(line: 302, column: 3, scope: !413)
!422 = distinct !DISubprogram(name: "text.SetFont..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.SetFont", scope: null, file: !10, line: 361, type: !423, isLocal: false, isDefinition: true, scopeLine: 361, isOptimized: false, unit: !1, retainedNodes: !3)
!423 = !DISubroutineType(types: !424)
!424 = !{!43, !26, !26, !175}
!425 = !DILocalVariable(name: "f", arg: 1, scope: !422, file: !10, line: 361, type: !26)
!426 = !DILocation(line: 361, column: 1, scope: !422)
!427 = !DILocalVariable(name: "v", arg: 2, scope: !422, file: !10, line: 361, type: !175)
!428 = !DILocation(line: 361, column: 25, scope: !422)
!429 = !DILocation(line: 362, column: 22, scope: !422)
!430 = !DILocation(line: 362, column: 3, scope: !422)
!431 = distinct !DISubprogram(name: "text.SetHyphenation..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.SetHyphenation", scope: null, file: !10, line: 373, type: !432, isLocal: false, isDefinition: true, scopeLine: 373, isOptimized: false, unit: !1, retainedNodes: !3)
!432 = !DISubroutineType(types: !433)
!433 = !{!43, !26, !26, !174}
!434 = !DILocalVariable(name: "f", arg: 1, scope: !431, file: !10, line: 373, type: !26)
!435 = !DILocation(line: 373, column: 1, scope: !431)
!436 = !DILocalVariable(name: "v", arg: 2, scope: !431, file: !10, line: 373, type: !174)
!437 = !DILocation(line: 373, column: 32, scope: !431)
!438 = !DILocation(line: 374, column: 29, scope: !431)
!439 = !DILocation(line: 374, column: 3, scope: !431)
!440 = distinct !DISubprogram(name: "text.SetLineHeightMultiple..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.SetLineHeightMultiple", scope: null, file: !10, line: 385, type: !432, isLocal: false, isDefinition: true, scopeLine: 385, isOptimized: false, unit: !1, retainedNodes: !3)
!441 = !DILocalVariable(name: "f", arg: 1, scope: !440, file: !10, line: 385, type: !26)
!442 = !DILocation(line: 385, column: 1, scope: !440)
!443 = !DILocalVariable(name: "v", arg: 2, scope: !440, file: !10, line: 385, type: !174)
!444 = !DILocation(line: 385, column: 39, scope: !440)
!445 = !DILocation(line: 386, column: 36, scope: !440)
!446 = !DILocation(line: 386, column: 3, scope: !440)
!447 = distinct !DISubprogram(name: "text.SetStrikethroughColor..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.SetStrikethroughColor", scope: null, file: !10, line: 325, type: !448, isLocal: false, isDefinition: true, scopeLine: 325, isOptimized: false, unit: !1, retainedNodes: !3)
!448 = !DISubroutineType(types: !449)
!449 = !{!43, !26, !26, !450}
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", file: !10, line: 4, size: 128, align: 8, elements: !451)
!451 = !{!452, !511}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !453, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{uint32,uint32,uint32,uint32}}", file: !455, size: 128, align: 8, elements: !456)
!455 = !DIFile(filename: "", directory: "")
!456 = !{!457, !501}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !455, line: 4, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !460)
!460 = !{!461, !462, !463, !464, !465, !466, !467, !473, !479, !480, !482, !500}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !46, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !46, size: 64, align: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !36, size: 8, align: 8, offset: 160)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !36, size: 8, align: 8, offset: 168)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !36, size: 8, align: 8, offset: 176)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !468, size: 64, align: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !470)
!470 = !{!471}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !474, size: 64, align: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !476)
!476 = !{!477}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !170, size: 64, align: 64, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !481, size: 64, align: 64, offset: 384)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !483, size: 64, align: 64, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !485)
!485 = !{!486, !487, !488}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !481, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !481, size: 64, align: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !489, size: 192, align: 64, offset: 128)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !455, size: 192, align: 8, elements: !490)
!490 = !{!491, !498, !499}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !455, line: 1, baseType: !492, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !494)
!494 = !{!486, !487, !495, !496, !497}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !42, size: 64, align: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !42, size: 64, align: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !42, size: 64, align: 64, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !455, line: 1, baseType: !34, size: 64, align: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !455, line: 1, baseType: !34, size: 64, align: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !42, size: 64, align: 64, offset: 512)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "RGBA", file: !455, line: 4, baseType: !502, size: 64, align: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!505, !42}
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{uint32,uint32,uint32,uint32}", file: !455, size: 128, align: 8, elements: !506)
!506 = !{!507, !508, !509, !510}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !455, line: 4, baseType: !8, size: 32, align: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !455, line: 4, baseType: !8, size: 32, align: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !455, line: 4, baseType: !8, size: 32, align: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "a", file: !455, line: 4, baseType: !8, size: 32, align: 32, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !42, size: 64, align: 64, offset: 64)
!512 = !DILocalVariable(name: "f", arg: 1, scope: !447, file: !10, line: 325, type: !26)
!513 = !DILocation(line: 325, column: 1, scope: !447)
!514 = !DILocalVariable(name: "v", arg: 2, scope: !447, file: !10, line: 325, type: !450)
!515 = !DILocation(line: 325, column: 39, scope: !447)
!516 = !DILocation(line: 326, column: 36, scope: !447)
!517 = !DILocation(line: 326, column: 3, scope: !447)
!518 = !DILocalVariable(name: "pointer", arg: 1, scope: !285, file: !10, line: 37, type: !288)
!519 = !DILocation(line: 37, column: 1, scope: !285)
!520 = !DILocation(line: 37, column: 47, scope: !285)
!521 = !DILocation(line: 38, column: 34, scope: !285)
!522 = !DILocation(line: 38, column: 2, scope: !285)
!523 = distinct !DISubprogram(name: "text.SetStrikethroughStyle..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.SetStrikethroughStyle", scope: null, file: !10, line: 313, type: !524, isLocal: false, isDefinition: true, scopeLine: 313, isOptimized: false, unit: !1, retainedNodes: !3)
!524 = !DISubroutineType(types: !525)
!525 = !{!43, !26, !26, !289}
!526 = !DILocalVariable(name: "f", arg: 1, scope: !523, file: !10, line: 313, type: !26)
!527 = !DILocation(line: 313, column: 1, scope: !523)
!528 = !DILocalVariable(name: "v", arg: 2, scope: !523, file: !10, line: 313, type: !289)
!529 = !DILocation(line: 313, column: 39, scope: !523)
!530 = !DILocation(line: 314, column: 36, scope: !523)
!531 = !DILocation(line: 314, column: 3, scope: !523)
!532 = distinct !DISubprogram(name: "text.SetTextColor..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.SetTextColor", scope: null, file: !10, line: 397, type: !448, isLocal: false, isDefinition: true, scopeLine: 397, isOptimized: false, unit: !1, retainedNodes: !3)
!533 = !DILocalVariable(name: "f", arg: 1, scope: !532, file: !10, line: 397, type: !26)
!534 = !DILocation(line: 397, column: 1, scope: !532)
!535 = !DILocalVariable(name: "v", arg: 2, scope: !532, file: !10, line: 397, type: !450)
!536 = !DILocation(line: 397, column: 30, scope: !532)
!537 = !DILocation(line: 398, column: 27, scope: !532)
!538 = !DILocation(line: 398, column: 3, scope: !532)
!539 = !DILocalVariable(name: "pointer", arg: 1, scope: !326, file: !10, line: 127, type: !329)
!540 = !DILocation(line: 127, column: 1, scope: !326)
!541 = !DILocation(line: 127, column: 39, scope: !326)
!542 = !DILocation(line: 128, column: 26, scope: !326)
!543 = !DILocation(line: 128, column: 2, scope: !326)
!544 = distinct !DISubprogram(name: "text.SetTruncation..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.SetTruncation", scope: null, file: !10, line: 421, type: !545, isLocal: false, isDefinition: true, scopeLine: 421, isOptimized: false, unit: !1, retainedNodes: !3)
!545 = !DISubroutineType(types: !546)
!546 = !{!43, !26, !26, !330}
!547 = !DILocalVariable(name: "f", arg: 1, scope: !544, file: !10, line: 421, type: !26)
!548 = !DILocation(line: 421, column: 1, scope: !544)
!549 = !DILocalVariable(name: "v", arg: 2, scope: !544, file: !10, line: 421, type: !330)
!550 = !DILocation(line: 421, column: 31, scope: !544)
!551 = !DILocation(line: 422, column: 28, scope: !544)
!552 = !DILocation(line: 422, column: 3, scope: !544)
!553 = distinct !DISubprogram(name: "text.SetTruncationString..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.SetTruncationString", scope: null, file: !10, line: 433, type: !554, isLocal: false, isDefinition: true, scopeLine: 433, isOptimized: false, unit: !1, retainedNodes: !3)
!554 = !DISubroutineType(types: !555)
!555 = !{!43, !26, !26, !167}
!556 = !DILocalVariable(name: "f", arg: 1, scope: !553, file: !10, line: 433, type: !26)
!557 = !DILocation(line: 433, column: 1, scope: !553)
!558 = !DILocalVariable(name: "v", arg: 2, scope: !553, file: !10, line: 433, type: !167)
!559 = !DILocation(line: 433, column: 37, scope: !553)
!560 = !DILocation(line: 434, column: 34, scope: !553)
!561 = !DILocation(line: 434, column: 3, scope: !553)
!562 = distinct !DISubprogram(name: "text.SetUnderlineColor..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.SetUnderlineColor", scope: null, file: !10, line: 349, type: !448, isLocal: false, isDefinition: true, scopeLine: 349, isOptimized: false, unit: !1, retainedNodes: !3)
!563 = !DILocalVariable(name: "f", arg: 1, scope: !562, file: !10, line: 349, type: !26)
!564 = !DILocation(line: 349, column: 1, scope: !562)
!565 = !DILocalVariable(name: "v", arg: 2, scope: !562, file: !10, line: 349, type: !450)
!566 = !DILocation(line: 349, column: 35, scope: !562)
!567 = !DILocation(line: 350, column: 32, scope: !562)
!568 = !DILocation(line: 350, column: 3, scope: !562)
!569 = !DILocalVariable(name: "pointer", arg: 1, scope: !298, file: !10, line: 53, type: !301)
!570 = !DILocation(line: 53, column: 1, scope: !298)
!571 = !DILocation(line: 53, column: 43, scope: !298)
!572 = !DILocation(line: 54, column: 30, scope: !298)
!573 = !DILocation(line: 54, column: 2, scope: !298)
!574 = distinct !DISubprogram(name: "text.SetUnderlineStyle..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.SetUnderlineStyle", scope: null, file: !10, line: 337, type: !575, isLocal: false, isDefinition: true, scopeLine: 337, isOptimized: false, unit: !1, retainedNodes: !3)
!575 = !DISubroutineType(types: !576)
!576 = !{!43, !26, !26, !302}
!577 = !DILocalVariable(name: "f", arg: 1, scope: !574, file: !10, line: 337, type: !26)
!578 = !DILocation(line: 337, column: 1, scope: !574)
!579 = !DILocalVariable(name: "v", arg: 2, scope: !574, file: !10, line: 337, type: !302)
!580 = !DILocation(line: 337, column: 35, scope: !574)
!581 = !DILocation(line: 338, column: 32, scope: !574)
!582 = !DILocation(line: 338, column: 3, scope: !574)
!583 = !DILocalVariable(name: "pointer", arg: 1, scope: !313, file: !10, line: 113, type: !316)
!584 = !DILocation(line: 113, column: 1, scope: !313)
!585 = !DILocation(line: 113, column: 33, scope: !313)
!586 = !DILocation(line: 114, column: 24, scope: !313)
!587 = !DILocation(line: 114, column: 2, scope: !313)
!588 = distinct !DISubprogram(name: "text.SetWrap..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.SetWrap", scope: null, file: !10, line: 409, type: !589, isLocal: false, isDefinition: true, scopeLine: 409, isOptimized: false, unit: !1, retainedNodes: !3)
!589 = !DISubroutineType(types: !590)
!590 = !{!43, !26, !26, !317}
!591 = !DILocalVariable(name: "f", arg: 1, scope: !588, file: !10, line: 409, type: !26)
!592 = !DILocation(line: 409, column: 1, scope: !588)
!593 = !DILocalVariable(name: "v", arg: 2, scope: !588, file: !10, line: 409, type: !317)
!594 = !DILocation(line: 409, column: 25, scope: !588)
!595 = !DILocation(line: 410, column: 22, scope: !588)
!596 = !DILocation(line: 410, column: 3, scope: !588)
!597 = distinct !DISubprogram(name: "text.StrikethroughColor..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.StrikethroughColor", scope: null, file: !10, line: 321, type: !598, isLocal: false, isDefinition: true, scopeLine: 321, isOptimized: false, unit: !1, retainedNodes: !3)
!598 = !DISubroutineType(types: !599)
!599 = !{!450, !26, !26}
!600 = !DILocalVariable(name: "f", arg: 1, scope: !597, file: !10, line: 321, type: !26)
!601 = !DILocation(line: 321, column: 1, scope: !597)
!602 = !DILocation(line: 322, column: 10, scope: !597)
!603 = !DILocation(line: 322, column: 42, scope: !597)
!604 = !DILocalVariable(name: "$ret25", scope: !597, file: !10, line: 321, type: !450)
!605 = !DILocation(line: 321, column: 38, scope: !597)
!606 = !DILocation(line: 322, column: 2, scope: !597)
!607 = distinct !DISubprogram(name: "text.StrikethroughStyle..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.StrikethroughStyle", scope: null, file: !10, line: 309, type: !608, isLocal: false, isDefinition: true, scopeLine: 309, isOptimized: false, unit: !1, retainedNodes: !3)
!608 = !DISubroutineType(types: !609)
!609 = !{!289, !26, !26}
!610 = !DILocalVariable(name: "f", arg: 1, scope: !607, file: !10, line: 309, type: !26)
!611 = !DILocation(line: 309, column: 1, scope: !607)
!612 = !DILocalVariable(name: "$ret24", scope: !607, file: !10, line: 309, type: !289)
!613 = !DILocation(line: 309, column: 38, scope: !607)
!614 = !DILocation(line: 310, column: 10, scope: !607)
!615 = !DILocation(line: 310, column: 42, scope: !607)
!616 = !DILocation(line: 310, column: 2, scope: !607)
!617 = distinct !DISubprogram(name: "text.TextColor..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.TextColor", scope: null, file: !10, line: 393, type: !598, isLocal: false, isDefinition: true, scopeLine: 393, isOptimized: false, unit: !1, retainedNodes: !3)
!618 = !DILocalVariable(name: "f", arg: 1, scope: !617, file: !10, line: 393, type: !26)
!619 = !DILocation(line: 393, column: 1, scope: !617)
!620 = !DILocation(line: 394, column: 10, scope: !617)
!621 = !DILocation(line: 394, column: 33, scope: !617)
!622 = !DILocalVariable(name: "$ret31", scope: !617, file: !10, line: 393, type: !450)
!623 = !DILocation(line: 393, column: 29, scope: !617)
!624 = !DILocation(line: 394, column: 2, scope: !617)
!625 = distinct !DISubprogram(name: "text.Truncation..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.Truncation", scope: null, file: !10, line: 417, type: !626, isLocal: false, isDefinition: true, scopeLine: 417, isOptimized: false, unit: !1, retainedNodes: !3)
!626 = !DISubroutineType(types: !627)
!627 = !{!330, !26, !26}
!628 = !DILocalVariable(name: "f", arg: 1, scope: !625, file: !10, line: 417, type: !26)
!629 = !DILocation(line: 417, column: 1, scope: !625)
!630 = !DILocalVariable(name: "$ret33", scope: !625, file: !10, line: 417, type: !330)
!631 = !DILocation(line: 417, column: 30, scope: !625)
!632 = !DILocation(line: 418, column: 10, scope: !625)
!633 = !DILocation(line: 418, column: 34, scope: !625)
!634 = !DILocation(line: 418, column: 2, scope: !625)
!635 = distinct !DISubprogram(name: "text.TruncationString..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.TruncationString", scope: null, file: !10, line: 429, type: !636, isLocal: false, isDefinition: true, scopeLine: 429, isOptimized: false, unit: !1, retainedNodes: !3)
!636 = !DISubroutineType(types: !637)
!637 = !{!167, !26, !26}
!638 = !DILocalVariable(name: "f", arg: 1, scope: !635, file: !10, line: 429, type: !26)
!639 = !DILocation(line: 429, column: 1, scope: !635)
!640 = !DILocation(line: 430, column: 10, scope: !635)
!641 = !DILocation(line: 430, column: 40, scope: !635)
!642 = !DILocation(line: 430, column: 2, scope: !635)
!643 = !DILocalVariable(name: "$ret34", scope: !635, file: !10, line: 429, type: !167)
!644 = !DILocation(line: 429, column: 36, scope: !635)
!645 = distinct !DISubprogram(name: "text.UnderlineColor..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.UnderlineColor", scope: null, file: !10, line: 345, type: !598, isLocal: false, isDefinition: true, scopeLine: 345, isOptimized: false, unit: !1, retainedNodes: !3)
!646 = !DILocalVariable(name: "f", arg: 1, scope: !645, file: !10, line: 345, type: !26)
!647 = !DILocation(line: 345, column: 1, scope: !645)
!648 = !DILocation(line: 346, column: 10, scope: !645)
!649 = !DILocation(line: 346, column: 38, scope: !645)
!650 = !DILocalVariable(name: "$ret27", scope: !645, file: !10, line: 345, type: !450)
!651 = !DILocation(line: 345, column: 34, scope: !645)
!652 = !DILocation(line: 346, column: 2, scope: !645)
!653 = distinct !DISubprogram(name: "text.UnderlineStyle..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.UnderlineStyle", scope: null, file: !10, line: 333, type: !654, isLocal: false, isDefinition: true, scopeLine: 333, isOptimized: false, unit: !1, retainedNodes: !3)
!654 = !DISubroutineType(types: !655)
!655 = !{!302, !26, !26}
!656 = !DILocalVariable(name: "f", arg: 1, scope: !653, file: !10, line: 333, type: !26)
!657 = !DILocation(line: 333, column: 1, scope: !653)
!658 = !DILocalVariable(name: "$ret26", scope: !653, file: !10, line: 333, type: !302)
!659 = !DILocation(line: 333, column: 34, scope: !653)
!660 = !DILocation(line: 334, column: 10, scope: !653)
!661 = !DILocation(line: 334, column: 38, scope: !653)
!662 = !DILocation(line: 334, column: 2, scope: !653)
!663 = distinct !DISubprogram(name: "text.Update..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.Update", scope: null, file: !10, line: 241, type: !664, isLocal: false, isDefinition: true, scopeLine: 241, isOptimized: false, unit: !1, retainedNodes: !3)
!664 = !DISubroutineType(types: !665)
!665 = !{!43, !26, !26, !26}
!666 = !DILocalVariable(name: "f", arg: 1, scope: !663, file: !10, line: 241, type: !26)
!667 = !DILocation(line: 241, column: 1, scope: !663)
!668 = !DILocalVariable(name: "u", arg: 2, scope: !663, file: !10, line: 241, type: !26)
!669 = !DILocation(line: 241, column: 24, scope: !663)
!670 = !DILocalVariable(name: "k", scope: !671, file: !10, line: 242, type: !126)
!671 = distinct !DILexicalBlock(scope: !663, file: !10, line: 242, column: 2)
!672 = !DILocation(line: 242, column: 6, scope: !663)
!673 = !DILocation(line: 242, column: 21, scope: !671)
!674 = !DILocation(line: 242, column: 2, scope: !671)
!675 = !DILocation(line: 243, column: 4, scope: !671)
!676 = !DILocation(line: 243, column: 19, scope: !671)
!677 = !DILocalVariable(name: "k", scope: !678, file: !10, line: 245, type: !126)
!678 = distinct !DILexicalBlock(scope: !663, file: !10, line: 245, column: 2)
!679 = !DILocation(line: 245, column: 6, scope: !663)
!680 = !DILocation(line: 245, column: 18, scope: !678)
!681 = !DILocation(line: 245, column: 2, scope: !678)
!682 = !DILocation(line: 246, column: 11, scope: !678)
!683 = !DILocation(line: 246, column: 3, scope: !678)
!684 = distinct !DISubprogram(name: "text.Wrap..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.Wrap", scope: null, file: !10, line: 405, type: !685, isLocal: false, isDefinition: true, scopeLine: 405, isOptimized: false, unit: !1, retainedNodes: !3)
!685 = !DISubroutineType(types: !686)
!686 = !{!317, !26, !26}
!687 = !DILocalVariable(name: "f", arg: 1, scope: !684, file: !10, line: 405, type: !26)
!688 = !DILocation(line: 405, column: 1, scope: !684)
!689 = !DILocalVariable(name: "$ret32", scope: !684, file: !10, line: 405, type: !317)
!690 = !DILocation(line: 405, column: 24, scope: !684)
!691 = !DILocation(line: 406, column: 10, scope: !684)
!692 = !DILocation(line: 406, column: 28, scope: !684)
!693 = !DILocation(line: 406, column: 2, scope: !684)
!694 = distinct !DISubprogram(name: "text.clear..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.clear", scope: null, file: !10, line: 159, type: !695, isLocal: false, isDefinition: true, scopeLine: 159, isOptimized: false, unit: !1, retainedNodes: !3)
!695 = !DISubroutineType(types: !696)
!696 = !{!43, !26, !26, !126}
!697 = !DILocalVariable(name: "f", arg: 1, scope: !694, file: !10, line: 159, type: !26)
!698 = !DILocation(line: 159, column: 1, scope: !694)
!699 = !DILocalVariable(name: "k", arg: 2, scope: !694, file: !10, line: 159, type: !126)
!700 = !DILocation(line: 159, column: 23, scope: !694)
!701 = !DILocation(line: 160, column: 6, scope: !694)
!702 = !DILocation(line: 160, column: 15, scope: !694)
!703 = !DILocation(line: 160, column: 26, scope: !694)
!704 = !DILocation(line: 160, column: 38, scope: !694)
!705 = !DILocation(line: 161, column: 18, scope: !694)
!706 = !DILocation(line: 161, column: 16, scope: !694)
!707 = !DILocation(line: 161, column: 4, scope: !694)
!708 = !DILocation(line: 162, column: 15, scope: !694)
!709 = !DILocation(line: 162, column: 13, scope: !694)
!710 = !DILocation(line: 165, column: 10, scope: !694)
!711 = !DILocation(line: 165, column: 2, scope: !694)
!712 = !DILocation(line: 166, column: 3, scope: !694)
!713 = !DILocation(line: 166, column: 15, scope: !694)
!714 = distinct !DISubprogram(name: "text.get..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.get", scope: null, file: !10, line: 169, type: !715, isLocal: false, isDefinition: true, scopeLine: 169, isOptimized: false, unit: !1, retainedNodes: !3)
!715 = !DISubroutineType(types: !716)
!716 = !{!717, !26, !26, !126}
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !455, size: 128, align: 8, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !455, line: 1, baseType: !458, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !455, line: 1, baseType: !42, size: 64, align: 64, offset: 64)
!721 = !DILocalVariable(name: "f", arg: 1, scope: !714, file: !10, line: 169, type: !26)
!722 = !DILocation(line: 169, column: 1, scope: !714)
!723 = !DILocalVariable(name: "k", arg: 2, scope: !714, file: !10, line: 169, type: !126)
!724 = !DILocation(line: 169, column: 21, scope: !714)
!725 = !DILocalVariable(name: "ok", scope: !726, file: !10, line: 170, type: !141)
!726 = distinct !DILexicalBlock(scope: !714, file: !10, line: 169, column: 1)
!727 = !DILocation(line: 170, column: 2, scope: !714)
!728 = !DILocation(line: 170, column: 12, scope: !726)
!729 = !DILocation(line: 170, column: 2, scope: !726)
!730 = !DILocation(line: 171, column: 2, scope: !726)
!731 = !DILocalVariable(name: "v", scope: !726, file: !10, line: 170, type: !717)
!732 = !DILocalVariable(name: "$ret19", scope: !714, file: !10, line: 169, type: !717)
!733 = !DILocation(line: 169, column: 33, scope: !714)
!734 = !DILocation(line: 172, column: 3, scope: !726)
!735 = !DILocation(line: 176, column: 3, scope: !726)
!736 = !DILocation(line: 178, column: 3, scope: !726)
!737 = !DILocation(line: 180, column: 3, scope: !726)
!738 = !DILocation(line: 182, column: 3, scope: !726)
!739 = !DILocation(line: 184, column: 3, scope: !726)
!740 = !DILocation(line: 186, column: 10, scope: !726)
!741 = !DILocation(line: 186, column: 3, scope: !726)
!742 = !DILocation(line: 188, column: 3, scope: !726)
!743 = !DILocation(line: 190, column: 3, scope: !726)
!744 = !DILocation(line: 192, column: 3, scope: !726)
!745 = !DILocation(line: 194, column: 3, scope: !726)
!746 = !DILocation(line: 196, column: 3, scope: !726)
!747 = !DILocation(line: 198, column: 3, scope: !726)
!748 = !DILocation(line: 200, column: 3, scope: !726)
!749 = !DILocation(line: 202, column: 2, scope: !726)
!750 = distinct !DISubprogram(name: "text.map_..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.map_", scope: null, file: !10, line: 155, type: !751, isLocal: false, isDefinition: true, scopeLine: 155, isOptimized: false, unit: !1, retainedNodes: !3)
!751 = !DISubroutineType(types: !752)
!752 = !{!30, !26, !26}
!753 = !DILocalVariable(name: "f", arg: 1, scope: !750, file: !10, line: 155, type: !26)
!754 = !DILocation(line: 155, column: 1, scope: !750)
!755 = !DILocalVariable(name: "$ret18", scope: !750, file: !10, line: 155, type: !30)
!756 = !DILocation(line: 155, column: 24, scope: !750)
!757 = !DILocation(line: 156, column: 10, scope: !750)
!758 = !DILocation(line: 156, column: 2, scope: !750)
!759 = distinct !DISubprogram(name: "text.set..1command_line_arguments.Style", linkageName: "command_line_arguments.Style.set", scope: null, file: !10, line: 205, type: !760, isLocal: false, isDefinition: true, scopeLine: 205, isOptimized: false, unit: !1, retainedNodes: !3)
!760 = !DISubroutineType(types: !761)
!761 = !{!43, !26, !26, !126, !717}
!762 = !DILocalVariable(name: "f", arg: 1, scope: !759, file: !10, line: 205, type: !26)
!763 = !DILocation(line: 205, column: 1, scope: !759)
!764 = !DILocalVariable(name: "k", arg: 2, scope: !759, file: !10, line: 205, type: !126)
!765 = !DILocation(line: 205, column: 21, scope: !759)
!766 = !DILocalVariable(name: "v", arg: 3, scope: !759, file: !10, line: 205, type: !717)
!767 = !DILocation(line: 205, column: 33, scope: !759)
!768 = !DILocation(line: 206, column: 6, scope: !759)
!769 = !DILocation(line: 206, column: 15, scope: !759)
!770 = !DILocation(line: 206, column: 26, scope: !759)
!771 = !DILocation(line: 206, column: 38, scope: !759)
!772 = !DILocation(line: 211, column: 3, scope: !759)
!773 = !DILocation(line: 211, column: 18, scope: !759)
!774 = !DILocation(line: 207, column: 18, scope: !759)
!775 = !DILocation(line: 207, column: 16, scope: !759)
!776 = !DILocation(line: 207, column: 4, scope: !759)
!777 = !DILocation(line: 208, column: 15, scope: !759)
!778 = !DILocation(line: 208, column: 13, scope: !759)
!779 = !DILocation(line: 212, column: 10, scope: !759)
!780 = !DILocation(line: 212, column: 2, scope: !759)
!781 = distinct !DISubprogram(name: "text.At..1command_line_arguments.StyledText", linkageName: "command_line_arguments.StyledText.At", scope: null, file: !164, line: 59, type: !782, isLocal: false, isDefinition: true, scopeLine: 59, isOptimized: false, unit: !1, retainedNodes: !3)
!782 = !DISubroutineType(types: !783)
!783 = !{!26, !784, !784, !34}
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "StyledText", file: !164, line: 20, size: 256, align: 8, elements: !786)
!786 = !{!787, !810}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "text", file: !164, line: 21, baseType: !788, size: 64, align: 64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "Text", file: !790, line: 28, size: 512, align: 8, elements: !791)
!790 = !DIFile(filename: "text.go", directory: ".")
!791 = !{!792, !796, !797}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", file: !790, line: 29, baseType: !793, size: 192, align: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !455, size: 192, align: 8, elements: !794)
!794 = !{!795, !498, !499}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !455, line: 1, baseType: !170, size: 64, align: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "runeCount", file: !790, line: 30, baseType: !34, size: 64, align: 64, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "relay", file: !790, line: 31, baseType: !798, size: 256, align: 64, offset: 256)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "Relay", file: !790, line: 7, size: 256, align: 8, elements: !799)
!799 = !{!800, !806, !807, !808}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !790, line: 7, baseType: !801, size: 64, align: 32)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !164, line: 8, size: 64, align: 8, elements: !802)
!802 = !{!803, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !164, line: 8, baseType: !804, size: 32, align: 32)
!804 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !164, line: 8, baseType: !8, size: 32, align: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "subs", file: !790, line: 7, baseType: !30, size: 64, align: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", file: !790, line: 7, baseType: !30, size: 64, align: 64, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "maxId", file: !790, line: 7, baseType: !809, size: 64, align: 64, offset: 192)
!809 = !DIBasicType(name: "Id", size: 64, encoding: DW_ATE_signed)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "styles", file: !164, line: 22, baseType: !811, size: 192, align: 64, offset: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.command-line-arguments.styleRange,int,int}", file: !455, size: 192, align: 8, elements: !812)
!812 = !{!813, !498, !499}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !455, line: 1, baseType: !814, size: 64, align: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.styleRange", file: !164, line: 15, size: 128, align: 8, elements: !816)
!816 = !{!817, !818}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !164, line: 16, baseType: !34, size: 64, align: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "style", file: !164, line: 17, baseType: !26, size: 64, align: 64, offset: 64)
!819 = !DILocalVariable(name: "st", arg: 1, scope: !781, file: !164, line: 59, type: !784)
!820 = !DILocation(line: 59, column: 1, scope: !781)
!821 = !DILocalVariable(name: "a", arg: 2, scope: !781, file: !164, line: 59, type: !34)
!822 = !DILocation(line: 59, column: 26, scope: !781)
!823 = !DILocalVariable(name: "$ret3", scope: !781, file: !164, line: 59, type: !26)
!824 = !DILocation(line: 59, column: 33, scope: !781)
!825 = !DILocation(line: 60, column: 12, scope: !826)
!826 = distinct !DILexicalBlock(scope: !781, file: !164, line: 59, column: 1)
!827 = !DILocation(line: 60, column: 17, scope: !826)
!828 = !DILocation(line: 60, column: 7, scope: !826)
!829 = !DILocation(line: 60, column: 33, scope: !826)
!830 = !DILocation(line: 61, column: 3, scope: !826)
!831 = !DILocalVariable(name: "style", scope: !826, file: !164, line: 64, type: !26)
!832 = !DILocation(line: 64, column: 6, scope: !781)
!833 = !DILocation(line: 65, column: 2, scope: !834)
!834 = distinct !DILexicalBlock(scope: !826, file: !164, line: 65, column: 2)
!835 = !DILocalVariable(name: "i", scope: !834, file: !164, line: 65, type: !815)
!836 = !DILocation(line: 65, column: 6, scope: !826)
!837 = !DILocation(line: 66, column: 14, scope: !834)
!838 = !DILocation(line: 71, column: 14, scope: !826)
!839 = !DILocation(line: 71, column: 2, scope: !826)
!840 = distinct !DISubprogram(name: "text.Copy..1command_line_arguments.StyledText", linkageName: "command_line_arguments.StyledText.Copy", scope: null, file: !164, line: 39, type: !841, isLocal: false, isDefinition: true, scopeLine: 39, isOptimized: false, unit: !1, retainedNodes: !3)
!841 = !DISubroutineType(types: !842)
!842 = !{!784, !784, !784}
!843 = !DILocalVariable(name: "st", arg: 1, scope: !840, file: !164, line: 39, type: !784)
!844 = !DILocation(line: 39, column: 1, scope: !840)
!845 = !DILocalVariable(name: "$ret2", scope: !840, file: !164, line: 39, type: !784)
!846 = !DILocation(line: 39, column: 30, scope: !840)
!847 = !DILocation(line: 40, column: 8, scope: !848)
!848 = distinct !DILexicalBlock(scope: !840, file: !164, line: 39, column: 1)
!849 = !DILocation(line: 41, column: 3, scope: !848)
!850 = !DILocation(line: 44, column: 32, scope: !848)
!851 = !DILocation(line: 44, column: 7, scope: !848)
!852 = !DILocalVariable(name: "s", scope: !848, file: !164, line: 44, type: !811)
!853 = !DILocation(line: 44, column: 2, scope: !840)
!854 = !DILocalVariable(name: "idx", scope: !855, file: !164, line: 45, type: !34)
!855 = distinct !DILexicalBlock(scope: !848, file: !164, line: 45, column: 2)
!856 = !DILocation(line: 45, column: 6, scope: !848)
!857 = !DILocation(line: 45, column: 2, scope: !855)
!858 = !DILocalVariable(name: "i", scope: !855, file: !164, line: 45, type: !815)
!859 = !DILocation(line: 48, column: 18, scope: !855)
!860 = !DILocation(line: 46, column: 4, scope: !855)
!861 = !DILocation(line: 46, column: 12, scope: !855)
!862 = !DILocation(line: 46, column: 10, scope: !855)
!863 = !DILocation(line: 52, column: 13, scope: !848)
!864 = !DILocation(line: 52, column: 18, scope: !848)
!865 = !DILocation(line: 51, column: 7, scope: !848)
!866 = !DILocation(line: 51, column: 8, scope: !848)
!867 = !DILocalVariable(name: "c", scope: !848, file: !164, line: 51, type: !784)
!868 = !DILocation(line: 51, column: 2, scope: !840)
!869 = !DILocation(line: 55, column: 2, scope: !848)
!870 = distinct !DISubprogram(name: "text.Equal..1command_line_arguments.StyledText", linkageName: "command_line_arguments.StyledText.Equal", scope: null, file: !164, line: 35, type: !871, isLocal: false, isDefinition: true, scopeLine: 35, isOptimized: false, unit: !1, retainedNodes: !3)
!871 = !DISubroutineType(types: !872)
!872 = !{!141, !784, !784, !784}
!873 = !DILocalVariable(name: "st", arg: 1, scope: !870, file: !164, line: 35, type: !784)
!874 = !DILocation(line: 35, column: 1, scope: !870)
!875 = !DILocalVariable(name: "st2", arg: 2, scope: !870, file: !164, line: 35, type: !784)
!876 = !DILocation(line: 35, column: 29, scope: !870)
!877 = !DILocalVariable(name: "$ret1", scope: !870, file: !164, line: 35, type: !141)
!878 = !DILocation(line: 35, column: 46, scope: !870)
!879 = !DILocation(line: 36, column: 27, scope: !870)
!880 = !DILocation(line: 36, column: 31, scope: !870)
!881 = !DILocation(line: 36, column: 17, scope: !870)
!882 = !DILocation(line: 36, column: 2, scope: !870)
!883 = distinct !DISubprogram(name: "text.MarshalProtobuf..1command_line_arguments.StyledText", linkageName: "command_line_arguments.StyledText.MarshalProtobuf", scope: null, file: !164, line: 160, type: !884, isLocal: false, isDefinition: true, scopeLine: 160, isOptimized: false, unit: !1, retainedNodes: !3)
!884 = !DISubroutineType(types: !885)
!885 = !{!886, !784, !784}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "StyledText", file: !164, line: 12, size: 256, align: 8, elements: !888)
!888 = !{!889, !894}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "Styles", file: !164, line: 12, baseType: !890, size: 192, align: 64)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**TextStyle,int,int}", file: !455, size: 192, align: 8, elements: !891)
!891 = !{!892, !498, !499}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !455, line: 1, baseType: !893, size: 64, align: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "Text", file: !164, line: 12, baseType: !895, size: 64, align: 64, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "Text", file: !164, line: 12, size: 128, align: 8, elements: !897)
!897 = !{!898}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "Text", file: !164, line: 12, baseType: !167, size: 128, align: 64)
!899 = !DILocalVariable(name: "st", arg: 1, scope: !883, file: !164, line: 160, type: !784)
!900 = !DILocation(line: 160, column: 1, scope: !883)
!901 = !DILocalVariable(name: "$ret7", scope: !883, file: !164, line: 160, type: !886)
!902 = !DILocation(line: 160, column: 41, scope: !883)
!903 = !DILocation(line: 161, column: 8, scope: !904)
!904 = distinct !DILexicalBlock(scope: !883, file: !164, line: 160, column: 1)
!905 = !DILocation(line: 162, column: 3, scope: !904)
!906 = !DILocation(line: 165, column: 12, scope: !904)
!907 = !DILocalVariable(name: "styles", scope: !904, file: !164, line: 165, type: !890)
!908 = !DILocation(line: 165, column: 2, scope: !883)
!909 = !DILocation(line: 166, column: 2, scope: !910)
!910 = distinct !DILexicalBlock(scope: !904, file: !164, line: 166, column: 2)
!911 = !DILocalVariable(name: "i", scope: !910, file: !164, line: 166, type: !815)
!912 = !DILocation(line: 166, column: 6, scope: !904)
!913 = !DILocation(line: 167, column: 19, scope: !914)
!914 = distinct !DILexicalBlock(scope: !910, file: !164, line: 166, column: 30)
!915 = !DILocalVariable(name: "style", scope: !914, file: !164, line: 167, type: !234)
!916 = !DILocation(line: 167, column: 3, scope: !910)
!917 = !DILocation(line: 168, column: 8, scope: !914)
!918 = !DILocation(line: 168, column: 15, scope: !914)
!919 = !DILocation(line: 169, column: 12, scope: !914)
!920 = !DILocation(line: 169, column: 10, scope: !914)
!921 = !DILocation(line: 0, scope: !914)
!922 = !DILocation(line: 173, column: 13, scope: !904)
!923 = !DILocation(line: 173, column: 18, scope: !904)
!924 = !DILocation(line: 172, column: 9, scope: !904)
!925 = !DILocation(line: 172, column: 17, scope: !904)
!926 = !DILocation(line: 172, column: 2, scope: !904)
!927 = distinct !DISubprogram(name: "text.Set..1command_line_arguments.StyledText", linkageName: "command_line_arguments.StyledText.Set", scope: null, file: !164, line: 74, type: !928, isLocal: false, isDefinition: true, scopeLine: 74, isOptimized: false, unit: !1, retainedNodes: !3)
!928 = !DISubroutineType(types: !929)
!929 = !{!43, !784, !784, !26, !34, !34}
!930 = !DILocalVariable(name: "st", arg: 1, scope: !927, file: !164, line: 74, type: !784)
!931 = !DILocation(line: 74, column: 1, scope: !927)
!932 = !DILocalVariable(name: "s", arg: 2, scope: !927, file: !164, line: 74, type: !26)
!933 = !DILocation(line: 74, column: 27, scope: !927)
!934 = !DILocalVariable(name: "start", arg: 3, scope: !927, file: !164, line: 74, type: !34)
!935 = !DILocation(line: 74, column: 37, scope: !927)
!936 = !DILocalVariable(name: "end", arg: 4, scope: !927, file: !164, line: 74, type: !34)
!937 = !DILocation(line: 74, column: 44, scope: !927)
!938 = !DILocation(line: 75, column: 12, scope: !927)
!939 = !DILocation(line: 75, column: 4, scope: !927)
!940 = distinct !DISubprogram(name: "text.Size..1command_line_arguments.StyledText", linkageName: "command_line_arguments.StyledText.Size", scope: null, file: !164, line: 130, type: !941, isLocal: false, isDefinition: true, scopeLine: 130, isOptimized: false, unit: !1, retainedNodes: !3)
!941 = !DISubroutineType(types: !942)
!942 = !{!943, !784, !784, !943, !943, !34}
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "Point", file: !164, line: 10, size: 128, align: 8, elements: !944)
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "X", file: !164, line: 10, baseType: !174, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "Y", file: !164, line: 10, baseType: !174, size: 64, align: 64, offset: 64)
!947 = !DILocalVariable(name: "st", arg: 1, scope: !940, file: !164, line: 130, type: !784)
!948 = !DILocation(line: 130, column: 1, scope: !940)
!949 = !DILocalVariable(name: "maxLines", arg: 4, scope: !940, file: !164, line: 130, type: !34)
!950 = !DILocation(line: 130, column: 64, scope: !940)
!951 = !DILocation(line: 131, column: 7, scope: !952)
!952 = distinct !DILexicalBlock(scope: !940, file: !164, line: 130, column: 1)
!953 = !DILocation(line: 131, column: 12, scope: !952)
!954 = !DILocation(line: 131, column: 22, scope: !952)
!955 = !DILocation(line: 132, column: 8, scope: !952)
!956 = !DILocation(line: 136, column: 14, scope: !952)
!957 = !DILocalVariable(name: "min", arg: 2, scope: !940, file: !164, line: 130, type: !943)
!958 = !DILocation(line: 130, column: 28, scope: !940)
!959 = !DILocation(line: 137, column: 15, scope: !952)
!960 = !DILocalVariable(name: "max", arg: 3, scope: !940, file: !164, line: 130, type: !943)
!961 = !DILocation(line: 130, column: 46, scope: !940)
!962 = !DILocation(line: 138, column: 15, scope: !952)
!963 = !DILocation(line: 135, column: 14, scope: !952)
!964 = !DILocation(line: 135, column: 22, scope: !952)
!965 = !DILocalVariable(name: "sizeFunc", scope: !952, file: !164, line: 135, type: !966)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DICompositeType(tag: DW_TAG_structure_type, name: "SizeFunc", file: !164, line: 12, size: 192, align: 8, elements: !968)
!968 = !{!969, !970, !972}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "Text", file: !164, line: 12, baseType: !886, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "MinSize", file: !164, line: 12, baseType: !971, size: 64, align: 64, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "MaxSize", file: !164, line: 12, baseType: !971, size: 64, align: 64, offset: 128)
!973 = !DILocation(line: 135, column: 2, scope: !940)
!974 = !DILocation(line: 140, column: 29, scope: !952)
!975 = !DILocation(line: 140, column: 21, scope: !952)
!976 = !DILocalVariable(name: "err", scope: !952, file: !164, line: 140, type: !977)
!977 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !978)
!978 = !{!979, !987}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !455, size: 128, align: 8, elements: !982)
!982 = !{!719, !983}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !455, line: 1, baseType: !984, size: 64, align: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!167, !42}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !42, size: 64, align: 64, offset: 64)
!988 = !DILocation(line: 140, column: 2, scope: !940)
!989 = !DILocation(line: 141, column: 9, scope: !952)
!990 = !DILocation(line: 142, column: 17, scope: !952)
!991 = !DILocation(line: 142, column: 3, scope: !952)
!992 = !DILocation(line: 151, column: 13, scope: !952)
!993 = !DILocalVariable(name: "pbpoint", scope: !952, file: !164, line: 151, type: !971)
!994 = !DILocation(line: 151, column: 2, scope: !940)
!995 = !DILocation(line: 152, column: 35, scope: !952)
!996 = !DILocalVariable(name: "pointData", scope: !952, file: !164, line: 145, type: !793)
!997 = !DILocation(line: 145, column: 6, scope: !940)
!998 = !DILocation(line: 152, column: 14, scope: !952)
!999 = !DILocation(line: 153, column: 9, scope: !952)
!1000 = !DILocation(line: 154, column: 7, scope: !952)
!1001 = !DILocation(line: 154, column: 50, scope: !952)
!1002 = !DILocation(line: 155, column: 17, scope: !952)
!1003 = !DILocation(line: 155, column: 3, scope: !952)
!1004 = !DILocation(line: 157, column: 26, scope: !952)
!1005 = !DILocation(line: 157, column: 37, scope: !952)
!1006 = !DILocation(line: 157, column: 16, scope: !952)
!1007 = !DILocation(line: 157, column: 2, scope: !952)
!1008 = distinct !DISubprogram(name: "text.Update..1command_line_arguments.StyledText", linkageName: "command_line_arguments.StyledText.Update", scope: null, file: !164, line: 80, type: !928, isLocal: false, isDefinition: true, scopeLine: 80, isOptimized: false, unit: !1, retainedNodes: !3)
!1009 = !DILocalVariable(name: "st", arg: 1, scope: !1008, file: !164, line: 80, type: !784)
!1010 = !DILocation(line: 80, column: 1, scope: !1008)
!1011 = !DILocalVariable(name: "s", arg: 2, scope: !1008, file: !164, line: 80, type: !26)
!1012 = !DILocation(line: 80, column: 30, scope: !1008)
!1013 = !DILocalVariable(name: "start", arg: 3, scope: !1008, file: !164, line: 80, type: !34)
!1014 = !DILocation(line: 80, column: 40, scope: !1008)
!1015 = !DILocalVariable(name: "end", arg: 4, scope: !1008, file: !164, line: 80, type: !34)
!1016 = !DILocation(line: 80, column: 47, scope: !1008)
!1017 = !DILocation(line: 81, column: 12, scope: !1008)
!1018 = !DILocation(line: 81, column: 4, scope: !1008)
!1019 = distinct !DISubprogram(name: "text.update..1command_line_arguments.StyledText", linkageName: "command_line_arguments.StyledText.update", scope: null, file: !164, line: 88, type: !1020, isLocal: false, isDefinition: true, scopeLine: 88, isOptimized: false, unit: !1, retainedNodes: !3)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!43, !784, !784, !1022, !34, !34}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 219, size: 64, align: 8, elements: !1024)
!1024 = !{!1025}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 219, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!26, !26}
!1029 = !DILocalVariable(name: "st", arg: 1, scope: !1019, file: !164, line: 88, type: !784)
!1030 = !DILocation(line: 88, column: 1, scope: !1019)
!1031 = !DILocalVariable(name: "f", arg: 2, scope: !1019, file: !164, line: 88, type: !1022)
!1032 = !DILocation(line: 88, column: 30, scope: !1019)
!1033 = !DILocalVariable(name: "start", arg: 3, scope: !1019, file: !164, line: 88, type: !34)
!1034 = !DILocation(line: 88, column: 53, scope: !1019)
!1035 = !DILocalVariable(name: "end", arg: 4, scope: !1019, file: !164, line: 88, type: !34)
!1036 = !DILocation(line: 88, column: 60, scope: !1019)
!1037 = !DILocation(line: 89, column: 12, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1019, file: !164, line: 88, column: 1)
!1039 = !DILocalVariable(name: "styles", scope: !1038, file: !164, line: 89, type: !811)
