; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22android\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/gogo/protobuf/proto\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/gogo/protobuf/proto\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22colornames\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22golang.org/x/image/colornames\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22golang.org/x/image/colornames\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bridge\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22gomatcha.io/matcha/bridge\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22gomatcha.io/matcha/bridge\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22comm\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./pagerview.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha/view/android")
!3 = !{}
!4 = !{!5, !9, !19, !110}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "golang_org_x_image_colornames.White", linkageName: "golang_org_x_image_colornames.White", scope: !1, file: !11, line: 8, type: !12, isLocal: false, isDefinition: true)
!11 = !DIFile(filename: "stackview.go", directory: ".")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "RGBA", file: !11, line: 4, size: 32, align: 8, elements: !13)
!13 = !{!14, !16, !17, !18}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "R", file: !11, line: 4, baseType: !15, size: 8, align: 8)
!15 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "G", file: !11, line: 4, baseType: !15, size: 8, align: 8, offset: 8)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !11, line: 4, baseType: !15, size: 8, align: 8, offset: 16)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "A", file: !11, line: 4, baseType: !15, size: 8, align: 8, offset: 24)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "command_line_arguments.stackMiddlewareVar", linkageName: "command_line_arguments.stackMiddlewareVar", scope: !1, file: !11, line: 310, type: !21, isLocal: true, isDefinition: true)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.stackMiddleware", file: !11, line: 337, size: 64, align: 8, elements: !23)
!23 = !{!24}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "radix", file: !11, line: 338, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "Radix", file: !11, line: 15, size: 64, align: 8, elements: !27)
!27 = !{!28}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "root", file: !11, line: 15, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !11, line: 15, size: 256, align: 8, elements: !31)
!31 = !{!32, !50, !52}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "children", file: !11, line: 15, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !35)
!35 = !{!36, !38, !39, !40, !42, !43, !46, !47, !49}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !37, size: 64, align: 64)
!37 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !15, size: 8, align: 8, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !15, size: 8, align: 8, offset: 72)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !41, size: 16, align: 16, offset: 80)
!41 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !44, size: 64, align: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIBasicType(name: "void")
!46 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !44, size: 64, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !48, size: 64, align: 64, offset: 256)
!48 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !44, size: 64, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "exists", file: !11, line: 15, baseType: !51, size: 8, align: 8, offset: 64)
!51 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !11, line: 15, baseType: !53, size: 128, align: 64, offset: 128)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !54, size: 128, align: 8, elements: !55)
!54 = !DIFile(filename: "", directory: "")
!55 = !{!56, !109}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !54, line: 1, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !65, !66, !74, !82, !84, !90, !108}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !48, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !48, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !15, size: 8, align: 8, offset: 160)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !15, size: 8, align: 8, offset: 168)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !15, size: 8, align: 8, offset: 176)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !67, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !69)
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!48, !44, !48}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !75, size: 64, align: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !77)
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!51, !44, !44}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !83, size: 64, align: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !85, size: 64, align: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !87)
!87 = !{!88, !89}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !83, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !91, size: 64, align: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !93)
!93 = !{!94, !95, !96}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !85, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !85, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !97, size: 192, align: 64, offset: 128)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !54, size: 192, align: 8, elements: !98)
!98 = !{!99, !106, !107}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !102)
!102 = !{!94, !95, !103, !104, !105}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !44, size: 64, align: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !44, size: 64, align: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !44, size: 64, align: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !54, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !54, line: 1, baseType: !37, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !44, size: 64, align: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !54, line: 1, baseType: !44, size: 64, align: 64, offset: 64)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "golang_org_x_image_colornames.Black", linkageName: "golang_org_x_image_colornames.Black", scope: !1, file: !11, line: 8, type: !12, isLocal: false, isDefinition: true)
!112 = distinct !DISubprogram(name: "android.Notify..1command_line_arguments.Pages", linkageName: "command_line_arguments.Pages.Notify", scope: null, file: !113, line: 50, type: !114, isLocal: false, isDefinition: true, scopeLine: 50, isOptimized: false, unit: !1, retainedNodes: !3)
!113 = !DIFile(filename: "pagerview.go", directory: ".")
!114 = !DISubroutineType(types: !115)
!115 = !{!116, !117, !117, !207}
!116 = !DIBasicType(name: "Id", size: 64, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pages", file: !113, line: 12, size: 512, align: 8, elements: !119)
!119 = !{!120, !132, !308}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "relay", file: !113, line: 13, baseType: !121, size: 256, align: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "Relay", file: !113, line: 4, size: 256, align: 8, elements: !122)
!122 = !{!123, !129, !130, !131}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !113, line: 4, baseType: !124, size: 64, align: 32)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !113, line: 4, size: 64, align: 8, elements: !125)
!125 = !{!126, !128}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !113, line: 4, baseType: !127, size: 32, align: 32)
!127 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !113, line: 4, baseType: !8, size: 32, align: 32, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "subs", file: !113, line: 4, baseType: !33, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", file: !113, line: 4, baseType: !33, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "maxId", file: !113, line: 4, baseType: !116, size: 64, align: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "children", file: !113, line: 14, baseType: !133, size: 192, align: 64, offset: 256)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*View,int,int}", file: !54, size: 192, align: 8, elements: !134)
!134 = !{!135, !106, !107}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "View", file: !113, line: 6, size: 128, align: 8, elements: !138)
!138 = !{!139, !202}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !113, line: 6, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Context)Model,*func(*void,Stage,Stage)void,*func(*void,*__go_descriptor)Id,*func(*void,Id)void,*func(*void,View)void,*func(*void)struct{*_type,*void}}", file: !54, size: 448, align: 8, elements: !142)
!142 = !{!143, !144, !293, !298, !299, !300, !304}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !54, line: 6, baseType: !57, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Build", file: !54, line: 6, baseType: !145, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!148, !44, !279}
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "Model", file: !113, line: 6, size: 1088, align: 8, elements: !149)
!149 = !{!150, !151, !218, !257, !272, !273, !277, !278}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Children", file: !113, line: 6, baseType: !133, size: 192, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Layouter", file: !113, line: 6, baseType: !152, size: 128, align: 64, offset: 192)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "Layouter", file: !113, line: 6, size: 128, align: 8, elements: !153)
!153 = !{!154, !202}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !113, line: 6, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Context)struct{Guide,struct{*Guide,int,int}},*func(*void,*__go_descriptor)Id,*func(*void,Id)void}", file: !54, size: 256, align: 8, elements: !157)
!157 = !{!143, !158, !203, !214}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Layout", file: !54, line: 6, baseType: !159, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !44, !183}
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Guide,struct{*Guide,int,int}}", file: !54, size: 512, align: 8, elements: !163)
!163 = !{!164, !178}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !54, line: 6, baseType: !165, size: 320, align: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "Guide", file: !113, line: 6, size: 320, align: 8, elements: !166)
!166 = !{!167, !177}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Frame", file: !113, line: 6, baseType: !168, size: 256, align: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rect", file: !113, line: 6, size: 256, align: 8, elements: !169)
!169 = !{!170, !176}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Min", file: !113, line: 6, baseType: !171, size: 128, align: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Point", file: !113, line: 6, size: 128, align: 8, elements: !172)
!172 = !{!173, !175}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "X", file: !113, line: 6, baseType: !174, size: 64, align: 64)
!174 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Y", file: !113, line: 6, baseType: !174, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Max", file: !113, line: 6, baseType: !171, size: 128, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ZIndex", file: !113, line: 6, baseType: !37, size: 64, align: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !54, line: 6, baseType: !179, size: 192, align: 64, offset: 320)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Guide,int,int}", file: !54, size: 192, align: 8, elements: !180)
!180 = !{!181, !106, !107}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !113, line: 6, size: 128, align: 8, elements: !184)
!184 = !{!185, !202}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !113, line: 6, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,int,Point,Point)Guide,*func(*void)Point,*func(*void)Point}", file: !54, size: 320, align: 8, elements: !188)
!188 = !{!143, !189, !193, !197, !201}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ChildCount", file: !54, line: 6, baseType: !190, size: 64, align: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!37, !44}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "LayoutChild", file: !54, line: 6, baseType: !194, size: 64, align: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!165, !44, !37, !171, !171}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "MaxSize", file: !54, line: 6, baseType: !198, size: 64, align: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!171, !44}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "MinSize", file: !54, line: 6, baseType: !198, size: 64, align: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !113, line: 1, baseType: !44, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Notify", file: !54, line: 6, baseType: !204, size: 64, align: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!116, !44, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !113, line: 4, size: 64, align: 8, elements: !209)
!209 = !{!210}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !113, line: 4, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!45}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Unnotify", file: !54, line: 6, baseType: !215, size: 64, align: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!45, !44, !116}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Painter", file: !113, line: 6, baseType: !219, size: 128, align: 64, offset: 320)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "Painter", file: !113, line: 6, size: 128, align: 8, elements: !220)
!220 = !{!221, !202}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !113, line: 6, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*__go_descriptor)Id,*func(*void)Style,*func(*void,Id)void}", file: !54, size: 256, align: 8, elements: !224)
!224 = !{!143, !225, !226, !214}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Notify", file: !54, line: 6, baseType: !204, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "PaintStyle", file: !54, line: 6, baseType: !227, size: 64, align: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!230, !44}
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "Style", file: !113, line: 6, size: 768, align: 8, elements: !231)
!231 = !{!232, !233, !251, !252, !253, !254, !255, !256}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency", file: !113, line: 6, baseType: !174, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "BackgroundColor", file: !113, line: 6, baseType: !234, size: 128, align: 64, offset: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", file: !113, line: 4, size: 128, align: 8, elements: !235)
!235 = !{!236, !202}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !113, line: 4, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{uint32,uint32,uint32,uint32}}", file: !54, size: 128, align: 8, elements: !239)
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !54, line: 4, baseType: !57, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "RGBA", file: !54, line: 4, baseType: !242, size: 64, align: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!245, !44}
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{uint32,uint32,uint32,uint32}", file: !54, size: 128, align: 8, elements: !246)
!246 = !{!247, !248, !249, !250}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !54, line: 4, baseType: !8, size: 32, align: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !54, line: 4, baseType: !8, size: 32, align: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !54, line: 4, baseType: !8, size: 32, align: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "a", file: !54, line: 4, baseType: !8, size: 32, align: 32, offset: 96)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "BorderColor", file: !113, line: 6, baseType: !234, size: 128, align: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "BorderWidth", file: !113, line: 6, baseType: !174, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "CornerRadius", file: !113, line: 6, baseType: !174, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowRadius", file: !113, line: 6, baseType: !174, size: 64, align: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowOffset", file: !113, line: 6, baseType: !171, size: 128, align: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowColor", file: !113, line: 6, baseType: !234, size: 128, align: 64, offset: 640)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !113, line: 6, baseType: !258, size: 192, align: 64, offset: 448)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Option,int,int}", file: !54, size: 192, align: 8, elements: !259)
!259 = !{!260, !106, !107}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option", file: !113, line: 6, size: 128, align: 8, elements: !263)
!263 = !{!264, !202}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !113, line: 6, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !54, size: 128, align: 8, elements: !267)
!267 = !{!143, !268}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "OptionKey", file: !54, line: 6, baseType: !269, size: 64, align: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!86, !44}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "NativeViewName", file: !113, line: 6, baseType: !86, size: 128, align: 64, offset: 640)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "NativeViewState", file: !113, line: 6, baseType: !274, size: 192, align: 64, offset: 768)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !54, size: 192, align: 8, elements: !275)
!275 = !{!276, !106, !107}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !83, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "NativeOptions", file: !113, line: 6, baseType: !33, size: 64, align: 64, offset: 960)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "NativeFuncs", file: !113, line: 6, baseType: !33, size: 64, align: 64, offset: 1024)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !113, line: 6, size: 128, align: 8, elements: !280)
!280 = !{!281, !202}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !113, line: 6, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{*Id,int,int}}", file: !54, size: 128, align: 8, elements: !284)
!284 = !{!143, !285}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !54, line: 6, baseType: !286, size: 64, align: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!289, !44}
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Id,int,int}", file: !54, size: 192, align: 8, elements: !290)
!290 = !{!291, !106, !107}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Lifecycle", file: !54, line: 6, baseType: !294, size: 64, align: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!45, !44, !297, !297}
!297 = !DIBasicType(name: "Stage", size: 64, encoding: DW_ATE_signed)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Notify", file: !54, line: 6, baseType: !204, size: 64, align: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Unnotify", file: !54, line: 6, baseType: !215, size: 64, align: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Update", file: !54, line: 6, baseType: !301, size: 64, align: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!45, !44, !137}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ViewKey", file: !54, line: 6, baseType: !305, size: 64, align: 64, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!53, !44}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "selectedIndex", file: !113, line: 15, baseType: !37, size: 64, align: 64, offset: 448)
!309 = !DILocalVariable(name: "s", arg: 1, scope: !112, file: !113, line: 50, type: !117)
!310 = !DILocation(line: 50, column: 1, scope: !112)
!311 = !DILocalVariable(name: "f", arg: 2, scope: !112, file: !113, line: 50, type: !207)
!312 = !DILocation(line: 50, column: 24, scope: !112)
!313 = !DILocalVariable(name: "$ret3", scope: !112, file: !113, line: 50, type: !116)
!314 = !DILocation(line: 50, column: 34, scope: !112)
!315 = !DILocation(line: 51, column: 10, scope: !112)
!316 = !DILocation(line: 51, column: 16, scope: !112)
!317 = !DILocation(line: 51, column: 2, scope: !112)
!318 = distinct !DISubprogram(name: "android.SelectedIndex..1command_line_arguments.Pages", linkageName: "command_line_arguments.Pages.SelectedIndex", scope: null, file: !113, line: 38, type: !319, isLocal: false, isDefinition: true, scopeLine: 38, isOptimized: false, unit: !1, retainedNodes: !3)
!319 = !DISubroutineType(types: !320)
!320 = !{!37, !117, !117}
!321 = !DILocalVariable(name: "s", arg: 1, scope: !318, file: !113, line: 38, type: !117)
!322 = !DILocation(line: 38, column: 1, scope: !318)
!323 = !DILocalVariable(name: "$ret1", scope: !318, file: !113, line: 38, type: !37)
!324 = !DILocation(line: 38, column: 33, scope: !318)
!325 = !DILocation(line: 39, column: 10, scope: !318)
!326 = !DILocation(line: 39, column: 2, scope: !318)
!327 = distinct !DISubprogram(name: "android.SelectedView..1command_line_arguments.Pages", linkageName: "command_line_arguments.Pages.SelectedView", scope: null, file: !113, line: 42, type: !328, isLocal: false, isDefinition: true, scopeLine: 42, isOptimized: false, unit: !1, retainedNodes: !3)
!328 = !DISubroutineType(types: !329)
!329 = !{!137, !117, !117}
!330 = !DILocalVariable(name: "s", arg: 1, scope: !327, file: !113, line: 42, type: !117)
!331 = !DILocation(line: 42, column: 1, scope: !327)
!332 = !DILocation(line: 43, column: 6, scope: !327)
!333 = !DILocation(line: 43, column: 28, scope: !327)
!334 = !DILocation(line: 43, column: 38, scope: !327)
!335 = !DILocation(line: 43, column: 21, scope: !327)
!336 = !DILocalVariable(name: "$ret2", scope: !327, file: !113, line: 42, type: !137)
!337 = !DILocation(line: 42, column: 32, scope: !327)
!338 = !DILocation(line: 44, column: 3, scope: !327)
!339 = !DILocation(line: 46, column: 19, scope: !327)
!340 = !DILocation(line: 46, column: 2, scope: !327)
!341 = distinct !DISubprogram(name: "android.SetSelectedIndex..1command_line_arguments.Pages", linkageName: "command_line_arguments.Pages.SetSelectedIndex", scope: null, file: !113, line: 30, type: !342, isLocal: false, isDefinition: true, scopeLine: 30, isOptimized: false, unit: !1, retainedNodes: !3)
!342 = !DISubroutineType(types: !343)
!343 = !{!45, !117, !117, !37}
!344 = !DILocalVariable(name: "s", arg: 1, scope: !341, file: !113, line: 30, type: !117)
!345 = !DILocation(line: 30, column: 1, scope: !341)
!346 = !DILocalVariable(name: "idx", arg: 2, scope: !341, file: !113, line: 30, type: !37)
!347 = !DILocation(line: 30, column: 34, scope: !341)
!348 = !DILocation(line: 31, column: 13, scope: !341)
!349 = !DILocation(line: 31, column: 9, scope: !341)
!350 = !DILocation(line: 32, column: 19, scope: !341)
!351 = !DILocation(line: 33, column: 4, scope: !341)
!352 = !DILocation(line: 33, column: 10, scope: !341)
!353 = distinct !DISubprogram(name: "android.SetViews..1command_line_arguments.Pages", linkageName: "command_line_arguments.Pages.SetViews", scope: null, file: !113, line: 19, type: !354, isLocal: false, isDefinition: true, scopeLine: 19, isOptimized: false, unit: !1, retainedNodes: !3)
!354 = !DISubroutineType(types: !355)
!355 = !{!45, !117, !117, !133}
!356 = !DILocalVariable(name: "ss", arg: 2, scope: !353, file: !113, line: 19, type: !133)
!357 = !DILocation(line: 19, column: 26, scope: !353)
!358 = !DILocalVariable(name: "s", arg: 1, scope: !353, file: !113, line: 19, type: !117)
!359 = !DILocation(line: 19, column: 1, scope: !353)
!360 = !DILocation(line: 20, column: 3, scope: !353)
!361 = !DILocation(line: 20, column: 13, scope: !353)
!362 = !DILocation(line: 21, column: 3, scope: !353)
!363 = !DILocation(line: 21, column: 9, scope: !353)
!364 = distinct !DISubprogram(name: "android.Unnotify..1command_line_arguments.Pages", linkageName: "command_line_arguments.Pages.Unnotify", scope: null, file: !113, line: 55, type: !365, isLocal: false, isDefinition: true, scopeLine: 55, isOptimized: false, unit: !1, retainedNodes: !3)
!365 = !DISubroutineType(types: !366)
!366 = !{!45, !117, !117, !116}
!367 = !DILocalVariable(name: "s", arg: 1, scope: !364, file: !113, line: 55, type: !117)
!368 = !DILocation(line: 55, column: 1, scope: !364)
!369 = !DILocalVariable(name: "id", arg: 2, scope: !364, file: !113, line: 55, type: !116)
!370 = !DILocation(line: 55, column: 26, scope: !364)
!371 = !DILocation(line: 56, column: 3, scope: !364)
!372 = !DILocation(line: 56, column: 9, scope: !364)
!373 = distinct !DISubprogram(name: "android.Views..1command_line_arguments.Pages", linkageName: "command_line_arguments.Pages.Views", scope: null, file: !113, line: 25, type: !374, isLocal: false, isDefinition: true, scopeLine: 25, isOptimized: false, unit: !1, retainedNodes: !3)
!374 = !DISubroutineType(types: !375)
!375 = !{!133, !117, !117}
!376 = !DILocalVariable(name: "s", arg: 1, scope: !373, file: !113, line: 25, type: !117)
!377 = !DILocation(line: 25, column: 1, scope: !373)
!378 = !DILocation(line: 26, column: 10, scope: !373)
!379 = !DILocation(line: 26, column: 2, scope: !373)
!380 = distinct !DISubprogram(name: "android.Build..1command_line_arguments.PagerView", linkageName: "command_line_arguments.PagerView.Build", scope: null, file: !113, line: 96, type: !381, isLocal: false, isDefinition: true, scopeLine: 96, isOptimized: false, unit: !1, retainedNodes: !3)
!381 = !DISubroutineType(types: !382)
!382 = !{!148, !383, !383, !279}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "PagerView", file: !113, line: 59, size: 640, align: 8, elements: !385)
!385 = !{!386, !395}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Embed", file: !113, line: 60, baseType: !387, size: 576, align: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "Embed", file: !113, line: 8, size: 576, align: 8, elements: !388)
!388 = !{!389, !390, !391, !392, !393}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !113, line: 8, baseType: !53, size: 128, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !113, line: 8, baseType: !53, size: 128, align: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !113, line: 8, baseType: !124, size: 64, align: 32, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "relay", file: !113, line: 8, baseType: !121, size: 256, align: 64, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "lastField", file: !113, line: 8, baseType: !394, align: 8, offset: 576)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{}", file: !54, align: 8, elements: !3)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Pages", file: !113, line: 61, baseType: !117, size: 64, align: 64, offset: 576)
!396 = !DILocalVariable(name: "param", arg: 1, scope: !380, file: !113, line: 96, type: !383)
!397 = !DILocation(line: 96, column: 1, scope: !380)
!398 = !DILocalVariable(name: "ctx", arg: 2, scope: !380, file: !113, line: 96, type: !279)
!399 = !DILocation(line: 96, column: 27, scope: !380)
!400 = !DILocalVariable(name: "v", scope: !380, file: !113, line: 96, type: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!402 = !DILocation(line: 97, column: 7, scope: !403)
!403 = distinct !DILexicalBlock(scope: !380, file: !113, line: 96, column: 1)
!404 = !DILocalVariable(name: "l", scope: !403, file: !113, line: 97, type: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "Layouter", file: !113, line: 6, size: 2112, align: 8, elements: !407)
!407 = !{!408, !420, !421, !422, !454, !455, !468, !469, !470, !471}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Guide", file: !113, line: 6, baseType: !409, size: 384, align: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "Guide", file: !113, line: 6, size: 384, align: 8, elements: !410)
!410 = !{!411, !412, !413, !419}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !113, line: 6, baseType: !37, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "system", file: !113, line: 6, baseType: !44, size: 64, align: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "children2", file: !113, line: 6, baseType: !414, size: 192, align: 64, offset: 128)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Guide,int,int}", file: !54, size: 192, align: 8, elements: !415)
!415 = !{!416, !106, !107}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "matchaGuide", file: !113, line: 6, baseType: !182, size: 64, align: 64, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "min", file: !113, line: 6, baseType: !409, size: 384, align: 64, offset: 384)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "max", file: !113, line: 6, baseType: !409, size: 384, align: 64, offset: 768)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "solvers", file: !113, line: 6, baseType: !423, size: 192, align: 64, offset: 1152)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Solver,int,int}", file: !54, size: 192, align: 8, elements: !424)
!424 = !{!425, !106, !107}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "Solver", file: !113, line: 6, size: 320, align: 8, elements: !429)
!429 = !{!430, !431, !432}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "debug", file: !113, line: 6, baseType: !51, size: 8, align: 8)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !113, line: 6, baseType: !37, size: 64, align: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", file: !113, line: 6, baseType: !433, size: 192, align: 64, offset: 128)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.gomatcha.io/matcha/layout/constraint.constraint,int,int}", file: !54, size: 192, align: 8, elements: !434)
!434 = !{!435, !106, !107}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: ".gomatcha.io/matcha/layout/constraint.constraint", file: !113, line: 6, size: 256, align: 8, elements: !438)
!438 = !{!439, !441, !443}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", file: !113, line: 6, baseType: !440, size: 64, align: 64)
!440 = !DIBasicType(name: ".gomatcha.io/matcha/layout/constraint.attribute", size: 64, encoding: DW_ATE_signed)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "comparison", file: !113, line: 6, baseType: !442, size: 64, align: 64, offset: 64)
!442 = !DIBasicType(name: ".gomatcha.io/matcha/layout/constraint.comparison", size: 64, encoding: DW_ATE_signed)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "anchor", file: !113, line: 6, baseType: !444, size: 128, align: 64, offset: 128)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: ".gomatcha.io/matcha/layout/constraint.anchor", file: !113, line: 6, size: 128, align: 8, elements: !445)
!445 = !{!446, !202}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !113, line: 6, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*Layouter)float64}", file: !54, size: 128, align: 8, elements: !449)
!449 = !{!143, !450}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !54, line: 6, baseType: !451, size: 64, align: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!174, !44, !44}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "zIndex", file: !113, line: 6, baseType: !37, size: 64, align: 64, offset: 1344)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "notifiers", file: !113, line: 6, baseType: !456, size: 192, align: 64, offset: 1408)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Notifier,int,int}", file: !54, size: 192, align: 8, elements: !457)
!457 = !{!458, !106, !107}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "Notifier", file: !113, line: 4, size: 128, align: 8, elements: !461)
!461 = !{!462, !202}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !113, line: 4, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*__go_descriptor)Id,*func(*void,Id)void}", file: !54, size: 192, align: 8, elements: !465)
!465 = !{!240, !466, !467}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Notify", file: !54, line: 4, baseType: !204, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Unnotify", file: !54, line: 4, baseType: !215, size: 64, align: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "groupNotifiers", file: !113, line: 6, baseType: !33, size: 64, align: 64, offset: 1600)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "maxId", file: !113, line: 6, baseType: !116, size: 64, align: 64, offset: 1664)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "views", file: !113, line: 6, baseType: !133, size: 192, align: 64, offset: 1728)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "solutions", file: !113, line: 6, baseType: !472, size: 192, align: 64, offset: 1920)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**.gomatcha.io/matcha/layout/constraint.solution,int,int}", file: !54, size: 192, align: 8, elements: !473)
!473 = !{!474, !106, !107}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !475, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: ".gomatcha.io/matcha/layout/constraint.solution", file: !113, line: 6, size: 256, align: 8, elements: !478)
!478 = !{!479, !487}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", file: !113, line: 6, baseType: !480, size: 192, align: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.gomatcha.io/matcha/layout/constraint.resolvedConstraint,int,int}", file: !54, size: 192, align: 8, elements: !481)
!481 = !{!482, !106, !107}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: ".gomatcha.io/matcha/layout/constraint.resolvedConstraint", file: !113, line: 6, size: 192, align: 8, elements: !485)
!485 = !{!439, !441, !486}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !113, line: 6, baseType: !174, size: 64, align: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !113, line: 6, baseType: !37, size: 64, align: 64, offset: 192)
!488 = !DILocation(line: 97, column: 2, scope: !380)
!489 = !DILocation(line: 99, column: 16, scope: !403)
!490 = !DILocalVariable(name: "childrenPb", scope: !403, file: !113, line: 99, type: !491)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**PagerChildView,int,int}", file: !54, size: 192, align: 8, elements: !492)
!492 = !{!493, !106, !107}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !494, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "PagerChildView", file: !113, line: 7, size: 128, align: 8, elements: !497)
!497 = !{!498}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Title", file: !113, line: 7, baseType: !86, size: 128, align: 64)
!499 = !DILocation(line: 99, column: 2, scope: !380)
!500 = !DILocation(line: 100, column: 23, scope: !501)
!501 = distinct !DILexicalBlock(scope: !403, file: !113, line: 100, column: 2)
!502 = !DILocation(line: 100, column: 24, scope: !501)
!503 = !DILocation(line: 100, column: 30, scope: !501)
!504 = !DILocation(line: 100, column: 2, scope: !501)
!505 = !DILocalVariable(name: "chld", scope: !501, file: !113, line: 100, type: !137)
!506 = !DILocation(line: 100, column: 6, scope: !403)
!507 = !DILocalVariable(name: "button", scope: !508, file: !113, line: 102, type: !509)
!508 = distinct !DILexicalBlock(scope: !501, file: !113, line: 100, column: 39)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "PagerButton", file: !113, line: 165, size: 128, align: 8, elements: !511)
!511 = !{!512}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "Title", file: !113, line: 166, baseType: !86, size: 128, align: 64)
!513 = !DILocation(line: 102, column: 7, scope: !501)
!514 = !DILocation(line: 104, column: 28, scope: !515)
!515 = distinct !DILexicalBlock(scope: !508, file: !113, line: 104, column: 3)
!516 = !DILocation(line: 104, column: 3, scope: !515)
!517 = !DILocalVariable(name: "opts", scope: !515, file: !113, line: 104, type: !262)
!518 = !DILocation(line: 104, column: 7, scope: !508)
!519 = !DILocalVariable(name: "ok", scope: !520, file: !113, line: 105, type: !51)
!520 = distinct !DILexicalBlock(scope: !515, file: !113, line: 104, column: 48)
!521 = !DILocation(line: 105, column: 8, scope: !515)
!522 = !DILocation(line: 106, column: 18, scope: !520)
!523 = !DILocation(line: 106, column: 4, scope: !520)
!524 = !DILocation(line: 111, column: 13, scope: !508)
!525 = !DILocation(line: 112, column: 13, scope: !508)
!526 = !DILocation(line: 118, column: 3, scope: !508)
!527 = !DILocation(line: 118, column: 15, scope: !508)
!528 = !DILocation(line: 118, column: 4, scope: !508)
!529 = !DILocation(line: 126, column: 35, scope: !508)
!530 = !DILocation(line: 126, column: 46, scope: !508)
!531 = !DILocation(line: 126, column: 16, scope: !508)
!532 = !DILocation(line: 126, column: 14, scope: !508)
!533 = !DILocation(line: 145, column: 19, scope: !403)
!534 = !DILocation(line: 0, scope: !508)
!535 = !DILocation(line: 145, column: 20, scope: !403)
!536 = !DILocation(line: 150, column: 25, scope: !403)
!537 = !DILocation(line: 150, column: 26, scope: !403)
!538 = !DILocation(line: 150, column: 32, scope: !403)
!539 = !DILocation(line: 148, column: 45, scope: !403)
!540 = !DILocation(line: 148, column: 56, scope: !403)
!541 = !DILocation(line: 148, column: 29, scope: !403)
!542 = !DILocation(line: 157, column: 16, scope: !403)
!543 = !DILocation(line: 158, column: 16, scope: !403)
!544 = !DILocation(line: 146, column: 19, scope: !403)
!545 = !DILocalVariable(name: "$ret5", scope: !380, file: !113, line: 96, type: !148)
!546 = !DILocation(line: 96, column: 45, scope: !380)
!547 = !DILocation(line: 144, column: 2, scope: !403)
!548 = distinct !DISubprogram(name: "android.Lifecycle..1command_line_arguments.PagerView", linkageName: "command_line_arguments.PagerView.Lifecycle", scope: null, file: !113, line: 73, type: !549, isLocal: false, isDefinition: true, scopeLine: 73, isOptimized: false, unit: !1, retainedNodes: !3)
!549 = !DISubroutineType(types: !550)
!550 = !{!45, !383, !383, !297, !297}
!551 = !DILocalVariable(name: "v", arg: 1, scope: !548, file: !113, line: 73, type: !383)
!552 = !DILocation(line: 73, column: 1, scope: !548)
!553 = !DILocalVariable(name: "from", arg: 2, scope: !548, file: !113, line: 73, type: !297)
!554 = !DILocation(line: 73, column: 31, scope: !548)
!555 = !DILocalVariable(name: "to", arg: 3, scope: !548, file: !113, line: 73, type: !297)
!556 = !DILocation(line: 73, column: 37, scope: !548)
!557 = !DILocation(line: 74, column: 10, scope: !548)
!558 = !DILocation(line: 74, column: 2, scope: !548)
!559 = !DILocation(line: 75, column: 7, scope: !548)
!560 = !DILocation(line: 79, column: 17, scope: !548)
!561 = !DILocation(line: 79, column: 9, scope: !548)
!562 = !DILocation(line: 75, column: 14, scope: !548)
!563 = !DILocation(line: 76, column: 14, scope: !548)
!564 = !DILocation(line: 76, column: 12, scope: !548)
!565 = !DILocation(line: 78, column: 16, scope: !548)
!566 = !DILocalVariable(name: "$this4", arg: 1, scope: !567, file: !113, line: 8, type: !383)
!567 = distinct !DISubprogram(name: "android.Subscribe..stub..1command_line_arguments.PagerView", linkageName: "command_line_arguments.PagerView.Subscribe..stub", scope: null, file: !113, line: 8, type: !568, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!568 = !DISubroutineType(types: !569)
!569 = !{!45, !383, !383, !460}
!570 = !DILocation(line: 8, column: 25, scope: !567, inlinedAt: !571)
!571 = distinct !DILocation(line: 78, column: 4, scope: !548)
!572 = !DILocalVariable(name: "$p5", arg: 2, scope: !567, file: !113, line: 8, type: !460)
!573 = !DILocation(line: 59, column: 6, scope: !567, inlinedAt: !571)
!574 = !DILocation(line: 80, column: 18, scope: !548)
!575 = !DILocalVariable(name: "$this2", arg: 1, scope: !576, file: !113, line: 8, type: !383)
!576 = distinct !DISubprogram(name: "android.Unsubscribe..stub..1command_line_arguments.PagerView", linkageName: "command_line_arguments.PagerView.Unsubscribe..stub", scope: null, file: !113, line: 8, type: !568, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!577 = !DILocation(line: 8, column: 25, scope: !576, inlinedAt: !578)
!578 = distinct !DILocation(line: 80, column: 4, scope: !548)
!579 = !DILocalVariable(name: "$p3", arg: 2, scope: !576, file: !113, line: 8, type: !460)
!580 = !DILocation(line: 59, column: 6, scope: !576, inlinedAt: !578)
!581 = distinct !DISubprogram(name: "android.Notify..stub..1command_line_arguments.PagerView", linkageName: "command_line_arguments.PagerView.Notify..stub", scope: null, file: !113, line: 8, type: !582, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!582 = !DISubroutineType(types: !583)
!583 = !{!116, !383, !383, !207}
!584 = !DILocalVariable(name: "$this0", arg: 1, scope: !581, file: !113, line: 8, type: !383)
!585 = !DILocation(line: 8, column: 25, scope: !581)
!586 = !DILocalVariable(name: "$p1", arg: 2, scope: !581, file: !113, line: 8, type: !207)
!587 = !DILocalVariable(name: "$ret25", scope: !581, file: !113, line: 8, type: !116)
!588 = !DILocation(line: 59, column: 6, scope: !581)
!589 = distinct !DISubprogram(name: "android.Signal..stub..1command_line_arguments.PagerView", linkageName: "command_line_arguments.PagerView.Signal..stub", scope: null, file: !113, line: 8, type: !590, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!590 = !DISubroutineType(types: !591)
!591 = !{!45, !383, !383}
!592 = !DILocalVariable(name: "$this6", arg: 1, scope: !589, file: !113, line: 8, type: !383)
!593 = !DILocation(line: 8, column: 25, scope: !589)
!594 = !DILocation(line: 59, column: 6, scope: !589)
!595 = !DILocation(line: 8, column: 25, scope: !567)
!596 = !DILocation(line: 59, column: 6, scope: !567)
!597 = distinct !DISubprogram(name: "android.Unnotify..stub..1command_line_arguments.PagerView", linkageName: "command_line_arguments.PagerView.Unnotify..stub", scope: null, file: !113, line: 8, type: !598, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!598 = !DISubroutineType(types: !599)
!599 = !{!45, !383, !383, !116}
!600 = !DILocalVariable(name: "$this8", arg: 1, scope: !597, file: !113, line: 8, type: !383)
!601 = !DILocation(line: 8, column: 25, scope: !597)
!602 = !DILocalVariable(name: "$p9", arg: 2, scope: !597, file: !113, line: 8, type: !116)
!603 = !DILocation(line: 59, column: 6, scope: !597)
!604 = !DILocation(line: 8, column: 25, scope: !576)
!605 = !DILocation(line: 59, column: 6, scope: !576)
!606 = distinct !DISubprogram(name: "android.Update..1command_line_arguments.PagerView", linkageName: "command_line_arguments.PagerView.Update", scope: null, file: !113, line: 84, type: !607, isLocal: false, isDefinition: true, scopeLine: 84, isOptimized: false, unit: !1, retainedNodes: !3)
!607 = !DISubroutineType(types: !608)
!608 = !{!45, !383, !383, !137}
!609 = !DILocalVariable(name: "v", arg: 1, scope: !606, file: !113, line: 84, type: !383)
!610 = !DILocation(line: 84, column: 1, scope: !606)
!611 = !DILocalVariable(name: "v2", arg: 2, scope: !606, file: !113, line: 84, type: !137)
!612 = !DILocation(line: 84, column: 28, scope: !606)
!613 = !DILocation(line: 85, column: 17, scope: !606)
!614 = !DILocation(line: 8, column: 25, scope: !576, inlinedAt: !615)
!615 = distinct !DILocation(line: 85, column: 3, scope: !606)
!616 = !DILocation(line: 59, column: 6, scope: !576, inlinedAt: !615)
!617 = !DILocation(line: 87, column: 18, scope: !606)
!618 = !DILocation(line: 87, column: 7, scope: !606)
!619 = !DILocation(line: 89, column: 6, scope: !606)
!620 = !DILocation(line: 89, column: 13, scope: !606)
!621 = !DILocation(line: 90, column: 13, scope: !606)
!622 = !DILocation(line: 90, column: 11, scope: !606)
!623 = !DILocation(line: 92, column: 15, scope: !606)
!624 = !DILocation(line: 8, column: 25, scope: !567, inlinedAt: !625)
!625 = distinct !DILocation(line: 92, column: 3, scope: !606)
!626 = !DILocation(line: 59, column: 6, scope: !567, inlinedAt: !625)
!627 = distinct !DISubprogram(name: "android.ViewKey..stub..1command_line_arguments.PagerView", linkageName: "command_line_arguments.PagerView.ViewKey..stub", scope: null, file: !113, line: 8, type: !628, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!628 = !DISubroutineType(types: !629)
!629 = !{!53, !383, !383}
!630 = !DILocalVariable(name: "$this7", arg: 1, scope: !627, file: !113, line: 8, type: !383)
!631 = !DILocation(line: 8, column: 25, scope: !627)
!632 = !DILocation(line: 59, column: 6, scope: !627)
!633 = distinct !DISubprogram(name: "android.NewPagerView", linkageName: "command_line_arguments.NewPagerView", scope: null, file: !113, line: 66, type: !634, isLocal: false, isDefinition: true, scopeLine: 66, isOptimized: false, unit: !1, retainedNodes: !3)
!634 = !DISubroutineType(types: !635)
!635 = !{!383}
!636 = !DILocalVariable(name: "$ret4", scope: !633, file: !113, line: 66, type: !383)
!637 = !DILocation(line: 66, column: 21, scope: !633)
!638 = !DILocation(line: 68, column: 10, scope: !633)
!639 = !DILocation(line: 67, column: 9, scope: !633)
!640 = !DILocation(line: 67, column: 10, scope: !633)
!641 = !DILocation(line: 67, column: 2, scope: !633)
!642 = distinct !DISubprogram(name: "android.OptionKey..1command_line_arguments.PagerButton", linkageName: "command_line_arguments.PagerButton.OptionKey", scope: null, file: !113, line: 169, type: !643, isLocal: false, isDefinition: true, scopeLine: 169, isOptimized: false, unit: !1, retainedNodes: !3)
!643 = !DISubroutineType(types: !644)
!644 = !{!86, !509, !509}
!645 = !DILocalVariable(name: "t", arg: 1, scope: !642, file: !113, line: 169, type: !509)
!646 = !DILocation(line: 169, column: 1, scope: !642)
!647 = !DILocalVariable(name: "$ret6", scope: !642, file: !113, line: 169, type: !86)
!648 = !DILocation(line: 169, column: 35, scope: !642)
!649 = !DILocation(line: 170, column: 2, scope: !642)
!650 = distinct !DISubprogram(name: "android.command_line_arguments.PagerButton..hash", linkageName: "command_line_arguments.command_line_arguments.PagerButton..hash", scope: null, file: !7, line: 1, type: !72, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!651 = !DILocalVariable(name: "key", arg: 1, scope: !650, file: !7, line: 1, type: !44)
!652 = !DILocation(line: 1, column: 1, scope: !650)
!653 = !DILocalVariable(name: "seed", arg: 2, scope: !650, file: !7, line: 1, type: !48)
!654 = !DILocalVariable(name: "$ret31", scope: !650, file: !7, line: 1, type: !48)
!655 = distinct !DISubprogram(name: "android.command_line_arguments.PagerButton..eq", linkageName: "command_line_arguments.command_line_arguments.PagerButton..eq", scope: null, file: !7, line: 1, type: !80, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!656 = !DILocalVariable(name: "key1", arg: 1, scope: !655, file: !7, line: 1, type: !44)
!657 = !DILocation(line: 1, column: 1, scope: !655)
!658 = !DILocalVariable(name: "key2", arg: 2, scope: !655, file: !7, line: 1, type: !44)
!659 = !DILocalVariable(name: "$ret32", scope: !655, file: !7, line: 1, type: !51)
!660 = distinct !DISubprogram(name: "android.func1", scope: null, file: !113, line: 118, type: !661, isLocal: true, isDefinition: true, scopeLine: 118, isOptimized: false, unit: !1, retainedNodes: !3)
!661 = !DISubroutineType(types: !662)
!662 = !{!45, !427}
!663 = !DILocalVariable(name: "s", arg: 1, scope: !660, file: !113, line: 118, type: !427)
!664 = !DILocation(line: 118, column: 20, scope: !660)
!665 = !DILocation(line: 119, column: 26, scope: !660)
!666 = !DILocation(line: 119, column: 5, scope: !660)
!667 = !DILocation(line: 120, column: 27, scope: !660)
!668 = !DILocation(line: 120, column: 5, scope: !660)
!669 = !DILocation(line: 121, column: 17, scope: !660)
!670 = !DILocation(line: 121, column: 18, scope: !660)
!671 = !DILocation(line: 121, column: 29, scope: !660)
!672 = !DILocation(line: 121, column: 5, scope: !660)
!673 = !DILocation(line: 122, column: 18, scope: !660)
!674 = !DILocation(line: 122, column: 19, scope: !660)
!675 = !DILocation(line: 122, column: 30, scope: !660)
!676 = !DILocation(line: 122, column: 5, scope: !660)
!677 = distinct !DISubprogram(name: "android.func2", scope: null, file: !113, line: 158, type: !678, isLocal: true, isDefinition: true, scopeLine: 158, isOptimized: false, unit: !1, retainedNodes: !3)
!678 = !DISubroutineType(types: !679)
!679 = !{!45, !37}
!680 = !DILocalVariable(name: "index", arg: 1, scope: !677, file: !113, line: 158, type: !37)
!681 = !DILocation(line: 158, column: 21, scope: !677)
!682 = !DILocation(line: 159, column: 5, scope: !677)
!683 = !DILocation(line: 159, column: 6, scope: !677)
!684 = !DILocation(line: 159, column: 12, scope: !677)
!685 = distinct !DISubprogram(name: "android.Notify..1command_line_arguments.Stack", linkageName: "command_line_arguments.Stack.Notify", scope: null, file: !11, line: 75, type: !686, isLocal: false, isDefinition: true, scopeLine: 75, isOptimized: false, unit: !1, retainedNodes: !3)
!686 = !DISubroutineType(types: !687)
!687 = !{!116, !688, !688, !207}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stack", file: !11, line: 25, size: 576, align: 8, elements: !690)
!690 = !{!691, !692, !698, !699}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "relay", file: !11, line: 26, baseType: !121, size: 256, align: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "childIds", file: !11, line: 27, baseType: !693, size: 192, align: 64, offset: 256)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int64,int,int}", file: !54, size: 192, align: 8, elements: !694)
!694 = !{!695, !106, !107}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !696, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "childrenMap", file: !11, line: 28, baseType: !33, size: 64, align: 64, offset: 448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "maxId", file: !11, line: 29, baseType: !697, size: 64, align: 64, offset: 512)
!700 = !DILocalVariable(name: "s", arg: 1, scope: !685, file: !11, line: 75, type: !688)
!701 = !DILocation(line: 75, column: 1, scope: !685)
!702 = !DILocalVariable(name: "f", arg: 2, scope: !685, file: !11, line: 75, type: !207)
!703 = !DILocation(line: 75, column: 24, scope: !685)
!704 = !DILocalVariable(name: "$ret8", scope: !685, file: !11, line: 75, type: !116)
!705 = !DILocation(line: 75, column: 34, scope: !685)
!706 = !DILocation(line: 76, column: 10, scope: !685)
!707 = !DILocation(line: 76, column: 16, scope: !685)
!708 = !DILocation(line: 76, column: 2, scope: !685)
!709 = distinct !DISubprogram(name: "android.Pop..1command_line_arguments.Stack", linkageName: "command_line_arguments.Stack.Pop", scope: null, file: !11, line: 66, type: !710, isLocal: false, isDefinition: true, scopeLine: 66, isOptimized: false, unit: !1, retainedNodes: !3)
!710 = !DISubroutineType(types: !711)
!711 = !{!45, !688, !688}
!712 = !DILocalVariable(name: "s", arg: 1, scope: !709, file: !11, line: 66, type: !688)
!713 = !DILocation(line: 66, column: 1, scope: !709)
!714 = !DILocation(line: 67, column: 10, scope: !709)
!715 = !DILocation(line: 67, column: 21, scope: !709)
!716 = !DILocation(line: 68, column: 3, scope: !709)
!717 = !DILocation(line: 70, column: 50, scope: !709)
!718 = !DILocation(line: 70, column: 10, scope: !709)
!719 = !DILocation(line: 70, column: 34, scope: !709)
!720 = !DILocation(line: 70, column: 2, scope: !709)
!721 = !DILocation(line: 71, column: 32, scope: !709)
!722 = !DILocation(line: 71, column: 42, scope: !709)
!723 = !DILocation(line: 71, column: 25, scope: !709)
!724 = !DILocation(line: 71, column: 13, scope: !709)
!725 = !DILocation(line: 72, column: 3, scope: !709)
!726 = !DILocation(line: 72, column: 9, scope: !709)
!727 = distinct !DISubprogram(name: "android.Push..1command_line_arguments.Stack", linkageName: "command_line_arguments.Stack.Push", scope: null, file: !11, line: 58, type: !728, isLocal: false, isDefinition: true, scopeLine: 58, isOptimized: false, unit: !1, retainedNodes: !3)
!728 = !DISubroutineType(types: !729)
!729 = !{!45, !688, !688, !137}
!730 = !DILocalVariable(name: "s", arg: 1, scope: !727, file: !11, line: 58, type: !688)
!731 = !DILocation(line: 58, column: 1, scope: !727)
!732 = !DILocalVariable(name: "vs", arg: 2, scope: !727, file: !11, line: 58, type: !137)
!733 = !DILocation(line: 58, column: 22, scope: !727)
!734 = !DILocation(line: 59, column: 3, scope: !727)
!735 = !DILocation(line: 59, column: 10, scope: !727)
!736 = !DILocation(line: 61, column: 3, scope: !727)
!737 = !DILocation(line: 61, column: 15, scope: !727)
!738 = !DILocation(line: 61, column: 13, scope: !727)
!739 = !DILocation(line: 62, column: 17, scope: !727)
!740 = !DILocation(line: 62, column: 3, scope: !727)
!741 = !DILocation(line: 62, column: 25, scope: !727)
!742 = !DILocation(line: 63, column: 3, scope: !727)
!743 = !DILocation(line: 63, column: 9, scope: !727)
!744 = distinct !DISubprogram(name: "android.SetViews..1command_line_arguments.Stack", linkageName: "command_line_arguments.Stack.SetViews", scope: null, file: !11, line: 32, type: !745, isLocal: false, isDefinition: true, scopeLine: 32, isOptimized: false, unit: !1, retainedNodes: !3)
!745 = !DISubroutineType(types: !746)
!746 = !{!45, !688, !688, !133}
!747 = !DILocalVariable(name: "vs", arg: 2, scope: !744, file: !11, line: 32, type: !133)
!748 = !DILocation(line: 32, column: 26, scope: !744)
!749 = !DILocalVariable(name: "s", arg: 1, scope: !744, file: !11, line: 32, type: !688)
!750 = !DILocation(line: 32, column: 1, scope: !744)
!751 = !DILocation(line: 33, column: 6, scope: !744)
!752 = !DILocation(line: 33, column: 19, scope: !744)
!753 = !DILocation(line: 37, column: 2, scope: !754)
!754 = distinct !DILexicalBlock(scope: !744, file: !11, line: 37, column: 2)
!755 = !DILocation(line: 34, column: 19, scope: !744)
!756 = !DILocation(line: 34, column: 17, scope: !744)
!757 = !DILocation(line: 38, column: 4, scope: !754)
!758 = !DILocation(line: 38, column: 11, scope: !754)
!759 = !DILocation(line: 39, column: 16, scope: !754)
!760 = !DILocation(line: 39, column: 14, scope: !754)
!761 = !DILocation(line: 40, column: 18, scope: !754)
!762 = !DILocation(line: 40, column: 4, scope: !754)
!763 = !DILocation(line: 40, column: 26, scope: !754)
!764 = !DILocation(line: 42, column: 3, scope: !744)
!765 = !DILocation(line: 42, column: 9, scope: !744)
!766 = distinct !DISubprogram(name: "android.Unnotify..1command_line_arguments.Stack", linkageName: "command_line_arguments.Stack.Unnotify", scope: null, file: !11, line: 79, type: !767, isLocal: false, isDefinition: true, scopeLine: 79, isOptimized: false, unit: !1, retainedNodes: !3)
!767 = !DISubroutineType(types: !768)
!768 = !{!45, !688, !688, !116}
!769 = !DILocalVariable(name: "s", arg: 1, scope: !766, file: !11, line: 79, type: !688)
!770 = !DILocation(line: 79, column: 1, scope: !766)
!771 = !DILocalVariable(name: "id", arg: 2, scope: !766, file: !11, line: 79, type: !116)
!772 = !DILocation(line: 79, column: 26, scope: !766)
!773 = !DILocation(line: 80, column: 3, scope: !766)
!774 = !DILocation(line: 80, column: 9, scope: !766)
!775 = distinct !DISubprogram(name: "android.Views..1command_line_arguments.Stack", linkageName: "command_line_arguments.Stack.Views", scope: null, file: !11, line: 50, type: !776, isLocal: false, isDefinition: true, scopeLine: 50, isOptimized: false, unit: !1, retainedNodes: !3)
!776 = !DISubroutineType(types: !777)
!777 = !{!133, !688, !688}
!778 = !DILocalVariable(name: "s", arg: 1, scope: !775, file: !11, line: 50, type: !688)
!779 = !DILocation(line: 50, column: 1, scope: !775)
!780 = !DILocation(line: 51, column: 8, scope: !781)
!781 = distinct !DILexicalBlock(scope: !775, file: !11, line: 50, column: 1)
!782 = !DILocalVariable(name: "vs", scope: !781, file: !11, line: 51, type: !133)
!783 = !DILocation(line: 51, column: 2, scope: !775)
!784 = !DILocalVariable(name: "i", scope: !785, file: !11, line: 52, type: !697)
!785 = distinct !DILexicalBlock(scope: !781, file: !11, line: 52, column: 2)
!786 = !DILocation(line: 52, column: 6, scope: !781)
!787 = !DILocation(line: 52, column: 21, scope: !785)
!788 = !DILocation(line: 52, column: 2, scope: !785)
!789 = !DILocation(line: 53, column: 20, scope: !785)
!790 = !DILocation(line: 53, column: 32, scope: !785)
!791 = !DILocation(line: 53, column: 8, scope: !785)
!792 = !DILocation(line: 53, column: 6, scope: !785)
!793 = !DILocation(line: 0, scope: !785)
!794 = !DILocalVariable(name: "$ret7", scope: !775, file: !11, line: 50, type: !133)
!795 = !DILocation(line: 50, column: 25, scope: !775)
!796 = !DILocation(line: 55, column: 2, scope: !781)
!797 = distinct !DISubprogram(name: "android.setChildIds..1command_line_arguments.Stack", linkageName: "command_line_arguments.Stack.setChildIds", scope: null, file: !11, line: 45, type: !798, isLocal: false, isDefinition: true, scopeLine: 45, isOptimized: false, unit: !1, retainedNodes: !3)
!798 = !DISubroutineType(types: !799)
!799 = !{!45, !688, !688, !693}
!800 = !DILocalVariable(name: "ids", arg: 2, scope: !797, file: !11, line: 45, type: !693)
!801 = !DILocation(line: 45, column: 29, scope: !797)
!802 = !DILocalVariable(name: "s", arg: 1, scope: !797, file: !11, line: 45, type: !688)
!803 = !DILocation(line: 45, column: 1, scope: !797)
!804 = !DILocation(line: 46, column: 3, scope: !797)
!805 = !DILocation(line: 46, column: 13, scope: !797)
!806 = !DILocation(line: 47, column: 3, scope: !797)
!807 = !DILocation(line: 47, column: 9, scope: !797)
!808 = distinct !DISubprogram(name: "android.Build..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.Build", scope: null, file: !11, line: 126, type: !809, isLocal: false, isDefinition: true, scopeLine: 126, isOptimized: false, unit: !1, retainedNodes: !3)
!809 = !DISubroutineType(types: !810)
!810 = !{!148, !811, !811, !279}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "StackView", file: !11, line: 83, size: 1088, align: 8, elements: !813)
!813 = !{!814, !815, !816, !817, !823, !824, !825}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "Embed", file: !11, line: 84, baseType: !387, size: 576, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "Stack", file: !11, line: 85, baseType: !688, size: 64, align: 64, offset: 576)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "BarColor", file: !11, line: 87, baseType: !234, size: 128, align: 64, offset: 640)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "TitleStyle", file: !11, line: 88, baseType: !818, size: 64, align: 64, offset: 768)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "Style", file: !113, line: 8, size: 128, align: 8, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", file: !113, line: 8, baseType: !33, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "cleared", file: !113, line: 8, baseType: !33, size: 64, align: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "SubtitleStyle", file: !11, line: 89, baseType: !818, size: 64, align: 64, offset: 832)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ItemTitleStyle", file: !11, line: 90, baseType: !818, size: 64, align: 64, offset: 896)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ItemIconTint", file: !11, line: 91, baseType: !234, size: 128, align: 64, offset: 960)
!826 = !DILocalVariable(name: "param", arg: 1, scope: !808, file: !11, line: 126, type: !811)
!827 = !DILocation(line: 126, column: 1, scope: !808)
!828 = !DILocalVariable(name: "ctx", arg: 2, scope: !808, file: !11, line: 126, type: !279)
!829 = !DILocation(line: 126, column: 27, scope: !808)
!830 = !DILocalVariable(name: "v", scope: !808, file: !11, line: 126, type: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!832 = !DILocation(line: 127, column: 7, scope: !833)
!833 = distinct !DILexicalBlock(scope: !808, file: !11, line: 126, column: 1)
!834 = !DILocalVariable(name: "l", scope: !833, file: !11, line: 127, type: !405)
!835 = !DILocation(line: 127, column: 2, scope: !808)
!836 = !DILocation(line: 129, column: 16, scope: !833)
!837 = !DILocalVariable(name: "childrenPb", scope: !833, file: !11, line: 129, type: !838)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**StackChildView,int,int}", file: !54, size: 192, align: 8, elements: !839)
!839 = !{!840, !106, !107}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !841, size: 64, align: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "StackChildView", file: !113, line: 7, size: 64, align: 8, elements: !844)
!844 = !{!845}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ScreenId", file: !113, line: 7, baseType: !697, size: 64, align: 64)
!846 = !DILocation(line: 129, column: 2, scope: !808)
!847 = !DILocalVariable(name: "idx", scope: !848, file: !11, line: 130, type: !37)
!848 = distinct !DILexicalBlock(scope: !833, file: !11, line: 130, column: 2)
!849 = !DILocation(line: 130, column: 6, scope: !833)
!850 = !DILocalVariable(name: "id", scope: !848, file: !11, line: 130, type: !697)
!851 = !DILocation(line: 130, column: 23, scope: !848)
!852 = !DILocation(line: 130, column: 24, scope: !848)
!853 = !DILocation(line: 130, column: 30, scope: !848)
!854 = !DILocation(line: 130, column: 2, scope: !848)
!855 = !DILocation(line: 131, column: 11, scope: !856)
!856 = distinct !DILexicalBlock(scope: !848, file: !11, line: 130, column: 40)
!857 = !DILocation(line: 131, column: 12, scope: !856)
!858 = !DILocation(line: 131, column: 18, scope: !856)
!859 = !DILocation(line: 131, column: 30, scope: !856)
!860 = !DILocalVariable(name: "chld", scope: !856, file: !11, line: 131, type: !137)
!861 = !DILocation(line: 131, column: 3, scope: !848)
!862 = !DILocation(line: 135, column: 54, scope: !856)
!863 = !DILocation(line: 135, column: 45, scope: !856)
!864 = !DILocation(line: 135, column: 26, scope: !856)
!865 = !DILocation(line: 138, column: 21, scope: !856)
!866 = !DILocation(line: 138, column: 22, scope: !856)
!867 = !DILocation(line: 139, column: 22, scope: !856)
!868 = !DILocation(line: 137, column: 22, scope: !856)
!869 = !DILocation(line: 140, column: 22, scope: !856)
!870 = !DILocation(line: 141, column: 22, scope: !856)
!871 = !DILocation(line: 142, column: 25, scope: !856)
!872 = !DILocation(line: 134, column: 11, scope: !856)
!873 = !DILocation(line: 134, column: 12, scope: !856)
!874 = !DILocalVariable(name: "barV", scope: !856, file: !11, line: 134, type: !875)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.stackBarView", file: !11, line: 183, size: 1216, align: 8, elements: !877)
!877 = !{!878, !879, !880, !881, !882, !883, !884, !885}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "Embed", file: !11, line: 184, baseType: !387, size: 576, align: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "View", file: !11, line: 185, baseType: !137, size: 128, align: 64, offset: 576)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "TitleStyle", file: !11, line: 186, baseType: !818, size: 64, align: 64, offset: 704)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "SubtitleStyle", file: !11, line: 187, baseType: !818, size: 64, align: 64, offset: 768)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "BarColor", file: !11, line: 188, baseType: !234, size: 128, align: 64, offset: 832)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ItemTitleStyle", file: !11, line: 189, baseType: !818, size: 64, align: 64, offset: 960)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ItemIconTint", file: !11, line: 190, baseType: !234, size: 128, align: 64, offset: 1024)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "NeedsBackButton", file: !11, line: 191, baseType: !51, size: 8, align: 8, offset: 1152)
!886 = !DILocation(line: 134, column: 3, scope: !848)
!887 = !DILocation(line: 144, column: 3, scope: !856)
!888 = !DILocation(line: 144, column: 9, scope: !856)
!889 = !DILocation(line: 144, column: 15, scope: !856)
!890 = !DILocation(line: 144, column: 4, scope: !856)
!891 = !DILocation(line: 152, column: 3, scope: !856)
!892 = !DILocation(line: 152, column: 15, scope: !856)
!893 = !DILocation(line: 152, column: 4, scope: !856)
!894 = !DILocation(line: 161, column: 20, scope: !856)
!895 = !DILocation(line: 160, column: 35, scope: !856)
!896 = !DILocation(line: 160, column: 44, scope: !856)
!897 = !DILocation(line: 160, column: 16, scope: !856)
!898 = !DILocation(line: 160, column: 14, scope: !856)
!899 = !DILocation(line: 166, column: 19, scope: !833)
!900 = !DILocation(line: 0, scope: !856)
!901 = !DILocation(line: 166, column: 20, scope: !833)
!902 = !DILocation(line: 169, column: 45, scope: !833)
!903 = !DILocation(line: 169, column: 54, scope: !833)
!904 = !DILocation(line: 169, column: 29, scope: !833)
!905 = !DILocation(line: 172, column: 16, scope: !833)
!906 = !DILocation(line: 173, column: 14, scope: !833)
!907 = !DILocation(line: 176, column: 15, scope: !833)
!908 = !DILocation(line: 167, column: 19, scope: !833)
!909 = !DILocalVariable(name: "$ret10", scope: !808, file: !11, line: 126, type: !148)
!910 = !DILocation(line: 126, column: 45, scope: !808)
!911 = !DILocation(line: 165, column: 2, scope: !833)
!912 = distinct !DISubprogram(name: "android.Lifecycle..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.Lifecycle", scope: null, file: !11, line: 102, type: !913, isLocal: false, isDefinition: true, scopeLine: 102, isOptimized: false, unit: !1, retainedNodes: !3)
!913 = !DISubroutineType(types: !914)
!914 = !{!45, !811, !811, !297, !297}
!915 = !DILocalVariable(name: "v", arg: 1, scope: !912, file: !11, line: 102, type: !811)
!916 = !DILocation(line: 102, column: 1, scope: !912)
!917 = !DILocalVariable(name: "from", arg: 2, scope: !912, file: !11, line: 102, type: !297)
!918 = !DILocation(line: 102, column: 31, scope: !912)
!919 = !DILocalVariable(name: "to", arg: 3, scope: !912, file: !11, line: 102, type: !297)
!920 = !DILocation(line: 102, column: 37, scope: !912)
!921 = !DILocation(line: 103, column: 10, scope: !912)
!922 = !DILocation(line: 103, column: 2, scope: !912)
!923 = !DILocation(line: 104, column: 7, scope: !912)
!924 = !DILocation(line: 108, column: 17, scope: !912)
!925 = !DILocation(line: 108, column: 9, scope: !912)
!926 = !DILocation(line: 104, column: 14, scope: !912)
!927 = !DILocation(line: 105, column: 14, scope: !912)
!928 = !DILocation(line: 105, column: 12, scope: !912)
!929 = !DILocation(line: 107, column: 16, scope: !912)
!930 = !DILocalVariable(name: "$this25", arg: 1, scope: !931, file: !113, line: 8, type: !811)
!931 = distinct !DISubprogram(name: "android.Subscribe..stub..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.Subscribe..stub", scope: null, file: !113, line: 8, type: !932, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!932 = !DISubroutineType(types: !933)
!933 = !{!45, !811, !811, !460}
!934 = !DILocation(line: 8, column: 25, scope: !931, inlinedAt: !935)
!935 = distinct !DILocation(line: 107, column: 4, scope: !912)
!936 = !DILocalVariable(name: "$p26", arg: 2, scope: !931, file: !113, line: 8, type: !460)
!937 = !DILocation(line: 83, column: 6, scope: !938, inlinedAt: !935)
!938 = !DILexicalBlockFile(scope: !931, file: !11, discriminator: 0)
!939 = !DILocation(line: 109, column: 18, scope: !912)
!940 = !DILocalVariable(name: "$this23", arg: 1, scope: !941, file: !113, line: 8, type: !811)
!941 = distinct !DISubprogram(name: "android.Unsubscribe..stub..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.Unsubscribe..stub", scope: null, file: !113, line: 8, type: !932, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!942 = !DILocation(line: 8, column: 25, scope: !941, inlinedAt: !943)
!943 = distinct !DILocation(line: 109, column: 4, scope: !912)
!944 = !DILocalVariable(name: "$p24", arg: 2, scope: !941, file: !113, line: 8, type: !460)
!945 = !DILocation(line: 83, column: 6, scope: !946, inlinedAt: !943)
!946 = !DILexicalBlockFile(scope: !941, file: !11, discriminator: 0)
!947 = distinct !DISubprogram(name: "android.Notify..stub..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.Notify..stub", scope: null, file: !113, line: 8, type: !948, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!948 = !DISubroutineType(types: !949)
!949 = !{!116, !811, !811, !207}
!950 = !DILocalVariable(name: "$this21", arg: 1, scope: !947, file: !113, line: 8, type: !811)
!951 = !DILocation(line: 8, column: 25, scope: !947)
!952 = !DILocalVariable(name: "$p22", arg: 2, scope: !947, file: !113, line: 8, type: !207)
!953 = !DILocalVariable(name: "$ret27", scope: !947, file: !113, line: 8, type: !116)
!954 = !DILocation(line: 83, column: 6, scope: !955)
!955 = !DILexicalBlockFile(scope: !947, file: !11, discriminator: 0)
!956 = distinct !DISubprogram(name: "android.Signal..stub..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.Signal..stub", scope: null, file: !113, line: 8, type: !957, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!957 = !DISubroutineType(types: !958)
!958 = !{!45, !811, !811}
!959 = !DILocalVariable(name: "$this27", arg: 1, scope: !956, file: !113, line: 8, type: !811)
!960 = !DILocation(line: 8, column: 25, scope: !956)
!961 = !DILocation(line: 83, column: 6, scope: !962)
!962 = !DILexicalBlockFile(scope: !956, file: !11, discriminator: 0)
!963 = !DILocation(line: 8, column: 25, scope: !931)
!964 = !DILocation(line: 83, column: 6, scope: !938)
!965 = distinct !DISubprogram(name: "android.Unnotify..stub..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.Unnotify..stub", scope: null, file: !113, line: 8, type: !966, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!966 = !DISubroutineType(types: !967)
!967 = !{!45, !811, !811, !116}
!968 = !DILocalVariable(name: "$this29", arg: 1, scope: !965, file: !113, line: 8, type: !811)
!969 = !DILocation(line: 8, column: 25, scope: !965)
!970 = !DILocalVariable(name: "$p30", arg: 2, scope: !965, file: !113, line: 8, type: !116)
!971 = !DILocation(line: 83, column: 6, scope: !972)
!972 = !DILexicalBlockFile(scope: !965, file: !11, discriminator: 0)
!973 = !DILocation(line: 8, column: 25, scope: !941)
!974 = !DILocation(line: 83, column: 6, scope: !946)
!975 = distinct !DISubprogram(name: "android.Update..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.Update", scope: null, file: !11, line: 114, type: !976, isLocal: false, isDefinition: true, scopeLine: 114, isOptimized: false, unit: !1, retainedNodes: !3)
!976 = !DISubroutineType(types: !977)
!977 = !{!45, !811, !811, !137}
!978 = !DILocalVariable(name: "v", arg: 1, scope: !975, file: !11, line: 114, type: !811)
!979 = !DILocation(line: 114, column: 1, scope: !975)
!980 = !DILocalVariable(name: "v2", arg: 2, scope: !975, file: !11, line: 114, type: !137)
!981 = !DILocation(line: 114, column: 28, scope: !975)
!982 = !DILocation(line: 115, column: 17, scope: !975)
!983 = !DILocation(line: 8, column: 25, scope: !941, inlinedAt: !984)
!984 = distinct !DILocation(line: 115, column: 3, scope: !975)
!985 = !DILocation(line: 83, column: 6, scope: !946, inlinedAt: !984)
!986 = !DILocation(line: 117, column: 18, scope: !975)
!987 = !DILocation(line: 117, column: 7, scope: !975)
!988 = !DILocation(line: 119, column: 6, scope: !975)
!989 = !DILocation(line: 119, column: 13, scope: !975)
!990 = !DILocation(line: 120, column: 13, scope: !975)
!991 = !DILocation(line: 120, column: 11, scope: !975)
!992 = !DILocation(line: 122, column: 15, scope: !975)
!993 = !DILocation(line: 8, column: 25, scope: !931, inlinedAt: !994)
!994 = distinct !DILocation(line: 122, column: 3, scope: !975)
!995 = !DILocation(line: 83, column: 6, scope: !938, inlinedAt: !994)
!996 = distinct !DISubprogram(name: "android.ViewKey..stub..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.ViewKey..stub", scope: null, file: !113, line: 8, type: !997, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!997 = !DISubroutineType(types: !998)
!998 = !{!53, !811, !811}
!999 = !DILocalVariable(name: "$this28", arg: 1, scope: !996, file: !113, line: 8, type: !811)
!1000 = !DILocation(line: 8, column: 25, scope: !996)
!1001 = !DILocation(line: 83, column: 6, scope: !1002)
!1002 = !DILexicalBlockFile(scope: !996, file: !11, discriminator: 0)
!1003 = distinct !DISubprogram(name: "android.NewStackView", linkageName: "command_line_arguments.NewStackView", scope: null, file: !11, line: 95, type: !1004, isLocal: false, isDefinition: true, scopeLine: 95, isOptimized: false, unit: !1, retainedNodes: !3)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!811}
!1006 = !DILocalVariable(name: "$ret9", scope: !1003, file: !11, line: 95, type: !811)
!1007 = !DILocation(line: 95, column: 21, scope: !1003)
!1008 = !DILocation(line: 97, column: 10, scope: !1003)
!1009 = !DILocation(line: 96, column: 9, scope: !1003)
!1010 = !DILocation(line: 96, column: 10, scope: !1003)
!1011 = !DILocation(line: 96, column: 2, scope: !1003)
!1012 = distinct !DISubprogram(name: "android.Build..1command_line_arguments.stackBarView", linkageName: "command_line_arguments.stackBarView.Build", scope: null, file: !11, line: 208, type: !1013, isLocal: false, isDefinition: true, scopeLine: 208, isOptimized: false, unit: !1, retainedNodes: !3)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!148, !875, !875, !279}
!1015 = !DILocalVariable(name: "v", arg: 1, scope: !1012, file: !11, line: 208, type: !875)
!1016 = !DILocation(line: 208, column: 1, scope: !1012)
!1017 = !DILocalVariable(name: "ctx", arg: 2, scope: !1012, file: !11, line: 208, type: !279)
!1018 = !DILocation(line: 208, column: 30, scope: !1012)
!1019 = !DILocalVariable(name: "bar", scope: !1020, file: !11, line: 210, type: !1021)
!1020 = distinct !DILexicalBlock(scope: !1012, file: !11, line: 208, column: 1)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DICompositeType(tag: DW_TAG_structure_type, name: "StackBar", file: !11, line: 272, size: 704, align: 8, elements: !1023)
!1023 = !{!1024, !1025, !1045, !1046, !1047, !1048}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "Title", file: !11, line: 273, baseType: !86, size: 128, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "StyledTitle", file: !11, line: 274, baseType: !1026, size: 64, align: 64, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DICompositeType(tag: DW_TAG_structure_type, name: "StyledText", file: !113, line: 8, size: 256, align: 8, elements: !1028)
!1028 = !{!1029, !1036}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "text", file: !113, line: 8, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DICompositeType(tag: DW_TAG_structure_type, name: "Text", file: !113, line: 8, size: 512, align: 8, elements: !1032)
!1032 = !{!1033, !1034, !1035}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", file: !113, line: 8, baseType: !274, size: 192, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "runeCount", file: !113, line: 8, baseType: !37, size: 64, align: 64, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "relay", file: !113, line: 8, baseType: !121, size: 256, align: 64, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "styles", file: !113, line: 8, baseType: !1037, size: 192, align: 64, offset: 64)
!1037 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.gomatcha.io/matcha/text.styleRange,int,int}", file: !54, size: 192, align: 8, elements: !1038)
!1038 = !{!1039, !106, !107}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: ".gomatcha.io/matcha/text.styleRange", file: !113, line: 8, size: 128, align: 8, elements: !1042)
!1042 = !{!1043, !1044}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !113, line: 8, baseType: !37, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "style", file: !113, line: 8, baseType: !818, size: 64, align: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "Subtitle", file: !11, line: 275, baseType: !86, size: 128, align: 64, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "StyledSubtitle", file: !11, line: 276, baseType: !1026, size: 64, align: 64, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "Color", file: !11, line: 277, baseType: !234, size: 128, align: 64, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "Items", file: !11, line: 278, baseType: !1049, size: 192, align: 64, offset: 512)
!1049 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**StackBarItem,int,int}", file: !54, size: 192, align: 8, elements: !1050)
!1050 = !{!1051, !106, !107}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DICompositeType(tag: DW_TAG_structure_type, name: "StackBarItem", file: !11, line: 285, size: 576, align: 8, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1096, !1097, !1098}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "Title", file: !11, line: 286, baseType: !86, size: 128, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "StyledTitle", file: !11, line: 287, baseType: !1026, size: 64, align: 64, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "Icon", file: !11, line: 288, baseType: !1059, size: 128, align: 64, offset: 192)
!1059 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !113, line: 5, size: 128, align: 8, elements: !1060)
!1060 = !{!1061, !202}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !113, line: 5, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,int,int)Color,*func(*void)Rectangle,*func(*void)Model}", file: !54, size: 256, align: 8, elements: !1064)
!1064 = !{!1065, !1066, !1070, !1082}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !54, line: 5, baseType: !57, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "At", file: !54, line: 5, baseType: !1067, size: 64, align: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!234, !44, !37, !37}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "Bounds", file: !54, line: 5, baseType: !1071, size: 64, align: 64, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!1074, !44}
!1074 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rectangle", file: !113, line: 5, size: 256, align: 8, elements: !1075)
!1075 = !{!1076, !1081}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "Min", file: !113, line: 5, baseType: !1077, size: 128, align: 64)
!1077 = !DICompositeType(tag: DW_TAG_structure_type, name: "Point", file: !113, line: 5, size: 128, align: 8, elements: !1078)
!1078 = !{!1079, !1080}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "X", file: !113, line: 5, baseType: !37, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "Y", file: !113, line: 5, baseType: !37, size: 64, align: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "Max", file: !113, line: 5, baseType: !1077, size: 128, align: 64, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "ColorModel", file: !54, line: 5, baseType: !1083, size: 64, align: 64, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!1086, !44}
!1086 = !DICompositeType(tag: DW_TAG_structure_type, name: "Model", file: !113, line: 5, size: 128, align: 8, elements: !1087)
!1087 = !{!1088, !202}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !113, line: 5, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Color)Color}", file: !54, size: 128, align: 8, elements: !1091)
!1091 = !{!1065, !1092}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "Convert", file: !54, line: 5, baseType: !1093, size: 64, align: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!234, !44, !234}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "IconTint", file: !11, line: 289, baseType: !234, size: 128, align: 64, offset: 320)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", file: !11, line: 290, baseType: !51, size: 8, align: 8, offset: 448)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "OnPress", file: !11, line: 291, baseType: !207, size: 64, align: 64, offset: 512)
!1099 = !DILocation(line: 210, column: 6, scope: !1012)
!1100 = !DILocation(line: 211, column: 24, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1020, file: !11, line: 211, column: 2)
!1102 = !DILocation(line: 211, column: 29, scope: !1101)
!1103 = !DILocation(line: 211, column: 2, scope: !1101)
!1104 = !DILocalVariable(name: "opts", scope: !1101, file: !11, line: 211, type: !262)
!1105 = !DILocation(line: 211, column: 6, scope: !1020)
!1106 = !DILocalVariable(name: "ok", scope: !1107, file: !11, line: 212, type: !51)
!1107 = distinct !DILexicalBlock(scope: !1101, file: !11, line: 211, column: 49)
!1108 = !DILocation(line: 212, column: 7, scope: !1101)
!1109 = !DILocation(line: 213, column: 14, scope: !1107)
!1110 = !DILocation(line: 213, column: 3, scope: !1107)
!1111 = !DILocation(line: 217, column: 9, scope: !1020)
!1112 = !DILocation(line: 218, column: 10, scope: !1020)
!1113 = !DILocation(line: 0, scope: !1107)
!1114 = !DILocalVariable(name: "col", scope: !1020, file: !11, line: 223, type: !234)
!1115 = !DILocation(line: 223, column: 2, scope: !1012)
!1116 = !DILocation(line: 224, column: 9, scope: !1020)
!1117 = !DILocation(line: 225, column: 7, scope: !1020)
!1118 = !DILocation(line: 227, column: 9, scope: !1020)
!1119 = !DILocation(line: 228, column: 7, scope: !1020)
!1120 = !DILocation(line: 0, scope: !1020)
!1121 = !DILocation(line: 231, column: 20, scope: !1020)
!1122 = !DILocalVariable(name: "styledTitle", scope: !1020, file: !11, line: 231, type: !1026)
!1123 = !DILocation(line: 231, column: 2, scope: !1012)
!1124 = !DILocation(line: 232, column: 6, scope: !1020)
!1125 = !DILocation(line: 232, column: 18, scope: !1020)
!1126 = !DILocation(line: 232, column: 40, scope: !1020)
!1127 = !DILocation(line: 233, column: 22, scope: !1020)
!1128 = !DILocation(line: 236, column: 23, scope: !1020)
!1129 = !DILocalVariable(name: "styledSubtitle", scope: !1020, file: !11, line: 236, type: !1026)
!1130 = !DILocation(line: 236, column: 2, scope: !1012)
!1131 = !DILocation(line: 237, column: 6, scope: !1020)
!1132 = !DILocation(line: 237, column: 21, scope: !1020)
!1133 = !DILocation(line: 237, column: 46, scope: !1020)
!1134 = !DILocation(line: 241, column: 11, scope: !1020)
!1135 = !DILocalVariable(name: "funcs", scope: !1020, file: !11, line: 241, type: !33)
!1136 = !DILocation(line: 241, column: 2, scope: !1012)
!1137 = !DILocation(line: 242, column: 11, scope: !1020)
!1138 = !DILocalVariable(name: "items", scope: !1020, file: !11, line: 242, type: !1139)
!1139 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**StackBarItem,int,int}", file: !54, size: 192, align: 8, elements: !1140)
!1140 = !{!1141, !106, !107}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DICompositeType(tag: DW_TAG_structure_type, name: "StackBarItem", file: !113, line: 7, size: 512, align: 8, elements: !1145)
!1145 = !{!498, !1146, !1195, !1208, !1216, !1217}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "StyledTitle", file: !113, line: 7, baseType: !1147, size: 64, align: 64, offset: 128)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DICompositeType(tag: DW_TAG_structure_type, name: "StyledText", file: !113, line: 7, size: 256, align: 8, elements: !1149)
!1149 = !{!1150, !1190}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "Styles", file: !113, line: 7, baseType: !1151, size: 192, align: 64)
!1151 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**TextStyle,int,int}", file: !54, size: 192, align: 8, elements: !1152)
!1152 = !{!1153, !106, !107}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DICompositeType(tag: DW_TAG_structure_type, name: "TextStyle", file: !113, line: 7, size: 1280, align: 8, elements: !1157)
!1157 = !{!1158, !1159, !1161, !1163, !1164, !1165, !1166, !1167, !1168, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1185, !1187, !1188, !1189}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !113, line: 7, baseType: !697, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "TextAlignment", file: !113, line: 7, baseType: !1160, size: 32, align: 32, offset: 64)
!1160 = !DIBasicType(name: "TextAlignment", size: 32, encoding: DW_ATE_signed)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughStyle", file: !113, line: 7, baseType: !1162, size: 32, align: 32, offset: 96)
