; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22ios\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/gogo/protobuf/proto\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/gogo/protobuf/proto\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22comm\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22gomatcha.io/matcha/comm\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22gomatcha.io/matcha/comm\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22internal\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22gomatcha.io/matcha/internal\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./activityindicator.go", directory: "/home/wangcong/go_path/src/gomatcha.io/matcha/view/ios")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "ios.OptionKey..1command_line_arguments.ActivityIndicator", linkageName: "command_line_arguments.ActivityIndicator.OptionKey", scope: null, file: !10, line: 19, type: !11, isLocal: false, isDefinition: true, scopeLine: 19, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DIFile(filename: "activityindicator.go", directory: ".")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !20, !20}
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !14)
!14 = !{!15, !18}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "ActivityIndicator", file: !10, line: 15, align: 8, elements: !3)
!22 = !DILocalVariable(name: "a", arg: 1, scope: !9, file: !10, line: 19, type: !20)
!23 = !DILocation(line: 19, column: 1, scope: !9)
!24 = !DILocalVariable(name: "$ret0", scope: !9, file: !10, line: 19, type: !13)
!25 = !DILocation(line: 19, column: 41, scope: !9)
!26 = !DILocation(line: 20, column: 2, scope: !9)
!27 = distinct !DISubprogram(name: "ios.command_line_arguments..init0", linkageName: "command_line_arguments.command_line_arguments..init0", scope: null, file: !10, line: 23, type: !28, isLocal: false, isDefinition: true, scopeLine: 23, isOptimized: false, unit: !1, retainedNodes: !3)
!28 = !DISubroutineType(types: !29)
!29 = !{!30}
!30 = !DIBasicType(name: "void")
!31 = !DILocation(line: 24, column: 11, scope: !27)
!32 = distinct !DISubprogram(name: "ios.command_line_arguments..init0..func1", scope: null, file: !10, line: 24, type: !33, isLocal: true, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !1, retainedNodes: !3)
!33 = !DISubroutineType(types: !34)
!34 = !{!35}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !36, size: 128, align: 8, elements: !37)
!36 = !DIFile(filename: "", directory: "")
!37 = !{!38, !89}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !36, line: 1, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !41)
!41 = !{!42, !44, !45, !46, !47, !48, !49, !58, !67, !68, !70, !88}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !43, size: 64, align: 64)
!43 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !17, size: 8, align: 8, offset: 160)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !17, size: 8, align: 8, offset: 168)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !17, size: 8, align: 8, offset: 176)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !50, size: 64, align: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !52)
!52 = !{!53}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!43, !57, !43}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !59, size: 64, align: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !61)
!61 = !{!62}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !57, !57}
!66 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !16, size: 64, align: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !69, size: 64, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !71, size: 64, align: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !73)
!73 = !{!74, !75, !76}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !69, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !69, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !77, size: 192, align: 64, offset: 128)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !36, size: 192, align: 8, elements: !78)
!78 = !{!79, !86, !87}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !82)
!82 = !{!74, !75, !83, !84, !85}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !57, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !57, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !57, size: 64, align: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !36, line: 1, baseType: !19, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !36, line: 1, baseType: !19, size: 64, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !57, size: 64, align: 64, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !36, line: 1, baseType: !57, size: 64, align: 64, offset: 64)
!90 = !DILocation(line: 26, column: 17, scope: !32)
!91 = !DILocation(line: 25, column: 10, scope: !32)
!92 = !DILocation(line: 25, column: 11, scope: !32)
!93 = !DILocalVariable(name: "$ret1", scope: !32, file: !10, line: 24, type: !35)
!94 = !DILocation(line: 24, column: 37, scope: !32)
!95 = !DILocation(line: 25, column: 3, scope: !32)
!96 = distinct !DISubprogram(name: "ios.Build..1command_line_arguments.activityIndicatorMiddleware", linkageName: "command_line_arguments.activityIndicatorMiddleware.Build", scope: null, file: !10, line: 35, type: !97, isLocal: false, isDefinition: true, scopeLine: 35, isOptimized: false, unit: !1, retainedNodes: !3)
!97 = !DISubroutineType(types: !98)
!98 = !{!30, !99, !99, !126, !143}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.activityIndicatorMiddleware", file: !10, line: 31, size: 64, align: 8, elements: !101)
!101 = !{!102}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "radix", file: !10, line: 32, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "Radix", file: !10, line: 6, size: 64, align: 8, elements: !105)
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "root", file: !10, line: 6, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !10, line: 6, size: 256, align: 8, elements: !109)
!109 = !{!110, !124, !125}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "children", file: !10, line: 6, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !113)
!113 = !{!114, !115, !116, !117, !119, !120, !121, !122, !123}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !19, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !17, size: 8, align: 8, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !17, size: 8, align: 8, offset: 72)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !118, size: 16, align: 16, offset: 80)
!118 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !57, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !57, size: 64, align: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !43, size: 64, align: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !57, size: 64, align: 64, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "exists", file: !10, line: 6, baseType: !66, size: 8, align: 8, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !10, line: 6, baseType: !35, size: 128, align: 64, offset: 128)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !10, line: 8, size: 128, align: 8, elements: !127)
!127 = !{!128, !142}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 8, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{*Id,int,int}}", file: !36, size: 128, align: 8, elements: !131)
!131 = !{!132, !133}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !36, line: 8, baseType: !39, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !36, line: 8, baseType: !134, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!137, !57}
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Id,int,int}", file: !36, size: 192, align: 8, elements: !138)
!138 = !{!139, !86, !87}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIBasicType(name: "Id", size: 64, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !57, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Model", file: !10, line: 8, size: 1088, align: 8, elements: !145)
!145 = !{!146, !187, !240, !279, !294, !295, !299, !300}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Children", file: !10, line: 8, baseType: !147, size: 192, align: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*View,int,int}", file: !36, size: 192, align: 8, elements: !148)
!148 = !{!149, !86, !87}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "View", file: !10, line: 8, size: 128, align: 8, elements: !152)
!152 = !{!153, !142}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 8, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Context)Model,*func(*void,Stage,Stage)void,*func(*void,*__go_descriptor)Id,*func(*void,Id)void,*func(*void,View)void,*func(*void)struct{*_type,*void}}", file: !36, size: 448, align: 8, elements: !156)
!156 = !{!132, !157, !161, !166, !175, !179, !183}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Build", file: !36, line: 8, baseType: !158, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!144, !57, !126}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Lifecycle", file: !36, line: 8, baseType: !162, size: 64, align: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!30, !57, !165, !165}
!165 = !DIBasicType(name: "Stage", size: 64, encoding: DW_ATE_signed)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Notify", file: !36, line: 8, baseType: !167, size: 64, align: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!141, !57, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 8, size: 64, align: 8, elements: !172)
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 8, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Unnotify", file: !36, line: 8, baseType: !176, size: 64, align: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!30, !57, !141}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Update", file: !36, line: 8, baseType: !180, size: 64, align: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!30, !57, !151}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ViewKey", file: !36, line: 8, baseType: !184, size: 64, align: 64, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!35, !57}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Layouter", file: !10, line: 8, baseType: !188, size: 128, align: 64, offset: 192)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "Layouter", file: !10, line: 8, size: 128, align: 8, elements: !189)
!189 = !{!190, !142}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 8, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Context)struct{Guide,struct{*Guide,int,int}},*func(*void,*__go_descriptor)Id,*func(*void,Id)void}", file: !36, size: 256, align: 8, elements: !193)
!193 = !{!132, !194, !238, !239}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Layout", file: !36, line: 8, baseType: !195, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!198, !57, !219}
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Guide,struct{*Guide,int,int}}", file: !36, size: 512, align: 8, elements: !199)
!199 = !{!200, !214}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !36, line: 8, baseType: !201, size: 320, align: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "Guide", file: !10, line: 8, size: 320, align: 8, elements: !202)
!202 = !{!203, !213}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Frame", file: !10, line: 8, baseType: !204, size: 256, align: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rect", file: !10, line: 8, size: 256, align: 8, elements: !205)
!205 = !{!206, !212}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Min", file: !10, line: 8, baseType: !207, size: 128, align: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "Point", file: !10, line: 8, size: 128, align: 8, elements: !208)
!208 = !{!209, !211}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "X", file: !10, line: 8, baseType: !210, size: 64, align: 64)
!210 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Y", file: !10, line: 8, baseType: !210, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Max", file: !10, line: 8, baseType: !207, size: 128, align: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ZIndex", file: !10, line: 8, baseType: !19, size: 64, align: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !36, line: 8, baseType: !215, size: 192, align: 64, offset: 320)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Guide,int,int}", file: !36, size: 192, align: 8, elements: !216)
!216 = !{!217, !86, !87}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !10, line: 8, size: 128, align: 8, elements: !220)
!220 = !{!221, !142}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 8, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,int,Point,Point)Guide,*func(*void)Point,*func(*void)Point}", file: !36, size: 320, align: 8, elements: !224)
!224 = !{!132, !225, !229, !233, !237}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ChildCount", file: !36, line: 8, baseType: !226, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!19, !57}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "LayoutChild", file: !36, line: 8, baseType: !230, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!201, !57, !19, !207, !207}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "MaxSize", file: !36, line: 8, baseType: !234, size: 64, align: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!207, !57}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "MinSize", file: !36, line: 8, baseType: !234, size: 64, align: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Notify", file: !36, line: 8, baseType: !167, size: 64, align: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "Unnotify", file: !36, line: 8, baseType: !176, size: 64, align: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Painter", file: !10, line: 8, baseType: !241, size: 128, align: 64, offset: 320)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "Painter", file: !10, line: 8, size: 128, align: 8, elements: !242)
!242 = !{!243, !142}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 8, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*__go_descriptor)Id,*func(*void)Style,*func(*void,Id)void}", file: !36, size: 256, align: 8, elements: !246)
!246 = !{!132, !247, !248, !239}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Notify", file: !36, line: 8, baseType: !167, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "PaintStyle", file: !36, line: 8, baseType: !249, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!252, !57}
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "Style", file: !10, line: 8, size: 768, align: 8, elements: !253)
!253 = !{!254, !255, !273, !274, !275, !276, !277, !278}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency", file: !10, line: 8, baseType: !210, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "BackgroundColor", file: !10, line: 8, baseType: !256, size: 128, align: 64, offset: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", file: !10, line: 5, size: 128, align: 8, elements: !257)
!257 = !{!258, !142}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 5, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{uint32,uint32,uint32,uint32}}", file: !36, size: 128, align: 8, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !36, line: 5, baseType: !39, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "RGBA", file: !36, line: 5, baseType: !264, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!267, !57}
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{uint32,uint32,uint32,uint32}", file: !36, size: 128, align: 8, elements: !268)
!268 = !{!269, !270, !271, !272}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !36, line: 5, baseType: !8, size: 32, align: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !36, line: 5, baseType: !8, size: 32, align: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !36, line: 5, baseType: !8, size: 32, align: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "a", file: !36, line: 5, baseType: !8, size: 32, align: 32, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "BorderColor", file: !10, line: 8, baseType: !256, size: 128, align: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "BorderWidth", file: !10, line: 8, baseType: !210, size: 64, align: 64, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "CornerRadius", file: !10, line: 8, baseType: !210, size: 64, align: 64, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowRadius", file: !10, line: 8, baseType: !210, size: 64, align: 64, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowOffset", file: !10, line: 8, baseType: !207, size: 128, align: 64, offset: 512)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowColor", file: !10, line: 8, baseType: !256, size: 128, align: 64, offset: 640)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !10, line: 8, baseType: !280, size: 192, align: 64, offset: 448)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Option,int,int}", file: !36, size: 192, align: 8, elements: !281)
!281 = !{!282, !86, !87}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option", file: !10, line: 8, size: 128, align: 8, elements: !285)
!285 = !{!286, !142}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 8, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !36, size: 128, align: 8, elements: !289)
!289 = !{!132, !290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "OptionKey", file: !36, line: 8, baseType: !291, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!13, !57}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "NativeViewName", file: !10, line: 8, baseType: !13, size: 128, align: 64, offset: 640)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "NativeViewState", file: !10, line: 8, baseType: !296, size: 192, align: 64, offset: 768)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !36, size: 192, align: 8, elements: !297)
!297 = !{!298, !86, !87}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !16, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "NativeOptions", file: !10, line: 8, baseType: !111, size: 64, align: 64, offset: 960)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "NativeFuncs", file: !10, line: 8, baseType: !111, size: 64, align: 64, offset: 1024)
!301 = !DILocalVariable(name: "m", arg: 1, scope: !96, file: !10, line: 35, type: !99)
!302 = !DILocation(line: 35, column: 1, scope: !96)
!303 = !DILocalVariable(name: "ctx", arg: 2, scope: !96, file: !10, line: 35, type: !126)
!304 = !DILocation(line: 35, column: 45, scope: !96)
!305 = !DILocalVariable(name: "model", arg: 3, scope: !96, file: !10, line: 35, type: !143)
!306 = !DILocation(line: 35, column: 63, scope: !96)
!307 = !DILocation(line: 36, column: 31, scope: !308)
!308 = distinct !DILexicalBlock(scope: !96, file: !10, line: 35, column: 1)
!309 = !DILocation(line: 36, column: 10, scope: !308)
!310 = !DILocalVariable(name: "add", scope: !308, file: !10, line: 38, type: !66)
!311 = !DILocation(line: 38, column: 2, scope: !96)
!312 = !DILocation(line: 39, column: 11, scope: !308)
!313 = !DILocation(line: 0, scope: !308)
!314 = !DILocation(line: 46, column: 2, scope: !308)
!315 = !DILocation(line: 40, column: 3, scope: !316)
!316 = distinct !DILexicalBlock(scope: !308, file: !10, line: 40, column: 3)
!317 = !DILocalVariable(name: "i", scope: !316, file: !10, line: 40, type: !284)
!318 = !DILocation(line: 40, column: 7, scope: !308)
!319 = !DILocalVariable(name: "ok", scope: !320, file: !10, line: 41, type: !66)
!320 = distinct !DILexicalBlock(scope: !316, file: !10, line: 41, column: 4)
!321 = !DILocation(line: 41, column: 7, scope: !316)
!322 = !DILocation(line: 41, column: 7, scope: !320)
!323 = !DILocation(line: 41, column: 4, scope: !320)
!324 = !DILocation(line: 47, column: 4, scope: !308)
!325 = !DILocalVariable(name: "path", scope: !308, file: !10, line: 36, type: !326)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int64,int,int}", file: !36, size: 192, align: 8, elements: !327)
!327 = !{!328, !86, !87}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!331 = !DILocation(line: 36, column: 2, scope: !96)
!332 = !DILocation(line: 47, column: 10, scope: !308)
!333 = !DILocation(line: 49, column: 4, scope: !308)
!334 = !DILocation(line: 49, column: 10, scope: !308)
!335 = distinct !DISubprogram(name: "ios.Key..1command_line_arguments.activityIndicatorMiddleware", linkageName: "command_line_arguments.activityIndicatorMiddleware.Key", scope: null, file: !10, line: 63, type: !336, isLocal: false, isDefinition: true, scopeLine: 63, isOptimized: false, unit: !1, retainedNodes: !3)
!336 = !DISubroutineType(types: !337)
!337 = !{!13, !99, !99}
!338 = !DILocalVariable(name: "m", arg: 1, scope: !335, file: !10, line: 63, type: !99)
!339 = !DILocation(line: 63, column: 1, scope: !335)
!340 = !DILocalVariable(name: "$ret3", scope: !335, file: !10, line: 63, type: !13)
!341 = !DILocation(line: 63, column: 45, scope: !335)
!342 = !DILocation(line: 64, column: 2, scope: !335)
!343 = distinct !DISubprogram(name: "ios.MarshalProtobuf..1command_line_arguments.activityIndicatorMiddleware", linkageName: "command_line_arguments.activityIndicatorMiddleware.MarshalProtobuf", scope: null, file: !10, line: 53, type: !344, isLocal: false, isDefinition: true, scopeLine: 53, isOptimized: false, unit: !1, retainedNodes: !3)
!344 = !DISubroutineType(types: !345)
!345 = !{!346, !99, !99}
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !10, line: 4, size: 128, align: 8, elements: !347)
!347 = !{!348, !142}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void,*func(*void)string}", file: !36, size: 256, align: 8, elements: !351)
!351 = !{!352, !353, !357, !358}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !36, line: 4, baseType: !39, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMessage", file: !36, line: 4, baseType: !354, size: 64, align: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!30, !57}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", file: !36, line: 4, baseType: !354, size: 64, align: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !36, line: 4, baseType: !291, size: 64, align: 64, offset: 192)
!359 = !DILocalVariable(name: "m", arg: 1, scope: !343, file: !10, line: 53, type: !99)
!360 = !DILocation(line: 53, column: 1, scope: !343)
!361 = !DILocalVariable(name: "visible", scope: !362, file: !10, line: 54, type: !66)
!362 = distinct !DILexicalBlock(scope: !343, file: !10, line: 53, column: 1)
!363 = !DILocation(line: 54, column: 2, scope: !343)
!364 = !DILocation(line: 55, column: 3, scope: !362)
!365 = !DILocation(line: 55, column: 16, scope: !362)
!366 = !DILocation(line: 55, column: 9, scope: !362)
!367 = !DILocation(line: 58, column: 9, scope: !362)
!368 = !DILocation(line: 59, column: 12, scope: !362)
!369 = !DILocation(line: 58, column: 16, scope: !362)
!370 = !DILocalVariable(name: "$ret2", scope: !343, file: !10, line: 53, type: !346)
!371 = !DILocation(line: 53, column: 57, scope: !343)
!372 = !DILocation(line: 58, column: 2, scope: !362)
!373 = distinct !DISubprogram(name: "ios.idSliceToIntSlice", scope: null, file: !10, line: 67, type: !374, isLocal: true, isDefinition: true, scopeLine: 67, isOptimized: false, unit: !1, retainedNodes: !3)
!374 = !DISubroutineType(types: !375)
!375 = !{!326, !137}
!376 = !DILocalVariable(name: "ids", arg: 1, scope: !373, file: !10, line: 67, type: !137)
!377 = !DILocation(line: 67, column: 24, scope: !373)
!378 = !DILocation(line: 68, column: 28, scope: !379)
!379 = distinct !DILexicalBlock(scope: !373, file: !10, line: 67, column: 1)
!380 = !DILocation(line: 68, column: 10, scope: !379)
!381 = !DILocalVariable(name: "ints", scope: !379, file: !10, line: 68, type: !326)
!382 = !DILocation(line: 68, column: 2, scope: !373)
!383 = !DILocalVariable(name: "idx", scope: !384, file: !10, line: 69, type: !19)
!384 = distinct !DILexicalBlock(scope: !379, file: !10, line: 69, column: 2)
!385 = !DILocation(line: 69, column: 6, scope: !379)
!386 = !DILocalVariable(name: "i", scope: !384, file: !10, line: 69, type: !141)
!387 = !DILocation(line: 69, column: 2, scope: !384)
!388 = !DILocation(line: 70, column: 7, scope: !384)
!389 = !DILocation(line: 70, column: 13, scope: !384)
!390 = !DILocalVariable(name: "$ret4", scope: !373, file: !10, line: 67, type: !326)
!391 = !DILocation(line: 67, column: 39, scope: !373)
!392 = !DILocation(line: 72, column: 2, scope: !379)
!393 = distinct !DISubprogram(name: "ios.func1", scope: null, file: !10, line: 55, type: !394, isLocal: true, isDefinition: true, scopeLine: 55, isOptimized: false, unit: !1, retainedNodes: !3)
!394 = !DISubroutineType(types: !395)
!395 = !{!30, !326, !107}
!396 = !DILocalVariable(name: "path", arg: 1, scope: !393, file: !10, line: 55, type: !326)
!397 = !DILocation(line: 55, column: 21, scope: !393)
!398 = !DILocalVariable(name: "node", arg: 2, scope: !393, file: !10, line: 55, type: !107)
!399 = !DILocation(line: 55, column: 35, scope: !393)
!400 = !DILocation(line: 56, column: 3, scope: !393)
!401 = !DILocation(line: 56, column: 11, scope: !393)
!402 = distinct !DISubprogram(name: "ios.Build..1command_line_arguments.ProgressView", linkageName: "command_line_arguments.ProgressView.Build", scope: null, file: !403, line: 41, type: !404, isLocal: false, isDefinition: true, scopeLine: 41, isOptimized: false, unit: !1, retainedNodes: !3)
!403 = !DIFile(filename: "progressview.go", directory: ".")
!404 = !DISubroutineType(types: !405)
!405 = !{!144, !406, !406, !126}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProgressView", file: !403, line: 17, size: 1088, align: 8, elements: !408)
!408 = !{!409, !429, !430, !442, !443, !445}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Embed", file: !403, line: 18, baseType: !410, size: 576, align: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "Embed", file: !10, line: 8, size: 576, align: 8, elements: !411)
!411 = !{!412, !413, !414, !420, !427}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !10, line: 8, baseType: !35, size: 128, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !10, line: 8, baseType: !35, size: 128, align: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !10, line: 8, baseType: !415, size: 64, align: 32, offset: 256)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !10, line: 4, size: 64, align: 8, elements: !416)
!416 = !{!417, !419}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !10, line: 4, baseType: !418, size: 32, align: 32)
!418 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !10, line: 4, baseType: !8, size: 32, align: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "relay", file: !10, line: 8, baseType: !421, size: 256, align: 64, offset: 320)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "Relay", file: !10, line: 8, size: 256, align: 8, elements: !422)
!422 = !{!423, !424, !425, !426}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !10, line: 8, baseType: !415, size: 64, align: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "subs", file: !10, line: 8, baseType: !111, size: 64, align: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", file: !10, line: 8, baseType: !111, size: 64, align: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "maxId", file: !10, line: 8, baseType: !141, size: 64, align: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "lastField", file: !10, line: 8, baseType: !428, align: 8, offset: 576)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{}", file: !36, align: 8, elements: !3)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Progress", file: !403, line: 19, baseType: !210, size: 64, align: 64, offset: 576)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ProgressNotifier", file: !403, line: 20, baseType: !431, size: 128, align: 64, offset: 640)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "Float64Notifier", file: !10, line: 8, size: 128, align: 8, elements: !432)
!432 = !{!433, !142}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 8, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*__go_descriptor)Id,*func(*void,Id)void,*func(*void)float64}", file: !36, size: 256, align: 8, elements: !436)
!436 = !{!132, !247, !437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Unnotify", file: !36, line: 8, baseType: !176, size: 64, align: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !36, line: 8, baseType: !439, size: 64, align: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!210, !57}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ProgressColor", file: !403, line: 21, baseType: !256, size: 128, align: 64, offset: 768)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "PaintStyle", file: !403, line: 22, baseType: !444, size: 64, align: 64, offset: 896)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "progressNotifier", file: !403, line: 23, baseType: !431, size: 128, align: 64, offset: 960)
!446 = !DILocalVariable(name: "v", arg: 1, scope: !402, file: !403, line: 41, type: !406)
!447 = !DILocation(line: 41, column: 1, scope: !402)
!448 = !DILocalVariable(name: "ctx", arg: 2, scope: !402, file: !403, line: 41, type: !126)
!449 = !DILocation(line: 41, column: 30, scope: !402)
!450 = !DILocation(line: 42, column: 7, scope: !451)
!451 = distinct !DILexicalBlock(scope: !402, file: !403, line: 41, column: 1)
!452 = !DILocalVariable(name: "l", scope: !451, file: !403, line: 42, type: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "Layouter", file: !403, line: 9, size: 2112, align: 8, elements: !455)
!455 = !{!456, !468, !469, !470, !504, !505, !516, !517, !518, !519}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Guide", file: !403, line: 9, baseType: !457, size: 384, align: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Guide", file: !403, line: 9, size: 384, align: 8, elements: !458)
!458 = !{!459, !460, !461, !467}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !403, line: 9, baseType: !19, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "system", file: !403, line: 9, baseType: !57, size: 64, align: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "children2", file: !403, line: 9, baseType: !462, size: 192, align: 64, offset: 128)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Guide,int,int}", file: !36, size: 192, align: 8, elements: !463)
!463 = !{!464, !86, !87}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "matchaGuide", file: !403, line: 9, baseType: !218, size: 64, align: 64, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "min", file: !403, line: 9, baseType: !457, size: 384, align: 64, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "max", file: !403, line: 9, baseType: !457, size: 384, align: 64, offset: 768)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "solvers", file: !403, line: 9, baseType: !471, size: 192, align: 64, offset: 1152)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Solver,int,int}", file: !36, size: 192, align: 8, elements: !472)
!472 = !{!473, !86, !87}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !474, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "Solver", file: !403, line: 9, size: 320, align: 8, elements: !477)
!477 = !{!478, !479, !480}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "debug", file: !403, line: 9, baseType: !66, size: 8, align: 8)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !403, line: 9, baseType: !19, size: 64, align: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", file: !403, line: 9, baseType: !481, size: 192, align: 64, offset: 128)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.gomatcha.io/matcha/layout/constraint.constraint,int,int}", file: !36, size: 192, align: 8, elements: !482)
!482 = !{!483, !86, !87}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !484, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: ".gomatcha.io/matcha/layout/constraint.constraint", file: !403, line: 9, size: 256, align: 8, elements: !486)
!486 = !{!487, !489, !491}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", file: !403, line: 9, baseType: !488, size: 64, align: 64)
!488 = !DIBasicType(name: ".gomatcha.io/matcha/layout/constraint.attribute", size: 64, encoding: DW_ATE_signed)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "comparison", file: !403, line: 9, baseType: !490, size: 64, align: 64, offset: 64)
!490 = !DIBasicType(name: ".gomatcha.io/matcha/layout/constraint.comparison", size: 64, encoding: DW_ATE_signed)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "anchor", file: !403, line: 9, baseType: !492, size: 128, align: 64, offset: 128)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: ".gomatcha.io/matcha/layout/constraint.anchor", file: !403, line: 9, size: 128, align: 8, elements: !493)
!493 = !{!494, !503}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !403, line: 9, baseType: !495, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*Layouter)float64}", file: !36, size: 128, align: 8, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !36, line: 9, baseType: !39, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !36, line: 9, baseType: !500, size: 64, align: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!210, !57, !57}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !403, line: 1, baseType: !57, size: 64, align: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "zIndex", file: !403, line: 9, baseType: !19, size: 64, align: 64, offset: 1344)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "notifiers", file: !403, line: 9, baseType: !506, size: 192, align: 64, offset: 1408)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Notifier,int,int}", file: !36, size: 192, align: 8, elements: !507)
!507 = !{!508, !86, !87}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !509, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "Notifier", file: !10, line: 8, size: 128, align: 8, elements: !511)
!511 = !{!512, !142}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 8, baseType: !513, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*__go_descriptor)Id,*func(*void,Id)void}", file: !36, size: 192, align: 8, elements: !515)
!515 = !{!132, !247, !437}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "groupNotifiers", file: !403, line: 9, baseType: !111, size: 64, align: 64, offset: 1600)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "maxId", file: !403, line: 9, baseType: !141, size: 64, align: 64, offset: 1664)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "views", file: !403, line: 9, baseType: !147, size: 192, align: 64, offset: 1728)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "solutions", file: !403, line: 9, baseType: !520, size: 192, align: 64, offset: 1920)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**.gomatcha.io/matcha/layout/constraint.solution,int,int}", file: !36, size: 192, align: 8, elements: !521)
!521 = !{!522, !86, !87}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !523, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: ".gomatcha.io/matcha/layout/constraint.solution", file: !403, line: 9, size: 256, align: 8, elements: !526)
!526 = !{!527, !535}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", file: !403, line: 9, baseType: !528, size: 192, align: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.gomatcha.io/matcha/layout/constraint.resolvedConstraint,int,int}", file: !36, size: 192, align: 8, elements: !529)
!529 = !{!530, !86, !87}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !531, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: ".gomatcha.io/matcha/layout/constraint.resolvedConstraint", file: !403, line: 9, size: 192, align: 8, elements: !533)
!533 = !{!487, !489, !534}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "value", file: !403, line: 9, baseType: !210, size: 64, align: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !403, line: 9, baseType: !19, size: 64, align: 64, offset: 192)
!536 = !DILocation(line: 42, column: 2, scope: !402)
!537 = !DILocation(line: 43, column: 10, scope: !451)
!538 = !DILocation(line: 43, column: 3, scope: !451)
!539 = !DILocation(line: 50, column: 6, scope: !451)
!540 = !DILocation(line: 50, column: 28, scope: !451)
!541 = !DILocation(line: 50, column: 24, scope: !451)
!542 = !DILocation(line: 61, column: 24, scope: !451)
!543 = !DILocation(line: 51, column: 25, scope: !451)
!544 = !DILocation(line: 52, column: 19, scope: !451)
!545 = !DILocalVariable(name: "$this2", arg: 1, scope: !546, file: !10, line: 8, type: !406)
!546 = distinct !DISubprogram(name: "ios.Unsubscribe..stub..1command_line_arguments.ProgressView", linkageName: "command_line_arguments.ProgressView.Unsubscribe..stub", scope: null, file: !10, line: 8, type: !547, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!547 = !DISubroutineType(types: !548)
!548 = !{!30, !406, !406, !510}
!549 = !DILocation(line: 8, column: 25, scope: !546, inlinedAt: !550)
!550 = distinct !DILocation(line: 52, column: 5, scope: !451)
!551 = !DILocalVariable(name: "$p3", arg: 2, scope: !546, file: !10, line: 8, type: !510)
!552 = !DILocation(line: 17, column: 6, scope: !553, inlinedAt: !550)
!553 = !DILexicalBlockFile(scope: !546, file: !403, discriminator: 0)
!554 = !DILocation(line: 54, column: 25, scope: !451)
!555 = !DILocation(line: 55, column: 17, scope: !451)
!556 = !DILocalVariable(name: "$this4", arg: 1, scope: !557, file: !10, line: 8, type: !406)
!557 = distinct !DISubprogram(name: "ios.Subscribe..stub..1command_line_arguments.ProgressView", linkageName: "command_line_arguments.ProgressView.Subscribe..stub", scope: null, file: !10, line: 8, type: !547, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!558 = !DILocation(line: 8, column: 25, scope: !557, inlinedAt: !559)
!559 = distinct !DILocation(line: 55, column: 5, scope: !451)
!560 = !DILocalVariable(name: "$p5", arg: 2, scope: !557, file: !10, line: 8, type: !510)
!561 = !DILocation(line: 17, column: 6, scope: !562, inlinedAt: !559)
!562 = !DILexicalBlockFile(scope: !557, file: !403, discriminator: 0)
!563 = !DILocation(line: 57, column: 22, scope: !451)
!564 = !DILocation(line: 60, column: 10, scope: !451)
!565 = !DILocalVariable(name: "val", scope: !451, file: !403, line: 60, type: !210)
!566 = !DILocation(line: 60, column: 2, scope: !402)
!567 = !DILocation(line: 62, column: 27, scope: !451)
!568 = !DILocalVariable(name: "painter", scope: !451, file: !403, line: 65, type: !241)
!569 = !DILocation(line: 65, column: 2, scope: !402)
!570 = !DILocation(line: 66, column: 6, scope: !451)
!571 = !DILocation(line: 66, column: 18, scope: !451)
!572 = !DILocation(line: 75, column: 35, scope: !451)
!573 = !DILocation(line: 75, column: 22, scope: !451)
!574 = !DILocation(line: 73, column: 45, scope: !451)
!575 = !DILocation(line: 73, column: 52, scope: !451)
!576 = !DILocation(line: 73, column: 29, scope: !451)
!577 = !DILocation(line: 71, column: 19, scope: !451)
!578 = !DILocalVariable(name: "$ret6", scope: !402, file: !403, line: 41, type: !144)
!579 = !DILocation(line: 41, column: 48, scope: !402)
!580 = !DILocation(line: 69, column: 2, scope: !451)
!581 = distinct !DISubprogram(name: "ios.Lifecycle..1command_line_arguments.ProgressView", linkageName: "command_line_arguments.ProgressView.Lifecycle", scope: null, file: !403, line: 32, type: !582, isLocal: false, isDefinition: true, scopeLine: 32, isOptimized: false, unit: !1, retainedNodes: !3)
!582 = !DISubroutineType(types: !583)
!583 = !{!30, !406, !406, !165, !165}
!584 = !DILocalVariable(name: "v", arg: 1, scope: !581, file: !403, line: 32, type: !406)
!585 = !DILocation(line: 32, column: 1, scope: !581)
!586 = !DILocalVariable(name: "from", arg: 2, scope: !581, file: !403, line: 32, type: !165)
!587 = !DILocation(line: 32, column: 34, scope: !581)
!588 = !DILocalVariable(name: "to", arg: 3, scope: !581, file: !403, line: 32, type: !165)
!589 = !DILocation(line: 32, column: 40, scope: !581)
!590 = !DILocation(line: 33, column: 10, scope: !581)
!591 = !DILocation(line: 33, column: 2, scope: !581)
!592 = !DILocation(line: 34, column: 7, scope: !581)
!593 = !DILocation(line: 34, column: 25, scope: !581)
!594 = !DILocation(line: 35, column: 19, scope: !581)
!595 = !DILocation(line: 8, column: 25, scope: !546, inlinedAt: !596)
!596 = distinct !DILocation(line: 35, column: 5, scope: !581)
!597 = !DILocation(line: 17, column: 6, scope: !553, inlinedAt: !596)
!598 = distinct !DISubprogram(name: "ios.Notify..stub..1command_line_arguments.ProgressView", linkageName: "command_line_arguments.ProgressView.Notify..stub", scope: null, file: !10, line: 8, type: !599, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!599 = !DISubroutineType(types: !600)
!600 = !{!141, !406, !406, !170}
!601 = !DILocalVariable(name: "$this0", arg: 1, scope: !598, file: !10, line: 8, type: !406)
!602 = !DILocation(line: 8, column: 25, scope: !598)
!603 = !DILocalVariable(name: "$p1", arg: 2, scope: !598, file: !10, line: 8, type: !170)
!604 = !DILocalVariable(name: "$ret28", scope: !598, file: !10, line: 8, type: !141)
!605 = !DILocation(line: 17, column: 6, scope: !606)
!606 = !DILexicalBlockFile(scope: !598, file: !403, discriminator: 0)
!607 = distinct !DISubprogram(name: "ios.Signal..stub..1command_line_arguments.ProgressView", linkageName: "command_line_arguments.ProgressView.Signal..stub", scope: null, file: !10, line: 8, type: !608, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!608 = !DISubroutineType(types: !609)
!609 = !{!30, !406, !406}
!610 = !DILocalVariable(name: "$this6", arg: 1, scope: !607, file: !10, line: 8, type: !406)
!611 = !DILocation(line: 8, column: 25, scope: !607)
!612 = !DILocation(line: 17, column: 6, scope: !613)
!613 = !DILexicalBlockFile(scope: !607, file: !403, discriminator: 0)
!614 = !DILocation(line: 8, column: 25, scope: !557)
!615 = !DILocation(line: 17, column: 6, scope: !562)
!616 = distinct !DISubprogram(name: "ios.Unnotify..stub..1command_line_arguments.ProgressView", linkageName: "command_line_arguments.ProgressView.Unnotify..stub", scope: null, file: !10, line: 8, type: !617, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!617 = !DISubroutineType(types: !618)
!618 = !{!30, !406, !406, !141}
!619 = !DILocalVariable(name: "$this8", arg: 1, scope: !616, file: !10, line: 8, type: !406)
!620 = !DILocation(line: 8, column: 25, scope: !616)
!621 = !DILocalVariable(name: "$p9", arg: 2, scope: !616, file: !10, line: 8, type: !141)
!622 = !DILocation(line: 17, column: 6, scope: !623)
!623 = !DILexicalBlockFile(scope: !616, file: !403, discriminator: 0)
!624 = !DILocation(line: 8, column: 25, scope: !546)
!625 = !DILocation(line: 17, column: 6, scope: !553)
!626 = distinct !DISubprogram(name: "ios.Update..stub..1command_line_arguments.ProgressView", linkageName: "command_line_arguments.ProgressView.Update..stub", scope: null, file: !10, line: 8, type: !627, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!627 = !DISubroutineType(types: !628)
!628 = !{!30, !406, !406, !151}
!629 = !DILocalVariable(name: "$this10", arg: 1, scope: !626, file: !10, line: 8, type: !406)
!630 = !DILocation(line: 8, column: 25, scope: !626)
!631 = !DILocalVariable(name: "$p11", arg: 2, scope: !626, file: !10, line: 8, type: !151)
!632 = !DILocation(line: 17, column: 6, scope: !633)
!633 = !DILexicalBlockFile(scope: !626, file: !403, discriminator: 0)
!634 = distinct !DISubprogram(name: "ios.ViewKey..stub..1command_line_arguments.ProgressView", linkageName: "command_line_arguments.ProgressView.ViewKey..stub", scope: null, file: !10, line: 8, type: !635, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!635 = !DISubroutineType(types: !636)
!636 = !{!35, !406, !406}
!637 = !DILocalVariable(name: "$this7", arg: 1, scope: !634, file: !10, line: 8, type: !406)
!638 = !DILocation(line: 8, column: 25, scope: !634)
!639 = !DILocation(line: 17, column: 6, scope: !640)
!640 = !DILexicalBlockFile(scope: !634, file: !403, discriminator: 0)
!641 = distinct !DISubprogram(name: "ios.NewProgressView", linkageName: "command_line_arguments.NewProgressView", scope: null, file: !403, line: 27, type: !642, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!642 = !DISubroutineType(types: !643)
!643 = !{!406}
!644 = !DILocalVariable(name: "$ret5", scope: !641, file: !403, line: 27, type: !406)
!645 = !DILocation(line: 27, column: 24, scope: !641)
!646 = !DILocation(line: 28, column: 9, scope: !641)
!647 = !DILocation(line: 28, column: 2, scope: !641)
!648 = distinct !DISubprogram(name: "ios.func1", scope: null, file: !403, line: 43, type: !649, isLocal: true, isDefinition: true, scopeLine: 43, isOptimized: false, unit: !1, retainedNodes: !3)
!649 = !DISubroutineType(types: !650)
!650 = !{!30, !475}
!651 = !DILocalVariable(name: "s", arg: 1, scope: !648, file: !403, line: 43, type: !475)
!652 = !DILocation(line: 43, column: 15, scope: !648)
!653 = !DILocation(line: 44, column: 4, scope: !648)
!654 = !DILocation(line: 45, column: 16, scope: !648)
!655 = !DILocation(line: 45, column: 17, scope: !648)
!656 = !DILocation(line: 45, column: 28, scope: !648)
!657 = !DILocation(line: 45, column: 4, scope: !648)
!658 = !DILocation(line: 46, column: 14, scope: !648)
!659 = !DILocation(line: 46, column: 15, scope: !648)
!660 = !DILocation(line: 46, column: 26, scope: !648)
!661 = !DILocation(line: 46, column: 4, scope: !648)
!662 = !DILocation(line: 47, column: 15, scope: !648)
!663 = !DILocation(line: 47, column: 16, scope: !648)
!664 = !DILocation(line: 47, column: 27, scope: !648)
!665 = !DILocation(line: 47, column: 4, scope: !648)
!666 = distinct !DISubprogram(name: "ios.Build..1command_line_arguments.SegmentView", linkageName: "command_line_arguments.SegmentView.Build", scope: null, file: !667, line: 32, type: !668, isLocal: false, isDefinition: true, scopeLine: 32, isOptimized: false, unit: !1, retainedNodes: !3)
!667 = !DIFile(filename: "segmentview.go", directory: ".")
!668 = !DISubroutineType(types: !669)
!669 = !{!144, !670, !670, !126}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "SegmentView", file: !667, line: 14, size: 1024, align: 8, elements: !672)
!672 = !{!673, !674, !675, !676, !680, !681, !689}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Embed", file: !667, line: 15, baseType: !410, size: 576, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", file: !667, line: 16, baseType: !66, size: 8, align: 8, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Momentary", file: !667, line: 17, baseType: !66, size: 8, align: 8, offset: 584)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Titles", file: !667, line: 18, baseType: !677, size: 192, align: 64, offset: 640)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !36, size: 192, align: 8, elements: !678)
!678 = !{!679, !86, !87}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !69, size: 64, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !667, line: 19, baseType: !19, size: 64, align: 64, offset: 832)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "OnChange", file: !667, line: 20, baseType: !682, size: 64, align: 64, offset: 896)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !667, line: 20, size: 64, align: 8, elements: !684)
!684 = !{!685}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !667, line: 20, baseType: !686, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!30, !19}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "PaintStyle", file: !667, line: 21, baseType: !444, size: 64, align: 64, offset: 960)
!690 = !DILocalVariable(name: "param", arg: 1, scope: !666, file: !667, line: 32, type: !670)
!691 = !DILocation(line: 32, column: 1, scope: !666)
!692 = !DILocalVariable(name: "ctx", arg: 2, scope: !666, file: !667, line: 32, type: !126)
!693 = !DILocation(line: 32, column: 29, scope: !666)
!694 = !DILocalVariable(name: "v", scope: !666, file: !667, line: 32, type: !695)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!696 = !DILocation(line: 33, column: 7, scope: !697)
!697 = distinct !DILexicalBlock(scope: !666, file: !667, line: 32, column: 1)
!698 = !DILocalVariable(name: "l", scope: !697, file: !667, line: 33, type: !453)
!699 = !DILocation(line: 33, column: 2, scope: !666)
!700 = !DILocation(line: 34, column: 10, scope: !697)
!701 = !DILocation(line: 34, column: 3, scope: !697)
!702 = !DILocalVariable(name: "painter", scope: !697, file: !667, line: 41, type: !241)
!703 = !DILocation(line: 41, column: 2, scope: !666)
!704 = !DILocation(line: 42, column: 5, scope: !697)
!705 = !DILocation(line: 42, column: 6, scope: !697)
!706 = !DILocation(line: 42, column: 18, scope: !697)
!707 = !DILocation(line: 50, column: 22, scope: !697)
!708 = !DILocation(line: 51, column: 16, scope: !697)
!709 = !DILocation(line: 53, column: 16, scope: !697)
!710 = !DILocation(line: 52, column: 16, scope: !697)
!711 = !DILocation(line: 49, column: 45, scope: !697)
!712 = !DILocation(line: 49, column: 52, scope: !697)
!713 = !DILocation(line: 49, column: 29, scope: !697)
!714 = !DILocation(line: 55, column: 16, scope: !697)
!715 = !DILocation(line: 56, column: 16, scope: !697)
!716 = !DILocation(line: 47, column: 19, scope: !697)
!717 = !DILocalVariable(name: "$ret8", scope: !666, file: !667, line: 32, type: !144)
!718 = !DILocation(line: 32, column: 47, scope: !666)
!719 = !DILocation(line: 45, column: 2, scope: !697)
!720 = distinct !DISubprogram(name: "ios.Lifecycle..stub..1command_line_arguments.SegmentView", linkageName: "command_line_arguments.SegmentView.Lifecycle..stub", scope: null, file: !10, line: 8, type: !721, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!721 = !DISubroutineType(types: !722)
!722 = !{!30, !670, !670, !165, !165}
!723 = !DILocalVariable(name: "$this31", arg: 1, scope: !720, file: !10, line: 8, type: !670)
!724 = !DILocation(line: 8, column: 25, scope: !720)
!725 = !DILocalVariable(name: "$p32", arg: 2, scope: !720, file: !10, line: 8, type: !165)
!726 = !DILocalVariable(name: "$p33", arg: 3, scope: !720, file: !10, line: 8, type: !165)
!727 = !DILocation(line: 14, column: 6, scope: !728)
!728 = !DILexicalBlockFile(scope: !720, file: !667, discriminator: 0)
!729 = distinct !DISubprogram(name: "ios.Notify..stub..1command_line_arguments.SegmentView", linkageName: "command_line_arguments.SegmentView.Notify..stub", scope: null, file: !10, line: 8, type: !730, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!730 = !DISubroutineType(types: !731)
!731 = !{!141, !670, !670, !170}
!732 = !DILocalVariable(name: "$this23", arg: 1, scope: !729, file: !10, line: 8, type: !670)
!733 = !DILocation(line: 8, column: 25, scope: !729)
!734 = !DILocalVariable(name: "$p24", arg: 2, scope: !729, file: !10, line: 8, type: !170)
!735 = !DILocalVariable(name: "$ret30", scope: !729, file: !10, line: 8, type: !141)
!736 = !DILocation(line: 14, column: 6, scope: !737)
!737 = !DILexicalBlockFile(scope: !729, file: !667, discriminator: 0)
!738 = distinct !DISubprogram(name: "ios.Signal..stub..1command_line_arguments.SegmentView", linkageName: "command_line_arguments.SegmentView.Signal..stub", scope: null, file: !10, line: 8, type: !739, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!739 = !DISubroutineType(types: !740)
!740 = !{!30, !670, !670}
!741 = !DILocalVariable(name: "$this29", arg: 1, scope: !738, file: !10, line: 8, type: !670)
!742 = !DILocation(line: 8, column: 25, scope: !738)
!743 = !DILocation(line: 14, column: 6, scope: !744)
!744 = !DILexicalBlockFile(scope: !738, file: !667, discriminator: 0)
!745 = distinct !DISubprogram(name: "ios.Subscribe..stub..1command_line_arguments.SegmentView", linkageName: "command_line_arguments.SegmentView.Subscribe..stub", scope: null, file: !10, line: 8, type: !746, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!746 = !DISubroutineType(types: !747)
!747 = !{!30, !670, !670, !510}
!748 = !DILocalVariable(name: "$this27", arg: 1, scope: !745, file: !10, line: 8, type: !670)
!749 = !DILocation(line: 8, column: 25, scope: !745)
!750 = !DILocalVariable(name: "$p28", arg: 2, scope: !745, file: !10, line: 8, type: !510)
!751 = !DILocation(line: 14, column: 6, scope: !752)
!752 = !DILexicalBlockFile(scope: !745, file: !667, discriminator: 0)
!753 = distinct !DISubprogram(name: "ios.Unnotify..stub..1command_line_arguments.SegmentView", linkageName: "command_line_arguments.SegmentView.Unnotify..stub", scope: null, file: !10, line: 8, type: !754, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!754 = !DISubroutineType(types: !755)
!755 = !{!30, !670, !670, !141}
!756 = !DILocalVariable(name: "$this34", arg: 1, scope: !753, file: !10, line: 8, type: !670)
!757 = !DILocation(line: 8, column: 25, scope: !753)
!758 = !DILocalVariable(name: "$p35", arg: 2, scope: !753, file: !10, line: 8, type: !141)
!759 = !DILocation(line: 14, column: 6, scope: !760)
!760 = !DILexicalBlockFile(scope: !753, file: !667, discriminator: 0)
!761 = distinct !DISubprogram(name: "ios.Unsubscribe..stub..1command_line_arguments.SegmentView", linkageName: "command_line_arguments.SegmentView.Unsubscribe..stub", scope: null, file: !10, line: 8, type: !746, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!762 = !DILocalVariable(name: "$this25", arg: 1, scope: !761, file: !10, line: 8, type: !670)
!763 = !DILocation(line: 8, column: 25, scope: !761)
!764 = !DILocalVariable(name: "$p26", arg: 2, scope: !761, file: !10, line: 8, type: !510)
!765 = !DILocation(line: 14, column: 6, scope: !766)
!766 = !DILexicalBlockFile(scope: !761, file: !667, discriminator: 0)
!767 = distinct !DISubprogram(name: "ios.Update..stub..1command_line_arguments.SegmentView", linkageName: "command_line_arguments.SegmentView.Update..stub", scope: null, file: !10, line: 8, type: !768, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!768 = !DISubroutineType(types: !769)
!769 = !{!30, !670, !670, !151}
!770 = !DILocalVariable(name: "$this36", arg: 1, scope: !767, file: !10, line: 8, type: !670)
!771 = !DILocation(line: 8, column: 25, scope: !767)
!772 = !DILocalVariable(name: "$p37", arg: 2, scope: !767, file: !10, line: 8, type: !151)
!773 = !DILocation(line: 14, column: 6, scope: !774)
!774 = !DILexicalBlockFile(scope: !767, file: !667, discriminator: 0)
!775 = distinct !DISubprogram(name: "ios.ViewKey..stub..1command_line_arguments.SegmentView", linkageName: "command_line_arguments.SegmentView.ViewKey..stub", scope: null, file: !10, line: 8, type: !776, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!776 = !DISubroutineType(types: !777)
!777 = !{!35, !670, !670}
!778 = !DILocalVariable(name: "$this30", arg: 1, scope: !775, file: !10, line: 8, type: !670)
!779 = !DILocation(line: 8, column: 25, scope: !775)
!780 = !DILocation(line: 14, column: 6, scope: !781)
!781 = !DILexicalBlockFile(scope: !775, file: !667, discriminator: 0)
!782 = distinct !DISubprogram(name: "ios.NewSegmentView", linkageName: "command_line_arguments.NewSegmentView", scope: null, file: !667, line: 25, type: !783, isLocal: false, isDefinition: true, scopeLine: 25, isOptimized: false, unit: !1, retainedNodes: !3)
!783 = !DISubroutineType(types: !784)
!784 = !{!670}
!785 = !DILocalVariable(name: "$ret7", scope: !782, file: !667, line: 25, type: !670)
!786 = !DILocation(line: 25, column: 23, scope: !782)
!787 = !DILocation(line: 26, column: 9, scope: !782)
!788 = !DILocation(line: 26, column: 2, scope: !782)
!789 = distinct !DISubprogram(name: "ios.func1", scope: null, file: !667, line: 34, type: !649, isLocal: true, isDefinition: true, scopeLine: 34, isOptimized: false, unit: !1, retainedNodes: !3)
!790 = !DILocalVariable(name: "s", arg: 1, scope: !789, file: !667, line: 34, type: !475)
!791 = !DILocation(line: 34, column: 15, scope: !789)
!792 = !DILocation(line: 35, column: 4, scope: !789)
!793 = !DILocation(line: 36, column: 16, scope: !789)
!794 = !DILocation(line: 36, column: 17, scope: !789)
!795 = !DILocation(line: 36, column: 28, scope: !789)
!796 = !DILocation(line: 36, column: 4, scope: !789)
!797 = !DILocation(line: 37, column: 14, scope: !789)
!798 = !DILocation(line: 37, column: 15, scope: !789)
!799 = !DILocation(line: 37, column: 26, scope: !789)
!800 = !DILocation(line: 37, column: 4, scope: !789)
!801 = !DILocation(line: 38, column: 15, scope: !789)
!802 = !DILocation(line: 38, column: 16, scope: !789)
!803 = !DILocation(line: 38, column: 27, scope: !789)
!804 = !DILocation(line: 38, column: 4, scope: !789)
!805 = distinct !DISubprogram(name: "ios.func2", scope: null, file: !667, line: 56, type: !806, isLocal: true, isDefinition: true, scopeLine: 56, isOptimized: false, unit: !1, retainedNodes: !3)
!806 = !DISubroutineType(types: !807)
!807 = !{!30, !296}
!808 = !DILocalVariable(name: "data", arg: 1, scope: !805, file: !667, line: 56, type: !296)
!809 = !DILocation(line: 56, column: 21, scope: !805)
!810 = !DILocation(line: 57, column: 14, scope: !811)
!811 = distinct !DILexicalBlock(scope: !805, file: !667, line: 56, column: 16)
!812 = !DILocalVariable(name: "event", scope: !811, file: !667, line: 57, type: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "SegmentViewEvent", file: !403, line: 12, size: 64, align: 8, elements: !815)
!815 = !{!816}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !403, line: 12, baseType: !330, size: 64, align: 64)
!817 = !DILocation(line: 57, column: 5, scope: !805)
!818 = !DILocation(line: 58, column: 34, scope: !811)
!819 = !DILocation(line: 58, column: 18, scope: !811)
!820 = !DILocalVariable(name: "err", scope: !811, file: !667, line: 58, type: !821)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !822)
!822 = !{!823, !828}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !824, size: 64, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !36, size: 128, align: 8, elements: !826)
!826 = !{!38, !827}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !36, line: 1, baseType: !291, size: 64, align: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !57, size: 64, align: 64, offset: 64)
!829 = !DILocation(line: 58, column: 5, scope: !805)
!830 = !DILocation(line: 59, column: 12, scope: !811)
!831 = !DILocation(line: 60, column: 10, scope: !811)
!832 = !DILocation(line: 60, column: 27, scope: !811)
!833 = !DILocation(line: 61, column: 6, scope: !811)
!834 = !DILocation(line: 64, column: 5, scope: !811)
!835 = !DILocation(line: 64, column: 6, scope: !811)
!836 = !DILocation(line: 64, column: 24, scope: !811)
!837 = !DILocation(line: 64, column: 13, scope: !811)
!838 = !DILocation(line: 65, column: 8, scope: !811)
!839 = !DILocation(line: 65, column: 9, scope: !811)
!840 = !DILocation(line: 65, column: 19, scope: !811)
!841 = !DILocation(line: 66, column: 7, scope: !811)
!842 = !DILocation(line: 66, column: 18, scope: !811)
!843 = distinct !DISubprogram(name: "ios.Notify..1command_line_arguments.Stack", linkageName: "command_line_arguments.Stack.Notify", scope: null, file: !844, line: 71, type: !845, isLocal: false, isDefinition: true, scopeLine: 71, isOptimized: false, unit: !1, retainedNodes: !3)
!844 = !DIFile(filename: "stackview.go", directory: ".")
!845 = !DISubroutineType(types: !846)
!846 = !{!141, !847, !847, !170}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stack", file: !844, line: 21, size: 576, align: 8, elements: !849)
!849 = !{!850, !851, !852, !853}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "relay", file: !844, line: 22, baseType: !421, size: 256, align: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "childIds", file: !844, line: 23, baseType: !326, size: 192, align: 64, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "childrenMap", file: !844, line: 24, baseType: !111, size: 64, align: 64, offset: 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "maxId", file: !844, line: 25, baseType: !330, size: 64, align: 64, offset: 512)
!854 = !DILocalVariable(name: "s", arg: 1, scope: !843, file: !844, line: 71, type: !847)
!855 = !DILocation(line: 71, column: 1, scope: !843)
!856 = !DILocalVariable(name: "f", arg: 2, scope: !843, file: !844, line: 71, type: !170)
!857 = !DILocation(line: 71, column: 24, scope: !843)
!858 = !DILocalVariable(name: "$ret10", scope: !843, file: !844, line: 71, type: !141)
!859 = !DILocation(line: 71, column: 34, scope: !843)
!860 = !DILocation(line: 72, column: 10, scope: !843)
!861 = !DILocation(line: 72, column: 16, scope: !843)
!862 = !DILocation(line: 72, column: 2, scope: !843)
!863 = distinct !DISubprogram(name: "ios.Pop..1command_line_arguments.Stack", linkageName: "command_line_arguments.Stack.Pop", scope: null, file: !844, line: 62, type: !864, isLocal: false, isDefinition: true, scopeLine: 62, isOptimized: false, unit: !1, retainedNodes: !3)
!864 = !DISubroutineType(types: !865)
!865 = !{!30, !847, !847}
!866 = !DILocalVariable(name: "s", arg: 1, scope: !863, file: !844, line: 62, type: !847)
!867 = !DILocation(line: 62, column: 1, scope: !863)
!868 = !DILocation(line: 63, column: 10, scope: !863)
!869 = !DILocation(line: 63, column: 21, scope: !863)
!870 = !DILocation(line: 64, column: 3, scope: !863)
!871 = !DILocation(line: 66, column: 50, scope: !863)
!872 = !DILocation(line: 66, column: 10, scope: !863)
!873 = !DILocation(line: 66, column: 34, scope: !863)
!874 = !DILocation(line: 66, column: 2, scope: !863)
!875 = !DILocation(line: 67, column: 32, scope: !863)
!876 = !DILocation(line: 67, column: 42, scope: !863)
!877 = !DILocation(line: 67, column: 25, scope: !863)
!878 = !DILocation(line: 67, column: 13, scope: !863)
!879 = !DILocation(line: 68, column: 3, scope: !863)
!880 = !DILocation(line: 68, column: 9, scope: !863)
!881 = distinct !DISubprogram(name: "ios.Push..1command_line_arguments.Stack", linkageName: "command_line_arguments.Stack.Push", scope: null, file: !844, line: 54, type: !882, isLocal: false, isDefinition: true, scopeLine: 54, isOptimized: false, unit: !1, retainedNodes: !3)
!882 = !DISubroutineType(types: !883)
!883 = !{!30, !847, !847, !151}
!884 = !DILocalVariable(name: "s", arg: 1, scope: !881, file: !844, line: 54, type: !847)
!885 = !DILocation(line: 54, column: 1, scope: !881)
!886 = !DILocalVariable(name: "vs", arg: 2, scope: !881, file: !844, line: 54, type: !151)
!887 = !DILocation(line: 54, column: 22, scope: !881)
!888 = !DILocation(line: 55, column: 3, scope: !881)
!889 = !DILocation(line: 55, column: 10, scope: !881)
!890 = !DILocation(line: 57, column: 3, scope: !881)
!891 = !DILocation(line: 57, column: 15, scope: !881)
!892 = !DILocation(line: 57, column: 13, scope: !881)
!893 = !DILocation(line: 58, column: 17, scope: !881)
!894 = !DILocation(line: 58, column: 3, scope: !881)
!895 = !DILocation(line: 58, column: 25, scope: !881)
!896 = !DILocation(line: 59, column: 3, scope: !881)
!897 = !DILocation(line: 59, column: 9, scope: !881)
!898 = distinct !DISubprogram(name: "ios.SetViews..1command_line_arguments.Stack", linkageName: "command_line_arguments.Stack.SetViews", scope: null, file: !844, line: 28, type: !899, isLocal: false, isDefinition: true, scopeLine: 28, isOptimized: false, unit: !1, retainedNodes: !3)
!899 = !DISubroutineType(types: !900)
!900 = !{!30, !847, !847, !147}
!901 = !DILocalVariable(name: "vs", arg: 2, scope: !898, file: !844, line: 28, type: !147)
!902 = !DILocation(line: 28, column: 26, scope: !898)
!903 = !DILocalVariable(name: "s", arg: 1, scope: !898, file: !844, line: 28, type: !847)
!904 = !DILocation(line: 28, column: 1, scope: !898)
!905 = !DILocation(line: 29, column: 6, scope: !898)
!906 = !DILocation(line: 29, column: 19, scope: !898)
!907 = !DILocation(line: 33, column: 2, scope: !908)
!908 = distinct !DILexicalBlock(scope: !898, file: !844, line: 33, column: 2)
!909 = !DILocation(line: 30, column: 19, scope: !898)
!910 = !DILocation(line: 30, column: 17, scope: !898)
!911 = !DILocation(line: 34, column: 4, scope: !908)
!912 = !DILocation(line: 34, column: 11, scope: !908)
!913 = !DILocation(line: 35, column: 16, scope: !908)
!914 = !DILocation(line: 35, column: 14, scope: !908)
!915 = !DILocation(line: 36, column: 18, scope: !908)
!916 = !DILocation(line: 36, column: 4, scope: !908)
!917 = !DILocation(line: 36, column: 26, scope: !908)
!918 = !DILocation(line: 38, column: 3, scope: !898)
!919 = !DILocation(line: 38, column: 9, scope: !898)
!920 = distinct !DISubprogram(name: "ios.Unnotify..1command_line_arguments.Stack", linkageName: "command_line_arguments.Stack.Unnotify", scope: null, file: !844, line: 75, type: !921, isLocal: false, isDefinition: true, scopeLine: 75, isOptimized: false, unit: !1, retainedNodes: !3)
!921 = !DISubroutineType(types: !922)
!922 = !{!30, !847, !847, !141}
!923 = !DILocalVariable(name: "s", arg: 1, scope: !920, file: !844, line: 75, type: !847)
!924 = !DILocation(line: 75, column: 1, scope: !920)
!925 = !DILocalVariable(name: "id", arg: 2, scope: !920, file: !844, line: 75, type: !141)
!926 = !DILocation(line: 75, column: 26, scope: !920)
!927 = !DILocation(line: 76, column: 3, scope: !920)
!928 = !DILocation(line: 76, column: 9, scope: !920)
!929 = distinct !DISubprogram(name: "ios.Views..1command_line_arguments.Stack", linkageName: "command_line_arguments.Stack.Views", scope: null, file: !844, line: 46, type: !930, isLocal: false, isDefinition: true, scopeLine: 46, isOptimized: false, unit: !1, retainedNodes: !3)
!930 = !DISubroutineType(types: !931)
!931 = !{!147, !847, !847}
!932 = !DILocalVariable(name: "s", arg: 1, scope: !929, file: !844, line: 46, type: !847)
!933 = !DILocation(line: 46, column: 1, scope: !929)
!934 = !DILocation(line: 47, column: 8, scope: !935)
!935 = distinct !DILexicalBlock(scope: !929, file: !844, line: 46, column: 1)
!936 = !DILocalVariable(name: "vs", scope: !935, file: !844, line: 47, type: !147)
!937 = !DILocation(line: 47, column: 2, scope: !929)
!938 = !DILocalVariable(name: "i", scope: !939, file: !844, line: 48, type: !330)
!939 = distinct !DILexicalBlock(scope: !935, file: !844, line: 48, column: 2)
!940 = !DILocation(line: 48, column: 6, scope: !935)
!941 = !DILocation(line: 48, column: 21, scope: !939)
!942 = !DILocation(line: 48, column: 2, scope: !939)
!943 = !DILocation(line: 49, column: 20, scope: !939)
!944 = !DILocation(line: 49, column: 32, scope: !939)
!945 = !DILocation(line: 49, column: 8, scope: !939)
!946 = !DILocation(line: 49, column: 6, scope: !939)
!947 = !DILocation(line: 0, scope: !939)
!948 = !DILocalVariable(name: "$ret9", scope: !929, file: !844, line: 46, type: !147)
!949 = !DILocation(line: 46, column: 25, scope: !929)
!950 = !DILocation(line: 51, column: 2, scope: !935)
!951 = distinct !DISubprogram(name: "ios.setChildIds..1command_line_arguments.Stack", linkageName: "command_line_arguments.Stack.setChildIds", scope: null, file: !844, line: 41, type: !952, isLocal: false, isDefinition: true, scopeLine: 41, isOptimized: false, unit: !1, retainedNodes: !3)
!952 = !DISubroutineType(types: !953)
!953 = !{!30, !847, !847, !326}
!954 = !DILocalVariable(name: "ids", arg: 2, scope: !951, file: !844, line: 41, type: !326)
!955 = !DILocation(line: 41, column: 29, scope: !951)
!956 = !DILocalVariable(name: "s", arg: 1, scope: !951, file: !844, line: 41, type: !847)
!957 = !DILocation(line: 41, column: 1, scope: !951)
!958 = !DILocation(line: 42, column: 3, scope: !951)
!959 = !DILocation(line: 42, column: 13, scope: !951)
!960 = !DILocation(line: 43, column: 3, scope: !951)
!961 = !DILocation(line: 43, column: 9, scope: !951)
!962 = distinct !DISubprogram(name: "ios.Build..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.Build", scope: null, file: !844, line: 151, type: !963, isLocal: false, isDefinition: true, scopeLine: 151, isOptimized: false, unit: !1, retainedNodes: !3)
!963 = !DISubroutineType(types: !964)
!964 = !{!144, !965, !965, !126}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "StackView", file: !844, line: 110, size: 1024, align: 8, elements: !967)
!967 = !{!968, !969, !970, !976, !977, !978}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "Embed", file: !844, line: 111, baseType: !410, size: 576, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "Stack", file: !844, line: 112, baseType: !847, size: 64, align: 64, offset: 576)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "TitleStyle", file: !844, line: 113, baseType: !971, size: 64, align: 64, offset: 640)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DICompositeType(tag: DW_TAG_structure_type, name: "Style", file: !10, line: 8, size: 128, align: 8, elements: !973)
!973 = !{!974, !975}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", file: !10, line: 8, baseType: !111, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "cleared", file: !10, line: 8, baseType: !111, size: 64, align: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "BarColor", file: !844, line: 114, baseType: !256, size: 128, align: 64, offset: 704)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "ItemTitleStyle", file: !844, line: 115, baseType: !971, size: 64, align: 64, offset: 832)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ItemIconTint", file: !844, line: 116, baseType: !256, size: 128, align: 64, offset: 896)
!979 = !DILocalVariable(name: "param", arg: 1, scope: !962, file: !844, line: 151, type: !965)
!980 = !DILocation(line: 151, column: 1, scope: !962)
!981 = !DILocalVariable(name: "ctx", arg: 2, scope: !962, file: !844, line: 151, type: !126)
!982 = !DILocation(line: 151, column: 27, scope: !962)
!983 = !DILocalVariable(name: "v", scope: !962, file: !844, line: 151, type: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!985 = !DILocation(line: 152, column: 7, scope: !986)
!986 = distinct !DILexicalBlock(scope: !962, file: !844, line: 151, column: 1)
!987 = !DILocalVariable(name: "l", scope: !986, file: !844, line: 152, type: !453)
!988 = !DILocation(line: 152, column: 2, scope: !962)
!989 = !DILocation(line: 154, column: 16, scope: !986)
!990 = !DILocalVariable(name: "childrenPb", scope: !986, file: !844, line: 154, type: !991)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**StackChildView,int,int}", file: !36, size: 192, align: 8, elements: !992)
!992 = !{!993, !86, !87}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DICompositeType(tag: DW_TAG_structure_type, name: "StackChildView", file: !403, line: 12, size: 64, align: 8, elements: !997)
!997 = !{!998}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "ScreenId", file: !403, line: 12, baseType: !330, size: 64, align: 64)
!999 = !DILocation(line: 154, column: 2, scope: !962)
!1000 = !DILocalVariable(name: "id", scope: !1001, file: !844, line: 155, type: !330)
!1001 = distinct !DILexicalBlock(scope: !986, file: !844, line: 155, column: 2)
!1002 = !DILocation(line: 155, column: 6, scope: !986)
!1003 = !DILocation(line: 155, column: 21, scope: !1001)
!1004 = !DILocation(line: 155, column: 22, scope: !1001)
!1005 = !DILocation(line: 155, column: 28, scope: !1001)
!1006 = !DILocation(line: 155, column: 2, scope: !1001)
!1007 = !DILocation(line: 156, column: 11, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1001, file: !844, line: 155, column: 38)
!1009 = !DILocation(line: 156, column: 12, scope: !1008)
!1010 = !DILocation(line: 156, column: 18, scope: !1008)
!1011 = !DILocation(line: 156, column: 30, scope: !1008)
!1012 = !DILocalVariable(name: "chld", scope: !1008, file: !844, line: 156, type: !151)
!1013 = !DILocation(line: 156, column: 3, scope: !1001)
!1014 = !DILocation(line: 160, column: 53, scope: !1008)
!1015 = !DILocation(line: 160, column: 44, scope: !1008)
!1016 = !DILocation(line: 160, column: 25, scope: !1008)
!1017 = !DILocation(line: 162, column: 20, scope: !1008)
!1018 = !DILocation(line: 162, column: 21, scope: !1008)
!1019 = !DILocation(line: 163, column: 21, scope: !1008)
!1020 = !DILocation(line: 159, column: 11, scope: !1008)
!1021 = !DILocation(line: 159, column: 12, scope: !1008)
!1022 = !DILocalVariable(name: "barV", scope: !1008, file: !844, line: 159, type: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.stackBarView", file: !844, line: 222, size: 896, align: 8, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1029}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "Embed", file: !844, line: 223, baseType: !410, size: 576, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "View", file: !844, line: 224, baseType: !151, size: 128, align: 64, offset: 576)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ItemTitleStyle", file: !844, line: 225, baseType: !971, size: 64, align: 64, offset: 704)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ItemIconTint", file: !844, line: 226, baseType: !256, size: 128, align: 64, offset: 768)
!1030 = !DILocation(line: 159, column: 3, scope: !1001)
!1031 = !DILocation(line: 165, column: 3, scope: !1008)
!1032 = !DILocation(line: 165, column: 9, scope: !1008)
!1033 = !DILocation(line: 165, column: 15, scope: !1008)
!1034 = !DILocation(line: 165, column: 4, scope: !1008)
!1035 = !DILocation(line: 173, column: 3, scope: !1008)
!1036 = !DILocation(line: 173, column: 15, scope: !1008)
!1037 = !DILocation(line: 173, column: 4, scope: !1008)
!1038 = !DILocation(line: 182, column: 20, scope: !1008)
!1039 = !DILocation(line: 181, column: 35, scope: !1008)
!1040 = !DILocation(line: 181, column: 42, scope: !1008)
!1041 = !DILocation(line: 181, column: 16, scope: !1008)
!1042 = !DILocation(line: 181, column: 14, scope: !1008)
!1043 = !DILocation(line: 0, scope: !1008)
!1044 = !DILocalVariable(name: "titleTextStyle", scope: !986, file: !844, line: 186, type: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "TextStyle", file: !10, line: 8, size: 1280, align: 8, elements: !1047)
!1047 = !{!1048, !1049, !1051, !1053, !1054, !1055, !1056, !1057, !1058, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1075, !1077, !1078, !1079}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !10, line: 8, baseType: !330, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "TextAlignment", file: !10, line: 8, baseType: !1050, size: 32, align: 32, offset: 64)
!1050 = !DIBasicType(name: "TextAlignment", size: 32, encoding: DW_ATE_signed)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughStyle", file: !10, line: 8, baseType: !1052, size: 32, align: 32, offset: 96)
!1052 = !DIBasicType(name: "StrikethroughStyle", size: 32, encoding: DW_ATE_signed)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "HasStrikethroughColor", file: !10, line: 8, baseType: !66, size: 8, align: 8, offset: 128)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorRed", file: !10, line: 8, baseType: !8, size: 32, align: 32, offset: 160)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorGreen", file: !10, line: 8, baseType: !8, size: 32, align: 32, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorBlue", file: !10, line: 8, baseType: !8, size: 32, align: 32, offset: 224)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "StrikethroughColorAlpha", file: !10, line: 8, baseType: !8, size: 32, align: 32, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineStyle", file: !10, line: 8, baseType: !1059, size: 32, align: 32, offset: 288)
!1059 = !DIBasicType(name: "UnderlineStyle", size: 32, encoding: DW_ATE_signed)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "HasUnderlineColor", file: !10, line: 8, baseType: !66, size: 8, align: 8, offset: 320)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorRed", file: !10, line: 8, baseType: !8, size: 32, align: 32, offset: 352)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorGreen", file: !10, line: 8, baseType: !8, size: 32, align: 32, offset: 384)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorBlue", file: !10, line: 8, baseType: !8, size: 32, align: 32, offset: 416)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "UnderlineColorAlpha", file: !10, line: 8, baseType: !8, size: 32, align: 32, offset: 448)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "Hyphenation", file: !10, line: 8, baseType: !210, size: 64, align: 64, offset: 512)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "LineHeightMultiple", file: !10, line: 8, baseType: !210, size: 64, align: 64, offset: 576)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "MaxLines", file: !10, line: 8, baseType: !330, size: 64, align: 64, offset: 640)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "HasTextColor", file: !10, line: 8, baseType: !66, size: 8, align: 8, offset: 704)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorRed", file: !10, line: 8, baseType: !8, size: 32, align: 32, offset: 736)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorGreen", file: !10, line: 8, baseType: !8, size: 32, align: 32, offset: 768)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorBlue", file: !10, line: 8, baseType: !8, size: 32, align: 32, offset: 800)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "TextColorAlpha", file: !10, line: 8, baseType: !8, size: 32, align: 32, offset: 832)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "Wrap", file: !10, line: 8, baseType: !1074, size: 32, align: 32, offset: 864)
!1074 = !DIBasicType(name: "TextWrap", size: 32, encoding: DW_ATE_signed)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "Truncation", file: !10, line: 8, baseType: !1076, size: 32, align: 32, offset: 896)
!1076 = !DIBasicType(name: "Truncation", size: 32, encoding: DW_ATE_signed)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "TruncationString", file: !10, line: 8, baseType: !13, size: 128, align: 64, offset: 960)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "FontName", file: !10, line: 8, baseType: !13, size: 128, align: 64, offset: 1088)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "FontSize", file: !10, line: 8, baseType: !210, size: 64, align: 64, offset: 1216)
!1080 = !DILocation(line: 186, column: 6, scope: !962)
!1081 = !DILocation(line: 187, column: 5, scope: !986)
!1082 = !DILocation(line: 187, column: 6, scope: !986)
!1083 = !DILocation(line: 187, column: 18, scope: !986)
!1084 = !DILocation(line: 188, column: 32, scope: !986)
!1085 = !DILocation(line: 192, column: 5, scope: !986)
!1086 = !DILocalVariable(name: "itemTitleStyle", scope: !986, file: !844, line: 191, type: !1045)
!1087 = !DILocation(line: 191, column: 6, scope: !962)
!1088 = !DILocation(line: 192, column: 6, scope: !986)
!1089 = !DILocation(line: 192, column: 22, scope: !986)
!1090 = !DILocation(line: 197, column: 19, scope: !986)
!1091 = !DILocation(line: 197, column: 20, scope: !986)
!1092 = !DILocation(line: 204, column: 35, scope: !986)
!1093 = !DILocation(line: 204, column: 36, scope: !986)
!1094 = !DILocation(line: 193, column: 36, scope: !986)
!1095 = !DILocation(line: 204, column: 23, scope: !986)
!1096 = !DILocation(line: 205, column: 35, scope: !986)
!1097 = !DILocation(line: 205, column: 36, scope: !986)
!1098 = !DILocation(line: 205, column: 23, scope: !986)
!1099 = !DILocation(line: 200, column: 45, scope: !986)
!1100 = !DILocation(line: 200, column: 52, scope: !986)
!1101 = !DILocation(line: 200, column: 29, scope: !986)
!1102 = !DILocation(line: 207, column: 16, scope: !986)
!1103 = !DILocation(line: 208, column: 16, scope: !986)
!1104 = !DILocation(line: 198, column: 19, scope: !986)
!1105 = !DILocalVariable(name: "$ret12", scope: !962, file: !844, line: 151, type: !144)
!1106 = !DILocation(line: 151, column: 45, scope: !962)
!1107 = !DILocation(line: 196, column: 2, scope: !986)
!1108 = distinct !DISubprogram(name: "ios.Lifecycle..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.Lifecycle", scope: null, file: !844, line: 128, type: !1109, isLocal: false, isDefinition: true, scopeLine: 128, isOptimized: false, unit: !1, retainedNodes: !3)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!30, !965, !965, !165, !165}
!1111 = !DILocalVariable(name: "v", arg: 1, scope: !1108, file: !844, line: 128, type: !965)
!1112 = !DILocation(line: 128, column: 1, scope: !1108)
!1113 = !DILocalVariable(name: "from", arg: 2, scope: !1108, file: !844, line: 128, type: !165)
!1114 = !DILocation(line: 128, column: 31, scope: !1108)
!1115 = !DILocalVariable(name: "to", arg: 3, scope: !1108, file: !844, line: 128, type: !165)
!1116 = !DILocation(line: 128, column: 37, scope: !1108)
!1117 = !DILocation(line: 129, column: 10, scope: !1108)
!1118 = !DILocation(line: 129, column: 2, scope: !1108)
!1119 = !DILocation(line: 130, column: 7, scope: !1108)
!1120 = !DILocation(line: 134, column: 17, scope: !1108)
!1121 = !DILocation(line: 134, column: 9, scope: !1108)
!1122 = !DILocation(line: 130, column: 14, scope: !1108)
!1123 = !DILocation(line: 131, column: 14, scope: !1108)
!1124 = !DILocation(line: 131, column: 12, scope: !1108)
!1125 = !DILocation(line: 133, column: 16, scope: !1108)
!1126 = !DILocalVariable(name: "$this42", arg: 1, scope: !1127, file: !10, line: 8, type: !965)
!1127 = distinct !DISubprogram(name: "ios.Subscribe..stub..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.Subscribe..stub", scope: null, file: !10, line: 8, type: !1128, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!30, !965, !965, !510}
!1130 = !DILocation(line: 8, column: 25, scope: !1127, inlinedAt: !1131)
!1131 = distinct !DILocation(line: 133, column: 4, scope: !1108)
!1132 = !DILocalVariable(name: "$p43", arg: 2, scope: !1127, file: !10, line: 8, type: !510)
!1133 = !DILocation(line: 110, column: 6, scope: !1134, inlinedAt: !1131)
!1134 = !DILexicalBlockFile(scope: !1127, file: !844, discriminator: 0)
!1135 = !DILocation(line: 135, column: 18, scope: !1108)
!1136 = !DILocalVariable(name: "$this40", arg: 1, scope: !1137, file: !10, line: 8, type: !965)
!1137 = distinct !DISubprogram(name: "ios.Unsubscribe..stub..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.Unsubscribe..stub", scope: null, file: !10, line: 8, type: !1128, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!1138 = !DILocation(line: 8, column: 25, scope: !1137, inlinedAt: !1139)
!1139 = distinct !DILocation(line: 135, column: 4, scope: !1108)
!1140 = !DILocalVariable(name: "$p41", arg: 2, scope: !1137, file: !10, line: 8, type: !510)
!1141 = !DILocation(line: 110, column: 6, scope: !1142, inlinedAt: !1139)
!1142 = !DILexicalBlockFile(scope: !1137, file: !844, discriminator: 0)
!1143 = distinct !DISubprogram(name: "ios.Notify..stub..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.Notify..stub", scope: null, file: !10, line: 8, type: !1144, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!141, !965, !965, !170}
!1146 = !DILocalVariable(name: "$this38", arg: 1, scope: !1143, file: !10, line: 8, type: !965)
!1147 = !DILocation(line: 8, column: 25, scope: !1143)
!1148 = !DILocalVariable(name: "$p39", arg: 2, scope: !1143, file: !10, line: 8, type: !170)
!1149 = !DILocalVariable(name: "$ret32", scope: !1143, file: !10, line: 8, type: !141)
!1150 = !DILocation(line: 110, column: 6, scope: !1151)
!1151 = !DILexicalBlockFile(scope: !1143, file: !844, discriminator: 0)
!1152 = distinct !DISubprogram(name: "ios.Signal..stub..1command_line_arguments.StackView", linkageName: "command_line_arguments.StackView.Signal..stub", scope: null, file: !10, line: 8, type: !1153, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!30, !965, !965}
!1155 = !DILocalVariable(name: "$this44", arg: 1, scope: !1152, file: !10, line: 8, type: !965)
!1156 = !DILocation(line: 8, column: 25, scope: !1152)
!1157 = !DILocation(line: 110, column: 6, scope: !1158)
!1158 = !DILexicalBlockFile(scope: !1152, file: !844, discriminator: 0)
!1159 = !DILocation(line: 8, column: 25, scope: !1127)
!1160 = !DILocation(line: 110, column: 6, scope: !1134)
