; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22cli\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22gob\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/gob\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/gob\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./cli.go", directory: "/home/wangcong/go_path/src/github.com/spolu/warp/client")
!3 = !{}
!4 = !{!5, !28, !30, !256, !259, !277}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.Registrar", linkageName: "command_line_arguments.Registrar", scope: !1, file: !7, line: 30, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "cli.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !10, line: 1, size: 384, align: 8, elements: !11)
!10 = !DIFile(filename: "<built-in>", directory: "")
!11 = !{!12, !14, !16, !17, !19, !21, !24, !25, !27}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !10, line: 1, baseType: !13, size: 64, align: 64)
!13 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !10, line: 1, baseType: !15, size: 8, align: 8, offset: 64)
!15 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !10, line: 1, baseType: !15, size: 8, align: 8, offset: 72)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !10, line: 1, baseType: !18, size: 16, align: 16, offset: 80)
!18 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !10, line: 1, baseType: !20, size: 32, align: 32, offset: 96)
!20 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "void")
!24 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !10, line: 1, baseType: !26, size: 64, align: 64, offset: 256)
!26 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 320)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !10, line: 1, type: !20, isLocal: false, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "command_line_arguments.flagFilterRegexp", linkageName: "command_line_arguments.flagFilterRegexp", scope: !1, file: !7, line: 40, type: !32, isLocal: true, isDefinition: true)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "Regexp", file: !7, line: 5, size: 1280, align: 8, elements: !34)
!34 = !{!35, !105, !110}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "regexpRO", file: !7, line: 5, baseType: !36, size: 1024, align: 64)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.regexpRO", file: !7, line: 5, size: 1024, align: 8, elements: !37)
!37 = !{!38, !44, !70, !87, !88, !92, !94, !95, !96, !98, !99, !104}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "expr", file: !7, line: 5, baseType: !39, size: 128, align: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !10, line: 1, size: 128, align: 8, elements: !40)
!40 = !{!41, !43}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !10, line: 1, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !10, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "prog", file: !7, line: 5, baseType: !45, size: 64, align: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "Prog", file: !7, line: 5, size: 320, align: 8, elements: !47)
!47 = !{!48, !68, !69}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Inst", file: !7, line: 5, baseType: !49, size: 192, align: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Inst,int,int}", file: !50, size: 192, align: 8, elements: !51)
!50 = !DIFile(filename: "", directory: "")
!51 = !{!52, !66, !67}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inst", file: !7, line: 5, size: 320, align: 8, elements: !55)
!55 = !{!56, !58, !59, !60}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "Op", file: !7, line: 5, baseType: !57, size: 8, align: 8)
!57 = !DIBasicType(name: "InstOp", size: 8, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !7, line: 5, baseType: !20, size: 32, align: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Arg", file: !7, line: 5, baseType: !20, size: 32, align: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Rune", file: !7, line: 5, baseType: !61, size: 192, align: 64, offset: 128)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int32,int,int}", file: !50, size: 192, align: 8, elements: !62)
!62 = !{!63, !66, !67}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !50, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !50, line: 1, baseType: !13, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Start", file: !7, line: 5, baseType: !13, size: 64, align: 64, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "NumCap", file: !7, line: 5, baseType: !13, size: 64, align: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "onepass", file: !7, line: 5, baseType: !71, size: 64, align: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.onePassProg", file: !7, line: 5, size: 320, align: 8, elements: !73)
!73 = !{!74, !68, !69}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Inst", file: !7, line: 5, baseType: !75, size: 192, align: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.regexp.onePassInst,int,int}", file: !50, size: 192, align: 8, elements: !76)
!76 = !{!77, !66, !67}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.onePassInst", file: !7, line: 5, size: 512, align: 8, elements: !80)
!80 = !{!81, !82}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Inst", file: !7, line: 5, baseType: !54, size: 320, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !7, line: 5, baseType: !83, size: 192, align: 64, offset: 320)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint32,int,int}", file: !50, size: 192, align: 8, elements: !84)
!84 = !{!85, !66, !67}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", file: !7, line: 5, baseType: !39, size: 128, align: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "prefixBytes", file: !7, line: 5, baseType: !89, size: 192, align: 64, offset: 384)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !50, size: 192, align: 8, elements: !90)
!90 = !{!91, !66, !67}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !42, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "prefixComplete", file: !7, line: 5, baseType: !93, size: 8, align: 8, offset: 576)
!93 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "prefixRune", file: !7, line: 5, baseType: !65, size: 32, align: 32, offset: 608)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "prefixEnd", file: !7, line: 5, baseType: !20, size: 32, align: 32, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "cond", file: !7, line: 5, baseType: !97, size: 8, align: 8, offset: 672)
!97 = !DIBasicType(name: "EmptyOp", size: 8, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "numSubexp", file: !7, line: 5, baseType: !13, size: 64, align: 64, offset: 704)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "subexpNames", file: !7, line: 5, baseType: !100, size: 192, align: 64, offset: 768)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !50, size: 192, align: 8, elements: !101)
!101 = !{!102, !66, !67}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "longest", file: !7, line: 5, baseType: !93, size: 8, align: 8, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !7, line: 5, baseType: !106, size: 64, align: 32, offset: 1024)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 5, size: 64, align: 8, elements: !107)
!107 = !{!108, !109}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 5, baseType: !65, size: 32, align: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 5, baseType: !20, size: 32, align: 32, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "machine", file: !7, line: 5, baseType: !111, size: 192, align: 64, offset: 1088)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**.regexp.machine,int,int}", file: !50, size: 192, align: 8, elements: !112)
!112 = !{!113, !66, !67}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.machine", file: !7, line: 5, size: 2112, align: 8, elements: !117)
!117 = !{!118, !119, !120, !121, !122, !144, !161, !162, !167, !168, !169, !173, !177}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "re", file: !7, line: 5, baseType: !22, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !7, line: 5, baseType: !45, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "op", file: !7, line: 5, baseType: !71, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "maxBitStateLen", file: !7, line: 5, baseType: !13, size: 64, align: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !7, line: 5, baseType: !123, size: 64, align: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.bitState", file: !7, line: 5, size: 704, align: 8, elements: !125)
!125 = !{!126, !127, !128, !133, !143}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "prog", file: !7, line: 5, baseType: !45, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "end", file: !7, line: 5, baseType: !13, size: 64, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "cap", file: !7, line: 5, baseType: !129, size: 192, align: 64, offset: 128)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !50, size: 192, align: 8, elements: !130)
!130 = !{!131, !66, !67}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", file: !7, line: 5, baseType: !134, size: 192, align: 64, offset: 320)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.regexp.job,int,int}", file: !50, size: 192, align: 8, elements: !135)
!135 = !{!136, !66, !67}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.job", file: !7, line: 5, size: 128, align: 8, elements: !139)
!139 = !{!140, !141, !142}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !7, line: 5, baseType: !20, size: 32, align: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !7, line: 5, baseType: !93, size: 8, align: 8, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pos", file: !7, line: 5, baseType: !13, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "visited", file: !7, line: 5, baseType: !83, size: 192, align: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "q0", file: !7, line: 5, baseType: !145, size: 384, align: 64, offset: 320)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.queue", file: !7, line: 5, size: 384, align: 8, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "sparse", file: !7, line: 5, baseType: !83, size: 192, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "dense", file: !7, line: 5, baseType: !149, size: 192, align: 64, offset: 192)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.regexp.entry,int,int}", file: !50, size: 192, align: 8, elements: !150)
!150 = !{!151, !66, !67}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.entry", file: !7, line: 5, size: 128, align: 8, elements: !154)
!154 = !{!140, !155}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "t", file: !7, line: 5, baseType: !156, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.thread", file: !7, line: 5, size: 256, align: 8, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "inst", file: !7, line: 5, baseType: !53, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "cap", file: !7, line: 5, baseType: !129, size: 192, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "q1", file: !7, line: 5, baseType: !145, size: 384, align: 64, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pool", file: !7, line: 5, baseType: !163, size: 192, align: 64, offset: 1088)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**.regexp.thread,int,int}", file: !50, size: 192, align: 8, elements: !164)
!164 = !{!165, !66, !67}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "matched", file: !7, line: 5, baseType: !93, size: 8, align: 8, offset: 1280)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "matchcap", file: !7, line: 5, baseType: !129, size: 192, align: 64, offset: 1344)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "inputBytes", file: !7, line: 5, baseType: !170, size: 192, align: 64, offset: 1536)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.inputBytes", file: !7, line: 5, size: 192, align: 8, elements: !171)
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "str", file: !7, line: 5, baseType: !89, size: 192, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "inputString", file: !7, line: 5, baseType: !174, size: 128, align: 64, offset: 1728)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.inputString", file: !7, line: 5, size: 128, align: 8, elements: !175)
!175 = !{!176}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "str", file: !7, line: 5, baseType: !39, size: 128, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "inputReader", file: !7, line: 5, baseType: !178, size: 256, align: 64, offset: 1856)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.inputReader", file: !7, line: 5, size: 256, align: 8, elements: !179)
!179 = !{!180, !254, !255}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !7, line: 5, baseType: !181, size: 128, align: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "RuneReader", file: !7, line: 5, size: 128, align: 8, elements: !182)
!182 = !{!183, !253}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 5, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{int32,int,error}}", file: !50, size: 128, align: 8, elements: !186)
!186 = !{!187, !232}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !50, line: 5, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !10, line: 1, size: 576, align: 8, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !196, !197, !205, !213, !214, !215, !231}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !10, line: 1, baseType: !26, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !10, line: 1, baseType: !26, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !10, line: 1, baseType: !20, size: 32, align: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !10, line: 1, baseType: !15, size: 8, align: 8, offset: 160)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !10, line: 1, baseType: !15, size: 8, align: 8, offset: 168)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !10, line: 1, baseType: !15, size: 8, align: 8, offset: 176)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !10, line: 1, baseType: !198, size: 64, align: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 1, size: 64, align: 8, elements: !200)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 1, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!26, !22, !26}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !10, line: 1, baseType: !206, size: 64, align: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 1, size: 64, align: 8, elements: !208)
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 1, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!93, !22, !22}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !10, line: 1, baseType: !42, size: 64, align: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !10, line: 1, baseType: !103, size: 64, align: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !10, line: 1, baseType: !216, size: 64, align: 64, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !10, line: 1, size: 320, align: 8, elements: !218)
!218 = !{!219, !220, !221}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !10, line: 1, baseType: !103, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !10, line: 1, baseType: !103, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !10, line: 1, baseType: !222, size: 192, align: 64, offset: 128)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !50, size: 192, align: 8, elements: !223)
!223 = !{!224, !66, !67}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !10, line: 1, size: 320, align: 8, elements: !227)
!227 = !{!219, !220, !228, !229, !230}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ReadRune", file: !50, line: 5, baseType: !233, size: 64, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!236, !22}
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int32,int,error}", file: !50, size: 256, align: 8, elements: !237)
!237 = !{!238, !239, !240}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !50, line: 5, baseType: !65, size: 32, align: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !50, line: 5, baseType: !13, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !50, line: 5, baseType: !241, size: 128, align: 64, offset: 128)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !10, line: 1, size: 128, align: 8, elements: !242)
!242 = !{!243, !252}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 1, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !50, size: 128, align: 8, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !50, line: 1, baseType: !188, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !50, line: 1, baseType: !249, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!39, !22}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "atEOT", file: !7, line: 5, baseType: !93, size: 8, align: 8, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pos", file: !7, line: 5, baseType: !13, size: 64, align: 64, offset: 192)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "github_com_spolu_warp.EnvWarp", linkageName: "github_com_spolu_warp.EnvWarp", scope: !1, file: !258, line: 11, type: !39, isLocal: false, isDefinition: true)
!258 = !DIFile(filename: "local.go", directory: ".")
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "io_ioutil.Discard", linkageName: "io_ioutil.Discard", scope: !1, file: !261, line: 6, type: !262, isLocal: false, isDefinition: true)
!261 = !DIFile(filename: "config.go", directory: ".")
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !7, line: 6, size: 128, align: 8, elements: !263)
!263 = !{!264, !253}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 6, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !50, size: 128, align: 8, elements: !267)
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !50, line: 6, baseType: !188, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !50, line: 6, baseType: !270, size: 64, align: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !22, !89}
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !50, size: 192, align: 8, elements: !274)
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !50, line: 6, baseType: !13, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !50, line: 6, baseType: !241, size: 128, align: 64, offset: 64)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "github_com_spolu_warp.Version", linkageName: "github_com_spolu_warp.Version", scope: !1, file: !258, line: 11, type: !39, isLocal: false, isDefinition: true)
!279 = distinct !DISubprogram(name: "cli.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 1, type: !280, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!280 = !DISubroutineType(types: !281)
!281 = !{!23}
!282 = !DILocation(line: 1, column: 1, scope: !283)
!283 = !DILexicalBlockFile(scope: !279, file: !10, discriminator: 0)
!284 = !DILocation(line: 30, column: 17, scope: !285)
!285 = !DILexicalBlockFile(scope: !279, file: !7, discriminator: 0)
!286 = !DILocation(line: 30, column: 5, scope: !285)
!287 = !DILocation(line: 40, column: 31, scope: !285)
!288 = !DILocation(line: 40, column: 5, scope: !285)
!289 = distinct !DISubprogram(name: "cli.Run..1command_line_arguments.Cli", linkageName: "command_line_arguments.Cli.Run", scope: null, file: !7, line: 73, type: !290, isLocal: false, isDefinition: true, scopeLine: 73, isOptimized: false, unit: !1, retainedNodes: !3)
!290 = !DISubroutineType(types: !291)
!291 = !{!241, !292, !292}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cli", file: !7, line: 33, size: 384, align: 8, elements: !294)
!294 = !{!295, !363, !364}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Ctx", file: !7, line: 34, baseType: !296, size: 128, align: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !7, line: 4, size: 128, align: 8, elements: !297)
!297 = !{!298, !253}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 4, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,Token)Token}", file: !50, size: 320, align: 8, elements: !301)
!301 = !{!302, !303, !345, !351, !355}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !50, line: 4, baseType: !188, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !50, line: 4, baseType: !304, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!307, !22}
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !50, size: 256, align: 8, elements: !308)
!308 = !{!309, !344}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !50, line: 4, baseType: !310, size: 192, align: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 4, size: 192, align: 8, elements: !311)
!311 = !{!312, !314, !316}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 4, baseType: !313, size: 64, align: 64)
!313 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 4, baseType: !315, size: 64, align: 64, offset: 64)
!315 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 4, baseType: !317, size: 64, align: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 4, size: 704, align: 8, elements: !319)
!319 = !{!320, !321, !330, !341, !342, !343}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 4, baseType: !39, size: 128, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 4, baseType: !322, size: 192, align: 64, offset: 128)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !50, size: 192, align: 8, elements: !323)
!323 = !{!324, !66, !67}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 4, size: 256, align: 8, elements: !327)
!327 = !{!320, !328, !329}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 4, baseType: !13, size: 64, align: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 4, baseType: !93, size: 8, align: 8, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 4, baseType: !331, size: 192, align: 64, offset: 320)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !50, size: 192, align: 8, elements: !332)
!332 = !{!333, !66, !67}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 4, size: 128, align: 8, elements: !336)
!336 = !{!337, !338, !339, !340}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 4, baseType: !315, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 4, baseType: !15, size: 8, align: 8, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 4, baseType: !93, size: 8, align: 8, offset: 72)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 4, baseType: !93, size: 8, align: 8, offset: 80)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 4, baseType: !315, size: 64, align: 64, offset: 512)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 4, baseType: !315, size: 64, align: 64, offset: 576)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 4, baseType: !325, size: 64, align: 64, offset: 640)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !50, line: 4, baseType: !93, size: 8, align: 8, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !50, line: 4, baseType: !346, size: 64, align: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!349, !22}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !10, line: 1, align: 8, elements: !3)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !50, line: 4, baseType: !352, size: 64, align: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!241, !22}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !50, line: 4, baseType: !356, size: 64, align: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!359, !22, !359}
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "Token", file: !261, line: 5, size: 128, align: 8, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !261, line: 1, baseType: !188, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !261, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !7, line: 35, baseType: !8, size: 64, align: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "Args", file: !7, line: 36, baseType: !100, size: 192, align: 64, offset: 192)
!365 = !DILocalVariable(name: "c", arg: 1, scope: !289, file: !7, line: 73, type: !292)
!366 = !DILocation(line: 73, column: 1, scope: !289)
!367 = !DILocation(line: 74, column: 10, scope: !368)
!368 = distinct !DILexicalBlock(scope: !289, file: !7, line: 73, column: 1)
!369 = !DILocation(line: 74, column: 17, scope: !368)
!370 = !DILocation(line: 75, column: 12, scope: !368)
!371 = !DILocation(line: 75, column: 10, scope: !368)
!372 = !DILocation(line: 79, column: 21, scope: !368)
!373 = !DILocation(line: 79, column: 32, scope: !368)
!374 = !DILocalVariable(name: "r", scope: !375, file: !7, line: 80, type: !376)
!375 = distinct !DILexicalBlock(scope: !368, file: !7, line: 80, column: 2)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 30, size: 64, align: 8, elements: !378)
!378 = !{!379}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 30, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!383}
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "Command", file: !7, line: 15, size: 128, align: 8, elements: !384)
!384 = !{!385, !253}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 15, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Context)error,*func(*void,Context)void,*func(*void)CmdName,*func(*void,Context,struct{*string,int,int},*runtime.hmap)error}", file: !50, size: 320, align: 8, elements: !388)
!388 = !{!389, !390, !394, !398, !406}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !50, line: 15, baseType: !188, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Execute", file: !50, line: 15, baseType: !391, size: 64, align: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!241, !22, !296}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Help", file: !50, line: 15, baseType: !395, size: 64, align: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!23, !22, !296}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !50, line: 15, baseType: !399, size: 64, align: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!402, !22}
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "CmdName", file: !7, line: 12, size: 128, align: 8, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !42, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "Parse", file: !50, line: 15, baseType: !407, size: 64, align: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!241, !22, !296, !100, !8}
!410 = !DILocation(line: 80, column: 5, scope: !368)
!411 = !DILocalVariable(name: "ok", scope: !375, file: !7, line: 80, type: !93)
!412 = !DILocation(line: 80, column: 14, scope: !375)
!413 = !DILocation(line: 80, column: 5, scope: !375)
!414 = !DILocation(line: 80, column: 39, scope: !375)
!415 = !DILocation(line: 81, column: 13, scope: !375)
!416 = !DILocation(line: 81, column: 22, scope: !375)
!417 = !DILocation(line: 0, scope: !375)
!418 = !DILocalVariable(name: "command", scope: !368, file: !7, line: 78, type: !383)
!419 = !DILocation(line: 78, column: 6, scope: !289)
!420 = !DILocation(line: 86, column: 16, scope: !368)
!421 = !DILocation(line: 86, column: 37, scope: !368)
!422 = !DILocalVariable(name: "args", scope: !368, file: !7, line: 79, type: !100)
!423 = !DILocation(line: 79, column: 2, scope: !289)
!424 = !DILocalVariable(name: "err", scope: !368, file: !7, line: 86, type: !241)
!425 = !DILocation(line: 86, column: 2, scope: !289)
!426 = !DILocation(line: 87, column: 9, scope: !368)
!427 = !DILocation(line: 83, column: 13, scope: !375)
!428 = !DILocation(line: 88, column: 10, scope: !368)
!429 = !DILocation(line: 89, column: 17, scope: !368)
!430 = !DILocation(line: 89, column: 3, scope: !368)
!431 = !DILocation(line: 92, column: 15, scope: !368)
!432 = !DILocation(line: 93, column: 9, scope: !368)
!433 = !DILocation(line: 94, column: 17, scope: !368)
!434 = !DILocation(line: 94, column: 3, scope: !368)
!435 = !DILocalVariable(name: "$ret2", scope: !289, file: !7, line: 73, type: !241)
!436 = !DILocation(line: 73, column: 21, scope: !289)
!437 = !DILocation(line: 97, column: 2, scope: !368)
!438 = distinct !DISubprogram(name: "cli.New", linkageName: "command_line_arguments.New", scope: null, file: !7, line: 43, type: !439, isLocal: false, isDefinition: true, scopeLine: 43, isOptimized: false, unit: !1, retainedNodes: !3)
!439 = !DISubroutineType(types: !440)
!440 = !{!441, !100}
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Cli,error}", file: !50, size: 192, align: 8, elements: !442)
!442 = !{!443, !444}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 45, baseType: !292, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 45, baseType: !241, size: 128, align: 64, offset: 64)
!445 = !DILocalVariable(name: "argv", arg: 1, scope: !438, file: !7, line: 44, type: !100)
!446 = !DILocation(line: 44, column: 2, scope: !438)
!447 = !DILocalVariable(name: "$ret0", scope: !438, file: !7, line: 45, type: !292)
!448 = !DILocation(line: 45, column: 4, scope: !438)
!449 = !DILocation(line: 46, column: 17, scope: !450)
!450 = distinct !DILexicalBlock(scope: !438, file: !7, line: 43, column: 1)
!451 = !DILocalVariable(name: "ctx", scope: !450, file: !7, line: 46, type: !296)
!452 = !DILocation(line: 46, column: 2, scope: !438)
!453 = !DILocation(line: 48, column: 10, scope: !450)
!454 = !DILocalVariable(name: "args", scope: !450, file: !7, line: 48, type: !100)
!455 = !DILocation(line: 48, column: 2, scope: !438)
!456 = !DILocation(line: 49, column: 11, scope: !450)
!457 = !DILocalVariable(name: "flags", scope: !450, file: !7, line: 49, type: !8)
!458 = !DILocation(line: 49, column: 2, scope: !438)
!459 = !DILocation(line: 51, column: 2, scope: !460)
!460 = distinct !DILexicalBlock(scope: !450, file: !7, line: 51, column: 2)
!461 = !DILocalVariable(name: "a", scope: !460, file: !7, line: 51, type: !39)
!462 = !DILocation(line: 51, column: 6, scope: !450)
!463 = !DILocation(line: 52, column: 6, scope: !460)
!464 = !DILocation(line: 52, column: 22, scope: !460)
!465 = !DILocation(line: 52, column: 3, scope: !460)
!466 = !DILocation(line: 53, column: 16, scope: !467)
!467 = distinct !DILexicalBlock(scope: !460, file: !7, line: 52, column: 38)
!468 = !DILocation(line: 54, column: 17, scope: !467)
!469 = !DILocalVariable(name: "s", scope: !467, file: !7, line: 54, type: !100)
!470 = !DILocation(line: 54, column: 4, scope: !460)
!471 = !DILocation(line: 0, scope: !460)
!472 = !DILocation(line: 61, column: 32, scope: !460)
!473 = !DILocation(line: 61, column: 11, scope: !460)
!474 = !DILocation(line: 56, column: 20, scope: !467)
!475 = !DILocation(line: 56, column: 17, scope: !467)
!476 = !DILocation(line: 58, column: 17, scope: !467)
!477 = !DILocation(line: 61, column: 9, scope: !460)
!478 = !DILocation(line: 65, column: 9, scope: !450)
!479 = !DILocation(line: 65, column: 10, scope: !450)
!480 = !DILocation(line: 65, column: 2, scope: !450)
!481 = distinct !DISubprogram(name: "cli.command_line_arguments.Credentials..hash", linkageName: "command_line_arguments.command_line_arguments.Credentials..hash", scope: null, file: !10, line: 1, type: !203, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!482 = !DILocalVariable(name: "key", arg: 1, scope: !481, file: !10, line: 1, type: !22)
!483 = !DILocation(line: 1, column: 1, scope: !481)
!484 = !DILocalVariable(name: "seed", arg: 2, scope: !481, file: !10, line: 1, type: !26)
!485 = !DILocalVariable(name: "$ret74", scope: !481, file: !10, line: 1, type: !26)
!486 = distinct !DISubprogram(name: "cli.command_line_arguments.Credentials..eq", linkageName: "command_line_arguments.command_line_arguments.Credentials..eq", scope: null, file: !10, line: 1, type: !211, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!487 = !DILocalVariable(name: "key1", arg: 1, scope: !486, file: !10, line: 1, type: !22)
!488 = !DILocation(line: 1, column: 1, scope: !486)
!489 = !DILocalVariable(name: "key2", arg: 2, scope: !486, file: !10, line: 1, type: !22)
!490 = !DILocalVariable(name: "$ret75", scope: !486, file: !10, line: 1, type: !93)
!491 = distinct !DISubprogram(name: "cli.command_line_arguments.Config..hash", linkageName: "command_line_arguments.command_line_arguments.Config..hash", scope: null, file: !10, line: 1, type: !203, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!492 = !DILocalVariable(name: "key", arg: 1, scope: !491, file: !10, line: 1, type: !22)
!493 = !DILocation(line: 1, column: 1, scope: !491)
!494 = !DILocalVariable(name: "seed", arg: 2, scope: !491, file: !10, line: 1, type: !26)
!495 = !DILocalVariable(name: "$ret76", scope: !491, file: !10, line: 1, type: !26)
!496 = distinct !DISubprogram(name: "cli.command_line_arguments.Config..eq", linkageName: "command_line_arguments.command_line_arguments.Config..eq", scope: null, file: !10, line: 1, type: !211, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!497 = !DILocalVariable(name: "key1", arg: 1, scope: !496, file: !10, line: 1, type: !22)
!498 = !DILocation(line: 1, column: 1, scope: !496)
!499 = !DILocalVariable(name: "key2", arg: 2, scope: !496, file: !10, line: 1, type: !22)
!500 = !DILocalVariable(name: "$ret77", scope: !496, file: !10, line: 1, type: !93)
!501 = distinct !DISubprogram(name: "cli.ConfigPath", linkageName: "command_line_arguments.ConfigPath", scope: null, file: !261, line: 27, type: !502, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!502 = !DISubroutineType(types: !503)
!503 = !{!504, !296}
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,error}", file: !50, size: 192, align: 8, elements: !505)
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 29, baseType: !103, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 29, baseType: !241, size: 128, align: 64, offset: 64)
!508 = !DILocalVariable(name: "ctx", arg: 1, scope: !501, file: !261, line: 28, type: !296)
!509 = !DILocation(line: 28, column: 2, scope: !501)
!510 = !DILocalVariable(name: "$ret3", scope: !501, file: !261, line: 29, type: !103)
!511 = !DILocation(line: 29, column: 4, scope: !501)
!512 = !DILocation(line: 30, column: 23, scope: !513)
!513 = distinct !DILexicalBlock(scope: !501, file: !261, line: 27, column: 1)
!514 = !DILocation(line: 30, column: 2, scope: !513)
!515 = !DILocalVariable(name: "path", scope: !513, file: !261, line: 30, type: !103)
!516 = !DILocation(line: 30, column: 2, scope: !501)
!517 = !DILocalVariable(name: "err", scope: !513, file: !261, line: 30, type: !241)
!518 = !DILocation(line: 33, column: 9, scope: !513)
!519 = !DILocation(line: 34, column: 22, scope: !513)
!520 = !DILocalVariable(name: "$ret4", scope: !501, file: !261, line: 29, type: !241)
!521 = !DILocation(line: 29, column: 13, scope: !501)
!522 = !DILocation(line: 34, column: 3, scope: !513)
!523 = !DILocation(line: 37, column: 29, scope: !513)
!524 = !DILocation(line: 37, column: 11, scope: !513)
!525 = !DILocation(line: 38, column: 9, scope: !513)
!526 = !DILocation(line: 39, column: 22, scope: !513)
!527 = !DILocation(line: 39, column: 3, scope: !513)
!528 = !DILocation(line: 42, column: 2, scope: !513)
!529 = distinct !DISubprogram(name: "cli.RetrieveConfig", linkageName: "command_line_arguments.RetrieveConfig", scope: null, file: !261, line: 46, type: !530, isLocal: false, isDefinition: true, scopeLine: 46, isOptimized: false, unit: !1, retainedNodes: !3)
!530 = !DISubroutineType(types: !531)
!531 = !{!532, !296}
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Config,error}", file: !50, size: 192, align: 8, elements: !533)
!533 = !{!534, !543}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 48, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !261, line: 22, size: 256, align: 8, elements: !537)
!537 = !{!538}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Credentials", file: !261, line: 23, baseType: !539, size: 256, align: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "Credentials", file: !261, line: 16, size: 256, align: 8, elements: !540)
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !261, line: 17, baseType: !39, size: 128, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Secret", file: !261, line: 18, baseType: !39, size: 128, align: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 48, baseType: !241, size: 128, align: 64, offset: 64)
!544 = !DILocalVariable(name: "ctx", arg: 1, scope: !529, file: !261, line: 47, type: !296)
!545 = !DILocation(line: 47, column: 2, scope: !529)
!546 = !DILocalVariable(name: "$ret5", scope: !529, file: !261, line: 48, type: !535)
!547 = !DILocation(line: 48, column: 4, scope: !529)
!548 = !DILocation(line: 49, column: 15, scope: !549)
!549 = distinct !DILexicalBlock(scope: !529, file: !261, line: 46, column: 1)
!550 = !DILocalVariable(name: "path", scope: !549, file: !261, line: 49, type: !103)
!551 = !DILocation(line: 49, column: 2, scope: !529)
!552 = !DILocalVariable(name: "err", scope: !549, file: !261, line: 49, type: !241)
!553 = !DILocation(line: 50, column: 9, scope: !549)
!554 = !DILocation(line: 51, column: 22, scope: !549)
!555 = !DILocalVariable(name: "$ret6", scope: !529, file: !261, line: 48, type: !241)
!556 = !DILocation(line: 48, column: 13, scope: !529)
!557 = !DILocation(line: 51, column: 3, scope: !549)
!558 = !DILocation(line: 54, column: 23, scope: !559)
!559 = distinct !DILexicalBlock(scope: !549, file: !261, line: 54, column: 2)
!560 = !DILocation(line: 54, column: 18, scope: !559)
!561 = !DILocalVariable(name: "err", scope: !559, file: !261, line: 54, type: !241)
!562 = !DILocation(line: 54, column: 5, scope: !549)
!563 = !DILocation(line: 54, column: 34, scope: !559)
!564 = !DILocation(line: 54, column: 2, scope: !559)
!565 = !DILocation(line: 55, column: 3, scope: !559)
!566 = !DILocation(line: 58, column: 21, scope: !549)
!567 = !DILocation(line: 59, column: 9, scope: !549)
!568 = !DILocation(line: 60, column: 22, scope: !549)
!569 = !DILocation(line: 60, column: 3, scope: !549)
!570 = !DILocation(line: 63, column: 6, scope: !549)
!571 = !DILocation(line: 64, column: 28, scope: !549)
!572 = !DILocalVariable(name: "raw", scope: !549, file: !261, line: 58, type: !89)
!573 = !DILocation(line: 58, column: 2, scope: !529)
!574 = !DILocation(line: 64, column: 13, scope: !549)
!575 = !DILocation(line: 65, column: 9, scope: !549)
!576 = !DILocation(line: 66, column: 22, scope: !549)
!577 = !DILocation(line: 66, column: 3, scope: !549)
!578 = !DILocalVariable(name: "c", scope: !549, file: !261, line: 63, type: !535)
!579 = !DILocation(line: 63, column: 6, scope: !529)
!580 = !DILocation(line: 69, column: 2, scope: !549)
!581 = distinct !DISubprogram(name: "cli.GenerateConfig", linkageName: "command_line_arguments.GenerateConfig", scope: null, file: !261, line: 74, type: !530, isLocal: false, isDefinition: true, scopeLine: 74, isOptimized: false, unit: !1, retainedNodes: !3)
!582 = !DILocalVariable(name: "ctx", arg: 1, scope: !581, file: !261, line: 75, type: !296)
!583 = !DILocation(line: 75, column: 2, scope: !581)
!584 = !DILocalVariable(name: "$ret7", scope: !581, file: !261, line: 76, type: !535)
!585 = !DILocation(line: 76, column: 4, scope: !581)
!586 = !DILocation(line: 79, column: 18, scope: !587)
!587 = distinct !DILexicalBlock(scope: !581, file: !261, line: 74, column: 1)
!588 = !DILocation(line: 80, column: 18, scope: !587)
!589 = !DILocation(line: 77, column: 12, scope: !587)
!590 = !DILocation(line: 77, column: 13, scope: !587)
!591 = !DILocalVariable(name: "config", scope: !587, file: !261, line: 77, type: !535)
!592 = !DILocation(line: 77, column: 2, scope: !581)
!593 = !DILocation(line: 84, column: 15, scope: !587)
!594 = !DILocalVariable(name: "path", scope: !587, file: !261, line: 84, type: !103)
!595 = !DILocation(line: 84, column: 2, scope: !581)
!596 = !DILocalVariable(name: "err", scope: !587, file: !261, line: 84, type: !241)
!597 = !DILocation(line: 85, column: 9, scope: !587)
!598 = !DILocation(line: 86, column: 22, scope: !587)
!599 = !DILocalVariable(name: "$ret8", scope: !581, file: !261, line: 76, type: !241)
!600 = !DILocation(line: 76, column: 13, scope: !581)
!601 = !DILocation(line: 86, column: 3, scope: !587)
!602 = !DILocation(line: 89, column: 39, scope: !587)
!603 = !DILocation(line: 89, column: 25, scope: !587)
!604 = !DILocation(line: 90, column: 9, scope: !587)
!605 = !DILocation(line: 91, column: 22, scope: !587)
!606 = !DILocation(line: 91, column: 3, scope: !587)
!607 = !DILocation(line: 94, column: 25, scope: !587)
!608 = !DILocation(line: 94, column: 15, scope: !587)
!609 = !DILocalVariable(name: "formatted", scope: !587, file: !261, line: 89, type: !89)
!610 = !DILocation(line: 89, column: 2, scope: !581)
!611 = !DILocation(line: 95, column: 9, scope: !587)
!612 = !DILocation(line: 96, column: 22, scope: !587)
!613 = !DILocation(line: 96, column: 3, scope: !587)
!614 = !DILocation(line: 99, column: 2, scope: !587)
!615 = distinct !DISubprogram(name: "cli.RetrieveOrGenerateConfig", linkageName: "command_line_arguments.RetrieveOrGenerateConfig", scope: null, file: !261, line: 103, type: !530, isLocal: false, isDefinition: true, scopeLine: 103, isOptimized: false, unit: !1, retainedNodes: !3)
!616 = !DILocalVariable(name: "ctx", arg: 1, scope: !615, file: !261, line: 104, type: !296)
!617 = !DILocation(line: 104, column: 2, scope: !615)
!618 = !DILocalVariable(name: "$ret9", scope: !615, file: !261, line: 105, type: !535)
!619 = !DILocation(line: 105, column: 4, scope: !615)
!620 = !DILocation(line: 107, column: 17, scope: !621)
!621 = distinct !DILexicalBlock(scope: !615, file: !261, line: 103, column: 1)
!622 = !DILocalVariable(name: "config", scope: !621, file: !261, line: 107, type: !535)
!623 = !DILocation(line: 107, column: 2, scope: !615)
!624 = !DILocalVariable(name: "err", scope: !621, file: !261, line: 107, type: !241)
!625 = !DILocation(line: 108, column: 9, scope: !621)
!626 = !DILocation(line: 109, column: 22, scope: !621)
!627 = !DILocalVariable(name: "$ret10", scope: !615, file: !261, line: 105, type: !241)
!628 = !DILocation(line: 105, column: 13, scope: !615)
!629 = !DILocation(line: 109, column: 3, scope: !621)
!630 = !DILocation(line: 112, column: 12, scope: !621)
!631 = !DILocation(line: 113, column: 17, scope: !621)
!632 = !DILocation(line: 114, column: 10, scope: !621)
!633 = !DILocation(line: 119, column: 2, scope: !621)
!634 = !DILocation(line: 115, column: 23, scope: !621)
!635 = !DILocation(line: 115, column: 4, scope: !621)
!636 = distinct !DISubprogram(name: "cli.RunLocalCommand", linkageName: "command_line_arguments.RunLocalCommand", scope: null, file: !258, line: 19, type: !637, isLocal: false, isDefinition: true, scopeLine: 19, isOptimized: false, unit: !1, retainedNodes: !3)
!637 = !DISubroutineType(types: !638)
!638 = !{!639, !296, !667}
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*CommandResult,error}", file: !50, size: 192, align: 8, elements: !640)
!640 = !{!641, !666}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 22, baseType: !642, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "CommandResult", file: !258, line: 11, size: 768, align: 8, elements: !644)
!644 = !{!645, !650, !651, !661}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !258, line: 11, baseType: !646, size: 128, align: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "CommandType", file: !258, line: 11, size: 128, align: 8, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !258, line: 1, baseType: !42, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !258, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Disconnected", file: !258, line: 11, baseType: !93, size: 8, align: 8, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "SessionState", file: !258, line: 11, baseType: !652, size: 320, align: 64, offset: 192)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "State", file: !258, line: 11, size: 320, align: 8, elements: !653)
!653 = !{!654, !655, !660}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Warp", file: !258, line: 11, baseType: !39, size: 128, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "WindowSize", file: !258, line: 11, baseType: !656, size: 128, align: 64, offset: 128)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size", file: !258, line: 11, size: 128, align: 8, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Rows", file: !258, line: 11, baseType: !13, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Cols", file: !258, line: 11, baseType: !13, size: 64, align: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Users", file: !258, line: 11, baseType: !8, size: 64, align: 64, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !258, line: 11, baseType: !662, size: 256, align: 64, offset: 512)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", file: !258, line: 11, size: 256, align: 8, elements: !663)
!663 = !{!664, !665}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Code", file: !258, line: 11, baseType: !39, size: 128, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !258, line: 11, baseType: !39, size: 128, align: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 22, baseType: !241, size: 128, align: 64, offset: 64)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "Command", file: !258, line: 11, size: 320, align: 8, elements: !668)
!668 = !{!645, !669}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Args", file: !258, line: 11, baseType: !100, size: 192, align: 64, offset: 128)
!670 = !DILocalVariable(name: "cmd", arg: 2, scope: !636, file: !258, line: 21, type: !667)
!671 = !DILocation(line: 21, column: 2, scope: !636)
!672 = !DILocalVariable(name: "ctx", arg: 1, scope: !636, file: !258, line: 20, type: !296)
!673 = !DILocation(line: 20, column: 2, scope: !636)
!674 = !DILocalVariable(name: "$ret11", scope: !636, file: !258, line: 22, type: !642)
!675 = !DILocation(line: 22, column: 4, scope: !636)
!676 = !DILocalVariable(name: "$ret12", scope: !636, file: !258, line: 22, type: !241)
!677 = !DILocation(line: 22, column: 25, scope: !636)
!678 = !DILocation(line: 24, column: 6, scope: !679)
!679 = distinct !DILexicalBlock(scope: !636, file: !258, line: 19, column: 1)
!680 = !DILocation(line: 60, column: 1, scope: !636)
!681 = !DILocation(line: 25, column: 35, scope: !679)
!682 = !DILocation(line: 25, column: 7, scope: !679)
!683 = !DILocation(line: 23, column: 12, scope: !679)
!684 = !DILocalVariable(name: "p", scope: !679, file: !258, line: 23, type: !39)
!685 = !DILocation(line: 23, column: 2, scope: !636)
!686 = !DILocation(line: 28, column: 19, scope: !679)
!687 = !DILocalVariable(name: "conn", scope: !679, file: !258, line: 28, type: !688)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !258, line: 7, size: 128, align: 8, elements: !689)
!689 = !{!690, !708}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !258, line: 7, baseType: !691, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)Addr,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void)Addr,*func(*void,Time)error,*func(*void,Time)error,*func(*void,Time)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !50, size: 576, align: 8, elements: !693)
!693 = !{!694, !695, !696, !709, !717, !718, !722, !723, !724}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !50, line: 7, baseType: !188, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !50, line: 7, baseType: !352, size: 64, align: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "LocalAddr", file: !50, line: 7, baseType: !697, size: 64, align: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!700, !22}
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "Addr", file: !258, line: 7, size: 128, align: 8, elements: !701)
!701 = !{!702, !708}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !258, line: 7, baseType: !703, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)string}", file: !50, size: 192, align: 8, elements: !705)
!705 = !{!694, !706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Network", file: !50, line: 7, baseType: !249, size: 64, align: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !50, line: 7, baseType: !249, size: 64, align: 64, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !258, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !50, line: 7, baseType: !710, size: 64, align: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!713, !22, !89}
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !50, size: 192, align: 8, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !50, line: 7, baseType: !13, size: 64, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !50, line: 7, baseType: !241, size: 128, align: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !50, line: 7, baseType: !697, size: 64, align: 64, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "SetDeadline", file: !50, line: 7, baseType: !719, size: 64, align: 64, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!241, !22, !310}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "SetReadDeadline", file: !50, line: 7, baseType: !719, size: 64, align: 64, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "SetWriteDeadline", file: !50, line: 7, baseType: !719, size: 64, align: 64, offset: 448)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !50, line: 7, baseType: !710, size: 64, align: 64, offset: 512)
!725 = !DILocation(line: 28, column: 2, scope: !636)
!726 = !DILocalVariable(name: "err", scope: !679, file: !258, line: 28, type: !241)
!727 = !DILocation(line: 29, column: 9, scope: !679)
!728 = !DILocation(line: 34, column: 2, scope: !679)
!729 = !DILocation(line: 31, column: 50, scope: !679)
!730 = !DILocation(line: 31, column: 11, scope: !679)
!731 = !DILocation(line: 30, column: 22, scope: !679)
!732 = !DILocation(line: 36, column: 29, scope: !679)
!733 = !DILocation(line: 36, column: 18, scope: !679)
!734 = !DILocalVariable(name: "commandR", scope: !679, file: !258, line: 36, type: !735)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "Decoder", file: !258, line: 5, size: 1024, align: 8, elements: !737)
!737 = !{!738, !739, !754, !759, !760, !761, !762, !771, !772}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !258, line: 5, baseType: !106, size: 64, align: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !258, line: 5, baseType: !740, size: 128, align: 64, offset: 64)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !261, line: 5, size: 128, align: 8, elements: !741)
!741 = !{!742, !362}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !261, line: 5, baseType: !743, size: 64, align: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !50, size: 128, align: 8, elements: !745)
!745 = !{!187, !746}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !50, line: 5, baseType: !747, size: 64, align: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!750, !22, !89}
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !50, size: 192, align: 8, elements: !751)
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !50, line: 5, baseType: !13, size: 64, align: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !50, line: 5, baseType: !241, size: 128, align: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !258, line: 5, baseType: !755, size: 256, align: 64, offset: 192)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.decBuffer", file: !258, line: 5, size: 256, align: 8, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "data", file: !258, line: 5, baseType: !89, size: 192, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !258, line: 5, baseType: !13, size: 64, align: 64, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "wireType", file: !258, line: 5, baseType: !8, size: 64, align: 64, offset: 448)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "decoderCache", file: !258, line: 5, baseType: !8, size: 64, align: 64, offset: 512)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ignorerCache", file: !258, line: 5, baseType: !8, size: 64, align: 64, offset: 576)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "freeList", file: !258, line: 5, baseType: !763, size: 64, align: 64, offset: 640)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.decoderState", file: !258, line: 5, size: 256, align: 8, elements: !765)
!765 = !{!766, !767, !769, !770}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "dec", file: !258, line: 5, baseType: !22, size: 64, align: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !258, line: 5, baseType: !768, size: 64, align: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fieldnum", file: !258, line: 5, baseType: !13, size: 64, align: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !258, line: 5, baseType: !22, size: 64, align: 64, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "countBuf", file: !258, line: 5, baseType: !89, size: 192, align: 64, offset: 704)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !258, line: 5, baseType: !241, size: 128, align: 64, offset: 896)
!773 = !DILocation(line: 36, column: 2, scope: !636)
!774 = !DILocation(line: 37, column: 29, scope: !679)
!775 = !DILocation(line: 37, column: 18, scope: !679)
!776 = !DILocalVariable(name: "commandW", scope: !679, file: !258, line: 37, type: !777)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "Encoder", file: !258, line: 5, size: 1280, align: 8, elements: !779)
!779 = !{!738, !780, !785, !786, !806, !807, !808}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !258, line: 5, baseType: !781, size: 192, align: 64, offset: 64)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Writer,int,int}", file: !50, size: 192, align: 8, elements: !782)
!782 = !{!783, !66, !67}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !784, size: 64, align: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "sent", file: !258, line: 5, baseType: !8, size: 64, align: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "countState", file: !258, line: 5, baseType: !787, size: 64, align: 64, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.encoderState", file: !258, line: 5, size: 448, align: 8, elements: !789)
!789 = !{!790, !791, !799, !800, !801, !805}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "enc", file: !258, line: 5, baseType: !22, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !258, line: 5, baseType: !792, size: 64, align: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.encBuffer", file: !258, line: 5, size: 704, align: 8, elements: !794)
!794 = !{!757, !795}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", file: !258, line: 5, baseType: !796, size: 512, align: 8, offset: 192)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 512, align: 1, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "sendZero", file: !258, line: 5, baseType: !93, size: 8, align: 8, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "fieldnum", file: !258, line: 5, baseType: !13, size: 64, align: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !258, line: 5, baseType: !802, size: 72, align: 8, offset: 256)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 72, align: 1, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: 9)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !258, line: 5, baseType: !22, size: 64, align: 64, offset: 384)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "freeList", file: !258, line: 5, baseType: !787, size: 64, align: 64, offset: 384)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "byteBuf", file: !258, line: 5, baseType: !793, size: 704, align: 64, offset: 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !258, line: 5, baseType: !241, size: 128, align: 64, offset: 1152)
!809 = !DILocation(line: 37, column: 2, scope: !636)
!810 = !DILocation(line: 39, column: 28, scope: !811)
!811 = distinct !DILexicalBlock(scope: !679, file: !258, line: 39, column: 2)
!812 = !DILocation(line: 39, column: 20, scope: !811)
!813 = !DILocalVariable(name: "err", scope: !811, file: !258, line: 39, type: !241)
!814 = !DILocation(line: 39, column: 5, scope: !679)
!815 = !DILocation(line: 39, column: 38, scope: !811)
!816 = !DILocation(line: 46, column: 6, scope: !679)
!817 = !DILocation(line: 41, column: 46, scope: !811)
!818 = !DILocation(line: 41, column: 11, scope: !811)
!819 = !DILocation(line: 40, column: 22, scope: !811)
!820 = !DILocalVariable(name: "result", scope: !679, file: !258, line: 46, type: !642)
!821 = !DILocation(line: 46, column: 6, scope: !636)
!822 = !DILocation(line: 47, column: 28, scope: !823)
!823 = distinct !DILexicalBlock(scope: !679, file: !258, line: 47, column: 2)
!824 = !DILocation(line: 47, column: 20, scope: !823)
!825 = !DILocalVariable(name: "err", scope: !823, file: !258, line: 47, type: !241)
!826 = !DILocation(line: 47, column: 5, scope: !679)
!827 = !DILocation(line: 47, column: 42, scope: !823)
!828 = !DILocation(line: 48, column: 22, scope: !823)
!829 = !DILocation(line: 51, column: 11, scope: !679)
!830 = !DILocation(line: 51, column: 23, scope: !679)
!831 = !DILocation(line: 55, column: 16, scope: !679)
!832 = !DILocation(line: 52, column: 22, scope: !679)
!833 = !DILocation(line: 30, column: 3, scope: !636)
!834 = distinct !DISubprogram(name: "cli.command_line_arguments..thunk0", scope: null, file: !258, line: 34, type: !835, isLocal: true, isDefinition: true, scopeLine: 34, isOptimized: false, unit: !1, retainedNodes: !3)
!835 = !DISubroutineType(types: !836)
!836 = !{!93, !837}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Conn}", file: !50, size: 128, align: 8, elements: !839)
!839 = !{!840}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "object", file: !50, line: 34, baseType: !688, size: 128, align: 64)
!841 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !834, file: !258, line: 34, type: !837)
!842 = !DILocation(line: 34, column: 2, scope: !834)
!843 = !DILocalVariable(name: "$ret54", scope: !834, file: !258, line: 34, type: !93)
!844 = distinct !DISubprogram(name: "cli.CheckEnvWarp", linkageName: "command_line_arguments.CheckEnvWarp", scope: null, file: !258, line: 64, type: !845, isLocal: false, isDefinition: true, scopeLine: 64, isOptimized: false, unit: !1, retainedNodes: !3)
!845 = !DISubroutineType(types: !846)
!846 = !{!241, !296}
!847 = !DILocalVariable(name: "ctx", arg: 1, scope: !844, file: !258, line: 65, type: !296)
!848 = !DILocation(line: 65, column: 2, scope: !844)
!849 = !DILocation(line: 67, column: 8, scope: !844)
!850 = !DILocation(line: 67, column: 29, scope: !844)
!851 = !DILocalVariable(name: "$ret13", scope: !844, file: !258, line: 66, type: !241)
!852 = !DILocation(line: 66, column: 3, scope: !844)
!853 = !DILocation(line: 68, column: 3, scope: !844)
!854 = !DILocation(line: 70, column: 6, scope: !844)
!855 = !DILocation(line: 71, column: 6, scope: !844)
!856 = !DILocation(line: 72, column: 6, scope: !844)
!857 = !DILocation(line: 73, column: 6, scope: !844)
!858 = !DILocation(line: 74, column: 6, scope: !844)
!859 = !DILocation(line: 75, column: 6, scope: !844)
!860 = !DILocation(line: 76, column: 6, scope: !844)
!861 = !DILocation(line: 77, column: 6, scope: !844)
!862 = !DILocation(line: 78, column: 6, scope: !844)
!863 = !DILocation(line: 79, column: 6, scope: !844)
!864 = !DILocation(line: 82, column: 10, scope: !844)
!865 = !DILocation(line: 81, column: 16, scope: !844)
!866 = !DILocation(line: 81, column: 2, scope: !844)
!867 = distinct !DISubprogram(name: "cli.DataC..1command_line_arguments.Session", linkageName: "command_line_arguments.Session.DataC", scope: null, file: !868, line: 145, type: !869, isLocal: false, isDefinition: true, scopeLine: 145, isOptimized: false, unit: !1, retainedNodes: !3)
!868 = !DIFile(filename: "session.go", directory: ".")
!869 = !DISubroutineType(types: !870)
!870 = !{!688, !871, !871}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "Session", file: !868, line: 18, size: 1920, align: 8, elements: !873)
!873 = !{!874, !880, !881, !883, !884, !885, !949, !950, !951, !952, !953, !954, !955, !956, !964, !965, !971}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "session", file: !868, line: 19, baseType: !875, size: 384, align: 64)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "Session", file: !258, line: 11, size: 384, align: 8, elements: !876)
!876 = !{!877, !878, !879}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "Token", file: !258, line: 11, baseType: !39, size: 128, align: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !258, line: 11, baseType: !39, size: 128, align: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "Secret", file: !258, line: 11, baseType: !39, size: 128, align: 64, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "warp", file: !868, line: 21, baseType: !39, size: 128, align: 64, offset: 384)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "sessionType", file: !868, line: 22, baseType: !882, size: 128, align: 64, offset: 512)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "SessionType", file: !258, line: 11, size: 128, align: 8, elements: !647)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !868, line: 23, baseType: !39, size: 128, align: 64, offset: 640)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "conn", file: !868, line: 25, baseType: !688, size: 128, align: 64, offset: 768)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "mux", file: !868, line: 26, baseType: !886, size: 64, align: 64, offset: 896)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "Session", file: !868, line: 11, size: 1408, align: 8, elements: !888)
!888 = !{!889, !890, !891, !892, !903, !912, !924, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "remoteGoAway", file: !868, line: 11, baseType: !65, size: 32, align: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "localGoAway", file: !868, line: 11, baseType: !65, size: 32, align: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "nextStreamID", file: !868, line: 11, baseType: !20, size: 32, align: 32, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "config", file: !868, line: 11, baseType: !893, size: 64, align: 64, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !868, line: 11, size: 448, align: 8, elements: !895)
!895 = !{!896, !897, !898, !900, !901, !902}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptBacklog", file: !868, line: 11, baseType: !13, size: 64, align: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "EnableKeepAlive", file: !868, line: 11, baseType: !93, size: 8, align: 8, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "KeepAliveInterval", file: !868, line: 11, baseType: !899, size: 64, align: 64, offset: 128)
!899 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ConnectionWriteTimeout", file: !868, line: 11, baseType: !899, size: 64, align: 64, offset: 192)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "MaxStreamWindowSize", file: !868, line: 11, baseType: !20, size: 32, align: 32, offset: 256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "LogOutput", file: !868, line: 11, baseType: !262, size: 128, align: 64, offset: 320)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "logger", file: !868, line: 11, baseType: !904, size: 64, align: 64, offset: 192)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "Logger", file: !868, line: 11, size: 576, align: 8, elements: !906)
!906 = !{!907, !908, !909, !910, !911}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !868, line: 11, baseType: !106, size: 64, align: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", file: !868, line: 11, baseType: !39, size: 128, align: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !868, line: 11, baseType: !13, size: 64, align: 64, offset: 192)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "out", file: !868, line: 11, baseType: !262, size: 128, align: 64, offset: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !868, line: 11, baseType: !89, size: 192, align: 64, offset: 384)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "conn", file: !868, line: 11, baseType: !913, size: 128, align: 64, offset: 256)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteCloser", file: !868, line: 11, size: 128, align: 8, elements: !914)
!914 = !{!915, !923}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !868, line: 11, baseType: !916, size: 64, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !50, size: 256, align: 8, elements: !918)
!918 = !{!919, !920, !921, !922}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !50, line: 11, baseType: !188, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !50, line: 11, baseType: !352, size: 64, align: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !50, line: 11, baseType: !747, size: 64, align: 64, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !50, line: 11, baseType: !270, size: 64, align: 64, offset: 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !868, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "bufRead", file: !868, line: 11, baseType: !925, size: 64, align: 64, offset: 384)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !868, line: 11, size: 704, align: 8, elements: !927)
!927 = !{!928, !929, !930, !931, !932, !933, !934}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !868, line: 11, baseType: !89, size: 192, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "rd", file: !868, line: 11, baseType: !740, size: 128, align: 64, offset: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !868, line: 11, baseType: !13, size: 64, align: 64, offset: 320)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !868, line: 11, baseType: !13, size: 64, align: 64, offset: 384)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !868, line: 11, baseType: !241, size: 128, align: 64, offset: 448)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "lastByte", file: !868, line: 11, baseType: !13, size: 64, align: 64, offset: 576)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "lastRuneSize", file: !868, line: 11, baseType: !13, size: 64, align: 64, offset: 640)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "pings", file: !868, line: 11, baseType: !8, size: 64, align: 64, offset: 448)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "pingID", file: !868, line: 11, baseType: !20, size: 32, align: 32, offset: 512)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "pingLock", file: !868, line: 11, baseType: !106, size: 64, align: 32, offset: 544)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "streams", file: !868, line: 11, baseType: !8, size: 64, align: 64, offset: 640)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "inflight", file: !868, line: 11, baseType: !8, size: 64, align: 64, offset: 704)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "streamLock", file: !868, line: 11, baseType: !106, size: 64, align: 32, offset: 768)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "synCh", file: !868, line: 11, baseType: !349, size: 64, align: 64, offset: 832)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "acceptCh", file: !868, line: 11, baseType: !349, size: 64, align: 64, offset: 896)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "sendCh", file: !868, line: 11, baseType: !349, size: 64, align: 64, offset: 960)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "recvDoneCh", file: !868, line: 11, baseType: !349, size: 64, align: 64, offset: 1024)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", file: !868, line: 11, baseType: !93, size: 8, align: 8, offset: 1088)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "shutdownErr", file: !868, line: 11, baseType: !241, size: 128, align: 64, offset: 1152)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "shutdownCh", file: !868, line: 11, baseType: !349, size: 64, align: 64, offset: 1280)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "shutdownLock", file: !868, line: 11, baseType: !106, size: 64, align: 32, offset: 1344)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "stateC", file: !868, line: 28, baseType: !688, size: 128, align: 64, offset: 960)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "stateR", file: !868, line: 29, baseType: !735, size: 64, align: 64, offset: 1088)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "updateC", file: !868, line: 30, baseType: !688, size: 128, align: 64, offset: 1152)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "updateW", file: !868, line: 31, baseType: !777, size: 64, align: 64, offset: 1280)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "errorC", file: !868, line: 32, baseType: !688, size: 128, align: 64, offset: 1344)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "errorR", file: !868, line: 33, baseType: !735, size: 64, align: 64, offset: 1472)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "dataC", file: !868, line: 34, baseType: !688, size: 128, align: 64, offset: 1536)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !868, line: 36, baseType: !957, size: 64, align: 64, offset: 1664)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "WarpState", file: !959, line: 11, size: 320, align: 8, elements: !960)
!959 = !DIFile(filename: "warp_state.go", directory: ".")
!960 = !{!961, !962, !963}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "token", file: !959, line: 12, baseType: !39, size: 128, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "windowSize", file: !959, line: 14, baseType: !656, size: 128, align: 64, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "users", file: !959, line: 15, baseType: !8, size: 64, align: 64, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "tornDown", file: !868, line: 38, baseType: !93, size: 8, align: 8, offset: 1728)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", file: !868, line: 39, baseType: !966, size: 64, align: 64, offset: 1792)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !868, line: 39, size: 64, align: 8, elements: !968)
!968 = !{!969}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !868, line: 39, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !868, line: 41, baseType: !972, size: 64, align: 64, offset: 1856)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!973 = !DILocalVariable(name: "ss", arg: 1, scope: !867, file: !868, line: 145, type: !871)
!974 = !DILocation(line: 145, column: 1, scope: !867)
!975 = !DILocalVariable(name: "$ret16", scope: !867, file: !868, line: 145, type: !688)
!976 = !DILocation(line: 145, column: 28, scope: !867)
!977 = !DILocation(line: 146, column: 4, scope: !867)
!978 = !DILocation(line: 149, column: 1, scope: !867)
!979 = !DILocation(line: 146, column: 10, scope: !867)
!980 = !DILocation(line: 147, column: 10, scope: !867)
!981 = !DILocation(line: 147, column: 2, scope: !867)
!982 = !DILocation(line: 148, column: 2, scope: !867)
!983 = distinct !DISubprogram(name: "cli.DecodeError..1command_line_arguments.Session", linkageName: "command_line_arguments.Session.DecodeError", scope: null, file: !868, line: 275, type: !984, isLocal: false, isDefinition: true, scopeLine: 275, isOptimized: false, unit: !1, retainedNodes: !3)
!984 = !DISubroutineType(types: !985)
!985 = !{!986, !871, !871, !296}
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Error,error}", file: !50, size: 192, align: 8, elements: !987)
!987 = !{!988, !990}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 277, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 277, baseType: !241, size: 128, align: 64, offset: 64)
!991 = !DILocalVariable(name: "ss", arg: 1, scope: !983, file: !868, line: 275, type: !871)
!992 = !DILocation(line: 275, column: 1, scope: !983)
!993 = !DILocalVariable(name: "ctx", arg: 2, scope: !983, file: !868, line: 276, type: !296)
!994 = !DILocation(line: 276, column: 2, scope: !983)
!995 = !DILocalVariable(name: "$ret29", scope: !983, file: !868, line: 277, type: !989)
!996 = !DILocation(line: 277, column: 4, scope: !983)
!997 = !DILocation(line: 278, column: 6, scope: !998)
!998 = distinct !DILexicalBlock(scope: !983, file: !868, line: 275, column: 1)
!999 = !DILocalVariable(name: "e", scope: !998, file: !868, line: 278, type: !989)
!1000 = !DILocation(line: 278, column: 6, scope: !983)
!1001 = !DILocation(line: 279, column: 14, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !998, file: !868, line: 279, column: 2)
!1003 = !DILocation(line: 279, column: 29, scope: !1002)
!1004 = !DILocation(line: 279, column: 21, scope: !1002)
!1005 = !DILocalVariable(name: "err", scope: !1002, file: !868, line: 279, type: !241)
!1006 = !DILocation(line: 279, column: 5, scope: !998)
!1007 = !DILocation(line: 279, column: 38, scope: !1002)
!1008 = !DILocation(line: 280, column: 22, scope: !1002)
!1009 = !DILocalVariable(name: "$ret30", scope: !983, file: !868, line: 277, type: !241)
!1010 = !DILocation(line: 277, column: 17, scope: !983)
!1011 = !DILocation(line: 280, column: 3, scope: !1002)
!1012 = !DILocation(line: 282, column: 2, scope: !998)
!1013 = distinct !DISubprogram(name: "cli.DecodeState..1command_line_arguments.Session", linkageName: "command_line_arguments.Session.DecodeState", scope: null, file: !868, line: 287, type: !1014, isLocal: false, isDefinition: true, scopeLine: 287, isOptimized: false, unit: !1, retainedNodes: !3)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!1016, !871, !871, !296}
!1016 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*State,error}", file: !50, size: 192, align: 8, elements: !1017)
!1017 = !{!1018, !1020}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 289, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 289, baseType: !241, size: 128, align: 64, offset: 64)
!1021 = !DILocalVariable(name: "ss", arg: 1, scope: !1013, file: !868, line: 287, type: !871)
!1022 = !DILocation(line: 287, column: 1, scope: !1013)
!1023 = !DILocalVariable(name: "ctx", arg: 2, scope: !1013, file: !868, line: 288, type: !296)
!1024 = !DILocation(line: 288, column: 2, scope: !1013)
!1025 = !DILocalVariable(name: "$ret31", scope: !1013, file: !868, line: 289, type: !1019)
!1026 = !DILocation(line: 289, column: 4, scope: !1013)
!1027 = !DILocation(line: 290, column: 6, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1013, file: !868, line: 287, column: 1)
!1029 = !DILocalVariable(name: "st", scope: !1028, file: !868, line: 290, type: !1019)
!1030 = !DILocation(line: 290, column: 6, scope: !1013)
!1031 = !DILocation(line: 291, column: 14, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1028, file: !868, line: 291, column: 2)
!1033 = !DILocation(line: 291, column: 29, scope: !1032)
!1034 = !DILocation(line: 291, column: 21, scope: !1032)
!1035 = !DILocalVariable(name: "err", scope: !1032, file: !868, line: 291, type: !241)
!1036 = !DILocation(line: 291, column: 5, scope: !1028)
!1037 = !DILocation(line: 291, column: 39, scope: !1032)
!1038 = !DILocation(line: 292, column: 22, scope: !1032)
!1039 = !DILocalVariable(name: "$ret32", scope: !1013, file: !868, line: 289, type: !241)
!1040 = !DILocation(line: 289, column: 17, scope: !1013)
!1041 = !DILocation(line: 292, column: 3, scope: !1032)
!1042 = !DILocation(line: 294, column: 2, scope: !1028)
!1043 = distinct !DISubprogram(name: "cli.GetMode..1command_line_arguments.Session", linkageName: "command_line_arguments.Session.GetMode", scope: null, file: !868, line: 185, type: !1044, isLocal: false, isDefinition: true, scopeLine: 185, isOptimized: false, unit: !1, retainedNodes: !3)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!1046, !871, !871, !39}
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Mode,error}", file: !50, size: 192, align: 8, elements: !1047)
!1047 = !{!1048, !1051}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 187, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DIBasicType(name: "Mode", size: 64, encoding: DW_ATE_unsigned)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 187, baseType: !241, size: 128, align: 64, offset: 64)
!1052 = !DILocalVariable(name: "ss", arg: 1, scope: !1043, file: !868, line: 185, type: !871)
!1053 = !DILocation(line: 185, column: 1, scope: !1043)
!1054 = !DILocalVariable(name: "user", arg: 2, scope: !1043, file: !868, line: 186, type: !39)
!1055 = !DILocation(line: 186, column: 2, scope: !1043)
!1056 = !DILocalVariable(name: "$ret20", scope: !1043, file: !868, line: 187, type: !1049)
!1057 = !DILocation(line: 187, column: 4, scope: !1043)
!1058 = !DILocation(line: 188, column: 4, scope: !1043)
!1059 = !DILocation(line: 191, column: 1, scope: !1043)
!1060 = !DILocation(line: 188, column: 10, scope: !1043)
!1061 = !DILocation(line: 189, column: 10, scope: !1043)
!1062 = !DILocation(line: 189, column: 2, scope: !1043)
!1063 = !DILocation(line: 190, column: 11, scope: !1043)
!1064 = !DILocation(line: 190, column: 17, scope: !1043)
!1065 = !DILocation(line: 190, column: 2, scope: !1043)
!1066 = distinct !DISubprogram(name: "cli.HostCanReceiveWrite..1command_line_arguments.Session", linkageName: "command_line_arguments.Session.HostCanReceiveWrite", scope: null, file: !868, line: 215, type: !1067, isLocal: false, isDefinition: true, scopeLine: 215, isOptimized: false, unit: !1, retainedNodes: !3)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!93, !871, !871}
!1069 = !DILocalVariable(name: "ss", arg: 1, scope: !1066, file: !868, line: 215, type: !871)
!1070 = !DILocation(line: 215, column: 1, scope: !1066)
!1071 = !DILocalVariable(name: "$ret24", scope: !1066, file: !868, line: 215, type: !93)
!1072 = !DILocation(line: 215, column: 42, scope: !1066)
!1073 = !DILocation(line: 216, column: 4, scope: !1066)
!1074 = !DILocation(line: 219, column: 1, scope: !1066)
!1075 = !DILocation(line: 216, column: 10, scope: !1066)
!1076 = !DILocation(line: 217, column: 10, scope: !1066)
!1077 = !DILocation(line: 217, column: 2, scope: !1066)
!1078 = !DILocation(line: 218, column: 11, scope: !1066)
!1079 = !DILocation(line: 218, column: 17, scope: !1066)
!1080 = !DILocation(line: 218, column: 2, scope: !1066)
!1081 = distinct !DISubprogram(name: "cli.Modes..1command_line_arguments.Session", linkageName: "command_line_arguments.Session.Modes", scope: null, file: !868, line: 229, type: !1082, isLocal: false, isDefinition: true, scopeLine: 229, isOptimized: false, unit: !1, retainedNodes: !3)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!8, !871, !871}
!1084 = !DILocalVariable(name: "ss", arg: 1, scope: !1081, file: !868, line: 229, type: !871)
!1085 = !DILocation(line: 229, column: 1, scope: !1081)
!1086 = !DILocalVariable(name: "$ret26", scope: !1081, file: !868, line: 229, type: !8)
!1087 = !DILocation(line: 229, column: 28, scope: !1081)
!1088 = !DILocation(line: 230, column: 4, scope: !1081)
!1089 = !DILocation(line: 233, column: 1, scope: !1081)
!1090 = !DILocation(line: 230, column: 10, scope: !1081)
!1091 = !DILocation(line: 231, column: 10, scope: !1081)
!1092 = !DILocation(line: 231, column: 2, scope: !1081)
!1093 = !DILocation(line: 232, column: 11, scope: !1081)
!1094 = !DILocation(line: 232, column: 17, scope: !1081)
!1095 = !DILocation(line: 232, column: 2, scope: !1081)
!1096 = distinct !DISubprogram(name: "cli.ProtocolState..1command_line_arguments.Session", linkageName: "command_line_arguments.Session.ProtocolState", scope: null, file: !868, line: 178, type: !1097, isLocal: false, isDefinition: true, scopeLine: 178, isOptimized: false, unit: !1, retainedNodes: !3)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!652, !871, !871}
!1099 = !DILocalVariable(name: "ss", arg: 1, scope: !1096, file: !868, line: 178, type: !871)
!1100 = !DILocation(line: 178, column: 1, scope: !1096)
!1101 = !DILocation(line: 179, column: 4, scope: !1096)
!1102 = !DILocation(line: 182, column: 1, scope: !1096)
!1103 = !DILocation(line: 179, column: 10, scope: !1096)
!1104 = !DILocation(line: 180, column: 10, scope: !1096)
!1105 = !DILocation(line: 180, column: 2, scope: !1096)
!1106 = !DILocation(line: 181, column: 11, scope: !1096)
!1107 = !DILocation(line: 181, column: 17, scope: !1096)
!1108 = !DILocation(line: 181, column: 2, scope: !1096)
!1109 = distinct !DISubprogram(name: "cli.SendHostUpdate..1command_line_arguments.Session", linkageName: "command_line_arguments.Session.SendHostUpdate", scope: null, file: !868, line: 255, type: !1110, isLocal: false, isDefinition: true, scopeLine: 255, isOptimized: false, unit: !1, retainedNodes: !3)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!241, !871, !871, !296, !1112}
!1112 = !DICompositeType(tag: DW_TAG_structure_type, name: "HostUpdate", file: !258, line: 11, size: 704, align: 8, elements: !1113)
!1113 = !{!654, !1114, !1115, !1116}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "From", file: !258, line: 11, baseType: !875, size: 384, align: 64, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "WindowSize", file: !258, line: 11, baseType: !656, size: 128, align: 64, offset: 512)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "Modes", file: !258, line: 11, baseType: !8, size: 64, align: 64, offset: 640)
!1117 = !DILocalVariable(name: "update", arg: 3, scope: !1109, file: !868, line: 257, type: !1112)
!1118 = !DILocation(line: 257, column: 2, scope: !1109)
!1119 = !DILocalVariable(name: "ss", arg: 1, scope: !1109, file: !868, line: 255, type: !871)
!1120 = !DILocation(line: 255, column: 1, scope: !1109)
!1121 = !DILocalVariable(name: "ctx", arg: 2, scope: !1109, file: !868, line: 256, type: !296)
!1122 = !DILocation(line: 256, column: 2, scope: !1109)
!1123 = !DILocalVariable(name: "$ret28", scope: !1109, file: !868, line: 258, type: !241)
