; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22daemon\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22tls\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/tls\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/tls\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22gob\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/gob\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/gob\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./session.go", directory: "/home/wangcong/go_path/src/github.com/spolu/warp/daemon")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "daemon.SendError..1command_line_arguments.Session", linkageName: "command_line_arguments.Session.SendError", scope: null, file: !10, line: 152, type: !11, isLocal: false, isDefinition: true, scopeLine: 152, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DIFile(filename: "session.go", directory: ".")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !14, !348, !21, !21}
!13 = !DIBasicType(name: "void")
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "Session", file: !10, line: 18, size: 1984, align: 8, elements: !16)
!16 = !{!17, !30, !31, !36, !37, !178, !283, !284, !319, !320, !343, !344, !345, !346, !347, !377, !385}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "session", file: !10, line: 19, baseType: !18, size: 384, align: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "Session", file: !10, line: 12, size: 384, align: 8, elements: !19)
!19 = !{!20, !28, !29}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Token", file: !10, line: 12, baseType: !21, size: 128, align: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !22)
!22 = !{!23, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !10, line: 12, baseType: !21, size: 128, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "Secret", file: !10, line: 12, baseType: !21, size: 128, align: 64, offset: 256)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "warp", file: !10, line: 21, baseType: !21, size: 128, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "sessionType", file: !10, line: 22, baseType: !32, size: 128, align: 64, offset: 512)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "SessionType", file: !10, line: 12, size: 128, align: 8, elements: !33)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !10, line: 1, baseType: !24, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !10, line: 1, baseType: !27, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !10, line: 24, baseType: !21, size: 128, align: 64, offset: 640)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "conn", file: !10, line: 26, baseType: !38, size: 128, align: 64, offset: 768)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !10, line: 7, size: 128, align: 8, elements: !39)
!39 = !{!40, !124}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 7, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)Addr,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void)Addr,*func(*void,Time)error,*func(*void,Time)error,*func(*void,Time)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !43, size: 576, align: 8, elements: !44)
!43 = !DIFile(filename: "", directory: "")
!44 = !{!45, !96, !112, !125, !136, !137, !175, !176, !177}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !43, line: 7, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !48)
!48 = !{!49, !51, !52, !53, !54, !55, !56, !65, !74, !75, !77, !95}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !50, size: 64, align: 64)
!50 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !50, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !25, size: 8, align: 8, offset: 160)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !25, size: 8, align: 8, offset: 168)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !25, size: 8, align: 8, offset: 176)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !57, size: 64, align: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !59)
!59 = !{!60}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!50, !64, !50}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !66, size: 64, align: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !68)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!73, !64, !64}
!73 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !24, size: 64, align: 64, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !76, size: 64, align: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !78, size: 64, align: 64, offset: 448)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !80)
!80 = !{!81, !82, !83}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !76, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !76, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !84, size: 192, align: 64, offset: 128)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !43, size: 192, align: 8, elements: !85)
!85 = !{!86, !93, !94}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !89)
!89 = !{!81, !82, !90, !91, !92}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !64, size: 64, align: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !64, size: 64, align: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !64, size: 64, align: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !43, line: 1, baseType: !27, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !43, line: 1, baseType: !27, size: 64, align: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !64, size: 64, align: 64, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !43, line: 7, baseType: !97, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !64}
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !101)
!101 = !{!102, !111}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !43, size: 128, align: 8, elements: !105)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !43, line: 1, baseType: !46, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !43, line: 1, baseType: !108, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!21, !64}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !64, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "LocalAddr", file: !43, line: 7, baseType: !113, size: 64, align: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!116, !64}
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "Addr", file: !10, line: 7, size: 128, align: 8, elements: !117)
!117 = !{!118, !124}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 7, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)string}", file: !43, size: 192, align: 8, elements: !121)
!121 = !{!45, !122, !123}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Network", file: !43, line: 7, baseType: !108, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !43, line: 7, baseType: !108, size: 64, align: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !64, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !43, line: 7, baseType: !126, size: 64, align: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!129, !64, !133}
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !43, size: 192, align: 8, elements: !130)
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !43, line: 7, baseType: !27, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !43, line: 7, baseType: !100, size: 128, align: 64, offset: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !43, size: 192, align: 8, elements: !134)
!134 = !{!135, !93, !94}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !24, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !43, line: 7, baseType: !113, size: 64, align: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "SetDeadline", file: !43, line: 7, baseType: !138, size: 64, align: 64, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!100, !64, !141}
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !10, line: 4, size: 192, align: 8, elements: !142)
!142 = !{!143, !145, !147}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !10, line: 4, baseType: !144, size: 64, align: 64)
!144 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !10, line: 4, baseType: !146, size: 64, align: 64, offset: 64)
!146 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !10, line: 4, baseType: !148, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !10, line: 4, size: 704, align: 8, elements: !150)
!150 = !{!151, !152, !161, !172, !173, !174}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !10, line: 4, baseType: !21, size: 128, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !10, line: 4, baseType: !153, size: 192, align: 64, offset: 128)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !43, size: 192, align: 8, elements: !154)
!154 = !{!155, !93, !94}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !10, line: 4, size: 256, align: 8, elements: !158)
!158 = !{!151, !159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !10, line: 4, baseType: !27, size: 64, align: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !10, line: 4, baseType: !73, size: 8, align: 8, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !10, line: 4, baseType: !162, size: 192, align: 64, offset: 320)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !43, size: 192, align: 8, elements: !163)
!163 = !{!164, !93, !94}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !10, line: 4, size: 128, align: 8, elements: !167)
!167 = !{!168, !169, !170, !171}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !10, line: 4, baseType: !146, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !10, line: 4, baseType: !25, size: 8, align: 8, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !10, line: 4, baseType: !73, size: 8, align: 8, offset: 72)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !10, line: 4, baseType: !73, size: 8, align: 8, offset: 80)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !10, line: 4, baseType: !146, size: 64, align: 64, offset: 512)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !10, line: 4, baseType: !146, size: 64, align: 64, offset: 576)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !10, line: 4, baseType: !156, size: 64, align: 64, offset: 640)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "SetReadDeadline", file: !43, line: 7, baseType: !138, size: 64, align: 64, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "SetWriteDeadline", file: !43, line: 7, baseType: !138, size: 64, align: 64, offset: 448)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !43, line: 7, baseType: !126, size: 64, align: 64, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "mux", file: !10, line: 27, baseType: !179, size: 64, align: 64, offset: 896)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "Session", file: !10, line: 11, size: 1408, align: 8, elements: !181)
!181 = !{!182, !184, !185, !186, !212, !225, !236, !254, !268, !269, !270, !271, !272, !273, !276, !277, !278, !279, !280, !281, !282}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "remoteGoAway", file: !10, line: 11, baseType: !183, size: 32, align: 32)
!183 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "localGoAway", file: !10, line: 11, baseType: !183, size: 32, align: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nextStreamID", file: !10, line: 11, baseType: !8, size: 32, align: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "config", file: !10, line: 11, baseType: !187, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !10, line: 11, size: 448, align: 8, elements: !189)
!189 = !{!190, !191, !192, !194, !195, !196}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptBacklog", file: !10, line: 11, baseType: !27, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "EnableKeepAlive", file: !10, line: 11, baseType: !73, size: 8, align: 8, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "KeepAliveInterval", file: !10, line: 11, baseType: !193, size: 64, align: 64, offset: 128)
!193 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ConnectionWriteTimeout", file: !10, line: 11, baseType: !193, size: 64, align: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "MaxStreamWindowSize", file: !10, line: 11, baseType: !8, size: 32, align: 32, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "LogOutput", file: !10, line: 11, baseType: !197, size: 128, align: 64, offset: 320)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !10, line: 5, size: 128, align: 8, elements: !198)
!198 = !{!199, !124}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 5, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !43, size: 128, align: 8, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !43, line: 5, baseType: !46, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !43, line: 5, baseType: !205, size: 64, align: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!208, !64, !133}
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !43, size: 192, align: 8, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !43, line: 5, baseType: !27, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !43, line: 5, baseType: !100, size: 128, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "logger", file: !10, line: 11, baseType: !213, size: 64, align: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "Logger", file: !10, line: 11, size: 576, align: 8, elements: !215)
!215 = !{!216, !221, !222, !223, !224}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !10, line: 11, baseType: !217, size: 64, align: 32)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !10, line: 5, size: 64, align: 8, elements: !218)
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !10, line: 5, baseType: !183, size: 32, align: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !10, line: 5, baseType: !8, size: 32, align: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", file: !10, line: 11, baseType: !21, size: 128, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !10, line: 11, baseType: !27, size: 64, align: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "out", file: !10, line: 11, baseType: !197, size: 128, align: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !10, line: 11, baseType: !133, size: 192, align: 64, offset: 384)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "conn", file: !10, line: 11, baseType: !226, size: 128, align: 64, offset: 256)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteCloser", file: !10, line: 11, size: 128, align: 8, elements: !227)
!227 = !{!228, !124}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 11, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !43, size: 256, align: 8, elements: !231)
!231 = !{!232, !233, !234, !235}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !43, line: 11, baseType: !46, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !43, line: 11, baseType: !97, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !43, line: 11, baseType: !205, size: 64, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !43, line: 11, baseType: !205, size: 64, align: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bufRead", file: !10, line: 11, baseType: !237, size: 64, align: 64, offset: 384)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !10, line: 11, size: 704, align: 8, elements: !239)
!239 = !{!240, !241, !249, !250, !251, !252, !253}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !10, line: 11, baseType: !133, size: 192, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "rd", file: !10, line: 11, baseType: !242, size: 128, align: 64, offset: 192)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !10, line: 5, size: 128, align: 8, elements: !243)
!243 = !{!244, !124}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 5, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !43, size: 128, align: 8, elements: !247)
!247 = !{!203, !248}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !43, line: 5, baseType: !205, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !10, line: 11, baseType: !27, size: 64, align: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !10, line: 11, baseType: !27, size: 64, align: 64, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !10, line: 11, baseType: !100, size: 128, align: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "lastByte", file: !10, line: 11, baseType: !27, size: 64, align: 64, offset: 576)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "lastRuneSize", file: !10, line: 11, baseType: !27, size: 64, align: 64, offset: 640)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pings", file: !10, line: 11, baseType: !255, size: 64, align: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !257)
!257 = !{!258, !259, !260, !261, !263, !264, !265, !266, !267}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !27, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !25, size: 8, align: 8, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !25, size: 8, align: 8, offset: 72)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !262, size: 16, align: 16, offset: 80)
!262 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !64, size: 64, align: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !64, size: 64, align: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !50, size: 64, align: 64, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !64, size: 64, align: 64, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pingID", file: !10, line: 11, baseType: !8, size: 32, align: 32, offset: 512)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pingLock", file: !10, line: 11, baseType: !217, size: 64, align: 32, offset: 544)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "streams", file: !10, line: 11, baseType: !255, size: 64, align: 64, offset: 640)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "inflight", file: !10, line: 11, baseType: !255, size: 64, align: 64, offset: 704)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "streamLock", file: !10, line: 11, baseType: !217, size: 64, align: 32, offset: 768)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "synCh", file: !10, line: 11, baseType: !274, size: 64, align: 64, offset: 832)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !7, line: 1, align: 8, elements: !3)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "acceptCh", file: !10, line: 11, baseType: !274, size: 64, align: 64, offset: 896)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "sendCh", file: !10, line: 11, baseType: !274, size: 64, align: 64, offset: 960)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "recvDoneCh", file: !10, line: 11, baseType: !274, size: 64, align: 64, offset: 1024)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", file: !10, line: 11, baseType: !73, size: 8, align: 8, offset: 1088)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "shutdownErr", file: !10, line: 11, baseType: !100, size: 128, align: 64, offset: 1152)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "shutdownCh", file: !10, line: 11, baseType: !274, size: 64, align: 64, offset: 1280)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "shutdownLock", file: !10, line: 11, baseType: !217, size: 64, align: 32, offset: 1344)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "stateC", file: !10, line: 29, baseType: !38, size: 128, align: 64, offset: 960)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "stateW", file: !10, line: 30, baseType: !285, size: 64, align: 64, offset: 1088)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "Encoder", file: !10, line: 5, size: 1280, align: 8, elements: !287)
!287 = !{!288, !289, !294, !295, !316, !317, !318}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !10, line: 5, baseType: !217, size: 64, align: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !10, line: 5, baseType: !290, size: 192, align: 64, offset: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Writer,int,int}", file: !43, size: 192, align: 8, elements: !291)
!291 = !{!292, !93, !94}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "sent", file: !10, line: 5, baseType: !255, size: 64, align: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "countState", file: !10, line: 5, baseType: !296, size: 64, align: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.encoderState", file: !10, line: 5, size: 448, align: 8, elements: !298)
!298 = !{!299, !300, !309, !310, !311, !315}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "enc", file: !10, line: 5, baseType: !64, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !10, line: 5, baseType: !301, size: 64, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.encBuffer", file: !10, line: 5, size: 704, align: 8, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "data", file: !10, line: 5, baseType: !133, size: 192, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", file: !10, line: 5, baseType: !306, size: 512, align: 8, offset: 192)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 512, align: 1, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sendZero", file: !10, line: 5, baseType: !73, size: 8, align: 8, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "fieldnum", file: !10, line: 5, baseType: !27, size: 64, align: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !10, line: 5, baseType: !312, size: 72, align: 8, offset: 256)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 72, align: 1, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 9)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !10, line: 5, baseType: !64, size: 64, align: 64, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "freeList", file: !10, line: 5, baseType: !296, size: 64, align: 64, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "byteBuf", file: !10, line: 5, baseType: !302, size: 704, align: 64, offset: 448)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !10, line: 5, baseType: !100, size: 128, align: 64, offset: 1152)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "updateC", file: !10, line: 31, baseType: !38, size: 128, align: 64, offset: 1152)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "updateR", file: !10, line: 32, baseType: !321, size: 64, align: 64, offset: 1280)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "Decoder", file: !10, line: 5, size: 1024, align: 8, elements: !323)
!323 = !{!288, !324, !325, !329, !330, !331, !332, !341, !342}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !10, line: 5, baseType: !242, size: 128, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !10, line: 5, baseType: !326, size: 256, align: 64, offset: 192)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.decBuffer", file: !10, line: 5, size: 256, align: 8, elements: !327)
!327 = !{!304, !328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !10, line: 5, baseType: !27, size: 64, align: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "wireType", file: !10, line: 5, baseType: !255, size: 64, align: 64, offset: 448)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "decoderCache", file: !10, line: 5, baseType: !255, size: 64, align: 64, offset: 512)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ignorerCache", file: !10, line: 5, baseType: !255, size: 64, align: 64, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "freeList", file: !10, line: 5, baseType: !333, size: 64, align: 64, offset: 640)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.decoderState", file: !10, line: 5, size: 256, align: 8, elements: !335)
!335 = !{!336, !337, !339, !340}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "dec", file: !10, line: 5, baseType: !64, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !10, line: 5, baseType: !338, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "fieldnum", file: !10, line: 5, baseType: !27, size: 64, align: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !10, line: 5, baseType: !64, size: 64, align: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "countBuf", file: !10, line: 5, baseType: !133, size: 192, align: 64, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !10, line: 5, baseType: !100, size: 128, align: 64, offset: 896)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "errorC", file: !10, line: 33, baseType: !38, size: 128, align: 64, offset: 1344)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "errorW", file: !10, line: 34, baseType: !285, size: 64, align: 64, offset: 1472)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "dataC", file: !10, line: 35, baseType: !38, size: 128, align: 64, offset: 1536)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tornDown", file: !10, line: 37, baseType: !73, size: 8, align: 8, offset: 1664)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !10, line: 38, baseType: !348, size: 128, align: 64, offset: 1728)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !10, line: 4, size: 128, align: 8, elements: !349)
!349 = !{!350, !124}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,PrivateKey)PrivateKey}", file: !43, size: 320, align: 8, elements: !353)
!353 = !{!354, !355, !363, !367, !368}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !43, line: 4, baseType: !46, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !43, line: 4, baseType: !356, size: 64, align: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!359, !64}
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !43, size: 256, align: 8, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !43, line: 4, baseType: !141, size: 192, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !43, line: 4, baseType: !73, size: 8, align: 8, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !43, line: 4, baseType: !364, size: 64, align: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!274, !64}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !43, line: 4, baseType: !97, size: 64, align: 64, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !43, line: 4, baseType: !369, size: 64, align: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!372, !64, !372}
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !373, line: 5, size: 128, align: 8, elements: !374)
!373 = !DIFile(filename: "srv.go", directory: ".")
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !373, line: 1, baseType: !46, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !373, line: 1, baseType: !64, size: 64, align: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", file: !10, line: 39, baseType: !378, size: 64, align: 64, offset: 1856)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 39, size: 64, align: 8, elements: !380)
!380 = !{!381}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 39, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!13}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !10, line: 41, baseType: !386, size: 64, align: 64, offset: 1920)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!387 = !DILocalVariable(name: "message", arg: 4, scope: !9, file: !10, line: 155, type: !21)
!388 = !DILocation(line: 155, column: 2, scope: !9)
!389 = !DILocalVariable(name: "ss", arg: 1, scope: !9, file: !10, line: 152, type: !14)
!390 = !DILocation(line: 152, column: 1, scope: !9)
!391 = !DILocalVariable(name: "ctx", arg: 2, scope: !9, file: !10, line: 153, type: !348)
!392 = !DILocation(line: 153, column: 2, scope: !9)
!393 = !DILocalVariable(name: "code", arg: 3, scope: !9, file: !10, line: 154, type: !21)
!394 = !DILocation(line: 154, column: 2, scope: !9)
!395 = !DILocation(line: 157, column: 4, scope: !9)
!396 = !DILocation(line: 175, column: 1, scope: !9)
!397 = !DILocation(line: 157, column: 10, scope: !9)
!398 = !DILocation(line: 158, column: 10, scope: !9)
!399 = !DILocation(line: 158, column: 2, scope: !9)
!400 = !DILocation(line: 159, column: 7, scope: !9)
!401 = !DILocation(line: 159, column: 2, scope: !9)
!402 = !DILocation(line: 164, column: 5, scope: !9)
!403 = !DILocation(line: 162, column: 10, scope: !9)
!404 = !DILocation(line: 166, column: 34, scope: !405)
!405 = distinct !DILexicalBlock(scope: !9, file: !10, line: 166, column: 2)
!406 = !DILocation(line: 166, column: 14, scope: !405)
!407 = !DILocation(line: 166, column: 21, scope: !405)
!408 = !DILocalVariable(name: "err", scope: !405, file: !10, line: 166, type: !100)
!409 = !DILocation(line: 166, column: 5, scope: !9)
!410 = !DILocation(line: 169, column: 10, scope: !405)
!411 = !DILocation(line: 172, column: 6, scope: !405)
!412 = !DILocation(line: 170, column: 11, scope: !405)
!413 = !DILocation(line: 172, column: 19, scope: !405)
!414 = !DILocation(line: 160, column: 3, scope: !9)
!415 = distinct !DISubprogram(name: "daemon.SendInternalError..1command_line_arguments.Session", linkageName: "command_line_arguments.Session.SendInternalError", scope: null, file: !10, line: 179, type: !416, isLocal: false, isDefinition: true, scopeLine: 179, isOptimized: false, unit: !1, retainedNodes: !3)
!416 = !DISubroutineType(types: !417)
!417 = !{!13, !14, !14, !348}
!418 = !DILocalVariable(name: "ss", arg: 1, scope: !415, file: !10, line: 179, type: !14)
!419 = !DILocation(line: 179, column: 1, scope: !415)
!420 = !DILocalVariable(name: "ctx", arg: 2, scope: !415, file: !10, line: 180, type: !348)
!421 = !DILocation(line: 180, column: 2, scope: !415)
!422 = !DILocation(line: 186, column: 6, scope: !415)
!423 = !DILocation(line: 184, column: 7, scope: !415)
!424 = !DILocation(line: 182, column: 4, scope: !415)
!425 = distinct !DISubprogram(name: "daemon.TearDown..1command_line_arguments.Session", linkageName: "command_line_arguments.Session.TearDown", scope: null, file: !10, line: 134, type: !426, isLocal: false, isDefinition: true, scopeLine: 134, isOptimized: false, unit: !1, retainedNodes: !3)
!426 = !DISubroutineType(types: !427)
!427 = !{!13, !14, !14}
!428 = !DILocalVariable(name: "param", arg: 1, scope: !425, file: !10, line: 134, type: !14)
!429 = !DILocation(line: 134, column: 1, scope: !425)
!430 = !DILocation(line: 148, column: 1, scope: !425)
!431 = !DILocalVariable(name: "ss", scope: !425, file: !10, line: 134, type: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!433 = !DILocation(line: 135, column: 2, scope: !425)
!434 = !DILocation(line: 135, column: 4, scope: !425)
!435 = !DILocation(line: 135, column: 10, scope: !425)
!436 = !DILocation(line: 136, column: 8, scope: !425)
!437 = !DILocation(line: 136, column: 10, scope: !425)
!438 = !DILocation(line: 136, column: 2, scope: !425)
!439 = !DILocation(line: 137, column: 6, scope: !425)
!440 = !DILocation(line: 137, column: 8, scope: !425)
!441 = !DILocation(line: 137, column: 5, scope: !425)
!442 = !DILocation(line: 138, column: 3, scope: !425)
!443 = !DILocation(line: 138, column: 5, scope: !425)
!444 = !DILocation(line: 138, column: 15, scope: !425)
!445 = !DILocation(line: 139, column: 3, scope: !425)
!446 = !DILocation(line: 139, column: 5, scope: !425)
!447 = !DILocation(line: 140, column: 6, scope: !425)
!448 = !DILocation(line: 140, column: 3, scope: !425)
!449 = distinct !DISubprogram(name: "daemon.ToString..1command_line_arguments.Session", linkageName: "command_line_arguments.Session.ToString", scope: null, file: !10, line: 127, type: !450, isLocal: false, isDefinition: true, scopeLine: 127, isOptimized: false, unit: !1, retainedNodes: !3)
!450 = !DISubroutineType(types: !451)
!451 = !{!21, !14, !14}
!452 = !DILocalVariable(name: "ss", arg: 1, scope: !449, file: !10, line: 127, type: !14)
!453 = !DILocation(line: 127, column: 1, scope: !449)
!454 = !DILocation(line: 129, column: 17, scope: !449)
!455 = !DILocation(line: 129, column: 34, scope: !449)
!456 = !DILocation(line: 128, column: 13, scope: !449)
!457 = !DILocation(line: 128, column: 2, scope: !449)
!458 = distinct !DISubprogram(name: "daemon.NewSession", linkageName: "command_line_arguments.NewSession", scope: null, file: !10, line: 46, type: !459, isLocal: false, isDefinition: true, scopeLine: 46, isOptimized: false, unit: !1, retainedNodes: !3)
!459 = !DISubroutineType(types: !460)
!460 = !{!461, !348, !378, !38}
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Session,error}", file: !43, size: 192, align: 8, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !43, line: 50, baseType: !14, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !43, line: 50, baseType: !100, size: 128, align: 64, offset: 64)
!465 = !DILocalVariable(name: "ctx", arg: 1, scope: !458, file: !10, line: 47, type: !348)
!466 = !DILocation(line: 47, column: 2, scope: !458)
!467 = !DILocalVariable(name: "cancel", arg: 2, scope: !458, file: !10, line: 48, type: !378)
!468 = !DILocation(line: 48, column: 2, scope: !458)
!469 = !DILocalVariable(name: "conn", arg: 3, scope: !458, file: !10, line: 49, type: !38)
!470 = !DILocation(line: 49, column: 2, scope: !458)
!471 = !DILocalVariable(name: "$ret0", scope: !458, file: !10, line: 50, type: !14)
!472 = !DILocation(line: 50, column: 4, scope: !458)
!473 = !DILocation(line: 51, column: 27, scope: !474)
!474 = distinct !DILexicalBlock(scope: !458, file: !10, line: 46, column: 1)
!475 = !DILocation(line: 51, column: 20, scope: !474)
!476 = !DILocalVariable(name: "mux", scope: !474, file: !10, line: 51, type: !179)
!477 = !DILocation(line: 51, column: 2, scope: !458)
!478 = !DILocalVariable(name: "err", scope: !474, file: !10, line: 51, type: !100)
!479 = !DILocation(line: 52, column: 9, scope: !474)
!480 = !DILocation(line: 64, column: 13, scope: !474)
!481 = !DILocation(line: 58, column: 8, scope: !474)
!482 = !DILocation(line: 58, column: 9, scope: !474)
!483 = !DILocalVariable(name: "ss", scope: !474, file: !10, line: 58, type: !14)
!484 = !DILocation(line: 58, column: 2, scope: !458)
!485 = !DILocation(line: 68, column: 22, scope: !474)
!486 = !DILocation(line: 68, column: 4, scope: !474)
!487 = !DILocation(line: 54, column: 33, scope: !474)
!488 = !DILocation(line: 54, column: 11, scope: !474)
!489 = !DILocation(line: 53, column: 22, scope: !474)
!490 = !DILocalVariable(name: "$ret1", scope: !458, file: !10, line: 50, type: !100)
!491 = !DILocation(line: 50, column: 14, scope: !458)
!492 = !DILocation(line: 53, column: 3, scope: !474)
!493 = !DILocation(line: 68, column: 17, scope: !474)
!494 = !DILocation(line: 69, column: 9, scope: !474)
!495 = !DILocation(line: 70, column: 5, scope: !474)
!496 = !DILocation(line: 72, column: 48, scope: !474)
!497 = !DILocation(line: 72, column: 11, scope: !474)
!498 = !DILocation(line: 71, column: 22, scope: !474)
!499 = !DILocation(line: 71, column: 3, scope: !474)
!500 = !DILocation(line: 75, column: 31, scope: !474)
!501 = !DILocation(line: 75, column: 18, scope: !474)
!502 = !DILocation(line: 75, column: 4, scope: !474)
!503 = !DILocation(line: 75, column: 12, scope: !474)
!504 = !DILocation(line: 78, column: 23, scope: !474)
!505 = !DILocation(line: 78, column: 4, scope: !474)
!506 = !DILocation(line: 78, column: 18, scope: !474)
!507 = !DILocation(line: 79, column: 9, scope: !474)
!508 = !DILocation(line: 80, column: 5, scope: !474)
!509 = !DILocation(line: 82, column: 49, scope: !474)
!510 = !DILocation(line: 82, column: 11, scope: !474)
!511 = !DILocation(line: 81, column: 22, scope: !474)
!512 = !DILocation(line: 81, column: 3, scope: !474)
!513 = !DILocation(line: 85, column: 32, scope: !474)
!514 = !DILocation(line: 85, column: 19, scope: !474)
!515 = !DILocation(line: 85, column: 4, scope: !474)
!516 = !DILocation(line: 85, column: 13, scope: !474)
!517 = !DILocation(line: 87, column: 6, scope: !474)
!518 = !DILocalVariable(name: "hello", scope: !474, file: !10, line: 87, type: !519)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "SessionHello", file: !10, line: 12, size: 896, align: 8, elements: !521)
!521 = !{!522, !523, !524, !525, !526}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Warp", file: !10, line: 12, baseType: !21, size: 128, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "From", file: !10, line: 12, baseType: !18, size: 384, align: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !10, line: 12, baseType: !21, size: 128, align: 64, offset: 512)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !10, line: 12, baseType: !32, size: 128, align: 64, offset: 640)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Username", file: !10, line: 12, baseType: !21, size: 128, align: 64, offset: 768)
!527 = !DILocation(line: 87, column: 6, scope: !458)
!528 = !DILocation(line: 88, column: 14, scope: !529)
!529 = distinct !DILexicalBlock(scope: !474, file: !10, line: 88, column: 2)
!530 = !DILocation(line: 88, column: 30, scope: !529)
!531 = !DILocation(line: 88, column: 22, scope: !529)
!532 = !DILocalVariable(name: "err", scope: !529, file: !10, line: 88, type: !100)
!533 = !DILocation(line: 88, column: 5, scope: !474)
!534 = !DILocation(line: 88, column: 43, scope: !529)
!535 = !DILocation(line: 89, column: 5, scope: !529)
!536 = !DILocation(line: 91, column: 51, scope: !529)
!537 = !DILocation(line: 91, column: 11, scope: !529)
!538 = !DILocation(line: 90, column: 22, scope: !529)
!539 = !DILocation(line: 90, column: 3, scope: !529)
!540 = !DILocation(line: 94, column: 20, scope: !474)
!541 = !DILocation(line: 94, column: 13, scope: !474)
!542 = !DILocation(line: 95, column: 4, scope: !474)
!543 = !DILocation(line: 95, column: 10, scope: !474)
!544 = !DILocation(line: 96, column: 4, scope: !474)
!545 = !DILocation(line: 96, column: 24, scope: !474)
!546 = !DILocation(line: 96, column: 17, scope: !474)
!547 = !DILocation(line: 97, column: 4, scope: !474)
!548 = !DILocation(line: 97, column: 21, scope: !474)
!549 = !DILocation(line: 97, column: 14, scope: !474)
!550 = !DILocation(line: 101, column: 5, scope: !474)
!551 = !DILocation(line: 99, column: 10, scope: !474)
!552 = !DILocation(line: 105, column: 22, scope: !474)
!553 = !DILocation(line: 105, column: 4, scope: !474)
!554 = !DILocation(line: 105, column: 17, scope: !474)
!555 = !DILocation(line: 106, column: 9, scope: !474)
!556 = !DILocation(line: 107, column: 5, scope: !474)
!557 = !DILocation(line: 109, column: 48, scope: !474)
!558 = !DILocation(line: 109, column: 11, scope: !474)
!559 = !DILocation(line: 108, column: 22, scope: !474)
!560 = !DILocation(line: 108, column: 3, scope: !474)
!561 = !DILocation(line: 112, column: 31, scope: !474)
!562 = !DILocation(line: 112, column: 18, scope: !474)
!563 = !DILocation(line: 112, column: 4, scope: !474)
!564 = !DILocation(line: 112, column: 12, scope: !474)
!565 = !DILocation(line: 115, column: 21, scope: !474)
!566 = !DILocation(line: 115, column: 4, scope: !474)
!567 = !DILocation(line: 115, column: 16, scope: !474)
!568 = !DILocation(line: 116, column: 9, scope: !474)
!569 = !DILocation(line: 117, column: 5, scope: !474)
!570 = !DILocation(line: 119, column: 47, scope: !474)
!571 = !DILocation(line: 119, column: 11, scope: !474)
!572 = !DILocation(line: 118, column: 22, scope: !474)
!573 = !DILocation(line: 118, column: 3, scope: !474)
!574 = !DILocation(line: 123, column: 2, scope: !474)
!575 = distinct !DISubprogram(name: "daemon.command_line_arguments..thunk1", scope: null, file: !10, line: 136, type: !576, isLocal: true, isDefinition: true, scopeLine: 136, isOptimized: false, unit: !1, retainedNodes: !3)
!576 = !DISubroutineType(types: !577)
!577 = !{!73, !578}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Mutex}", file: !43, size: 64, align: 8, elements: !580)
!580 = !{!581}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !43, line: 136, baseType: !386, size: 64, align: 64)
!582 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !575, file: !10, line: 136, type: !578)
!583 = !DILocation(line: 136, column: 2, scope: !575)
!584 = !DILocalVariable(name: "$ret14", scope: !575, file: !10, line: 136, type: !73)
!585 = distinct !DISubprogram(name: "daemon.func1", scope: null, file: !10, line: 140, type: !383, isLocal: true, isDefinition: true, scopeLine: 140, isOptimized: false, unit: !1, retainedNodes: !3)
!586 = !DILocation(line: 143, column: 9, scope: !585)
!587 = !DILocation(line: 145, column: 4, scope: !585)
!588 = !DILocation(line: 145, column: 6, scope: !585)
!589 = !DILocation(line: 145, column: 10, scope: !585)
!590 = distinct !DISubprogram(name: "daemon.command_line_arguments..thunk2", scope: null, file: !10, line: 140, type: !591, isLocal: true, isDefinition: true, scopeLine: 140, isOptimized: false, unit: !1, retainedNodes: !3)
!591 = !DISubroutineType(types: !592)
!592 = !{!13, !593}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*__go_descriptor}", file: !43, size: 64, align: 8, elements: !595)
!595 = !{!596}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !43, line: 140, baseType: !378, size: 64, align: 64)
!597 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !590, file: !10, line: 140, type: !593)
!598 = !DILocation(line: 140, column: 3, scope: !590)
!599 = distinct !DISubprogram(name: "daemon.command_line_arguments..thunk3", scope: null, file: !10, line: 158, type: !576, isLocal: true, isDefinition: true, scopeLine: 158, isOptimized: false, unit: !1, retainedNodes: !3)
!600 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !599, file: !10, line: 158, type: !578)
!601 = !DILocation(line: 158, column: 2, scope: !599)
!602 = !DILocalVariable(name: "$ret15", scope: !599, file: !10, line: 158, type: !73)
!603 = distinct !DISubprogram(name: "daemon.Run..1command_line_arguments.Srv", linkageName: "command_line_arguments.Srv.Run", scope: null, file: !373, line: 42, type: !604, isLocal: false, isDefinition: true, scopeLine: 42, isOptimized: false, unit: !1, retainedNodes: !3)
!604 = !DISubroutineType(types: !605)
!605 = !{!100, !606, !606, !348}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "Srv", file: !373, line: 16, size: 512, align: 8, elements: !608)
!608 = !{!609, !610, !611, !612, !613}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "address", file: !373, line: 17, baseType: !21, size: 128, align: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "certFile", file: !373, line: 18, baseType: !21, size: 128, align: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "keyFile", file: !373, line: 19, baseType: !21, size: 128, align: 64, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "warps", file: !373, line: 21, baseType: !255, size: 64, align: 64, offset: 384)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !373, line: 22, baseType: !386, size: 64, align: 64, offset: 448)
!614 = !DILocalVariable(name: "param", arg: 1, scope: !603, file: !373, line: 42, type: !606)
!615 = !DILocation(line: 42, column: 1, scope: !603)
!616 = !DILocalVariable(name: "param", arg: 2, scope: !603, file: !373, line: 43, type: !348)
!617 = !DILocation(line: 43, column: 2, scope: !603)
!618 = !DILocalVariable(name: "$ret4", scope: !603, file: !373, line: 44, type: !100)
!619 = !DILocation(line: 44, column: 3, scope: !603)
!620 = !DILocation(line: 109, column: 1, scope: !603)
!621 = !DILocalVariable(name: "s", scope: !603, file: !373, line: 42, type: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!623 = !DILocalVariable(name: "ctx", scope: !603, file: !373, line: 43, type: !624)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!625 = !DILocation(line: 47, column: 5, scope: !626)
!626 = distinct !DILexicalBlock(scope: !603, file: !373, line: 42, column: 1)
!627 = !DILocation(line: 47, column: 6, scope: !626)
!628 = !DILocation(line: 47, column: 16, scope: !626)
!629 = !DILocation(line: 47, column: 25, scope: !626)
!630 = !DILocation(line: 47, column: 26, scope: !626)
!631 = !DILocation(line: 47, column: 35, scope: !626)
!632 = !DILocation(line: 48, column: 35, scope: !633)
!633 = distinct !DILexicalBlock(scope: !626, file: !373, line: 47, column: 41)
!634 = !DILocation(line: 48, column: 36, scope: !633)
!635 = !DILocation(line: 0, scope: !636)
!636 = distinct !DILexicalBlock(scope: !626, file: !373, line: 75, column: 4)
!637 = !DILocalVariable(name: "ln", scope: !626, file: !373, line: 45, type: !638)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "Listener", file: !10, line: 7, size: 128, align: 8, elements: !639)
!639 = !{!640, !124}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 7, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Conn,error},*func(*void)Addr,*func(*void)error}", file: !43, size: 256, align: 8, elements: !643)
!643 = !{!45, !644, !652, !653}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Accept", file: !43, line: 7, baseType: !645, size: 64, align: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!648, !64}
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Conn,error}", file: !43, size: 256, align: 8, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !43, line: 7, baseType: !38, size: 128, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !43, line: 7, baseType: !100, size: 128, align: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", file: !43, line: 7, baseType: !113, size: 64, align: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !43, line: 7, baseType: !97, size: 64, align: 64, offset: 192)
!654 = !DILocation(line: 45, column: 6, scope: !603)
!655 = !DILocation(line: 83, column: 2, scope: !626)
!656 = !DILocation(line: 77, column: 31, scope: !636)
!657 = !DILocation(line: 77, column: 32, scope: !636)
!658 = !DILocation(line: 48, column: 47, scope: !633)
!659 = !DILocation(line: 48, column: 48, scope: !633)
!660 = !DILocation(line: 48, column: 19, scope: !633)
!661 = !DILocalVariable(name: "err", scope: !633, file: !373, line: 48, type: !100)
!662 = !DILocation(line: 48, column: 3, scope: !626)
!663 = !DILocation(line: 49, column: 10, scope: !633)
!664 = !DILocation(line: 50, column: 18, scope: !633)
!665 = !DILocation(line: 54, column: 18, scope: !633)
!666 = !DILocation(line: 60, column: 18, scope: !633)
!667 = !DILocation(line: 56, column: 22, scope: !633)
!668 = !DILocation(line: 53, column: 16, scope: !633)
!669 = !DILocation(line: 53, column: 21, scope: !633)
!670 = !DILocalVariable(name: "tlsConfig", scope: !633, file: !373, line: 53, type: !671)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !373, line: 5, size: 2944, align: 8, elements: !673)
!673 = !{!674, !675, !683, !848, !849, !886, !899, !910, !926, !933, !934, !935, !937, !938, !939, !940, !941, !942, !946, !974, !975, !976, !977, !978, !980, !981, !986, !994}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Rand", file: !373, line: 5, baseType: !242, size: 128, align: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Time", file: !373, line: 5, baseType: !676, size: 64, align: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !373, line: 5, size: 64, align: 8, elements: !678)
!678 = !{!679}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !373, line: 5, baseType: !680, size: 64, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!141}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Certificates", file: !373, line: 5, baseType: !684, size: 192, align: 64, offset: 192)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,int,int}", file: !43, size: 192, align: 8, elements: !685)
!685 = !{!686, !93, !94}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !687, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !373, line: 5, size: 768, align: 8, elements: !689)
!689 = !{!690, !695, !696, !697, !698}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Certificate", file: !373, line: 5, baseType: !691, size: 192, align: 64)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !43, size: 192, align: 8, elements: !692)
!692 = !{!693, !93, !94}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !694, size: 64, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "PrivateKey", file: !373, line: 5, baseType: !372, size: 128, align: 64, offset: 192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPStaple", file: !373, line: 5, baseType: !133, size: 192, align: 64, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !373, line: 5, baseType: !691, size: 192, align: 64, offset: 512)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Leaf", file: !373, line: 5, baseType: !699, size: 64, align: 64, offset: 704)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !373, line: 5, size: 10624, align: 8, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !707, !708, !710, !712, !713, !714, !727, !756, !757, !758, !759, !761, !771, !772, !777, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !804, !827, !828, !829, !830, !841, !842, !843, !844, !845, !846, !847}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !373, line: 5, baseType: !133, size: 192, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !373, line: 5, baseType: !133, size: 192, align: 64, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !373, line: 5, baseType: !133, size: 192, align: 64, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !373, line: 5, baseType: !133, size: 192, align: 64, offset: 576)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !373, line: 5, baseType: !133, size: 192, align: 64, offset: 768)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !373, line: 5, baseType: !133, size: 192, align: 64, offset: 960)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !373, line: 5, baseType: !709, size: 64, align: 64, offset: 1152)
!709 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !373, line: 5, baseType: !711, size: 64, align: 64, offset: 1216)
!711 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !373, line: 5, baseType: !372, size: 128, align: 64, offset: 1280)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !373, line: 5, baseType: !27, size: 64, align: 64, offset: 1408)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !373, line: 5, baseType: !715, size: 64, align: 64, offset: 1472)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !373, line: 5, size: 256, align: 8, elements: !717)
!717 = !{!718, !719}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !373, line: 5, baseType: !73, size: 8, align: 8)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !373, line: 5, baseType: !720, size: 192, align: 64, offset: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !373, line: 5, size: 192, align: 8, elements: !721)
!721 = !{!722, !725, !726}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !373, line: 1, baseType: !723, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !373, line: 1, baseType: !27, size: 64, align: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !373, line: 1, baseType: !27, size: 64, align: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !373, line: 5, baseType: !728, size: 1984, align: 64, offset: 1536)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !373, line: 5, size: 1984, align: 8, elements: !729)
!729 = !{!730, !734, !735, !736, !737, !738, !739, !740, !741, !742, !755}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !373, line: 5, baseType: !731, size: 192, align: 64)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !43, size: 192, align: 8, elements: !732)
!732 = !{!733, !93, !94}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !76, size: 64, align: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !373, line: 5, baseType: !731, size: 192, align: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !373, line: 5, baseType: !731, size: 192, align: 64, offset: 384)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !373, line: 5, baseType: !731, size: 192, align: 64, offset: 576)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !373, line: 5, baseType: !731, size: 192, align: 64, offset: 768)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !373, line: 5, baseType: !731, size: 192, align: 64, offset: 960)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !373, line: 5, baseType: !731, size: 192, align: 64, offset: 1152)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !373, line: 5, baseType: !21, size: 128, align: 64, offset: 1344)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !373, line: 5, baseType: !21, size: 128, align: 64, offset: 1472)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !373, line: 5, baseType: !743, size: 192, align: 64, offset: 1600)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !43, size: 192, align: 8, elements: !744)
!744 = !{!745, !93, !94}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !746, size: 64, align: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !373, line: 5, size: 320, align: 8, elements: !748)
!748 = !{!749, !754}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !373, line: 5, baseType: !750, size: 192, align: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !373, line: 5, size: 192, align: 8, elements: !751)
!751 = !{!752, !725, !726}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !373, line: 1, baseType: !753, size: 64, align: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !373, line: 5, baseType: !372, size: 128, align: 64, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !373, line: 5, baseType: !743, size: 192, align: 64, offset: 1792)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !373, line: 5, baseType: !728, size: 1984, align: 64, offset: 3520)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !373, line: 5, baseType: !141, size: 192, align: 64, offset: 5504)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !373, line: 5, baseType: !141, size: 192, align: 64, offset: 5696)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !373, line: 5, baseType: !760, size: 64, align: 64, offset: 5888)
!760 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !373, line: 5, baseType: !762, size: 192, align: 64, offset: 5952)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !43, size: 192, align: 8, elements: !763)
!763 = !{!764, !93, !94}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !765, size: 64, align: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !373, line: 5, size: 448, align: 8, elements: !767)
!767 = !{!768, !769, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !373, line: 5, baseType: !750, size: 192, align: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !373, line: 5, baseType: !73, size: 8, align: 8, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !373, line: 5, baseType: !133, size: 192, align: 64, offset: 256)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !373, line: 5, baseType: !762, size: 192, align: 64, offset: 6144)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !373, line: 5, baseType: !773, size: 192, align: 64, offset: 6336)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !43, size: 192, align: 8, elements: !774)
!774 = !{!775, !93, !94}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !776, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !373, line: 5, baseType: !778, size: 192, align: 64, offset: 6528)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !43, size: 192, align: 8, elements: !779)
!779 = !{!780, !93, !94}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !781, size: 64, align: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !373, line: 5, baseType: !773, size: 192, align: 64, offset: 6720)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !373, line: 5, baseType: !73, size: 8, align: 8, offset: 6912)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !373, line: 5, baseType: !73, size: 8, align: 8, offset: 6920)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !373, line: 5, baseType: !27, size: 64, align: 64, offset: 6976)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !373, line: 5, baseType: !73, size: 8, align: 8, offset: 7040)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !373, line: 5, baseType: !133, size: 192, align: 64, offset: 7104)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !373, line: 5, baseType: !133, size: 192, align: 64, offset: 7296)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !373, line: 5, baseType: !731, size: 192, align: 64, offset: 7488)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !373, line: 5, baseType: !731, size: 192, align: 64, offset: 7680)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !373, line: 5, baseType: !731, size: 192, align: 64, offset: 7872)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !373, line: 5, baseType: !731, size: 192, align: 64, offset: 8064)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !373, line: 5, baseType: !795, size: 192, align: 64, offset: 8256)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !43, size: 192, align: 8, elements: !796)
!796 = !{!797, !93, !94}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !798, size: 64, align: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !10, line: 7, size: 192, align: 8, elements: !800)
!800 = !{!801, !802, !803}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !24, size: 64, align: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !27, size: 64, align: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !27, size: 64, align: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !373, line: 5, baseType: !805, size: 192, align: 64, offset: 8448)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !43, size: 192, align: 8, elements: !806)
!806 = !{!807, !93, !94}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !808, size: 64, align: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !373, line: 5, size: 1024, align: 8, elements: !811)
!811 = !{!812, !813, !814, !821, !822, !823, !824, !825, !826}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !373, line: 5, baseType: !21, size: 128, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !373, line: 5, baseType: !21, size: 128, align: 64, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !373, line: 5, baseType: !815, size: 64, align: 64, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !373, line: 5, size: 320, align: 8, elements: !817)
!817 = !{!818, !819, !820}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !373, line: 5, baseType: !21, size: 128, align: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !373, line: 5, baseType: !21, size: 128, align: 64, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !373, line: 5, baseType: !73, size: 8, align: 8, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !373, line: 5, baseType: !21, size: 128, align: 64, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !373, line: 5, baseType: !21, size: 128, align: 64, offset: 448)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !373, line: 5, baseType: !21, size: 128, align: 64, offset: 576)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !373, line: 5, baseType: !73, size: 8, align: 8, offset: 704)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !373, line: 5, baseType: !21, size: 128, align: 64, offset: 768)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !373, line: 5, baseType: !21, size: 128, align: 64, offset: 896)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !373, line: 5, baseType: !73, size: 8, align: 8, offset: 8640)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !373, line: 5, baseType: !731, size: 192, align: 64, offset: 8704)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !373, line: 5, baseType: !731, size: 192, align: 64, offset: 8896)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !373, line: 5, baseType: !831, size: 192, align: 64, offset: 9088)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !43, size: 192, align: 8, elements: !832)
!832 = !{!833, !93, !94}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !834, size: 64, align: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !10, line: 7, size: 384, align: 8, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !10, line: 7, baseType: !799, size: 192, align: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !10, line: 7, baseType: !840, size: 192, align: 64, offset: 192)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !10, line: 7, size: 192, align: 8, elements: !800)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !373, line: 5, baseType: !831, size: 192, align: 64, offset: 9280)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !373, line: 5, baseType: !731, size: 192, align: 64, offset: 9472)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !373, line: 5, baseType: !731, size: 192, align: 64, offset: 9664)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !373, line: 5, baseType: !731, size: 192, align: 64, offset: 9856)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !373, line: 5, baseType: !731, size: 192, align: 64, offset: 10048)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !373, line: 5, baseType: !731, size: 192, align: 64, offset: 10240)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !373, line: 5, baseType: !773, size: 192, align: 64, offset: 10432)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "NameToCertificate", file: !373, line: 5, baseType: !255, size: 64, align: 64, offset: 384)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "GetCertificate", file: !373, line: 5, baseType: !850, size: 64, align: 64, offset: 448)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !373, line: 5, size: 64, align: 8, elements: !852)
!852 = !{!853}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !373, line: 5, baseType: !854, size: 64, align: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!857, !861}
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,error}", file: !43, size: 192, align: 8, elements: !858)
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !43, line: 5, baseType: !687, size: 64, align: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !43, line: 5, baseType: !100, size: 128, align: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientHelloInfo", file: !373, line: 5, size: 1408, align: 8, elements: !863)
!863 = !{!864, !869, !870, !876, !877, !883, !884, !885}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuites", file: !373, line: 5, baseType: !865, size: 192, align: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint16,int,int}", file: !43, size: 192, align: 8, elements: !866)
!866 = !{!867, !93, !94}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !868, size: 64, align: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !373, line: 5, baseType: !21, size: 128, align: 64, offset: 192)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedCurves", file: !373, line: 5, baseType: !871, size: 192, align: 64, offset: 320)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*CurveID,int,int}", file: !43, size: 192, align: 8, elements: !872)
!872 = !{!873, !93, !94}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !874, size: 64, align: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIBasicType(name: "CurveID", size: 16, encoding: DW_ATE_unsigned)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedPoints", file: !373, line: 5, baseType: !133, size: 192, align: 64, offset: 512)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureSchemes", file: !373, line: 5, baseType: !878, size: 192, align: 64, offset: 704)
!878 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*SignatureScheme,int,int}", file: !43, size: 192, align: 8, elements: !879)
!879 = !{!880, !93, !94}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !881, size: 64, align: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DIBasicType(name: "SignatureScheme", size: 16, encoding: DW_ATE_unsigned)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedProtos", file: !373, line: 5, baseType: !731, size: 192, align: 64, offset: 896)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedVersions", file: !373, line: 5, baseType: !865, size: 192, align: 64, offset: 1088)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "Conn", file: !373, line: 5, baseType: !38, size: 128, align: 64, offset: 1280)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "GetClientCertificate", file: !373, line: 5, baseType: !887, size: 64, align: 64, offset: 512)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !373, line: 5, size: 64, align: 8, elements: !889)
!889 = !{!890}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !373, line: 5, baseType: !891, size: 64, align: 64)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!857, !894}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertificateRequestInfo", file: !373, line: 5, size: 384, align: 8, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptableCAs", file: !373, line: 5, baseType: !691, size: 192, align: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureSchemes", file: !373, line: 5, baseType: !878, size: 192, align: 64, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "GetConfigForClient", file: !373, line: 5, baseType: !900, size: 64, align: 64, offset: 576)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !373, line: 5, size: 64, align: 8, elements: !902)
!902 = !{!903}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !373, line: 5, baseType: !904, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!907, !861}
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Config,error}", file: !43, size: 192, align: 8, elements: !908)
!908 = !{!909, !860}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !43, line: 5, baseType: !64, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "VerifyPeerCertificate", file: !373, line: 5, baseType: !911, size: 64, align: 64, offset: 640)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !373, line: 5, size: 64, align: 8, elements: !913)
!913 = !{!914}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !373, line: 5, baseType: !915, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!100, !691, !918}
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !43, size: 192, align: 8, elements: !919)
!919 = !{!920, !93, !94}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !43, size: 192, align: 8, elements: !923)
!923 = !{!924, !93, !94}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !925, size: 64, align: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "RootCAs", file: !373, line: 5, baseType: !927, size: 64, align: 64, offset: 704)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertPool", file: !373, line: 5, size: 320, align: 8, elements: !929)
!929 = !{!930, !931, !932}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "bySubjectKeyId", file: !373, line: 5, baseType: !255, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "byName", file: !373, line: 5, baseType: !255, size: 64, align: 64, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "certs", file: !373, line: 5, baseType: !922, size: 192, align: 64, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "NextProtos", file: !373, line: 5, baseType: !731, size: 192, align: 64, offset: 768)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !373, line: 5, baseType: !21, size: 128, align: 64, offset: 960)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAuth", file: !373, line: 5, baseType: !936, size: 64, align: 64, offset: 1088)
!936 = !DIBasicType(name: "ClientAuthType", size: 64, encoding: DW_ATE_signed)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ClientCAs", file: !373, line: 5, baseType: !927, size: 64, align: 64, offset: 1152)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "InsecureSkipVerify", file: !373, line: 5, baseType: !73, size: 8, align: 8, offset: 1216)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuites", file: !373, line: 5, baseType: !865, size: 192, align: 64, offset: 1280)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "PreferServerCipherSuites", file: !373, line: 5, baseType: !73, size: 8, align: 8, offset: 1472)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "SessionTicketsDisabled", file: !373, line: 5, baseType: !73, size: 8, align: 8, offset: 1480)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "SessionTicketKey", file: !373, line: 5, baseType: !943, size: 256, align: 8, offset: 1488)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 256, align: 1, elements: !944)
!944 = !{!945}
!945 = !DISubrange(count: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "ClientSessionCache", file: !373, line: 5, baseType: !947, size: 128, align: 64, offset: 1792)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientSessionCache", file: !373, line: 5, size: 128, align: 8, elements: !948)
!948 = !{!949, !376}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !373, line: 5, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)struct{*ClientSessionState,bool},*func(*void,string,*ClientSessionState)void}", file: !43, size: 192, align: 8, elements: !952)
!952 = !{!203, !953, !970}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !43, line: 5, baseType: !954, size: 64, align: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!957, !64, !21}
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ClientSessionState,bool}", file: !43, size: 128, align: 8, elements: !958)
!958 = !{!959, !969}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "session", file: !43, line: 5, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientSessionState", file: !373, line: 5, size: 832, align: 8, elements: !962)
!962 = !{!963, !964, !965, !966, !967, !968}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "sessionTicket", file: !373, line: 5, baseType: !133, size: 192, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "vers", file: !373, line: 5, baseType: !262, size: 16, align: 16, offset: 192)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "cipherSuite", file: !373, line: 5, baseType: !262, size: 16, align: 16, offset: 208)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "masterSecret", file: !373, line: 5, baseType: !133, size: 192, align: 64, offset: 256)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "serverCertificates", file: !373, line: 5, baseType: !922, size: 192, align: 64, offset: 448)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "verifiedChains", file: !373, line: 5, baseType: !918, size: 192, align: 64, offset: 640)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !43, line: 5, baseType: !73, size: 8, align: 8, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "Put", file: !43, line: 5, baseType: !971, size: 64, align: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!13, !64, !21, !960}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "MinVersion", file: !373, line: 5, baseType: !262, size: 16, align: 16, offset: 1920)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "MaxVersion", file: !373, line: 5, baseType: !262, size: 16, align: 16, offset: 1936)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "CurvePreferences", file: !373, line: 5, baseType: !871, size: 192, align: 64, offset: 1984)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "DynamicRecordSizingDisabled", file: !373, line: 5, baseType: !73, size: 8, align: 8, offset: 2176)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "Renegotiation", file: !373, line: 5, baseType: !979, size: 64, align: 64, offset: 2240)
!979 = !DIBasicType(name: "RenegotiationSupport", size: 64, encoding: DW_ATE_signed)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "KeyLogWriter", file: !373, line: 5, baseType: !197, size: 128, align: 64, offset: 2304)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "serverInitOnce", file: !373, line: 5, baseType: !982, size: 96, align: 32, offset: 2432)
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once", file: !10, line: 7, size: 96, align: 8, elements: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !10, line: 7, baseType: !217, size: 64, align: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "done", file: !10, line: 7, baseType: !8, size: 32, align: 32, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !373, line: 5, baseType: !987, size: 192, align: 32, offset: 2528)
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !10, line: 8, size: 192, align: 8, elements: !988)
!988 = !{!989, !990, !991, !992, !993}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !10, line: 8, baseType: !217, size: 64, align: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !10, line: 8, baseType: !8, size: 32, align: 32, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !10, line: 8, baseType: !8, size: 32, align: 32, offset: 96)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !10, line: 8, baseType: !183, size: 32, align: 32, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !10, line: 8, baseType: !183, size: 32, align: 32, offset: 160)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "sessionTicketKeys", file: !373, line: 5, baseType: !995, size: 192, align: 64, offset: 2752)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.crypto/tls.ticketKey,int,int}", file: !43, size: 192, align: 8, elements: !996)
!996 = !{!997, !93, !94}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DICompositeType(tag: DW_TAG_structure_type, name: ".crypto/tls.ticketKey", file: !373, line: 5, size: 384, align: 8, elements: !1000)
!1000 = !{!1001, !1005, !1006}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "keyName", file: !373, line: 5, baseType: !1002, size: 128, align: 8)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 128, align: 1, elements: !1003)
!1003 = !{!1004}
!1004 = !DISubrange(count: 16)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "aesKey", file: !373, line: 5, baseType: !1002, size: 128, align: 8, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "hmacKey", file: !373, line: 5, baseType: !1002, size: 128, align: 8, offset: 256)
!1007 = !DILocation(line: 53, column: 3, scope: !626)
!1008 = !DILocation(line: 68, column: 31, scope: !633)
!1009 = !DILocation(line: 68, column: 32, scope: !633)
!1010 = !DILocation(line: 68, column: 17, scope: !633)
!1011 = !DILocation(line: 69, column: 10, scope: !633)
!1012 = !DILocation(line: 70, column: 18, scope: !633)
!1013 = !DILocation(line: 74, column: 4, scope: !633)
!1014 = !DILocation(line: 74, column: 5, scope: !633)
!1015 = !DILocation(line: 74, column: 16, scope: !633)
!1016 = !DILocation(line: 74, column: 15, scope: !633)
!1017 = !DILocation(line: 74, column: 27, scope: !633)
!1018 = !DILocation(line: 74, column: 28, scope: !633)
!1019 = !DILocation(line: 72, column: 11, scope: !633)
!1020 = !DILocation(line: 77, column: 17, scope: !636)
!1021 = !DILocalVariable(name: "err", scope: !636, file: !373, line: 76, type: !100)
!1022 = !DILocation(line: 76, column: 7, scope: !626)
!1023 = !DILocation(line: 78, column: 10, scope: !636)
!1024 = !DILocation(line: 79, column: 18, scope: !636)
!1025 = !DILocation(line: 81, column: 56, scope: !636)
!1026 = !DILocation(line: 81, column: 57, scope: !636)
!1027 = !DILocation(line: 81, column: 11, scope: !636)
!1028 = !DILocation(line: 86, column: 18, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !626, file: !373, line: 85, column: 6)
!1030 = !DILocation(line: 86, column: 3, scope: !1029)
!1031 = !DILocalVariable(name: "conn", scope: !1029, file: !373, line: 86, type: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!1033 = !DILocation(line: 86, column: 3, scope: !626)
!1034 = !DILocalVariable(name: "err", scope: !1029, file: !373, line: 86, type: !100)
!1035 = !DILocation(line: 87, column: 10, scope: !1029)
!1036 = !DILocation(line: 90, column: 9, scope: !1029)
!1037 = !DILocation(line: 94, column: 6, scope: !1029)
!1038 = !DILocation(line: 90, column: 22, scope: !1029)
!1039 = !DILocation(line: 88, column: 12, scope: !1029)
!1040 = !DILocation(line: 90, column: 33, scope: !1029)
!1041 = !DILocation(line: 94, column: 3, scope: !1029)
!1042 = !DILocation(line: 50, column: 4, scope: !603)
!1043 = distinct !DISubprogram(name: "daemon.handle..1command_line_arguments.Srv", linkageName: "command_line_arguments.Srv.handle", scope: null, file: !373, line: 112, type: !1044, isLocal: false, isDefinition: true, scopeLine: 112, isOptimized: false, unit: !1, retainedNodes: !3)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!100, !606, !606, !348, !38}
!1046 = !DILocalVariable(name: "s", arg: 1, scope: !1043, file: !373, line: 112, type: !606)
!1047 = !DILocation(line: 112, column: 1, scope: !1043)
!1048 = !DILocalVariable(name: "ctx", arg: 2, scope: !1043, file: !373, line: 113, type: !348)
!1049 = !DILocation(line: 113, column: 2, scope: !1043)
!1050 = !DILocalVariable(name: "conn", arg: 3, scope: !1043, file: !373, line: 114, type: !38)
!1051 = !DILocation(line: 114, column: 2, scope: !1043)
!1052 = !DILocalVariable(name: "$ret5", scope: !1043, file: !373, line: 115, type: !100)
!1053 = !DILocation(line: 115, column: 3, scope: !1043)
!1054 = !DILocation(line: 118, column: 7, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1043, file: !373, line: 112, column: 1)
!1056 = !DILocation(line: 141, column: 1, scope: !1043)
!1057 = !DILocation(line: 118, column: 20, scope: !1055)
!1058 = !DILocation(line: 116, column: 10, scope: !1055)
!1059 = !DILocation(line: 122, column: 25, scope: !1055)
!1060 = !DILocalVariable(name: "cancel", scope: !1055, file: !373, line: 122, type: !1061)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 4, size: 64, align: 8, elements: !1063)
!1063 = !{!1064}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 4, baseType: !382, size: 64, align: 64)
!1065 = !DILocation(line: 122, column: 2, scope: !1043)
!1066 = !DILocation(line: 124, column: 13, scope: !1055)
!1067 = !DILocalVariable(name: "ss", scope: !1055, file: !373, line: 124, type: !14)
!1068 = !DILocation(line: 124, column: 2, scope: !1043)
!1069 = !DILocalVariable(name: "err", scope: !1055, file: !373, line: 124, type: !100)
!1070 = !DILocation(line: 125, column: 9, scope: !1055)
!1071 = !DILocation(line: 126, column: 17, scope: !1055)
!1072 = !DILocation(line: 129, column: 2, scope: !1055)
!1073 = !DILocation(line: 131, column: 11, scope: !1055)
!1074 = !DILocation(line: 132, column: 2, scope: !1055)
!1075 = !DILocation(line: 133, column: 10, scope: !1055)
!1076 = !DILocation(line: 134, column: 2, scope: !1055)
!1077 = !DILocation(line: 0, scope: !1055)
!1078 = !DILocation(line: 137, column: 9, scope: !1055)
!1079 = !DILocation(line: 135, column: 10, scope: !1055)
!1080 = !DILocation(line: 138, column: 17, scope: !1055)
!1081 = !DILocation(line: 126, column: 3, scope: !1043)
