; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22out\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22color\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/spolu/warp/vendor/github.com/fatih/color\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/fatih/color\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22out\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22command_line_arguments..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./out.go", directory: "/home/wangcong/go_path/src/github.com/spolu/warp/lib/out")
!3 = !{}
!4 = !{!5, !24, !26, !28, !30, !32, !34}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.white", linkageName: "command_line_arguments.white", scope: !1, file: !7, line: 9, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "out.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", file: !7, line: 6, size: 256, align: 8, elements: !10)
!10 = !{!11, !21}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "params", file: !7, line: 6, baseType: !12, size: 192, align: 64)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Attribute,int,int}", file: !13, size: 192, align: 8, elements: !14)
!13 = !DIFile(filename: "", directory: "")
!14 = !{!15, !18, !20}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !13, line: 1, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "Attribute", size: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !13, line: 1, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !13, line: 1, baseType: !19, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "noColor", file: !7, line: 6, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "command_line_arguments.bold", linkageName: "command_line_arguments.bold", scope: !1, file: !7, line: 10, type: !8, isLocal: true, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "command_line_arguments.cyan", linkageName: "command_line_arguments.cyan", scope: !1, file: !7, line: 11, type: !8, isLocal: true, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "command_line_arguments.yellow", linkageName: "command_line_arguments.yellow", scope: !1, file: !7, line: 12, type: !8, isLocal: true, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "command_line_arguments.magenta", linkageName: "command_line_arguments.magenta", scope: !1, file: !7, line: 13, type: !8, isLocal: true, isDefinition: true)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "command_line_arguments.redBold", linkageName: "command_line_arguments.redBold", scope: !1, file: !7, line: 14, type: !8, isLocal: true, isDefinition: true)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !36, line: 1, type: !37, isLocal: false, isDefinition: true)
!36 = !DIFile(filename: "<built-in>", directory: "")
!37 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!38 = distinct !DISubprogram(name: "out.command_line_arguments..init0", linkageName: "command_line_arguments.command_line_arguments..init0", scope: null, file: !7, line: 16, type: !39, isLocal: false, isDefinition: true, scopeLine: 16, isOptimized: false, unit: !1, retainedNodes: !3)
!39 = !DISubroutineType(types: !40)
!40 = !{!41}
!41 = !DIBasicType(name: "void")
!42 = !DILocation(line: 17, column: 16, scope: !38)
!43 = !DILocation(line: 17, column: 8, scope: !38)
!44 = !DILocation(line: 18, column: 15, scope: !38)
!45 = !DILocation(line: 18, column: 7, scope: !38)
!46 = !DILocation(line: 19, column: 15, scope: !38)
!47 = !DILocation(line: 19, column: 7, scope: !38)
!48 = !DILocation(line: 20, column: 17, scope: !38)
!49 = !DILocation(line: 20, column: 9, scope: !38)
!50 = !DILocation(line: 21, column: 18, scope: !38)
!51 = !DILocation(line: 21, column: 10, scope: !38)
!52 = !DILocation(line: 22, column: 18, scope: !38)
!53 = !DILocation(line: 22, column: 10, scope: !38)
!54 = distinct !DISubprogram(name: "out.Normf", linkageName: "command_line_arguments.Normf", scope: null, file: !7, line: 26, type: !55, isLocal: false, isDefinition: true, scopeLine: 26, isOptimized: false, unit: !1, retainedNodes: !3)
!55 = !DISubroutineType(types: !56)
!56 = !{!41, !57, !63}
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !36, line: 1, size: 128, align: 8, elements: !58)
!58 = !{!59, !62}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !36, line: 1, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !36, line: 1, baseType: !19, size: 64, align: 64, offset: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*void},int,int}", file: !13, size: 192, align: 8, elements: !64)
!64 = !{!65, !18, !20}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !13, line: 1, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !13, size: 128, align: 8, elements: !68)
!68 = !{!69, !117}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !13, line: 1, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !36, line: 1, size: 576, align: 8, elements: !72)
!72 = !{!73, !75, !76, !77, !78, !79, !80, !89, !97, !98, !100, !116}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !36, line: 1, baseType: !74, size: 64, align: 64)
!74 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !36, line: 1, baseType: !74, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !36, line: 1, baseType: !37, size: 32, align: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !36, line: 1, baseType: !61, size: 8, align: 8, offset: 160)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !36, line: 1, baseType: !61, size: 8, align: 8, offset: 168)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !36, line: 1, baseType: !61, size: 8, align: 8, offset: 176)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !36, line: 1, baseType: !81, size: 64, align: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !36, line: 1, size: 64, align: 8, elements: !83)
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !36, line: 1, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!74, !88, !74}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !36, line: 1, baseType: !90, size: 64, align: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !36, line: 1, size: 64, align: 8, elements: !92)
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !36, line: 1, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!23, !88, !88}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !36, line: 1, baseType: !60, size: 64, align: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !36, line: 1, baseType: !99, size: 64, align: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !36, line: 1, baseType: !101, size: 64, align: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !36, line: 1, size: 320, align: 8, elements: !103)
!103 = !{!104, !105, !106}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !36, line: 1, baseType: !99, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !36, line: 1, baseType: !99, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !36, line: 1, baseType: !107, size: 192, align: 64, offset: 128)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !13, size: 192, align: 8, elements: !108)
!108 = !{!109, !18, !20}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !13, line: 1, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !36, line: 1, size: 320, align: 8, elements: !112)
!112 = !{!104, !105, !113, !114, !115}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !36, line: 1, baseType: !88, size: 64, align: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !36, line: 1, baseType: !88, size: 64, align: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !36, line: 1, baseType: !88, size: 64, align: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !36, line: 1, baseType: !88, size: 64, align: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !13, line: 1, baseType: !88, size: 64, align: 64, offset: 64)
!118 = !DILocalVariable(name: "v", arg: 2, scope: !54, file: !7, line: 26, type: !63)
!119 = !DILocation(line: 26, column: 27, scope: !54)
!120 = !DILocalVariable(name: "format", arg: 1, scope: !54, file: !7, line: 26, type: !57)
!121 = !DILocation(line: 26, column: 12, scope: !54)
!122 = !DILocation(line: 27, column: 6, scope: !54)
!123 = distinct !DISubprogram(name: "out.Boldf", linkageName: "command_line_arguments.Boldf", scope: null, file: !7, line: 31, type: !55, isLocal: false, isDefinition: true, scopeLine: 31, isOptimized: false, unit: !1, retainedNodes: !3)
!124 = !DILocalVariable(name: "v", arg: 2, scope: !123, file: !7, line: 31, type: !63)
!125 = !DILocation(line: 31, column: 27, scope: !123)
!126 = !DILocalVariable(name: "format", arg: 1, scope: !123, file: !7, line: 31, type: !57)
!127 = !DILocation(line: 31, column: 12, scope: !123)
!128 = !DILocation(line: 32, column: 2, scope: !123)
!129 = !DILocation(line: 32, column: 6, scope: !123)
!130 = distinct !DISubprogram(name: "out.Valuf", linkageName: "command_line_arguments.Valuf", scope: null, file: !7, line: 36, type: !55, isLocal: false, isDefinition: true, scopeLine: 36, isOptimized: false, unit: !1, retainedNodes: !3)
!131 = !DILocalVariable(name: "v", arg: 2, scope: !130, file: !7, line: 36, type: !63)
!132 = !DILocation(line: 36, column: 27, scope: !130)
!133 = !DILocalVariable(name: "format", arg: 1, scope: !130, file: !7, line: 36, type: !57)
!134 = !DILocation(line: 36, column: 12, scope: !130)
!135 = !DILocation(line: 37, column: 2, scope: !130)
!136 = !DILocation(line: 37, column: 6, scope: !130)
!137 = distinct !DISubprogram(name: "out.Warnf", linkageName: "command_line_arguments.Warnf", scope: null, file: !7, line: 41, type: !55, isLocal: false, isDefinition: true, scopeLine: 41, isOptimized: false, unit: !1, retainedNodes: !3)
!138 = !DILocalVariable(name: "v", arg: 2, scope: !137, file: !7, line: 41, type: !63)
!139 = !DILocation(line: 41, column: 27, scope: !137)
!140 = !DILocalVariable(name: "format", arg: 1, scope: !137, file: !7, line: 41, type: !57)
!141 = !DILocation(line: 41, column: 12, scope: !137)
!142 = !DILocation(line: 42, column: 2, scope: !137)
!143 = !DILocation(line: 42, column: 8, scope: !137)
!144 = distinct !DISubprogram(name: "out.Errof", linkageName: "command_line_arguments.Errof", scope: null, file: !7, line: 46, type: !55, isLocal: false, isDefinition: true, scopeLine: 46, isOptimized: false, unit: !1, retainedNodes: !3)
!145 = !DILocalVariable(name: "v", arg: 2, scope: !144, file: !7, line: 46, type: !63)
!146 = !DILocation(line: 46, column: 27, scope: !144)
!147 = !DILocalVariable(name: "format", arg: 1, scope: !144, file: !7, line: 46, type: !57)
!148 = !DILocation(line: 46, column: 12, scope: !144)
!149 = !DILocation(line: 47, column: 2, scope: !144)
!150 = !DILocation(line: 47, column: 9, scope: !144)
!151 = distinct !DISubprogram(name: "out.Statf", linkageName: "command_line_arguments.Statf", scope: null, file: !7, line: 51, type: !55, isLocal: false, isDefinition: true, scopeLine: 51, isOptimized: false, unit: !1, retainedNodes: !3)
!152 = !DILocalVariable(name: "v", arg: 2, scope: !151, file: !7, line: 51, type: !63)
!153 = !DILocation(line: 51, column: 27, scope: !151)
!154 = !DILocalVariable(name: "format", arg: 1, scope: !151, file: !7, line: 51, type: !57)
!155 = !DILocation(line: 51, column: 12, scope: !151)
!156 = !DILocation(line: 52, column: 2, scope: !151)
!157 = !DILocation(line: 52, column: 9, scope: !151)
!158 = distinct !DISubprogram(name: "out.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 1, type: !39, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!159 = !DILocation(line: 1, column: 1, scope: !160)
!160 = !DILexicalBlockFile(scope: !158, file: !36, discriminator: 0)
