; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22token\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22rand\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/rand\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/rand\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22base64\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22io\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22io\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22io\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./token.go", directory: "/home/wangcong/go_path/src/github.com/spolu/warp/lib/token")
!3 = !{}
!4 = !{!5, !11, !14}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.tokens", linkageName: "command_line_arguments.tokens", scope: !1, file: !7, line: 18, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "token.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !10, line: 1, align: 8, elements: !3)
!10 = !DIFile(filename: "<built-in>", directory: "")
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !10, line: 1, type: !13, isLocal: false, isDefinition: true)
!13 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "crypto_rand.Reader", linkageName: "crypto_rand.Reader", scope: !1, file: !7, line: 5, type: !16, isLocal: false, isDefinition: true)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !7, line: 4, size: 128, align: 8, elements: !17)
!17 = !{!18, !105}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 4, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !21, size: 128, align: 8, elements: !22)
!21 = !DIFile(filename: "", directory: "")
!22 = !{!23, !82}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !21, line: 4, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !10, line: 1, size: 576, align: 8, elements: !26)
!26 = !{!27, !29, !30, !31, !33, !34, !35, !45, !54, !56, !63, !81}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !10, line: 1, baseType: !28, size: 64, align: 64)
!28 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !10, line: 1, baseType: !28, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !10, line: 1, baseType: !13, size: 32, align: 32, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !10, line: 1, baseType: !32, size: 8, align: 8, offset: 160)
!32 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !10, line: 1, baseType: !32, size: 8, align: 8, offset: 168)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !10, line: 1, baseType: !32, size: 8, align: 8, offset: 176)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !10, line: 1, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 1, size: 64, align: 8, elements: !38)
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 1, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!28, !43, !28}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "void")
!45 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !10, line: 1, baseType: !46, size: 64, align: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 1, size: 64, align: 8, elements: !48)
!48 = !{!49}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 1, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !43, !43}
!53 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !10, line: 1, baseType: !55, size: 64, align: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !10, line: 1, baseType: !57, size: 64, align: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !10, line: 1, size: 128, align: 8, elements: !59)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !10, line: 1, baseType: !55, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !10, line: 1, baseType: !62, size: 64, align: 64, offset: 64)
!62 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !10, line: 1, baseType: !64, size: 64, align: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !10, line: 1, size: 320, align: 8, elements: !66)
!66 = !{!67, !68, !69}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !10, line: 1, baseType: !57, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !10, line: 1, baseType: !57, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !10, line: 1, baseType: !70, size: 192, align: 64, offset: 128)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !21, size: 192, align: 8, elements: !71)
!71 = !{!72, !79, !80}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !21, line: 1, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !10, line: 1, size: 320, align: 8, elements: !75)
!75 = !{!67, !68, !76, !77, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !10, line: 1, baseType: !43, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !10, line: 1, baseType: !43, size: 64, align: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !10, line: 1, baseType: !43, size: 64, align: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !21, line: 1, baseType: !62, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !21, line: 1, baseType: !62, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !10, line: 1, baseType: !43, size: 64, align: 64, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !21, line: 4, baseType: !83, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!86, !43, !102}
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !21, size: 192, align: 8, elements: !87)
!87 = !{!88, !89}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !21, line: 4, baseType: !62, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !21, line: 4, baseType: !90, size: 128, align: 64, offset: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !10, line: 1, size: 128, align: 8, elements: !91)
!91 = !{!92, !101}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 1, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !21, size: 128, align: 8, elements: !95)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !21, line: 1, baseType: !24, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !21, line: 1, baseType: !98, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!58, !43}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !21, size: 192, align: 8, elements: !103)
!103 = !{!104, !79, !80}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !21, line: 1, baseType: !55, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!106 = distinct !DISubprogram(name: "token.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 1, type: !107, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!107 = !DISubroutineType(types: !108)
!108 = !{!44}
!109 = !DILocation(line: 1, column: 1, scope: !110)
!110 = !DILexicalBlockFile(scope: !106, file: !10, discriminator: 0)
!111 = !DILocation(line: 18, column: 14, scope: !112)
!112 = !DILexicalBlockFile(scope: !106, file: !7, discriminator: 0)
!113 = !DILocation(line: 18, column: 5, scope: !112)
!114 = !DILocation(line: 41, column: 1, scope: !112)
!115 = distinct !DISubprogram(name: "token.Write.command_line_arguments.tokenFountain", linkageName: "command_line_arguments.tokenFountain.Write", scope: null, file: !7, line: 22, type: !116, isLocal: false, isDefinition: true, scopeLine: 22, isOptimized: false, unit: !1, retainedNodes: !3)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !122, !122, !102}
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !21, size: 192, align: 8, elements: !119)
!119 = !{!120, !121}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !21, line: 24, baseType: !62, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !21, line: 24, baseType: !90, size: 128, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!123 = !DILocalVariable(name: "buf", arg: 2, scope: !115, file: !7, line: 23, type: !102)
!124 = !DILocation(line: 23, column: 2, scope: !115)
!125 = !DILocalVariable(name: "pointer", arg: 1, scope: !115, file: !7, line: 22, type: !122)
!126 = !DILocation(line: 22, column: 1, scope: !115)
!127 = !DILocalVariable(name: "f", scope: !115, file: !7, line: 22, type: !8)
!128 = !DILocalVariable(name: "$ret0", scope: !115, file: !7, line: 24, type: !62)
!129 = !DILocation(line: 24, column: 4, scope: !115)
!130 = !DILocalVariable(name: "token", scope: !131, file: !7, line: 25, type: !132)
!131 = distinct !DILexicalBlock(scope: !115, file: !7, line: 22, column: 1)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 128, align: 1, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 16)
!135 = !DILocation(line: 25, column: 6, scope: !115)
!136 = !DILocalVariable(name: "i", scope: !131, file: !7, line: 26, type: !62)
!137 = !DILocation(line: 26, column: 6, scope: !115)
!138 = !DILocalVariable(name: "b", scope: !139, file: !7, line: 27, type: !32)
!139 = distinct !DILexicalBlock(scope: !131, file: !7, line: 27, column: 2)
!140 = !DILocation(line: 27, column: 6, scope: !131)
!141 = !DILocation(line: 27, column: 2, scope: !139)
!142 = !DILocation(line: 28, column: 8, scope: !139)
!143 = !DILocation(line: 29, column: 9, scope: !139)
!144 = !DILocation(line: 29, column: 13, scope: !139)
!145 = !DILocation(line: 30, column: 4, scope: !139)
!146 = !DILocation(line: 32, column: 8, scope: !139)
!147 = !DILocation(line: 0, scope: !139)
!148 = !DILocation(line: 33, column: 9, scope: !139)
!149 = !DILocation(line: 33, column: 6, scope: !139)
!150 = !DILocation(line: 38, column: 2, scope: !131)
!151 = distinct !DISubprogram(name: "token.command_line_arguments..init0", linkageName: "command_line_arguments.command_line_arguments..init0", scope: null, file: !7, line: 41, type: !107, isLocal: false, isDefinition: true, scopeLine: 41, isOptimized: false, unit: !1, retainedNodes: !3)
!152 = !DILocation(line: 42, column: 29, scope: !153)
!153 = distinct !DILexicalBlock(scope: !151, file: !7, line: 41, column: 1)
!154 = !DILocation(line: 42, column: 15, scope: !153)
!155 = !DILocalVariable(name: "buf", scope: !153, file: !7, line: 42, type: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !7, line: 4, size: 512, align: 8, elements: !158)
!158 = !{!159, !160, !161, !162}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !7, line: 4, baseType: !90, size: 128, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 4, baseType: !102, size: 192, align: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !7, line: 4, baseType: !62, size: 64, align: 64, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "wr", file: !7, line: 4, baseType: !163, size: 128, align: 64, offset: 384)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !7, line: 4, size: 128, align: 8, elements: !164)
!164 = !{!165, !105}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 4, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !21, size: 128, align: 8, elements: !168)
!168 = !{!23, !169}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !21, line: 4, baseType: !83, size: 64, align: 64, offset: 64)
!170 = !DILocation(line: 42, column: 2, scope: !151)
!171 = !DILocation(line: 43, column: 34, scope: !153)
!172 = !DILocation(line: 43, column: 52, scope: !153)
!173 = !DILocation(line: 43, column: 16, scope: !153)
!174 = !DILocation(line: 43, column: 2, scope: !153)
!175 = !DILocalVariable(name: "enc", scope: !153, file: !7, line: 43, type: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "WriteCloser", file: !7, line: 6, size: 128, align: 8, elements: !178)
!178 = !{!179, !105}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 6, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !21, size: 192, align: 8, elements: !182)
!182 = !{!183, !184, !188}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !21, line: 6, baseType: !24, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !21, line: 6, baseType: !185, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!90, !43}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !21, line: 6, baseType: !83, size: 64, align: 64, offset: 128)
!189 = !DILocation(line: 43, column: 2, scope: !151)
!190 = !DILocation(line: 45, column: 5, scope: !153)
!191 = !DILocation(line: 45, column: 2, scope: !153)
!192 = distinct !DISubprogram(name: "token.command_line_arguments..init0..func1", scope: null, file: !7, line: 45, type: !107, isLocal: true, isDefinition: true, scopeLine: 45, isOptimized: false, unit: !1, retainedNodes: !3)
!193 = !DILocation(line: 46, column: 21, scope: !194)
!194 = distinct !DILexicalBlock(scope: !192, file: !7, line: 45, column: 5)
!195 = !DILocation(line: 46, column: 16, scope: !194)
!196 = !DILocalVariable(name: "sink$0", scope: !194, file: !7, line: 46, type: !197)
!197 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!198 = !DILocation(line: 46, column: 3, scope: !192)
!199 = !DILocalVariable(name: "err", scope: !194, file: !7, line: 46, type: !90)
!200 = !DILocation(line: 49, column: 7, scope: !194)
!201 = !DILocation(line: 49, column: 64, scope: !194)
!202 = distinct !DISubprogram(name: "token.command_line_arguments..thunk0", scope: null, file: !7, line: 45, type: !203, isLocal: true, isDefinition: true, scopeLine: 45, isOptimized: false, unit: !1, retainedNodes: !3)
!203 = !DISubroutineType(types: !204)
!204 = !{!44, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*__go_descriptor}", file: !21, size: 64, align: 8, elements: !207)
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !21, line: 45, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 45, size: 64, align: 8, elements: !211)
!211 = !{!212}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 45, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!214 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !202, file: !7, line: 45, type: !205)
!215 = !DILocation(line: 45, column: 2, scope: !202)
!216 = distinct !DISubprogram(name: "token.New", linkageName: "command_line_arguments.New", scope: null, file: !7, line: 54, type: !217, isLocal: false, isDefinition: true, scopeLine: 54, isOptimized: false, unit: !1, retainedNodes: !3)
!217 = !DISubroutineType(types: !218)
!218 = !{!58, !58}
!219 = !DILocalVariable(name: "name", arg: 1, scope: !216, file: !7, line: 55, type: !58)
!220 = !DILocation(line: 55, column: 2, scope: !216)
!221 = !DILocation(line: 57, column: 22, scope: !216)
!222 = !DILocation(line: 57, column: 9, scope: !216)
!223 = !DILocation(line: 57, column: 2, scope: !216)
!224 = distinct !DISubprogram(name: "token.RandStr", linkageName: "command_line_arguments.RandStr", scope: null, file: !7, line: 61, type: !225, isLocal: false, isDefinition: true, scopeLine: 61, isOptimized: false, unit: !1, retainedNodes: !3)
!225 = !DISubroutineType(types: !226)
!226 = !{!58}
!227 = !DILocation(line: 62, column: 11, scope: !224)
!228 = !DILocation(line: 62, column: 9, scope: !224)
!229 = !DILocalVariable(name: "$ret3", scope: !224, file: !7, line: 61, type: !58)
!230 = !DILocation(line: 61, column: 16, scope: !224)
!231 = !DILocation(line: 62, column: 2, scope: !224)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "token"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "command-line-arguments"
	.ascii ";\n"
	.ascii "import "
	.ascii "bufio"
	.ascii " "
	.ascii "bufio"
	.ascii " \""
	.ascii "bufio"
	.ascii "\";\n"
	.ascii "import "
	.ascii "rand"
	.ascii " "
	.ascii "crypto/rand"
	.ascii " \""
	.ascii "crypto/rand"
	.ascii "\";\n"
	.ascii "import "
	.ascii "base64"
	.ascii " "
	.ascii "encoding/base64"
	.ascii " \""
	.ascii "encoding/base64"
	.ascii "\";\n"
