; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22strings\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22strings\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22strings\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22poll\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./function.go", directory: "/home/wangcong/go_path/src/github.com/spolu/warp/lib/errors")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "errors.Newf", linkageName: "command_line_arguments.Newf", scope: null, file: !10, line: 9, type: !11, isLocal: false, isDefinition: true, scopeLine: 9, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DIFile(filename: "function.go", directory: ".")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !55, !84}
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !14)
!14 = !{!15, !83}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !18, size: 128, align: 8, elements: !19)
!18 = !DIFile(filename: "", directory: "")
!19 = !{!20, !79}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 1, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !23)
!23 = !{!24, !26, !27, !28, !30, !31, !32, !42, !51, !53, !60, !78}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 160)
!29 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 168)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 176)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !33, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !35)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!25, !40, !25}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "void")
!42 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !43, size: 64, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !45)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !40, !40}
!50 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !52, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !54, size: 64, align: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !52, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !61, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !63)
!63 = !{!64, !65, !66}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !54, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !54, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !67, size: 192, align: 64, offset: 128)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !18, size: 192, align: 8, elements: !68)
!68 = !{!69, !76, !77}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !72)
!72 = !{!64, !65, !73, !74, !75}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !18, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !18, line: 1, baseType: !59, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !18, line: 1, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!55, !40}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*void},int,int}", file: !18, size: 192, align: 8, elements: !85)
!85 = !{!86, !76, !77}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !18, size: 128, align: 8, elements: !89)
!89 = !{!20, !90}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !18, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!91 = !DILocalVariable(name: "args", arg: 2, scope: !9, file: !10, line: 9, type: !84)
!92 = !DILocation(line: 9, column: 26, scope: !9)
!93 = !DILocalVariable(name: "format", arg: 1, scope: !9, file: !10, line: 9, type: !55)
!94 = !DILocation(line: 9, column: 11, scope: !9)
!95 = !DILocation(line: 11, column: 17, scope: !96)
!96 = distinct !DILexicalBlock(scope: !9, file: !10, line: 9, column: 1)
!97 = !DILocation(line: 10, column: 9, scope: !96)
!98 = !DILocation(line: 10, column: 10, scope: !96)
!99 = !DILocalVariable(name: "err", scope: !96, file: !10, line: 10, type: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.wrap", file: !102, line: 10, size: 448, align: 8, elements: !103)
!102 = !DIFile(filename: "wrap.go", directory: ".")
!103 = !{!104, !105, !106, !107}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "traceFile", file: !102, line: 11, baseType: !55, size: 128, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "traceLine", file: !102, line: 12, baseType: !59, size: 64, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "traceMessage", file: !102, line: 13, baseType: !55, size: 128, align: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "previous", file: !102, line: 14, baseType: !13, size: 128, align: 64, offset: 320)
!108 = !DILocation(line: 10, column: 2, scope: !9)
!109 = !DILocation(line: 13, column: 5, scope: !96)
!110 = !DILocalVariable(name: "$ret0", scope: !9, file: !10, line: 9, type: !13)
!111 = !DILocation(line: 9, column: 47, scope: !9)
!112 = !DILocation(line: 14, column: 2, scope: !96)
!113 = distinct !DISubprogram(name: "errors.command_line_arguments.wrap..hash", linkageName: "command_line_arguments.command_line_arguments.wrap..hash", scope: null, file: !7, line: 1, type: !38, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!114 = !DILocalVariable(name: "key", arg: 1, scope: !113, file: !7, line: 1, type: !40)
!115 = !DILocation(line: 1, column: 1, scope: !113)
!116 = !DILocalVariable(name: "seed", arg: 2, scope: !113, file: !7, line: 1, type: !25)
!117 = !DILocalVariable(name: "$ret19", scope: !113, file: !7, line: 1, type: !25)
!118 = distinct !DISubprogram(name: "errors.command_line_arguments.wrap..eq", linkageName: "command_line_arguments.command_line_arguments.wrap..eq", scope: null, file: !7, line: 1, type: !48, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!119 = !DILocalVariable(name: "key1", arg: 1, scope: !118, file: !7, line: 1, type: !40)
!120 = !DILocation(line: 1, column: 1, scope: !118)
!121 = !DILocalVariable(name: "key2", arg: 2, scope: !118, file: !7, line: 1, type: !40)
!122 = !DILocalVariable(name: "$ret20", scope: !118, file: !7, line: 1, type: !50)
!123 = distinct !DISubprogram(name: "errors.Cause..1command_line_arguments.wrap", linkageName: "command_line_arguments.wrap.Cause", scope: null, file: !102, line: 29, type: !124, isLocal: false, isDefinition: true, scopeLine: 29, isOptimized: false, unit: !1, retainedNodes: !3)
!124 = !DISubroutineType(types: !125)
!125 = !{!13, !100, !100}
!126 = !DILocalVariable(name: "e", arg: 1, scope: !123, file: !102, line: 29, type: !100)
!127 = !DILocation(line: 29, column: 1, scope: !123)
!128 = !DILocation(line: 30, column: 15, scope: !123)
!129 = !DILocation(line: 30, column: 2, scope: !123)
!130 = !DILocation(line: 31, column: 2, scope: !123)
!131 = !DILocation(line: 30, column: 9, scope: !132)
!132 = distinct !DILexicalBlock(scope: !123, file: !102, line: 32, column: 3)
!133 = !DILocation(line: 33, column: 2, scope: !123)
!134 = !DILocation(line: 31, column: 2, scope: !132)
!135 = !DILocalVariable(name: "e", scope: !132, file: !102, line: 30, type: !100)
!136 = !DILocation(line: 30, column: 9, scope: !123)
!137 = !DILocation(line: 32, column: 11, scope: !132)
!138 = !DILocation(line: 32, column: 3, scope: !132)
!139 = !DILocation(line: 30, column: 9, scope: !140)
!140 = distinct !DILexicalBlock(scope: !123, file: !102, line: 34, column: 3)
!141 = !DILocalVariable(name: "e", scope: !142, file: !102, line: 30, type: !13)
!142 = distinct !DILexicalBlock(scope: !123, file: !102, line: 36, column: 3)
!143 = !DILocalVariable(name: "$ret16", scope: !123, file: !102, line: 29, type: !13)
!144 = !DILocation(line: 29, column: 24, scope: !123)
!145 = !DILocation(line: 36, column: 3, scope: !142)
!146 = !DILocation(line: 33, column: 2, scope: !140)
!147 = !DILocalVariable(name: "e", scope: !140, file: !102, line: 30, type: !148)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "UserError", file: !149, line: 6, size: 128, align: 8, elements: !150)
!149 = !DIFile(filename: "user_error.go", directory: ".")
!150 = !{!151, !167}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !149, line: 6, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)string,*func(*void)string,*func(*void)string,*func(*void)int}", file: !18, size: 384, align: 8, elements: !154)
!154 = !{!155, !156, !160, !161, !162, !163}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 6, baseType: !21, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Cause", file: !18, line: 6, baseType: !157, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!13, !40}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Code", file: !18, line: 6, baseType: !80, size: 64, align: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !18, line: 6, baseType: !80, size: 64, align: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Message", file: !18, line: 6, baseType: !80, size: 64, align: 64, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !18, line: 6, baseType: !164, size: 64, align: 64, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!59, !40}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !149, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!168 = !DILocation(line: 34, column: 11, scope: !140)
!169 = !DILocation(line: 34, column: 3, scope: !140)
!170 = distinct !DISubprogram(name: "errors.Error..1command_line_arguments.wrap", linkageName: "command_line_arguments.wrap.Error", scope: null, file: !102, line: 42, type: !171, isLocal: false, isDefinition: true, scopeLine: 42, isOptimized: false, unit: !1, retainedNodes: !3)
!171 = !DISubroutineType(types: !172)
!172 = !{!55, !100, !100}
!173 = !DILocalVariable(name: "e", arg: 1, scope: !170, file: !102, line: 42, type: !100)
!174 = !DILocation(line: 42, column: 1, scope: !170)
!175 = !DILocation(line: 43, column: 10, scope: !176)
!176 = distinct !DILexicalBlock(scope: !170, file: !102, line: 42, column: 1)
!177 = !DILocalVariable(name: "err", scope: !176, file: !102, line: 43, type: !13)
!178 = !DILocation(line: 43, column: 2, scope: !170)
!179 = !DILocation(line: 44, column: 9, scope: !176)
!180 = !DILocation(line: 45, column: 13, scope: !176)
!181 = !DILocation(line: 45, column: 3, scope: !176)
!182 = !DILocalVariable(name: "$ret17", scope: !170, file: !102, line: 42, type: !55)
!183 = !DILocation(line: 42, column: 24, scope: !170)
!184 = !DILocation(line: 47, column: 2, scope: !176)
!185 = distinct !DISubprogram(name: "errors.StackTrace..1command_line_arguments.wrap", linkageName: "command_line_arguments.wrap.StackTrace", scope: null, file: !102, line: 51, type: !186, isLocal: false, isDefinition: true, scopeLine: 51, isOptimized: false, unit: !1, retainedNodes: !3)
!186 = !DISubroutineType(types: !187)
!187 = !{!188, !100, !100}
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !18, size: 192, align: 8, elements: !189)
!189 = !{!190, !76, !77}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !54, size: 64, align: 64)
!191 = !DILocalVariable(name: "e", arg: 1, scope: !185, file: !102, line: 51, type: !100)
!192 = !DILocation(line: 51, column: 1, scope: !185)
!193 = !DILocation(line: 52, column: 20, scope: !185)
!194 = !DILocation(line: 52, column: 9, scope: !185)
!195 = !DILocation(line: 52, column: 2, scope: !185)
!196 = distinct !DISubprogram(name: "errors.UserError..1command_line_arguments.wrap", linkageName: "command_line_arguments.wrap.UserError", scope: null, file: !102, line: 17, type: !197, isLocal: false, isDefinition: true, scopeLine: 17, isOptimized: false, unit: !1, retainedNodes: !3)
!197 = !DISubroutineType(types: !198)
!198 = !{!148, !100, !100}
!199 = !DILocalVariable(name: "e", arg: 1, scope: !196, file: !102, line: 17, type: !100)
!200 = !DILocation(line: 17, column: 1, scope: !196)
!201 = !DILocation(line: 18, column: 15, scope: !196)
!202 = !DILocation(line: 18, column: 2, scope: !196)
!203 = !DILocation(line: 19, column: 2, scope: !196)
!204 = !DILocation(line: 18, column: 9, scope: !205)
!205 = distinct !DILexicalBlock(scope: !196, file: !102, line: 20, column: 3)
!206 = !DILocation(line: 21, column: 2, scope: !196)
!207 = !DILocation(line: 19, column: 2, scope: !205)
!208 = !DILocalVariable(name: "e", scope: !205, file: !102, line: 18, type: !100)
!209 = !DILocation(line: 18, column: 9, scope: !196)
!210 = !DILocation(line: 20, column: 11, scope: !205)
!211 = !DILocation(line: 20, column: 3, scope: !205)
!212 = !DILocation(line: 18, column: 9, scope: !213)
!213 = distinct !DILexicalBlock(scope: !196, file: !102, line: 22, column: 3)
!214 = !DILocalVariable(name: "e", scope: !215, file: !102, line: 18, type: !13)
!215 = distinct !DILexicalBlock(scope: !196, file: !102, line: 24, column: 3)
!216 = !DILocalVariable(name: "$ret15", scope: !196, file: !102, line: 17, type: !148)
!217 = !DILocation(line: 17, column: 28, scope: !196)
!218 = !DILocation(line: 24, column: 3, scope: !215)
!219 = !DILocation(line: 21, column: 2, scope: !213)
!220 = !DILocalVariable(name: "e", scope: !213, file: !102, line: 18, type: !148)
!221 = !DILocation(line: 22, column: 3, scope: !213)
!222 = distinct !DISubprogram(name: "errors.location..1command_line_arguments.wrap", linkageName: "command_line_arguments.wrap.location", scope: null, file: !102, line: 61, type: !223, isLocal: false, isDefinition: true, scopeLine: 61, isOptimized: false, unit: !1, retainedNodes: !3)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !100, !100}
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,int}", file: !18, size: 192, align: 8, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !18, line: 61, baseType: !55, size: 128, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "line", file: !18, line: 61, baseType: !59, size: 64, align: 64, offset: 128)
!229 = !DILocalVariable(name: "e", arg: 1, scope: !222, file: !102, line: 61, type: !100)
!230 = !DILocation(line: 61, column: 1, scope: !222)
!231 = !DILocalVariable(name: "line", scope: !222, file: !102, line: 61, type: !59)
!232 = !DILocation(line: 61, column: 45, scope: !222)
!233 = !DILocation(line: 62, column: 10, scope: !222)
!234 = !DILocation(line: 62, column: 23, scope: !222)
!235 = !DILocation(line: 62, column: 2, scope: !222)
!236 = distinct !DISubprogram(name: "errors.setLocation..1command_line_arguments.wrap", linkageName: "command_line_arguments.wrap.setLocation", scope: null, file: !102, line: 55, type: !237, isLocal: false, isDefinition: true, scopeLine: 55, isOptimized: false, unit: !1, retainedNodes: !3)
!237 = !DISubroutineType(types: !238)
!238 = !{!41, !100, !100, !59}
!239 = !DILocalVariable(name: "e", arg: 1, scope: !236, file: !102, line: 55, type: !100)
!240 = !DILocation(line: 55, column: 1, scope: !236)
!241 = !DILocalVariable(name: "callDepth", arg: 2, scope: !236, file: !102, line: 55, type: !59)
!242 = !DILocation(line: 55, column: 28, scope: !236)
!243 = !DILocation(line: 56, column: 47, scope: !244)
!244 = distinct !DILexicalBlock(scope: !236, file: !102, line: 55, column: 1)
!245 = !DILocation(line: 56, column: 30, scope: !244)
!246 = !DILocalVariable(name: "sink$0", scope: !244, file: !102, line: 56, type: !25)
!247 = !DILocation(line: 56, column: 2, scope: !236)
!248 = !DILocalVariable(name: "line", scope: !244, file: !102, line: 56, type: !59)
!249 = !DILocalVariable(name: "sink$1", scope: !244, file: !102, line: 56, type: !50)
!250 = !DILocation(line: 57, column: 3, scope: !244)
!251 = !DILocation(line: 57, column: 14, scope: !244)
!252 = !DILocation(line: 58, column: 3, scope: !244)
!253 = !DILocation(line: 58, column: 14, scope: !244)
!254 = distinct !DISubprogram(name: "errors.Trace", linkageName: "command_line_arguments.Trace", scope: null, file: !10, line: 19, type: !255, isLocal: false, isDefinition: true, scopeLine: 19, isOptimized: false, unit: !1, retainedNodes: !3)
!255 = !DISubroutineType(types: !256)
!256 = !{!13, !13}
!257 = !DILocalVariable(name: "other", arg: 1, scope: !254, file: !10, line: 19, type: !13)
!258 = !DILocation(line: 19, column: 12, scope: !254)
!259 = !DILocation(line: 20, column: 11, scope: !260)
!260 = distinct !DILexicalBlock(scope: !254, file: !10, line: 19, column: 1)
!261 = !DILocalVariable(name: "$ret1", scope: !254, file: !10, line: 19, type: !13)
!262 = !DILocation(line: 19, column: 25, scope: !254)
!263 = !DILocation(line: 21, column: 3, scope: !260)
!264 = !DILocation(line: 23, column: 9, scope: !260)
!265 = !DILocation(line: 23, column: 10, scope: !260)
!266 = !DILocalVariable(name: "err", scope: !260, file: !10, line: 23, type: !100)
!267 = !DILocation(line: 23, column: 2, scope: !254)
!268 = !DILocation(line: 26, column: 5, scope: !260)
!269 = !DILocation(line: 27, column: 2, scope: !260)
!270 = distinct !DISubprogram(name: "errors.Tracef", linkageName: "command_line_arguments.Tracef", scope: null, file: !10, line: 32, type: !271, isLocal: false, isDefinition: true, scopeLine: 32, isOptimized: false, unit: !1, retainedNodes: !3)
!271 = !DISubroutineType(types: !272)
!272 = !{!13, !13, !55, !84}
!273 = !DILocalVariable(name: "args", arg: 3, scope: !270, file: !10, line: 32, type: !84)
!274 = !DILocation(line: 32, column: 41, scope: !270)
!275 = !DILocalVariable(name: "other", arg: 1, scope: !270, file: !10, line: 32, type: !13)
!276 = !DILocation(line: 32, column: 13, scope: !270)
!277 = !DILocalVariable(name: "format", arg: 2, scope: !270, file: !10, line: 32, type: !55)
!278 = !DILocation(line: 32, column: 26, scope: !270)
!279 = !DILocation(line: 33, column: 11, scope: !280)
!280 = distinct !DILexicalBlock(scope: !270, file: !10, line: 32, column: 1)
!281 = !DILocalVariable(name: "$ret2", scope: !270, file: !10, line: 32, type: !13)
!282 = !DILocation(line: 32, column: 62, scope: !270)
!283 = !DILocation(line: 34, column: 3, scope: !280)
!284 = !DILocation(line: 37, column: 21, scope: !280)
!285 = !DILocation(line: 36, column: 9, scope: !280)
!286 = !DILocation(line: 36, column: 10, scope: !280)
!287 = !DILocalVariable(name: "err", scope: !280, file: !10, line: 36, type: !100)
!288 = !DILocation(line: 36, column: 2, scope: !270)
!289 = !DILocation(line: 40, column: 5, scope: !280)
!290 = !DILocation(line: 41, column: 2, scope: !280)
!291 = distinct !DISubprogram(name: "errors.Cause", linkageName: "command_line_arguments.Cause", scope: null, file: !10, line: 45, type: !255, isLocal: false, isDefinition: true, scopeLine: 45, isOptimized: false, unit: !1, retainedNodes: !3)
!292 = !DILocalVariable(name: "e", arg: 1, scope: !291, file: !10, line: 45, type: !13)
!293 = !DILocation(line: 45, column: 12, scope: !291)
!294 = !DILocation(line: 46, column: 2, scope: !291)
!295 = !DILocation(line: 47, column: 2, scope: !291)
!296 = !DILocation(line: 46, column: 9, scope: !297)
!297 = distinct !DILexicalBlock(scope: !291, file: !10, line: 48, column: 3)
!298 = !DILocation(line: 49, column: 2, scope: !291)
!299 = !DILocation(line: 47, column: 2, scope: !297)
!300 = !DILocalVariable(name: "e", scope: !297, file: !10, line: 46, type: !100)
!301 = !DILocation(line: 46, column: 9, scope: !291)
!302 = !DILocation(line: 48, column: 11, scope: !297)
!303 = !DILocation(line: 48, column: 3, scope: !297)
!304 = !DILocation(line: 46, column: 9, scope: !305)
!305 = distinct !DILexicalBlock(scope: !291, file: !10, line: 50, column: 3)
!306 = !DILocalVariable(name: "e", scope: !307, file: !10, line: 46, type: !13)
!307 = distinct !DILexicalBlock(scope: !291, file: !10, line: 52, column: 3)
!308 = !DILocalVariable(name: "$ret3", scope: !291, file: !10, line: 45, type: !13)
!309 = !DILocation(line: 45, column: 21, scope: !291)
!310 = !DILocation(line: 52, column: 3, scope: !307)
!311 = !DILocation(line: 49, column: 2, scope: !305)
!312 = !DILocalVariable(name: "e", scope: !305, file: !10, line: 46, type: !148)
!313 = !DILocation(line: 50, column: 11, scope: !305)
!314 = !DILocation(line: 50, column: 3, scope: !305)
!315 = distinct !DISubprogram(name: "errors.ExtractUserError", linkageName: "command_line_arguments.ExtractUserError", scope: null, file: !10, line: 57, type: !316, isLocal: false, isDefinition: true, scopeLine: 57, isOptimized: false, unit: !1, retainedNodes: !3)
!316 = !DISubroutineType(types: !317)
!317 = !{!148, !13}
!318 = !DILocalVariable(name: "err", arg: 1, scope: !315, file: !10, line: 57, type: !13)
!319 = !DILocation(line: 57, column: 23, scope: !315)
!320 = !DILocation(line: 58, column: 9, scope: !315)
!321 = !DILocalVariable(name: "$ret4", scope: !315, file: !10, line: 57, type: !148)
!322 = !DILocation(line: 57, column: 34, scope: !315)
!323 = !DILocation(line: 59, column: 3, scope: !315)
!324 = !DILocation(line: 61, column: 2, scope: !315)
!325 = !DILocation(line: 62, column: 2, scope: !315)
!326 = !DILocation(line: 64, column: 2, scope: !315)
!327 = !DILocation(line: 61, column: 9, scope: !328)
!328 = distinct !DILexicalBlock(scope: !315, file: !10, line: 63, column: 3)
!329 = !DILocation(line: 62, column: 2, scope: !328)
!330 = !DILocalVariable(name: "e", scope: !328, file: !10, line: 61, type: !100)
!331 = !DILocation(line: 61, column: 9, scope: !315)
!332 = !DILocation(line: 63, column: 11, scope: !328)
!333 = !DILocation(line: 63, column: 3, scope: !328)
!334 = !DILocation(line: 61, column: 9, scope: !335)
!335 = distinct !DILexicalBlock(scope: !315, file: !10, line: 65, column: 3)
!336 = !DILocation(line: 64, column: 2, scope: !335)
!337 = !DILocalVariable(name: "e", scope: !335, file: !10, line: 61, type: !148)
!338 = !DILocation(line: 65, column: 3, scope: !335)
!339 = distinct !DISubprogram(name: "errors.ErrorStack", linkageName: "command_line_arguments.ErrorStack", scope: null, file: !10, line: 72, type: !340, isLocal: false, isDefinition: true, scopeLine: 72, isOptimized: false, unit: !1, retainedNodes: !3)
!340 = !DISubroutineType(types: !341)
!341 = !{!188, !13}
!342 = !DILocalVariable(name: "err", arg: 1, scope: !339, file: !10, line: 72, type: !13)
!343 = !DILocation(line: 72, column: 17, scope: !339)
!344 = !DILocation(line: 73, column: 9, scope: !345)
!345 = distinct !DILexicalBlock(scope: !339, file: !10, line: 72, column: 1)
!346 = !DILocation(line: 74, column: 10, scope: !345)
!347 = !DILocalVariable(name: "$ret5", scope: !339, file: !10, line: 72, type: !188)
!348 = !DILocation(line: 72, column: 28, scope: !339)
!349 = !DILocation(line: 74, column: 3, scope: !345)
!350 = !DILocalVariable(name: "lines", scope: !345, file: !10, line: 77, type: !188)
!351 = !DILocation(line: 77, column: 6, scope: !339)
!352 = !DILocalVariable(name: "e", scope: !353, file: !10, line: 80, type: !100)
!353 = distinct !DILexicalBlock(scope: !354, file: !10, line: 80, column: 3)
!354 = distinct !DILexicalBlock(scope: !345, file: !10, line: 78, column: 6)
!355 = !DILocation(line: 80, column: 6, scope: !354)
!356 = !DILocalVariable(name: "ok", scope: !353, file: !10, line: 80, type: !50)
!357 = !DILocation(line: 80, column: 6, scope: !353)
!358 = !DILocation(line: 80, column: 3, scope: !353)
!359 = !DILocation(line: 81, column: 28, scope: !360)
!360 = distinct !DILexicalBlock(scope: !353, file: !10, line: 80, column: 31)
!361 = !DILocation(line: 81, column: 11, scope: !360)
!362 = !DILocation(line: 0, scope: !353)
!363 = !DILocation(line: 95, column: 10, scope: !354)
!364 = !DILocation(line: 95, column: 24, scope: !354)
!365 = !DILocation(line: 91, column: 28, scope: !353)
!366 = !DILocation(line: 91, column: 11, scope: !353)
!367 = !DILocation(line: 81, column: 9, scope: !360)
!368 = !DILocation(line: 82, column: 19, scope: !360)
!369 = !DILocalVariable(name: "file", scope: !360, file: !10, line: 82, type: !55)
!370 = !DILocation(line: 82, column: 4, scope: !353)
!371 = !DILocalVariable(name: "line", scope: !360, file: !10, line: 82, type: !59)
!372 = !DILocation(line: 83, column: 12, scope: !360)
!373 = !DILocation(line: 84, column: 29, scope: !360)
!374 = !DILocation(line: 84, column: 12, scope: !360)
!375 = !DILocation(line: 86, column: 12, scope: !360)
!376 = !DILocation(line: 84, column: 10, scope: !360)
!377 = !DILocation(line: 86, column: 7, scope: !360)
!378 = !DILocation(line: 86, column: 27, scope: !360)
!379 = !DILocation(line: 87, column: 29, scope: !360)
!380 = !DILocation(line: 87, column: 12, scope: !360)
!381 = !DILocation(line: 87, column: 10, scope: !360)
!382 = !DILocation(line: 89, column: 8, scope: !360)
!383 = !DILocation(line: 91, column: 9, scope: !353)
!384 = !DILocation(line: 92, column: 27, scope: !353)
!385 = !DILocation(line: 92, column: 11, scope: !353)
!386 = !DILocation(line: 92, column: 9, scope: !353)
!387 = !DILocation(line: 96, column: 26, scope: !354)
!388 = !DILocation(line: 96, column: 12, scope: !354)
!389 = !DILocation(line: 98, column: 10, scope: !354)
!390 = !DILocalVariable(name: "i", scope: !391, file: !10, line: 106, type: !59)
!391 = distinct !DILexicalBlock(scope: !345, file: !10, line: 106, column: 2)
!392 = !DILocation(line: 106, column: 6, scope: !345)
!393 = !DILocalVariable(name: "result", scope: !345, file: !10, line: 105, type: !188)
!394 = !DILocation(line: 105, column: 6, scope: !339)
!395 = !DILocation(line: 106, column: 25, scope: !391)
!396 = !DILocation(line: 96, column: 10, scope: !354)
!397 = !DILocation(line: 107, column: 32, scope: !391)
!398 = !DILocation(line: 107, column: 12, scope: !391)
!399 = !DILocation(line: 107, column: 10, scope: !391)
!400 = !DILocation(line: 107, column: 34, scope: !391)
!401 = !DILocation(line: 109, column: 2, scope: !345)
!402 = distinct !DISubprogram(name: "errors.Details", linkageName: "command_line_arguments.Details", scope: null, file: !10, line: 113, type: !403, isLocal: false, isDefinition: true, scopeLine: 113, isOptimized: false, unit: !1, retainedNodes: !3)
!403 = !DISubroutineType(types: !404)
!404 = !{!55, !13}
!405 = !DILocalVariable(name: "err", arg: 1, scope: !402, file: !10, line: 113, type: !13)
!406 = !DILocation(line: 113, column: 14, scope: !402)
!407 = !DILocation(line: 114, column: 22, scope: !402)
!408 = !DILocation(line: 114, column: 17, scope: !402)
!409 = !DILocation(line: 114, column: 2, scope: !402)
!410 = distinct !DISubprogram(name: "errors.command_line_arguments.ConcreteUserError..hash", linkageName: "command_line_arguments.command_line_arguments.ConcreteUserError..hash", scope: null, file: !7, line: 1, type: !38, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!411 = !DILocalVariable(name: "key", arg: 1, scope: !410, file: !7, line: 1, type: !40)
!412 = !DILocation(line: 1, column: 1, scope: !410)
!413 = !DILocalVariable(name: "seed", arg: 2, scope: !410, file: !7, line: 1, type: !25)
!414 = !DILocalVariable(name: "$ret21", scope: !410, file: !7, line: 1, type: !25)
!415 = distinct !DISubprogram(name: "errors.command_line_arguments.ConcreteUserError..eq", linkageName: "command_line_arguments.command_line_arguments.ConcreteUserError..eq", scope: null, file: !7, line: 1, type: !48, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!416 = !DILocalVariable(name: "key1", arg: 1, scope: !415, file: !7, line: 1, type: !40)
!417 = !DILocation(line: 1, column: 1, scope: !415)
!418 = !DILocalVariable(name: "key2", arg: 2, scope: !415, file: !7, line: 1, type: !40)
!419 = !DILocalVariable(name: "$ret22", scope: !415, file: !7, line: 1, type: !50)
!420 = distinct !DISubprogram(name: "errors.Cause..1command_line_arguments.ConcreteUserError", linkageName: "command_line_arguments.ConcreteUserError.Cause", scope: null, file: !149, line: 42, type: !421, isLocal: false, isDefinition: true, scopeLine: 42, isOptimized: false, unit: !1, retainedNodes: !3)
!421 = !DISubroutineType(types: !422)
!422 = !{!13, !423, !423}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConcreteUserError", file: !149, line: 16, size: 448, align: 8, elements: !425)
!425 = !{!426, !427, !428, !429}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ErrCause", file: !149, line: 17, baseType: !13, size: 128, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ErrStatus", file: !149, line: 18, baseType: !59, size: 64, align: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ErrCode", file: !149, line: 19, baseType: !55, size: 128, align: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ErrMessage", file: !149, line: 20, baseType: !55, size: 128, align: 64, offset: 320)
!430 = !DILocalVariable(name: "e", arg: 1, scope: !420, file: !149, line: 42, type: !423)
!431 = !DILocation(line: 42, column: 1, scope: !420)
!432 = !DILocation(line: 43, column: 10, scope: !420)
!433 = !DILocation(line: 43, column: 2, scope: !420)
!434 = !DILocalVariable(name: "$ret9", scope: !420, file: !149, line: 42, type: !13)
!435 = !DILocation(line: 42, column: 37, scope: !420)
!436 = distinct !DISubprogram(name: "errors.Code..1command_line_arguments.ConcreteUserError", linkageName: "command_line_arguments.ConcreteUserError.Code", scope: null, file: !149, line: 52, type: !437, isLocal: false, isDefinition: true, scopeLine: 52, isOptimized: false, unit: !1, retainedNodes: !3)
!437 = !DISubroutineType(types: !438)
!438 = !{!55, !423, !423}
!439 = !DILocalVariable(name: "e", arg: 1, scope: !436, file: !149, line: 52, type: !423)
!440 = !DILocation(line: 52, column: 1, scope: !436)
!441 = !DILocation(line: 53, column: 10, scope: !436)
!442 = !DILocation(line: 53, column: 2, scope: !436)
!443 = !DILocalVariable(name: "$ret11", scope: !436, file: !149, line: 52, type: !55)
!444 = !DILocation(line: 52, column: 36, scope: !436)
!445 = distinct !DISubprogram(name: "errors.Error..1command_line_arguments.ConcreteUserError", linkageName: "command_line_arguments.ConcreteUserError.Error", scope: null, file: !149, line: 34, type: !437, isLocal: false, isDefinition: true, scopeLine: 34, isOptimized: false, unit: !1, retainedNodes: !3)
!446 = !DILocalVariable(name: "e", arg: 1, scope: !445, file: !149, line: 34, type: !423)
!447 = !DILocation(line: 34, column: 1, scope: !445)
!448 = !DILocation(line: 35, column: 6, scope: !445)
!449 = !DILocation(line: 35, column: 16, scope: !445)
!450 = !DILocalVariable(name: "$ret8", scope: !445, file: !149, line: 34, type: !55)
!451 = !DILocation(line: 34, column: 37, scope: !445)
!452 = !DILocation(line: 38, column: 2, scope: !445)
!453 = !DILocation(line: 36, column: 20, scope: !445)
!454 = !DILocation(line: 36, column: 3, scope: !445)
!455 = distinct !DISubprogram(name: "errors.Message..1command_line_arguments.ConcreteUserError", linkageName: "command_line_arguments.ConcreteUserError.Message", scope: null, file: !149, line: 57, type: !437, isLocal: false, isDefinition: true, scopeLine: 57, isOptimized: false, unit: !1, retainedNodes: !3)
!456 = !DILocalVariable(name: "e", arg: 1, scope: !455, file: !149, line: 57, type: !423)
!457 = !DILocation(line: 57, column: 1, scope: !455)
!458 = !DILocation(line: 58, column: 10, scope: !455)
!459 = !DILocation(line: 58, column: 2, scope: !455)
!460 = !DILocalVariable(name: "$ret12", scope: !455, file: !149, line: 57, type: !55)
!461 = !DILocation(line: 57, column: 39, scope: !455)
!462 = distinct !DISubprogram(name: "errors.Status..1command_line_arguments.ConcreteUserError", linkageName: "command_line_arguments.ConcreteUserError.Status", scope: null, file: !149, line: 47, type: !463, isLocal: false, isDefinition: true, scopeLine: 47, isOptimized: false, unit: !1, retainedNodes: !3)
!463 = !DISubroutineType(types: !464)
!464 = !{!59, !423, !423}
!465 = !DILocalVariable(name: "e", arg: 1, scope: !462, file: !149, line: 47, type: !423)
!466 = !DILocation(line: 47, column: 1, scope: !462)
!467 = !DILocalVariable(name: "$ret10", scope: !462, file: !149, line: 47, type: !59)
!468 = !DILocation(line: 47, column: 38, scope: !462)
!469 = !DILocation(line: 48, column: 10, scope: !462)
!470 = !DILocation(line: 48, column: 2, scope: !462)
!471 = distinct !DISubprogram(name: "errors.Build", linkageName: "command_line_arguments.Build", scope: null, file: !149, line: 24, type: !472, isLocal: false, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !1, retainedNodes: !3)
!472 = !DISubroutineType(types: !473)
!473 = !{!423, !148}
!474 = !DILocalVariable(name: "err", arg: 1, scope: !471, file: !149, line: 24, type: !148)
