; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22logging\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22logging\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22command_line_arguments..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22context..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt..import\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./logging.go", directory: "/home/wangcong/go_path/src/github.com/spolu/warp/lib/logging")
!3 = !{}
!4 = !{!5, !10}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.silentKey", linkageName: "command_line_arguments.silentKey", scope: !1, file: !7, line: 8, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "logging.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !12, line: 1, type: !13, isLocal: false, isDefinition: true)
!12 = !DIFile(filename: "<built-in>", directory: "")
!13 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!14 = distinct !DISubprogram(name: "logging.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 1, type: !15, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!15 = !DISubroutineType(types: !16)
!16 = !{!17}
!17 = !DIBasicType(name: "void")
!18 = !DILocation(line: 1, column: 1, scope: !19)
!19 = !DILexicalBlockFile(scope: !14, file: !12, discriminator: 0)
!20 = !DILocation(line: 8, column: 17, scope: !21)
!21 = !DILexicalBlockFile(scope: !14, file: !7, discriminator: 0)
!22 = !DILocation(line: 8, column: 5, scope: !21)
!23 = distinct !DISubprogram(name: "logging.SetSilent", linkageName: "command_line_arguments.SetSilent", scope: null, file: !7, line: 11, type: !24, isLocal: false, isDefinition: true, scopeLine: 11, isOptimized: false, unit: !1, retainedNodes: !3)
!24 = !DISubroutineType(types: !25)
!25 = !{!26, !26, !62}
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !7, line: 4, size: 128, align: 8, elements: !27)
!27 = !{!28, !161}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 4, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,struct{*_type,*void})struct{*_type,*void}}", file: !31, size: 320, align: 8, elements: !32)
!31 = !DIFile(filename: "", directory: "")
!32 = !{!33, !90, !132, !138, !154}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !31, line: 4, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !12, line: 1, size: 576, align: 8, elements: !36)
!36 = !{!37, !39, !40, !41, !43, !44, !45, !54, !63, !65, !71, !89}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !12, line: 1, baseType: !38, size: 64, align: 64)
!38 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !12, line: 1, baseType: !38, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !12, line: 1, baseType: !13, size: 32, align: 32, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !12, line: 1, baseType: !42, size: 8, align: 8, offset: 160)
!42 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !12, line: 1, baseType: !42, size: 8, align: 8, offset: 168)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !12, line: 1, baseType: !42, size: 8, align: 8, offset: 176)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !12, line: 1, baseType: !46, size: 64, align: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !12, line: 1, size: 64, align: 8, elements: !48)
!48 = !{!49}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !12, line: 1, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!38, !53, !38}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !12, line: 1, baseType: !55, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !12, line: 1, size: 64, align: 8, elements: !57)
!57 = !{!58}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !12, line: 1, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !53, !53}
!62 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !12, line: 1, baseType: !64, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !12, line: 1, baseType: !66, size: 64, align: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !12, line: 1, size: 128, align: 8, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !12, line: 1, baseType: !64, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !12, line: 1, baseType: !9, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !12, line: 1, baseType: !72, size: 64, align: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !12, line: 1, size: 320, align: 8, elements: !74)
!74 = !{!75, !76, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !12, line: 1, baseType: !66, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !12, line: 1, baseType: !66, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !12, line: 1, baseType: !78, size: 192, align: 64, offset: 128)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !31, size: 192, align: 8, elements: !79)
!79 = !{!80, !87, !88}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !31, line: 1, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !12, line: 1, size: 320, align: 8, elements: !83)
!83 = !{!75, !76, !84, !85, !86}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !12, line: 1, baseType: !53, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !12, line: 1, baseType: !53, size: 64, align: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !12, line: 1, baseType: !53, size: 64, align: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !31, line: 1, baseType: !9, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !31, line: 1, baseType: !9, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !12, line: 1, baseType: !53, size: 64, align: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !31, line: 4, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !53}
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !31, size: 256, align: 8, elements: !95)
!95 = !{!96, !131}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !31, line: 4, baseType: !97, size: 192, align: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 4, size: 192, align: 8, elements: !98)
!98 = !{!99, !101, !103}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 4, baseType: !100, size: 64, align: 64)
!100 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 4, baseType: !102, size: 64, align: 64, offset: 64)
!102 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 4, baseType: !104, size: 64, align: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 4, size: 704, align: 8, elements: !106)
!106 = !{!107, !108, !117, !128, !129, !130}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 4, baseType: !67, size: 128, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 4, baseType: !109, size: 192, align: 64, offset: 128)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !31, size: 192, align: 8, elements: !110)
!110 = !{!111, !87, !88}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !31, line: 1, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 4, size: 256, align: 8, elements: !114)
!114 = !{!107, !115, !116}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 4, baseType: !9, size: 64, align: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 4, baseType: !62, size: 8, align: 8, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 4, baseType: !118, size: 192, align: 64, offset: 320)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !31, size: 192, align: 8, elements: !119)
!119 = !{!120, !87, !88}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !31, line: 1, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 4, size: 128, align: 8, elements: !123)
!123 = !{!124, !125, !126, !127}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 4, baseType: !102, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 4, baseType: !42, size: 8, align: 8, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 4, baseType: !62, size: 8, align: 8, offset: 72)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 4, baseType: !62, size: 8, align: 8, offset: 80)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 4, baseType: !102, size: 64, align: 64, offset: 512)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 4, baseType: !102, size: 64, align: 64, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 4, baseType: !112, size: 64, align: 64, offset: 640)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !31, line: 4, baseType: !62, size: 8, align: 8, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !31, line: 4, baseType: !133, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !53}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !12, line: 1, align: 8, elements: !3)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !31, line: 4, baseType: !139, size: 64, align: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!142, !53}
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !12, line: 1, size: 128, align: 8, elements: !143)
!143 = !{!144, !153}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !12, line: 1, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !31, size: 128, align: 8, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !31, line: 1, baseType: !34, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !31, line: 1, baseType: !150, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!67, !53}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !12, line: 1, baseType: !53, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !31, line: 4, baseType: !155, size: 64, align: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!158, !53, !158}
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !31, size: 128, align: 8, elements: !159)
!159 = !{!148, !160}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !31, line: 1, baseType: !53, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !53, size: 64, align: 64, offset: 64)
!162 = !DILocalVariable(name: "ctx", arg: 1, scope: !23, file: !7, line: 11, type: !26)
!163 = !DILocation(line: 11, column: 16, scope: !23)
!164 = !DILocalVariable(name: "val", arg: 2, scope: !23, file: !7, line: 11, type: !62)
!165 = !DILocation(line: 11, column: 37, scope: !23)
!166 = !DILocation(line: 12, column: 32, scope: !23)
!167 = !DILocation(line: 12, column: 43, scope: !23)
!168 = !DILocation(line: 12, column: 17, scope: !23)
!169 = !DILocation(line: 12, column: 2, scope: !23)
!170 = distinct !DISubprogram(name: "logging.Silent", linkageName: "command_line_arguments.Silent", scope: null, file: !7, line: 17, type: !171, isLocal: false, isDefinition: true, scopeLine: 17, isOptimized: false, unit: !1, retainedNodes: !3)
!171 = !DISubroutineType(types: !172)
!172 = !{!62, !26}
!173 = !DILocalVariable(name: "ctx", arg: 1, scope: !170, file: !7, line: 17, type: !26)
!174 = !DILocation(line: 17, column: 13, scope: !170)
!175 = !DILocalVariable(name: "$ret1", scope: !170, file: !7, line: 17, type: !62)
!176 = !DILocation(line: 17, column: 34, scope: !170)
!177 = !DILocalVariable(name: "val", scope: !178, file: !7, line: 18, type: !62)
!178 = distinct !DILexicalBlock(scope: !170, file: !7, line: 17, column: 1)
!179 = !DILocation(line: 18, column: 2, scope: !170)
!180 = !DILocalVariable(name: "ok", scope: !178, file: !7, line: 18, type: !62)
!181 = !DILocation(line: 18, column: 16, scope: !178)
!182 = !DILocation(line: 18, column: 23, scope: !178)
!183 = !DILocation(line: 18, column: 2, scope: !178)
!184 = !DILocation(line: 19, column: 12, scope: !178)
!185 = !DILocation(line: 19, column: 2, scope: !178)
!186 = distinct !DISubprogram(name: "logging.Log", linkageName: "command_line_arguments.Log", scope: null, file: !7, line: 23, type: !187, isLocal: false, isDefinition: true, scopeLine: 23, isOptimized: false, unit: !1, retainedNodes: !3)
!187 = !DISubroutineType(types: !188)
!188 = !{!17, !26, !189}
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*void},int,int}", file: !31, size: 192, align: 8, elements: !190)
!190 = !{!191, !87, !88}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !31, line: 1, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!193 = !DILocalVariable(name: "v", arg: 2, scope: !186, file: !7, line: 23, type: !189)
!194 = !DILocation(line: 23, column: 29, scope: !186)
!195 = !DILocalVariable(name: "c", arg: 1, scope: !186, file: !7, line: 23, type: !26)
!196 = !DILocation(line: 23, column: 10, scope: !186)
!197 = !DILocation(line: 24, column: 7, scope: !186)
!198 = !DILocation(line: 25, column: 7, scope: !186)
!199 = !DILocation(line: 25, column: 6, scope: !186)
!200 = !DILocation(line: 29, column: 7, scope: !186)
!201 = !DILocation(line: 26, column: 8, scope: !186)
!202 = distinct !DISubprogram(name: "logging.Logf", linkageName: "command_line_arguments.Logf", scope: null, file: !7, line: 34, type: !203, isLocal: false, isDefinition: true, scopeLine: 34, isOptimized: false, unit: !1, retainedNodes: !3)
!203 = !DISubroutineType(types: !204)
!204 = !{!17, !26, !67, !189}
!205 = !DILocalVariable(name: "v", arg: 3, scope: !202, file: !7, line: 34, type: !189)
!206 = !DILocation(line: 34, column: 45, scope: !202)
!207 = !DILocalVariable(name: "c", arg: 1, scope: !202, file: !7, line: 34, type: !26)
!208 = !DILocation(line: 34, column: 11, scope: !202)
!209 = !DILocalVariable(name: "format", arg: 2, scope: !202, file: !7, line: 34, type: !67)
!210 = !DILocation(line: 34, column: 30, scope: !202)
!211 = !DILocation(line: 35, column: 7, scope: !202)
!212 = !DILocation(line: 36, column: 7, scope: !202)
!213 = !DILocation(line: 36, column: 6, scope: !202)
!214 = !DILocation(line: 40, column: 7, scope: !202)
!215 = !DILocation(line: 37, column: 8, scope: !202)
