; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22plex\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22io\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22io\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22io\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22context..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22poll\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_poll..import\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3)
!2 = !DIFile(filename: "./plex.go", directory: "/home/wangcong/go_path/src/github.com/spolu/warp/lib/plex")
!3 = !{}
!4 = distinct !DISubprogram(name: "plex.Run", linkageName: "command_line_arguments.Run", scope: null, file: !5, line: 9, type: !6, isLocal: false, isDefinition: true, scopeLine: 9, isOptimized: false, unit: !1, retainedNodes: !3)
!5 = !DIFile(filename: "plex.go", directory: ".")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !9, !148, !158}
!8 = !DIBasicType(name: "void")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !5, line: 4, size: 128, align: 8, elements: !10)
!10 = !{!11, !147}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 4, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,struct{*_type,*void})struct{*_type,*void}}", file: !14, size: 320, align: 8, elements: !15)
!14 = !DIFile(filename: "", directory: "")
!15 = !{!16, !76, !118, !124, !140}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 4, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !19, line: 1, size: 576, align: 8, elements: !20)
!19 = !DIFile(filename: "<built-in>", directory: "")
!20 = !{!21, !23, !24, !26, !28, !29, !30, !39, !48, !50, !57, !75}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !19, line: 1, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !19, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !19, line: 1, baseType: !25, size: 32, align: 32, offset: 128)
!25 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !19, line: 1, baseType: !27, size: 8, align: 8, offset: 160)
!27 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !19, line: 1, baseType: !27, size: 8, align: 8, offset: 168)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !19, line: 1, baseType: !27, size: 8, align: 8, offset: 176)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !19, line: 1, baseType: !31, size: 64, align: 64, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !19, line: 1, size: 64, align: 8, elements: !33)
!33 = !{!34}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !19, line: 1, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{!22, !38, !22}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !19, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !19, line: 1, size: 64, align: 8, elements: !42)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !19, line: 1, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !38, !38}
!47 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !19, line: 1, baseType: !49, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !19, line: 1, baseType: !51, size: 64, align: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !19, line: 1, size: 128, align: 8, elements: !53)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !19, line: 1, baseType: !49, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !19, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !19, line: 1, baseType: !58, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !19, line: 1, size: 320, align: 8, elements: !60)
!60 = !{!61, !62, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !19, line: 1, baseType: !51, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !19, line: 1, baseType: !51, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !19, line: 1, baseType: !64, size: 192, align: 64, offset: 128)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !14, size: 192, align: 8, elements: !65)
!65 = !{!66, !73, !74}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !19, line: 1, size: 320, align: 8, elements: !69)
!69 = !{!61, !62, !70, !71, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !19, line: 1, baseType: !38, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !19, line: 1, baseType: !38, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !19, line: 1, baseType: !38, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !14, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !14, line: 1, baseType: !56, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !19, line: 1, baseType: !38, size: 64, align: 64, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !14, line: 4, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !38}
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !14, size: 256, align: 8, elements: !81)
!81 = !{!82, !117}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !14, line: 4, baseType: !83, size: 192, align: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !5, line: 4, size: 192, align: 8, elements: !84)
!84 = !{!85, !87, !89}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !5, line: 4, baseType: !86, size: 64, align: 64)
!86 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !5, line: 4, baseType: !88, size: 64, align: 64, offset: 64)
!88 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !5, line: 4, baseType: !90, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !5, line: 4, size: 704, align: 8, elements: !92)
!92 = !{!93, !94, !103, !114, !115, !116}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !5, line: 4, baseType: !52, size: 128, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !5, line: 4, baseType: !95, size: 192, align: 64, offset: 128)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !14, size: 192, align: 8, elements: !96)
!96 = !{!97, !73, !74}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !5, line: 4, size: 256, align: 8, elements: !100)
!100 = !{!93, !101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !5, line: 4, baseType: !56, size: 64, align: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !5, line: 4, baseType: !47, size: 8, align: 8, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !5, line: 4, baseType: !104, size: 192, align: 64, offset: 320)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !14, size: 192, align: 8, elements: !105)
!105 = !{!106, !73, !74}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !5, line: 4, size: 128, align: 8, elements: !109)
!109 = !{!110, !111, !112, !113}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !5, line: 4, baseType: !88, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !5, line: 4, baseType: !27, size: 8, align: 8, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !5, line: 4, baseType: !47, size: 8, align: 8, offset: 72)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !5, line: 4, baseType: !47, size: 8, align: 8, offset: 80)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !5, line: 4, baseType: !88, size: 64, align: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !5, line: 4, baseType: !88, size: 64, align: 64, offset: 576)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !5, line: 4, baseType: !98, size: 64, align: 64, offset: 640)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !14, line: 4, baseType: !47, size: 8, align: 8, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !14, line: 4, baseType: !119, size: 64, align: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!122, !38}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !19, line: 1, align: 8, elements: !3)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !14, line: 4, baseType: !125, size: 64, align: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!128, !38}
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !19, line: 1, size: 128, align: 8, elements: !129)
!129 = !{!130, !139}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !19, line: 1, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !14, size: 128, align: 8, elements: !133)
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 1, baseType: !17, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !14, line: 1, baseType: !136, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!52, !38}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !19, line: 1, baseType: !38, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !14, line: 4, baseType: !141, size: 64, align: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!144, !38, !144}
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !14, size: 128, align: 8, elements: !145)
!145 = !{!134, !146}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !14, line: 1, baseType: !38, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !5, line: 1, baseType: !38, size: 64, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 11, size: 64, align: 8, elements: !150)
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 11, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!8, !155}
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !14, size: 192, align: 8, elements: !156)
!156 = !{!157, !73, !74}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !49, size: 64, align: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !5, line: 5, size: 128, align: 8, elements: !159)
!159 = !{!160, !147}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 5, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !14, size: 128, align: 8, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 5, baseType: !17, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !14, line: 5, baseType: !166, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!169, !38, !155}
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !14, size: 192, align: 8, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !14, line: 5, baseType: !56, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !14, line: 5, baseType: !128, size: 128, align: 64, offset: 64)
!173 = !DILocalVariable(name: "ctx", arg: 1, scope: !4, file: !5, line: 10, type: !9)
!174 = !DILocation(line: 10, column: 2, scope: !4)
!175 = !DILocalVariable(name: "dst", arg: 2, scope: !4, file: !5, line: 11, type: !148)
!176 = !DILocation(line: 11, column: 2, scope: !4)
!177 = !DILocalVariable(name: "src", arg: 3, scope: !4, file: !5, line: 12, type: !158)
!178 = !DILocation(line: 12, column: 2, scope: !4)
!179 = !DILocation(line: 14, column: 9, scope: !180)
!180 = distinct !DILexicalBlock(scope: !4, file: !5, line: 9, column: 1)
!181 = !DILocation(line: 17, column: 17, scope: !182)
!182 = distinct !DILexicalBlock(scope: !180, file: !5, line: 16, column: 6)
!183 = !DILocalVariable(name: "buf", scope: !180, file: !5, line: 14, type: !155)
!184 = !DILocation(line: 14, column: 2, scope: !4)
!185 = !DILocalVariable(name: "nr", scope: !182, file: !5, line: 17, type: !56)
!186 = !DILocation(line: 17, column: 3, scope: !180)
!187 = !DILocalVariable(name: "err", scope: !182, file: !5, line: 17, type: !128)
!188 = !DILocation(line: 18, column: 9, scope: !182)
!189 = !DILocation(line: 19, column: 11, scope: !190)
!190 = distinct !DILexicalBlock(scope: !182, file: !5, line: 18, column: 13)
!191 = !DILocation(line: 20, column: 4, scope: !190)
!192 = !DILocation(line: 21, column: 4, scope: !190)
!193 = !DILocalVariable(name: "cpy", scope: !190, file: !5, line: 19, type: !155)
!194 = !DILocation(line: 19, column: 4, scope: !182)
!195 = !DILocation(line: 23, column: 10, scope: !182)
!196 = !DILocation(line: 26, column: 3, scope: !182)
!197 = !DILocation(line: 27, column: 13, scope: !182)
!198 = !DILocation(line: 27, column: 3, scope: !182)
!199 = !DILocation(line: 29, column: 3, scope: !182)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "plex"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "command-line-arguments"
	.ascii ";\n"
	.ascii "import "
	.ascii "context"
	.ascii " "
	.ascii "context"
	.ascii " \""
	.ascii "context"
	.ascii "\";\n"
	.ascii "import "
	.ascii "io"
	.ascii " "
	.ascii "io"
	.ascii " \""
	.ascii "io"
	.ascii "\";\n"
	.ascii "init"
	.ascii " "
	.ascii "context"
	.ascii " "
	.ascii "context..import"
	.ascii " "
	.ascii "fmt"
	.ascii " "
	.ascii "fmt..import"
	.ascii " "
	.ascii "poll"
	.ascii " "
	.ascii "internal_poll..import"
	.ascii " "
	.ascii "testlog"
	.ascii " "
	.ascii "internal_testlog..import"
	.ascii " "
	.ascii "io"
	.ascii " "
	.ascii "io..import"
	.ascii " "
	.ascii "os"
	.ascii " "
	.ascii "os..import"
	.ascii " "
	.ascii "reflect"
	.ascii " "
	.ascii "reflect..import"
	.ascii " "
	.ascii "runtime"
	.ascii " "
	.ascii "runtime..import"
	.ascii " "
	.ascii "sys"
	.ascii " "
	.ascii "runtime_internal_sys..import"
	.ascii " "
	.ascii "strconv"
	.ascii " "
	.ascii "strconv..import"
	.ascii " "
	.ascii "sync"
	.ascii " "
	.ascii "sync..import"
	.ascii " "
	.ascii "syscall"
	.ascii " "
	.ascii "syscall..import"
	.ascii " "
	.ascii "time"
	.ascii " "
	.ascii "time..import"
	.ascii " "
	.ascii "unicode"
	.ascii " "
	.ascii "unicode..import"
	.ascii ";\n"
	.ascii "init_graph"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "2"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "3"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "4"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "5"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "6"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "7"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "8"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "9"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "10"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "11"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "12"
	.ascii " "
	.ascii "0"
	.ascii " "
	.ascii "13"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "2"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "3"
	.ascii " "
	.ascii "1"
	.ascii " "
	.ascii "4"
	.ascii " "
	.ascii "1"
