; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22warp\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22regexp\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22regexp\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22regexp\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22warp\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22command_line_arguments..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22io\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22io..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22reflect\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22reflect..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22regexp\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22regexp..import\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./protocol.go", directory: "/home/wangcong/go_path/src/github.com/spolu/warp")
!3 = !{}
!4 = !{!5, !16, !18, !243, !245}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.Version", linkageName: "command_line_arguments.Version", scope: !1, file: !7, line: 10, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "protocol.go", directory: ".")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !9, line: 1, size: 128, align: 8, elements: !10)
!9 = !DIFile(filename: "<built-in>", directory: "")
!10 = !{!11, !14}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !9, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !9, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!15 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "command_line_arguments.DefaultAddress", linkageName: "command_line_arguments.DefaultAddress", scope: !1, file: !7, line: 13, type: !8, isLocal: false, isDefinition: true)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "command_line_arguments.WarpRegexp", linkageName: "command_line_arguments.WarpRegexp", scope: !1, file: !7, line: 16, type: !20, isLocal: false, isDefinition: true)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "Regexp", file: !7, line: 3, size: 1280, align: 8, elements: !22)
!22 = !{!23, !89, !94}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "regexpRO", file: !7, line: 3, baseType: !24, size: 1024, align: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.regexpRO", file: !7, line: 3, size: 1024, align: 8, elements: !25)
!25 = !{!26, !27, !54, !71, !72, !76, !78, !79, !80, !82, !83, !88}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "expr", file: !7, line: 3, baseType: !8, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "prog", file: !7, line: 3, baseType: !28, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "Prog", file: !7, line: 3, size: 320, align: 8, elements: !30)
!30 = !{!31, !52, !53}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Inst", file: !7, line: 3, baseType: !32, size: 192, align: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Inst,int,int}", file: !33, size: 192, align: 8, elements: !34)
!33 = !DIFile(filename: "", directory: "")
!34 = !{!35, !50, !51}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inst", file: !7, line: 3, size: 320, align: 8, elements: !38)
!38 = !{!39, !41, !43, !44}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "Op", file: !7, line: 3, baseType: !40, size: 8, align: 8)
!40 = !DIBasicType(name: "InstOp", size: 8, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !7, line: 3, baseType: !42, size: 32, align: 32, offset: 32)
!42 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "Arg", file: !7, line: 3, baseType: !42, size: 32, align: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "Rune", file: !7, line: 3, baseType: !45, size: 192, align: 64, offset: 128)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int32,int,int}", file: !33, size: 192, align: 8, elements: !46)
!46 = !{!47, !50, !51}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !33, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !33, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Start", file: !7, line: 3, baseType: !15, size: 64, align: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "NumCap", file: !7, line: 3, baseType: !15, size: 64, align: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "onepass", file: !7, line: 3, baseType: !55, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.onePassProg", file: !7, line: 3, size: 320, align: 8, elements: !57)
!57 = !{!58, !52, !53}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Inst", file: !7, line: 3, baseType: !59, size: 192, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.regexp.onePassInst,int,int}", file: !33, size: 192, align: 8, elements: !60)
!60 = !{!61, !50, !51}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.onePassInst", file: !7, line: 3, size: 512, align: 8, elements: !64)
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Inst", file: !7, line: 3, baseType: !37, size: 320, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !7, line: 3, baseType: !67, size: 192, align: 64, offset: 320)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint32,int,int}", file: !33, size: 192, align: 8, elements: !68)
!68 = !{!69, !50, !51}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", file: !7, line: 3, baseType: !8, size: 128, align: 64, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "prefixBytes", file: !7, line: 3, baseType: !73, size: 192, align: 64, offset: 384)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !33, size: 192, align: 8, elements: !74)
!74 = !{!75, !50, !51}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !12, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "prefixComplete", file: !7, line: 3, baseType: !77, size: 8, align: 8, offset: 576)
!77 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "prefixRune", file: !7, line: 3, baseType: !49, size: 32, align: 32, offset: 608)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "prefixEnd", file: !7, line: 3, baseType: !42, size: 32, align: 32, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "cond", file: !7, line: 3, baseType: !81, size: 8, align: 8, offset: 672)
!81 = !DIBasicType(name: "EmptyOp", size: 8, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "numSubexp", file: !7, line: 3, baseType: !15, size: 64, align: 64, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "subexpNames", file: !7, line: 3, baseType: !84, size: 192, align: 64, offset: 768)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !33, size: 192, align: 8, elements: !85)
!85 = !{!86, !50, !51}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "longest", file: !7, line: 3, baseType: !77, size: 8, align: 8, offset: 960)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !7, line: 3, baseType: !90, size: 64, align: 32, offset: 1024)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 3, size: 64, align: 8, elements: !91)
!91 = !{!92, !93}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 3, baseType: !49, size: 32, align: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 3, baseType: !42, size: 32, align: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "machine", file: !7, line: 3, baseType: !95, size: 192, align: 64, offset: 1088)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**.regexp.machine,int,int}", file: !33, size: 192, align: 8, elements: !96)
!96 = !{!97, !50, !51}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.machine", file: !7, line: 3, size: 2112, align: 8, elements: !101)
!101 = !{!102, !105, !106, !107, !108, !130, !147, !148, !153, !154, !155, !159, !163}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "re", file: !7, line: 3, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIBasicType(name: "void")
!105 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !7, line: 3, baseType: !28, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "op", file: !7, line: 3, baseType: !55, size: 64, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "maxBitStateLen", file: !7, line: 3, baseType: !15, size: 64, align: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !7, line: 3, baseType: !109, size: 64, align: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.bitState", file: !7, line: 3, size: 704, align: 8, elements: !111)
!111 = !{!112, !113, !114, !119, !129}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "prog", file: !7, line: 3, baseType: !28, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "end", file: !7, line: 3, baseType: !15, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "cap", file: !7, line: 3, baseType: !115, size: 192, align: 64, offset: 128)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !33, size: 192, align: 8, elements: !116)
!116 = !{!117, !50, !51}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", file: !7, line: 3, baseType: !120, size: 192, align: 64, offset: 320)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.regexp.job,int,int}", file: !33, size: 192, align: 8, elements: !121)
!121 = !{!122, !50, !51}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.job", file: !7, line: 3, size: 128, align: 8, elements: !125)
!125 = !{!126, !127, !128}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !7, line: 3, baseType: !42, size: 32, align: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !7, line: 3, baseType: !77, size: 8, align: 8, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "pos", file: !7, line: 3, baseType: !15, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "visited", file: !7, line: 3, baseType: !67, size: 192, align: 64, offset: 512)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "q0", file: !7, line: 3, baseType: !131, size: 384, align: 64, offset: 320)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.queue", file: !7, line: 3, size: 384, align: 8, elements: !132)
!132 = !{!133, !134}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "sparse", file: !7, line: 3, baseType: !67, size: 192, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "dense", file: !7, line: 3, baseType: !135, size: 192, align: 64, offset: 192)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.regexp.entry,int,int}", file: !33, size: 192, align: 8, elements: !136)
!136 = !{!137, !50, !51}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.entry", file: !7, line: 3, size: 128, align: 8, elements: !140)
!140 = !{!126, !141}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "t", file: !7, line: 3, baseType: !142, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.thread", file: !7, line: 3, size: 256, align: 8, elements: !144)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "inst", file: !7, line: 3, baseType: !36, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "cap", file: !7, line: 3, baseType: !115, size: 192, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "q1", file: !7, line: 3, baseType: !131, size: 384, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pool", file: !7, line: 3, baseType: !149, size: 192, align: 64, offset: 1088)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**.regexp.thread,int,int}", file: !33, size: 192, align: 8, elements: !150)
!150 = !{!151, !50, !51}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "matched", file: !7, line: 3, baseType: !77, size: 8, align: 8, offset: 1280)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "matchcap", file: !7, line: 3, baseType: !115, size: 192, align: 64, offset: 1344)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "inputBytes", file: !7, line: 3, baseType: !156, size: 192, align: 64, offset: 1536)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.inputBytes", file: !7, line: 3, size: 192, align: 8, elements: !157)
!157 = !{!158}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "str", file: !7, line: 3, baseType: !73, size: 192, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "inputString", file: !7, line: 3, baseType: !160, size: 128, align: 64, offset: 1728)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.inputString", file: !7, line: 3, size: 128, align: 8, elements: !161)
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "str", file: !7, line: 3, baseType: !8, size: 128, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "inputReader", file: !7, line: 3, baseType: !164, size: 256, align: 64, offset: 1856)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.inputReader", file: !7, line: 3, size: 256, align: 8, elements: !165)
!165 = !{!166, !241, !242}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !7, line: 3, baseType: !167, size: 128, align: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "RuneReader", file: !7, line: 3, size: 128, align: 8, elements: !168)
!168 = !{!169, !240}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 3, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{int32,int,error}}", file: !33, size: 128, align: 8, elements: !172)
!172 = !{!173, !219}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !33, line: 3, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !9, line: 1, size: 576, align: 8, elements: !176)
!176 = !{!177, !179, !180, !181, !182, !183, !184, !192, !200, !201, !202, !218}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !9, line: 1, baseType: !178, size: 64, align: 64)
!178 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !9, line: 1, baseType: !178, size: 64, align: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !9, line: 1, baseType: !42, size: 32, align: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !9, line: 1, baseType: !13, size: 8, align: 8, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !9, line: 1, baseType: !13, size: 8, align: 8, offset: 168)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !9, line: 1, baseType: !13, size: 8, align: 8, offset: 176)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !9, line: 1, baseType: !185, size: 64, align: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !9, line: 1, size: 64, align: 8, elements: !187)
!187 = !{!188}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !9, line: 1, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!178, !103, !178}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !9, line: 1, baseType: !193, size: 64, align: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !9, line: 1, size: 64, align: 8, elements: !195)
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !9, line: 1, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!77, !103, !103}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !9, line: 1, baseType: !12, size: 64, align: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !9, line: 1, baseType: !87, size: 64, align: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !9, line: 1, baseType: !203, size: 64, align: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !9, line: 1, size: 320, align: 8, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !9, line: 1, baseType: !87, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !9, line: 1, baseType: !87, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !9, line: 1, baseType: !209, size: 192, align: 64, offset: 128)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !33, size: 192, align: 8, elements: !210)
!210 = !{!211, !50, !51}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !9, line: 1, size: 320, align: 8, elements: !214)
!214 = !{!206, !207, !215, !216, !217}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !9, line: 1, baseType: !103, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !9, line: 1, baseType: !103, size: 64, align: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !9, line: 1, baseType: !103, size: 64, align: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !9, line: 1, baseType: !103, size: 64, align: 64, offset: 512)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ReadRune", file: !33, line: 3, baseType: !220, size: 64, align: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!223, !103}
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int32,int,error}", file: !33, size: 256, align: 8, elements: !224)
!224 = !{!225, !226, !227}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !33, line: 3, baseType: !49, size: 32, align: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !33, line: 3, baseType: !15, size: 64, align: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !33, line: 3, baseType: !228, size: 128, align: 64, offset: 128)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !9, line: 1, size: 128, align: 8, elements: !229)
!229 = !{!230, !239}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !9, line: 1, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !33, size: 128, align: 8, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !33, line: 1, baseType: !174, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !33, line: 1, baseType: !236, size: 64, align: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!8, !103}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !9, line: 1, baseType: !103, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !103, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "atEOT", file: !7, line: 3, baseType: !77, size: 8, align: 8, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pos", file: !7, line: 3, baseType: !15, size: 64, align: 64, offset: 192)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !9, line: 1, type: !42, isLocal: false, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "command_line_arguments.EnvWarp", linkageName: "command_line_arguments.EnvWarp", scope: !1, file: !7, line: 105, type: !8, isLocal: false, isDefinition: true)
!247 = distinct !DISubprogram(name: "warp.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 1, type: !248, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!248 = !DISubroutineType(types: !249)
!249 = !{!104}
!250 = !DILocation(line: 1, column: 1, scope: !251)
!251 = !DILexicalBlockFile(scope: !247, file: !9, discriminator: 0)
!252 = !DILocation(line: 16, column: 25, scope: !253)
!253 = !DILexicalBlockFile(scope: !247, file: !7, discriminator: 0)
!254 = !DILocation(line: 16, column: 5, scope: !253)
!255 = distinct !DISubprogram(name: "warp.command_line_arguments.User..hash", linkageName: "command_line_arguments.command_line_arguments.User..hash", scope: null, file: !9, line: 1, type: !190, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!256 = !DILocalVariable(name: "key", arg: 1, scope: !255, file: !9, line: 1, type: !103)
!257 = !DILocation(line: 1, column: 1, scope: !255)
!258 = !DILocalVariable(name: "seed", arg: 2, scope: !255, file: !9, line: 1, type: !178)
!259 = !DILocalVariable(name: "$ret0", scope: !255, file: !9, line: 1, type: !178)
!260 = distinct !DISubprogram(name: "warp.command_line_arguments.User..eq", linkageName: "command_line_arguments.command_line_arguments.User..eq", scope: null, file: !9, line: 1, type: !198, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!261 = !DILocalVariable(name: "key1", arg: 1, scope: !260, file: !9, line: 1, type: !103)
!262 = !DILocation(line: 1, column: 1, scope: !260)
!263 = !DILocalVariable(name: "key2", arg: 2, scope: !260, file: !9, line: 1, type: !103)
!264 = !DILocalVariable(name: "$ret1", scope: !260, file: !9, line: 1, type: !77)
!265 = distinct !DISubprogram(name: "warp.command_line_arguments.Session..hash", linkageName: "command_line_arguments.command_line_arguments.Session..hash", scope: null, file: !9, line: 1, type: !190, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!266 = !DILocalVariable(name: "key", arg: 1, scope: !265, file: !9, line: 1, type: !103)
!267 = !DILocation(line: 1, column: 1, scope: !265)
!268 = !DILocalVariable(name: "seed", arg: 2, scope: !265, file: !9, line: 1, type: !178)
!269 = !DILocalVariable(name: "$ret2", scope: !265, file: !9, line: 1, type: !178)
!270 = distinct !DISubprogram(name: "warp.command_line_arguments.Session..eq", linkageName: "command_line_arguments.command_line_arguments.Session..eq", scope: null, file: !9, line: 1, type: !198, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!271 = !DILocalVariable(name: "key1", arg: 1, scope: !270, file: !9, line: 1, type: !103)
!272 = !DILocation(line: 1, column: 1, scope: !270)
!273 = !DILocalVariable(name: "key2", arg: 2, scope: !270, file: !9, line: 1, type: !103)
!274 = !DILocalVariable(name: "$ret3", scope: !270, file: !9, line: 1, type: !77)
!275 = distinct !DISubprogram(name: "warp.command_line_arguments.Error..hash", linkageName: "command_line_arguments.command_line_arguments.Error..hash", scope: null, file: !9, line: 1, type: !190, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
