; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22subnet\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/twitchyliquid64/subnet/subnet\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/twitchyliquid64/subnet/subnet\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22cert\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/twitchyliquid64/subnet/subnet/cert\22"
module asm "\09.ascii \22 \5C\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./flags.go", directory: "/home/wangcong/go_path/src/github.com/twitchyliquid64/subnet")
!3 = !{}
!4 = !{!5, !16, !18, !20, !22, !24, !26, !28, !30, !32, !34, !36, !38, !47, !104, !114}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "main.interfaceNameVar", linkageName: "main.interfaceNameVar", scope: !1, file: !7, line: 11, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "flags.go", directory: ".")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !9, line: 1, size: 128, align: 8, elements: !10)
!9 = !DIFile(filename: "<built-in>", directory: "")
!10 = !{!11, !14}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !9, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !9, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!15 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "main.networkAddrVar", linkageName: "main.networkAddrVar", scope: !1, file: !7, line: 12, type: !8, isLocal: true, isDefinition: true)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "main.additionalClientAddrs", linkageName: "main.additionalClientAddrs", scope: !1, file: !7, line: 13, type: !8, isLocal: true, isDefinition: true)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "main.caCertPathVar", linkageName: "main.caCertPathVar", scope: !1, file: !7, line: 15, type: !8, isLocal: true, isDefinition: true)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "main.caKeyPathVar", linkageName: "main.caKeyPathVar", scope: !1, file: !7, line: 16, type: !8, isLocal: true, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "main.ourCertPathVar", linkageName: "main.ourCertPathVar", scope: !1, file: !7, line: 17, type: !8, isLocal: true, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "main.ourKeyPathVar", linkageName: "main.ourKeyPathVar", scope: !1, file: !7, line: 18, type: !8, isLocal: true, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "main.serverAddressVar", linkageName: "main.serverAddressVar", scope: !1, file: !7, line: 19, type: !8, isLocal: true, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "main.connPortVar", linkageName: "main.connPortVar", scope: !1, file: !7, line: 20, type: !8, isLocal: true, isDefinition: true)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "main.modeVar", linkageName: "main.modeVar", scope: !1, file: !7, line: 22, type: !8, isLocal: true, isDefinition: true)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "main.gatewayVar", linkageName: "main.gatewayVar", scope: !1, file: !7, line: 23, type: !8, isLocal: true, isDefinition: true)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "main.crlPathVar", linkageName: "main.crlPathVar", scope: !1, file: !7, line: 25, type: !8, isLocal: true, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "os.Args", linkageName: "os.Args", scope: !1, file: !7, line: 7, type: !40, isLocal: false, isDefinition: true)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !41, size: 192, align: 8, elements: !42)
!41 = !DIFile(filename: "", directory: "")
!42 = !{!43, !45, !46}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !41, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !41, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "os.Stderr", linkageName: "os.Stderr", scope: !1, file: !7, line: 7, type: !49, isLocal: false, isDefinition: true)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !7, line: 6, size: 64, align: 8, elements: !51)
!51 = !{!52}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !7, line: 6, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !7, line: 6, size: 640, align: 8, elements: !55)
!55 = !{!56, !90, !91, !102, !103}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !7, line: 6, baseType: !57, size: 384, align: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !7, line: 6, size: 384, align: 8, elements: !58)
!58 = !{!59, !67, !68, !73, !84, !85, !87, !88, !89}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !7, line: 6, baseType: !60, size: 128, align: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !7, line: 6, size: 128, align: 8, elements: !61)
!61 = !{!62, !64, !66}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 6, baseType: !63, size: 64, align: 64)
!63 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !7, line: 6, baseType: !65, size: 32, align: 32, offset: 64)
!65 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !7, line: 6, baseType: !65, size: 32, align: 32, offset: 96)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !7, line: 6, baseType: !15, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !7, line: 6, baseType: !69, size: 64, align: 64, offset: 192)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !7, line: 6, size: 64, align: 8, elements: !70)
!70 = !{!71}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !7, line: 6, baseType: !72, size: 64, align: 64)
!72 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !7, line: 6, baseType: !74, size: 64, align: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !41, size: 192, align: 8, elements: !76)
!76 = !{!77, !45, !46}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !7, line: 6, size: 128, align: 8, elements: !80)
!80 = !{!81, !82}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !7, line: 6, baseType: !12, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !7, line: 6, baseType: !83, size: 64, align: 64, offset: 64)
!83 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !7, line: 6, baseType: !65, size: 32, align: 32, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !7, line: 6, baseType: !86, size: 8, align: 8, offset: 352)
!86 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !7, line: 6, baseType: !86, size: 8, align: 8, offset: 360)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !7, line: 6, baseType: !86, size: 8, align: 8, offset: 368)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !7, line: 6, baseType: !86, size: 8, align: 8, offset: 376)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 6, baseType: !8, size: 128, align: 64, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !7, line: 6, baseType: !92, size: 64, align: 64, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !7, line: 6, size: 256, align: 8, elements: !94)
!94 = !{!95, !99}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 6, baseType: !96, size: 192, align: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !41, size: 192, align: 8, elements: !97)
!97 = !{!98, !45, !46}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !12, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !7, line: 6, baseType: !100, size: 64, align: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !7, line: 6, align: 8, elements: !3)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !7, line: 6, baseType: !86, size: 8, align: 8, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !7, line: 6, baseType: !86, size: 8, align: 8, offset: 584)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "flag.Usage", linkageName: "flag.Usage", scope: !1, file: !7, line: 4, type: !106, isLocal: false, isDefinition: true)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 7, size: 64, align: 8, elements: !108)
!108 = !{!109}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 7, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!113}
!113 = !DIBasicType(name: "void")
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !9, line: 1, type: !65, isLocal: false, isDefinition: true)
!116 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !7, line: 1, type: !111, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!117 = !DILocation(line: 1, column: 1, scope: !118)
!118 = !DILexicalBlockFile(scope: !116, file: !9, discriminator: 0)
!119 = distinct !DISubprogram(name: "main.printUsage", scope: null, file: !7, line: 27, type: !111, isLocal: true, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!120 = !DILocation(line: 28, column: 46, scope: !119)
!121 = !DILocation(line: 28, column: 50, scope: !119)
!122 = !DILocation(line: 28, column: 6, scope: !119)
!123 = !DILocation(line: 28, column: 17, scope: !119)
!124 = !DILocation(line: 29, column: 53, scope: !119)
!125 = !DILocation(line: 29, column: 57, scope: !119)
!126 = !DILocation(line: 29, column: 6, scope: !119)
!127 = !DILocation(line: 29, column: 17, scope: !119)
!128 = !DILocation(line: 30, column: 7, scope: !119)
!129 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !130, line: 17, type: !111, isLocal: false, isDefinition: true, scopeLine: 17, isOptimized: false, unit: !1, retainedNodes: !3)
!130 = !DIFile(filename: "main.go", directory: ".")
!131 = !DILocalVariable(name: "s", scope: !132, file: !130, line: 41, type: !134)
!132 = distinct !DILexicalBlock(scope: !133, file: !130, line: 41, column: 3)
!133 = distinct !DILexicalBlock(scope: !129, file: !130, line: 17, column: 1)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "Server", file: !130, line: 13, size: 1600, align: 8, elements: !136)
!136 = !{!137, !655, !672, !673, !674, !675, !676, !677, !678, !679, !682, !683, !684, !700, !716}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tlsConf", file: !130, line: 13, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !130, line: 13, size: 2944, align: 8, elements: !140)
!140 = !{!141, !215, !256, !423, !437, !513, !526, !537, !553, !560, !561, !562, !564, !565, !566, !567, !568, !569, !573, !602, !603, !604, !605, !606, !608, !624, !634, !642}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Rand", file: !130, line: 13, baseType: !142, size: 128, align: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !7, line: 5, size: 128, align: 8, elements: !143)
!143 = !{!144, !214}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 5, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !41, size: 128, align: 8, elements: !147)
!147 = !{!148, !194}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !41, line: 5, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !9, line: 1, size: 576, align: 8, elements: !151)
!151 = !{!152, !153, !154, !155, !156, !157, !158, !167, !175, !176, !177, !193}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !9, line: 1, baseType: !72, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !9, line: 1, baseType: !72, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !9, line: 1, baseType: !65, size: 32, align: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !9, line: 1, baseType: !13, size: 8, align: 8, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !9, line: 1, baseType: !13, size: 8, align: 8, offset: 168)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !9, line: 1, baseType: !13, size: 8, align: 8, offset: 176)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !9, line: 1, baseType: !159, size: 64, align: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !9, line: 1, size: 64, align: 8, elements: !161)
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !9, line: 1, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!72, !166, !72}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !9, line: 1, baseType: !168, size: 64, align: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !9, line: 1, size: 64, align: 8, elements: !170)
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !9, line: 1, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!86, !166, !166}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !9, line: 1, baseType: !12, size: 64, align: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !9, line: 1, baseType: !44, size: 64, align: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !9, line: 1, baseType: !178, size: 64, align: 64, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !9, line: 1, size: 320, align: 8, elements: !180)
!180 = !{!181, !182, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !9, line: 1, baseType: !44, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !9, line: 1, baseType: !44, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !9, line: 1, baseType: !184, size: 192, align: 64, offset: 128)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !41, size: 192, align: 8, elements: !185)
!185 = !{!186, !45, !46}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !9, line: 1, size: 320, align: 8, elements: !189)
!189 = !{!181, !182, !190, !191, !192}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !9, line: 1, baseType: !166, size: 64, align: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !9, line: 1, baseType: !166, size: 64, align: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !9, line: 1, baseType: !166, size: 64, align: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !9, line: 1, baseType: !166, size: 64, align: 64, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !41, line: 5, baseType: !195, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!198, !166, !96}
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !41, size: 192, align: 8, elements: !199)
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !41, line: 5, baseType: !15, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !41, line: 5, baseType: !202, size: 128, align: 64, offset: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !9, line: 1, size: 128, align: 8, elements: !203)
!203 = !{!204, !213}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !9, line: 1, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !41, size: 128, align: 8, elements: !207)
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !41, line: 1, baseType: !149, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !41, line: 1, baseType: !210, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!8, !166}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !9, line: 1, baseType: !166, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !166, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Time", file: !130, line: 13, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !130, line: 13, size: 64, align: 8, elements: !218)
!218 = !{!219}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !130, line: 13, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!223}
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 6, size: 192, align: 8, elements: !224)
!224 = !{!225, !226, !228}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 6, baseType: !63, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 6, baseType: !227, size: 64, align: 64, offset: 64)
!227 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 6, baseType: !229, size: 64, align: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 6, size: 704, align: 8, elements: !231)
!231 = !{!232, !233, !242, !253, !254, !255}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 6, baseType: !8, size: 128, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 6, baseType: !234, size: 192, align: 64, offset: 128)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !41, size: 192, align: 8, elements: !235)
!235 = !{!236, !45, !46}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 6, size: 256, align: 8, elements: !239)
!239 = !{!232, !240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 6, baseType: !15, size: 64, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 6, baseType: !86, size: 8, align: 8, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 6, baseType: !243, size: 192, align: 64, offset: 320)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !41, size: 192, align: 8, elements: !244)
!244 = !{!245, !45, !46}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 6, size: 128, align: 8, elements: !248)
!248 = !{!249, !250, !251, !252}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 6, baseType: !227, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 6, baseType: !13, size: 8, align: 8, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 6, baseType: !86, size: 8, align: 8, offset: 72)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 6, baseType: !86, size: 8, align: 8, offset: 80)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 6, baseType: !227, size: 64, align: 64, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 6, baseType: !227, size: 64, align: 64, offset: 576)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 6, baseType: !237, size: 64, align: 64, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Certificates", file: !130, line: 13, baseType: !257, size: 192, align: 64, offset: 192)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,int,int}", file: !41, size: 192, align: 8, elements: !258)
!258 = !{!259, !45, !46}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !130, line: 13, size: 768, align: 8, elements: !262)
!262 = !{!263, !268, !273, !274, !275}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Certificate", file: !130, line: 13, baseType: !264, size: 192, align: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !41, size: 192, align: 8, elements: !265)
!265 = !{!266, !45, !46}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "PrivateKey", file: !130, line: 13, baseType: !269, size: 128, align: 64, offset: 192)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !130, line: 13, size: 128, align: 8, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !130, line: 1, baseType: !149, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !130, line: 1, baseType: !166, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPStaple", file: !130, line: 13, baseType: !96, size: 192, align: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !130, line: 13, baseType: !264, size: 192, align: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Leaf", file: !130, line: 13, baseType: !276, size: 64, align: 64, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !130, line: 13, size: 10624, align: 8, elements: !278)
!278 = !{!279, !280, !281, !282, !283, !284, !285, !287, !289, !291, !292, !305, !331, !332, !333, !334, !336, !346, !347, !352, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !379, !402, !403, !404, !405, !416, !417, !418, !419, !420, !421, !422}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !130, line: 13, baseType: !96, size: 192, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !130, line: 13, baseType: !96, size: 192, align: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !130, line: 13, baseType: !96, size: 192, align: 64, offset: 384)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !130, line: 13, baseType: !96, size: 192, align: 64, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !130, line: 13, baseType: !96, size: 192, align: 64, offset: 768)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !130, line: 13, baseType: !96, size: 192, align: 64, offset: 960)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !130, line: 13, baseType: !286, size: 64, align: 64, offset: 1152)
!286 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !130, line: 13, baseType: !288, size: 64, align: 64, offset: 1216)
!288 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !130, line: 13, baseType: !290, size: 128, align: 64, offset: 1280)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecrypterOpts", file: !130, line: 14, size: 128, align: 8, elements: !270)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !130, line: 13, baseType: !15, size: 64, align: 64, offset: 1408)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !130, line: 13, baseType: !293, size: 64, align: 64, offset: 1472)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !130, line: 13, size: 256, align: 8, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !130, line: 13, baseType: !86, size: 8, align: 8)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !130, line: 13, baseType: !298, size: 192, align: 64, offset: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !130, line: 13, size: 192, align: 8, elements: !299)
!299 = !{!300, !303, !304}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !130, line: 1, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !130, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !130, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !130, line: 13, baseType: !306, size: 1984, align: 64, offset: 1536)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !130, line: 13, size: 1984, align: 8, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !330}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !130, line: 13, baseType: !40, size: 192, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !130, line: 13, baseType: !40, size: 192, align: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !130, line: 13, baseType: !40, size: 192, align: 64, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !130, line: 13, baseType: !40, size: 192, align: 64, offset: 576)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !130, line: 13, baseType: !40, size: 192, align: 64, offset: 768)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !130, line: 13, baseType: !40, size: 192, align: 64, offset: 960)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !130, line: 13, baseType: !40, size: 192, align: 64, offset: 1152)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !130, line: 13, baseType: !8, size: 128, align: 64, offset: 1344)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !130, line: 13, baseType: !8, size: 128, align: 64, offset: 1472)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !130, line: 13, baseType: !318, size: 192, align: 64, offset: 1600)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !41, size: 192, align: 8, elements: !319)
!319 = !{!320, !45, !46}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !130, line: 13, size: 320, align: 8, elements: !323)
!323 = !{!324, !329}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !130, line: 13, baseType: !325, size: 192, align: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !130, line: 13, size: 192, align: 8, elements: !326)
!326 = !{!327, !303, !304}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !130, line: 1, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !130, line: 13, baseType: !290, size: 128, align: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !130, line: 13, baseType: !318, size: 192, align: 64, offset: 1792)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !130, line: 13, baseType: !306, size: 1984, align: 64, offset: 3520)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !130, line: 13, baseType: !223, size: 192, align: 64, offset: 5504)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !130, line: 13, baseType: !223, size: 192, align: 64, offset: 5696)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !130, line: 13, baseType: !335, size: 64, align: 64, offset: 5888)
!335 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !130, line: 13, baseType: !337, size: 192, align: 64, offset: 5952)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !41, size: 192, align: 8, elements: !338)
!338 = !{!339, !45, !46}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !130, line: 13, size: 448, align: 8, elements: !342)
!342 = !{!343, !344, !345}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !130, line: 13, baseType: !325, size: 192, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !130, line: 13, baseType: !96, size: 192, align: 64, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !130, line: 13, baseType: !337, size: 192, align: 64, offset: 6144)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !130, line: 13, baseType: !348, size: 192, align: 64, offset: 6336)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !41, size: 192, align: 8, elements: !349)
!349 = !{!350, !45, !46}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !130, line: 13, baseType: !353, size: 192, align: 64, offset: 6528)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !41, size: 192, align: 8, elements: !354)
!354 = !{!355, !45, !46}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !130, line: 13, baseType: !348, size: 192, align: 64, offset: 6720)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 6912)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 6920)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !130, line: 13, baseType: !15, size: 64, align: 64, offset: 6976)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 7040)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !130, line: 13, baseType: !96, size: 192, align: 64, offset: 7104)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !130, line: 13, baseType: !96, size: 192, align: 64, offset: 7296)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !130, line: 13, baseType: !40, size: 192, align: 64, offset: 7488)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !130, line: 13, baseType: !40, size: 192, align: 64, offset: 7680)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !130, line: 13, baseType: !40, size: 192, align: 64, offset: 7872)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !130, line: 13, baseType: !40, size: 192, align: 64, offset: 8064)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !130, line: 13, baseType: !370, size: 192, align: 64, offset: 8256)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !41, size: 192, align: 8, elements: !371)
!371 = !{!372, !45, !46}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !7, line: 6, size: 192, align: 8, elements: !375)
!375 = !{!376, !377, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !7, line: 1, baseType: !12, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !7, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !7, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !130, line: 13, baseType: !380, size: 192, align: 64, offset: 8448)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !41, size: 192, align: 8, elements: !381)
!381 = !{!382, !45, !46}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !130, line: 13, size: 1024, align: 8, elements: !386)
!386 = !{!387, !388, !389, !396, !397, !398, !399, !400, !401}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !130, line: 13, baseType: !8, size: 128, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !130, line: 13, baseType: !8, size: 128, align: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !130, line: 13, baseType: !390, size: 64, align: 64, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !130, line: 13, size: 320, align: 8, elements: !392)
!392 = !{!393, !394, !395}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !130, line: 13, baseType: !8, size: 128, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !130, line: 13, baseType: !8, size: 128, align: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !130, line: 13, baseType: !8, size: 128, align: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !130, line: 13, baseType: !8, size: 128, align: 64, offset: 448)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !130, line: 13, baseType: !8, size: 128, align: 64, offset: 576)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 704)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !130, line: 13, baseType: !8, size: 128, align: 64, offset: 768)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !130, line: 13, baseType: !8, size: 128, align: 64, offset: 896)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 8640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !130, line: 13, baseType: !40, size: 192, align: 64, offset: 8704)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !130, line: 13, baseType: !40, size: 192, align: 64, offset: 8896)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !130, line: 13, baseType: !406, size: 192, align: 64, offset: 9088)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !41, size: 192, align: 8, elements: !407)
!407 = !{!408, !45, !46}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !7, line: 6, size: 384, align: 8, elements: !412)
!412 = !{!413, !414}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !7, line: 6, baseType: !374, size: 192, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !7, line: 6, baseType: !415, size: 192, align: 64, offset: 192)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !7, line: 6, size: 192, align: 8, elements: !375)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !130, line: 13, baseType: !406, size: 192, align: 64, offset: 9280)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !130, line: 13, baseType: !40, size: 192, align: 64, offset: 9472)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !130, line: 13, baseType: !40, size: 192, align: 64, offset: 9664)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !130, line: 13, baseType: !40, size: 192, align: 64, offset: 9856)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !130, line: 13, baseType: !40, size: 192, align: 64, offset: 10048)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !130, line: 13, baseType: !40, size: 192, align: 64, offset: 10240)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !130, line: 13, baseType: !348, size: 192, align: 64, offset: 10432)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "NameToCertificate", file: !130, line: 13, baseType: !424, size: 64, align: 64, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !9, line: 1, size: 384, align: 8, elements: !426)
!426 = !{!427, !428, !429, !430, !432, !433, !434, !435, !436}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !9, line: 1, baseType: !15, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !9, line: 1, baseType: !13, size: 8, align: 8, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !9, line: 1, baseType: !13, size: 8, align: 8, offset: 72)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !9, line: 1, baseType: !431, size: 16, align: 16, offset: 80)
!431 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !9, line: 1, baseType: !65, size: 32, align: 32, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !9, line: 1, baseType: !166, size: 64, align: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !9, line: 1, baseType: !166, size: 64, align: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !9, line: 1, baseType: !72, size: 64, align: 64, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !9, line: 1, baseType: !166, size: 64, align: 64, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "GetCertificate", file: !130, line: 13, baseType: !438, size: 64, align: 64, offset: 448)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !130, line: 13, size: 64, align: 8, elements: !440)
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !130, line: 13, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!445, !449}
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,error}", file: !41, size: 192, align: 8, elements: !446)
!446 = !{!447, !448}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !41, line: 13, baseType: !260, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !41, line: 13, baseType: !202, size: 128, align: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientHelloInfo", file: !130, line: 13, size: 1408, align: 8, elements: !451)
!451 = !{!452, !457, !458, !464, !465, !471, !472, !473}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuites", file: !130, line: 13, baseType: !453, size: 192, align: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint16,int,int}", file: !41, size: 192, align: 8, elements: !454)
!454 = !{!455, !45, !46}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !456, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !130, line: 13, baseType: !8, size: 128, align: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedCurves", file: !130, line: 13, baseType: !459, size: 192, align: 64, offset: 320)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*CurveID,int,int}", file: !41, size: 192, align: 8, elements: !460)
!460 = !{!461, !45, !46}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIBasicType(name: "CurveID", size: 16, encoding: DW_ATE_unsigned)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedPoints", file: !130, line: 13, baseType: !96, size: 192, align: 64, offset: 512)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureSchemes", file: !130, line: 13, baseType: !466, size: 192, align: 64, offset: 704)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*SignatureScheme,int,int}", file: !41, size: 192, align: 8, elements: !467)
!467 = !{!468, !45, !46}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIBasicType(name: "SignatureScheme", size: 16, encoding: DW_ATE_unsigned)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedProtos", file: !130, line: 13, baseType: !40, size: 192, align: 64, offset: 896)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedVersions", file: !130, line: 13, baseType: !453, size: 192, align: 64, offset: 1088)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Conn", file: !130, line: 13, baseType: !474, size: 128, align: 64, offset: 1280)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !7, line: 6, size: 128, align: 8, elements: !475)
!475 = !{!476, !214}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 6, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)Addr,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void)Addr,*func(*void,Time)error,*func(*void,Time)error,*func(*void,Time)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !41, size: 576, align: 8, elements: !479)
!479 = !{!480, !481, !485, !497, !505, !506, !510, !511, !512}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !41, line: 6, baseType: !149, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !41, line: 6, baseType: !482, size: 64, align: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!202, !166}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "LocalAddr", file: !41, line: 6, baseType: !486, size: 64, align: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!489, !166}
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "Addr", file: !7, line: 6, size: 128, align: 8, elements: !490)
!490 = !{!491, !214}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 6, baseType: !492, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)string}", file: !41, size: 192, align: 8, elements: !494)
!494 = !{!480, !495, !496}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "Network", file: !41, line: 6, baseType: !210, size: 64, align: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !41, line: 6, baseType: !210, size: 64, align: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !41, line: 6, baseType: !498, size: 64, align: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!501, !166, !96}
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !41, size: 192, align: 8, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !41, line: 6, baseType: !15, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !41, line: 6, baseType: !202, size: 128, align: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !41, line: 6, baseType: !486, size: 64, align: 64, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "SetDeadline", file: !41, line: 6, baseType: !507, size: 64, align: 64, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!202, !166, !223}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "SetReadDeadline", file: !41, line: 6, baseType: !507, size: 64, align: 64, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "SetWriteDeadline", file: !41, line: 6, baseType: !507, size: 64, align: 64, offset: 448)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !41, line: 6, baseType: !498, size: 64, align: 64, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "GetClientCertificate", file: !130, line: 13, baseType: !514, size: 64, align: 64, offset: 512)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !130, line: 13, size: 64, align: 8, elements: !516)
!516 = !{!517}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !130, line: 13, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!445, !521}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertificateRequestInfo", file: !130, line: 13, size: 384, align: 8, elements: !523)
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptableCAs", file: !130, line: 13, baseType: !264, size: 192, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureSchemes", file: !130, line: 13, baseType: !466, size: 192, align: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "GetConfigForClient", file: !130, line: 13, baseType: !527, size: 64, align: 64, offset: 576)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !130, line: 13, size: 64, align: 8, elements: !529)
!529 = !{!530}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !130, line: 13, baseType: !531, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!534, !449}
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Config,error}", file: !41, size: 192, align: 8, elements: !535)
!535 = !{!536, !448}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !41, line: 13, baseType: !166, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "VerifyPeerCertificate", file: !130, line: 13, baseType: !538, size: 64, align: 64, offset: 640)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !130, line: 13, size: 64, align: 8, elements: !540)
!540 = !{!541}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !130, line: 13, baseType: !542, size: 64, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!202, !264, !545}
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !41, size: 192, align: 8, elements: !546)
!546 = !{!547, !45, !46}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !548, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !41, size: 192, align: 8, elements: !550)
!550 = !{!551, !45, !46}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "RootCAs", file: !130, line: 13, baseType: !554, size: 64, align: 64, offset: 704)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertPool", file: !130, line: 13, size: 320, align: 8, elements: !556)
!556 = !{!557, !558, !559}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "bySubjectKeyId", file: !130, line: 13, baseType: !424, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "byName", file: !130, line: 13, baseType: !424, size: 64, align: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "certs", file: !130, line: 13, baseType: !549, size: 192, align: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "NextProtos", file: !130, line: 13, baseType: !40, size: 192, align: 64, offset: 768)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !130, line: 13, baseType: !8, size: 128, align: 64, offset: 960)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAuth", file: !130, line: 13, baseType: !563, size: 64, align: 64, offset: 1088)
!563 = !DIBasicType(name: "ClientAuthType", size: 64, encoding: DW_ATE_signed)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ClientCAs", file: !130, line: 13, baseType: !554, size: 64, align: 64, offset: 1152)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "InsecureSkipVerify", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 1216)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuites", file: !130, line: 13, baseType: !453, size: 192, align: 64, offset: 1280)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "PreferServerCipherSuites", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 1472)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "SessionTicketsDisabled", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 1480)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "SessionTicketKey", file: !130, line: 13, baseType: !570, size: 256, align: 8, offset: 1488)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 256, align: 1, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ClientSessionCache", file: !130, line: 13, baseType: !574, size: 128, align: 64, offset: 1792)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientSessionCache", file: !130, line: 13, size: 128, align: 8, elements: !575)
!575 = !{!576, !272}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !130, line: 13, baseType: !577, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)struct{*ClientSessionState,bool},*func(*void,string,*ClientSessionState)void}", file: !41, size: 192, align: 8, elements: !579)
!579 = !{!580, !581, !598}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !41, line: 13, baseType: !149, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !41, line: 13, baseType: !582, size: 64, align: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!585, !166, !8}
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ClientSessionState,bool}", file: !41, size: 128, align: 8, elements: !586)
!586 = !{!587, !597}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "session", file: !41, line: 13, baseType: !588, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientSessionState", file: !130, line: 13, size: 832, align: 8, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "sessionTicket", file: !130, line: 13, baseType: !96, size: 192, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "vers", file: !130, line: 13, baseType: !431, size: 16, align: 16, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "cipherSuite", file: !130, line: 13, baseType: !431, size: 16, align: 16, offset: 208)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "masterSecret", file: !130, line: 13, baseType: !96, size: 192, align: 64, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "serverCertificates", file: !130, line: 13, baseType: !549, size: 192, align: 64, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "verifiedChains", file: !130, line: 13, baseType: !545, size: 192, align: 64, offset: 640)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !41, line: 13, baseType: !86, size: 8, align: 8, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Put", file: !41, line: 13, baseType: !599, size: 64, align: 64, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!113, !166, !8, !588}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "MinVersion", file: !130, line: 13, baseType: !431, size: 16, align: 16, offset: 1920)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "MaxVersion", file: !130, line: 13, baseType: !431, size: 16, align: 16, offset: 1936)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "CurvePreferences", file: !130, line: 13, baseType: !459, size: 192, align: 64, offset: 1984)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "DynamicRecordSizingDisabled", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 2176)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "Renegotiation", file: !130, line: 13, baseType: !607, size: 64, align: 64, offset: 2240)
!607 = !DIBasicType(name: "RenegotiationSupport", size: 64, encoding: DW_ATE_signed)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "KeyLogWriter", file: !130, line: 13, baseType: !609, size: 128, align: 64, offset: 2304)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !7, line: 4, size: 128, align: 8, elements: !610)
!610 = !{!611, !214}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 4, baseType: !612, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !41, size: 128, align: 8, elements: !614)
!614 = !{!615, !616}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !41, line: 4, baseType: !149, size: 64, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !41, line: 4, baseType: !617, size: 64, align: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!620, !166, !96}
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !41, size: 192, align: 8, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !41, line: 4, baseType: !15, size: 64, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !41, line: 4, baseType: !202, size: 128, align: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "serverInitOnce", file: !130, line: 13, baseType: !625, size: 96, align: 32, offset: 2432)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once", file: !7, line: 6, size: 96, align: 8, elements: !626)
!626 = !{!627, !633}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !7, line: 6, baseType: !628, size: 64, align: 32)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 6, size: 64, align: 8, elements: !629)
!629 = !{!630, !632}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 6, baseType: !631, size: 32, align: 32)
!631 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 6, baseType: !65, size: 32, align: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "done", file: !7, line: 6, baseType: !65, size: 32, align: 32, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !130, line: 13, baseType: !635, size: 192, align: 32, offset: 2528)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !7, line: 7, size: 192, align: 8, elements: !636)
!636 = !{!637, !638, !639, !640, !641}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !7, line: 7, baseType: !628, size: 64, align: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !7, line: 7, baseType: !65, size: 32, align: 32, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !7, line: 7, baseType: !65, size: 32, align: 32, offset: 96)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !7, line: 7, baseType: !631, size: 32, align: 32, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !7, line: 7, baseType: !631, size: 32, align: 32, offset: 160)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "sessionTicketKeys", file: !130, line: 13, baseType: !643, size: 192, align: 64, offset: 2752)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.crypto/tls.ticketKey,int,int}", file: !41, size: 192, align: 8, elements: !644)
!644 = !{!645, !45, !46}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !646, size: 64, align: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: ".crypto/tls.ticketKey", file: !130, line: 13, size: 384, align: 8, elements: !648)
!648 = !{!649, !653, !654}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "keyName", file: !130, line: 13, baseType: !650, size: 128, align: 8)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 128, align: 1, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 16)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "aesKey", file: !130, line: 13, baseType: !650, size: 128, align: 8, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "hmacKey", file: !130, line: 13, baseType: !650, size: 128, align: 8, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "tlsListener", file: !130, line: 13, baseType: !656, size: 128, align: 64, offset: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "Listener", file: !7, line: 6, size: 128, align: 8, elements: !657)
!657 = !{!658, !214}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 6, baseType: !659, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Conn,error},*func(*void)Addr,*func(*void)error}", file: !41, size: 256, align: 8, elements: !661)
!661 = !{!480, !662, !670, !671}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Accept", file: !41, line: 6, baseType: !663, size: 64, align: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!666, !166}
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Conn,error}", file: !41, size: 256, align: 8, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !41, line: 6, baseType: !474, size: 128, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !41, line: 6, baseType: !202, size: 128, align: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", file: !41, line: 6, baseType: !486, size: 64, align: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !41, line: 6, baseType: !482, size: 64, align: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "localAddr", file: !130, line: 13, baseType: !374, size: 192, align: 64, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "localNetMask", file: !130, line: 13, baseType: !410, size: 64, align: 64, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "isShuttingDown", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 448)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "clientIDByAddress", file: !130, line: 13, baseType: !424, size: 64, align: 64, offset: 512)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "clients", file: !130, line: 13, baseType: !424, size: 64, align: 64, offset: 576)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "clientsLock", file: !130, line: 13, baseType: !628, size: 64, align: 32, offset: 640)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "lastClientID", file: !130, line: 13, baseType: !15, size: 64, align: 64, offset: 704)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "inboundIPPkts", file: !130, line: 13, baseType: !680, size: 64, align: 64, offset: 768)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !9, line: 1, align: 8, elements: !3)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "inboundDevPkts", file: !130, line: 13, baseType: !680, size: 64, align: 64, offset: 832)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "outboundDevPkts", file: !130, line: 13, baseType: !680, size: 64, align: 64, offset: 896)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "intf", file: !130, line: 13, baseType: !685, size: 64, align: 64, offset: 960)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interface", file: !130, line: 13, size: 320, align: 8, elements: !687)
!687 = !{!688, !689, !699}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "isTAP", file: !130, line: 13, baseType: !86, size: 8, align: 8)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ReadWriteCloser", file: !130, line: 13, baseType: !690, size: 128, align: 64, offset: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteCloser", file: !130, line: 13, size: 128, align: 8, elements: !691)
!691 = !{!692, !272}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !130, line: 13, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !41, size: 256, align: 8, elements: !695)
!695 = !{!580, !696, !697, !698}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !41, line: 13, baseType: !482, size: 64, align: 64, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !41, line: 13, baseType: !195, size: 64, align: 64, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !41, line: 13, baseType: !617, size: 64, align: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !130, line: 13, baseType: !8, size: 128, align: 64, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "reverser", file: !130, line: 13, baseType: !701, size: 448, align: 64, offset: 1024)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reverser", file: !130, line: 13, size: 448, align: 8, elements: !702)
!702 = !{!703, !713, !714, !715}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "RouteDeletions", file: !130, line: 13, baseType: !704, size: 192, align: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.github.com/twitchyliquid64/subnet/subnet.routeEntries,int,int}", file: !41, size: 192, align: 8, elements: !705)
!705 = !{!706, !45, !46}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !707, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: ".github.com/twitchyliquid64/subnet/subnet.routeEntries", file: !130, line: 13, size: 512, align: 8, elements: !709)
!709 = !{!710, !711, !712}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "dest", file: !130, line: 13, baseType: !374, size: 192, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "via", file: !130, line: 13, baseType: !374, size: 192, align: 64, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "dev", file: !130, line: 13, baseType: !8, size: 128, align: 64, offset: 384)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "updateGateway", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "newGW", file: !130, line: 13, baseType: !8, size: 128, align: 64, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "interfaceToClose", file: !130, line: 13, baseType: !685, size: 64, align: 64, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "wg", file: !130, line: 13, baseType: !717, size: 128, align: 32, offset: 1472)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "WaitGroup", file: !130, line: 13, size: 128, align: 8, elements: !718)
!718 = !{!719, !721, !725}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "noCopy", file: !130, line: 13, baseType: !720, align: 8)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: ".sync.noCopy", file: !130, line: 13, align: 8, elements: !3)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "state1", file: !130, line: 13, baseType: !722, size: 96, align: 8)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 96, align: 1, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 12)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !130, line: 13, baseType: !65, size: 32, align: 32, offset: 96)
!726 = !DILocation(line: 41, column: 3, scope: !133)
!727 = !DILocalVariable(name: "c", scope: !728, file: !130, line: 34, type: !729)
!728 = distinct !DILexicalBlock(scope: !133, file: !130, line: 28, column: 3)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "Client", file: !130, line: 13, size: 2304, align: 8, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !862, !863, !864, !865}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "debugMessages", file: !130, line: 13, baseType: !86, size: 8, align: 8)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "newGateway", file: !130, line: 13, baseType: !8, size: 128, align: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "serverAddr", file: !130, line: 13, baseType: !8, size: 128, align: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "port", file: !130, line: 13, baseType: !8, size: 128, align: 64, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "wg", file: !130, line: 13, baseType: !717, size: 128, align: 32, offset: 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "serverIP", file: !130, line: 13, baseType: !374, size: 192, align: 64, offset: 576)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "localAddr", file: !130, line: 13, baseType: !374, size: 192, align: 64, offset: 768)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "additionalAddrs", file: !130, line: 13, baseType: !370, size: 192, align: 64, offset: 960)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "localNetMask", file: !130, line: 13, baseType: !410, size: 64, align: 64, offset: 1152)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "isShuttingDown", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 1216)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "packetsIn", file: !130, line: 13, baseType: !680, size: 64, align: 64, offset: 1280)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "packetsDevOut", file: !130, line: 13, baseType: !680, size: 64, align: 64, offset: 1344)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "intf", file: !130, line: 13, baseType: !685, size: 64, align: 64, offset: 1408)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "tlsConf", file: !130, line: 13, baseType: !138, size: 64, align: 64, offset: 1472)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "tlsConn", file: !130, line: 13, baseType: !747, size: 64, align: 64, offset: 1536)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !130, line: 13, size: 6720, align: 8, elements: !749)
!749 = !{!750, !751, !752, !753, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !842, !843, !844, !845, !855, !856, !857, !858, !859, !860, !861}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "conn", file: !130, line: 13, baseType: !474, size: 128, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "isClient", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "handshakeMutex", file: !130, line: 13, baseType: !628, size: 64, align: 32, offset: 160)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "handshakeCond", file: !130, line: 13, baseType: !754, size: 64, align: 64, offset: 256)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cond", file: !130, line: 13, size: 448, align: 8, elements: !756)
!756 = !{!719, !757, !770, !778}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "L", file: !130, line: 13, baseType: !758, size: 128, align: 64)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "Locker", file: !7, line: 7, size: 128, align: 8, elements: !759)
!759 = !{!760, !214}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 7, baseType: !761, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void}", file: !41, size: 192, align: 8, elements: !763)
!763 = !{!764, !765, !769}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !41, line: 7, baseType: !149, size: 64, align: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", file: !41, line: 7, baseType: !766, size: 64, align: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!113, !166}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "Unlock", file: !41, line: 7, baseType: !766, size: 64, align: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "notify", file: !130, line: 13, baseType: !771, size: 256, align: 64, offset: 128)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: ".sync.notifyList", file: !130, line: 13, size: 256, align: 8, elements: !772)
!772 = !{!773, !774, !775, !776, !777}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "wait", file: !130, line: 13, baseType: !65, size: 32, align: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "notify", file: !130, line: 13, baseType: !65, size: 32, align: 32, offset: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !130, line: 13, baseType: !72, size: 64, align: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !130, line: 13, baseType: !166, size: 64, align: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !130, line: 13, baseType: !166, size: 64, align: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "checker", file: !130, line: 13, baseType: !779, size: 64, align: 64, offset: 384)
!779 = !DIBasicType(name: ".sync.copyChecker", size: 64, encoding: DW_ATE_unsigned)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "handshakeErr", file: !130, line: 13, baseType: !202, size: 128, align: 64, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "vers", file: !130, line: 13, baseType: !431, size: 16, align: 16, offset: 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "haveVers", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 464)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "config", file: !130, line: 13, baseType: !138, size: 64, align: 64, offset: 512)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "handshakeComplete", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 576)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "handshakes", file: !130, line: 13, baseType: !15, size: 64, align: 64, offset: 640)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "didResume", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 704)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "cipherSuite", file: !130, line: 13, baseType: !431, size: 16, align: 16, offset: 720)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ocspResponse", file: !130, line: 13, baseType: !96, size: 192, align: 64, offset: 768)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "scts", file: !130, line: 13, baseType: !264, size: 192, align: 64, offset: 960)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "peerCertificates", file: !130, line: 13, baseType: !549, size: 192, align: 64, offset: 1152)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "verifiedChains", file: !130, line: 13, baseType: !545, size: 192, align: 64, offset: 1344)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "serverName", file: !130, line: 13, baseType: !8, size: 128, align: 64, offset: 1536)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "secureRenegotiation", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 1664)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "clientFinishedIsFirst", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 1672)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "closeNotifyErr", file: !130, line: 13, baseType: !202, size: 128, align: 64, offset: 1728)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "closeNotifySent", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 1856)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "clientFinished", file: !130, line: 13, baseType: !722, size: 96, align: 8, offset: 1864)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "serverFinished", file: !130, line: 13, baseType: !722, size: 96, align: 8, offset: 1960)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "clientProtocol", file: !130, line: 13, baseType: !8, size: 128, align: 64, offset: 2112)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "clientProtocolFallback", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 2240)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "in", file: !130, line: 13, baseType: !802, size: 1408, align: 64, offset: 2304)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: ".crypto/tls.halfConn", file: !130, line: 13, size: 1408, align: 8, elements: !803)
!803 = !{!804, !805, !806, !807, !808, !823, !827, !834, !838, !839, !840, !841}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "Mutex", file: !130, line: 13, baseType: !628, size: 64, align: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !130, line: 13, baseType: !202, size: 128, align: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "version", file: !130, line: 13, baseType: !431, size: 16, align: 16, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", file: !130, line: 13, baseType: !290, size: 128, align: 64, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "mac", file: !130, line: 13, baseType: !809, size: 128, align: 64, offset: 384)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: ".crypto/tls.macFunction", file: !130, line: 13, size: 128, align: 8, elements: !810)
!810 = !{!811, !272}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !130, line: 13, baseType: !812, size: 64, align: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int},struct{*uint8,int,int},struct{*uint8,int,int},struct{*uint8,int,int},struct{*uint8,int,int})struct{*uint8,int,int},*func(*void)int}", file: !41, size: 192, align: 8, elements: !814)
!814 = !{!580, !815, !819}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "MAC", file: !41, line: 13, baseType: !816, size: 64, align: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!96, !166, !96, !96, !96, !96, !96}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !41, line: 13, baseType: !820, size: 64, align: 64, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!15, !166}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !130, line: 13, baseType: !824, size: 64, align: 8, offset: 512)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, align: 1, elements: !825)
!825 = !{!826}
!826 = !DISubrange(count: 8)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "bfree", file: !130, line: 13, baseType: !828, size: 64, align: 64, offset: 576)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: ".crypto/tls.block", file: !130, line: 13, size: 320, align: 8, elements: !830)
!830 = !{!831, !832, !833}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "data", file: !130, line: 13, baseType: !96, size: 192, align: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "off", file: !130, line: 13, baseType: !15, size: 64, align: 64, offset: 192)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !130, line: 13, baseType: !166, size: 64, align: 64, offset: 256)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "additionalData", file: !130, line: 13, baseType: !835, size: 104, align: 8, offset: 640)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 104, align: 1, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 13)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "nextCipher", file: !130, line: 13, baseType: !290, size: 128, align: 64, offset: 768)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "nextMac", file: !130, line: 13, baseType: !809, size: 128, align: 64, offset: 896)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "inDigestBuf", file: !130, line: 13, baseType: !96, size: 192, align: 64, offset: 1024)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "outDigestBuf", file: !130, line: 13, baseType: !96, size: 192, align: 64, offset: 1216)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "out", file: !130, line: 13, baseType: !802, size: 1408, align: 64, offset: 3712)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "rawInput", file: !130, line: 13, baseType: !828, size: 64, align: 64, offset: 5120)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "input", file: !130, line: 13, baseType: !828, size: 64, align: 64, offset: 5184)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "hand", file: !130, line: 13, baseType: !846, size: 832, align: 64, offset: 5248)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", file: !130, line: 13, size: 832, align: 8, elements: !847)
!847 = !{!848, !832, !849, !853}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !130, line: 13, baseType: !96, size: 192, align: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "bootstrap", file: !130, line: 13, baseType: !850, size: 512, align: 8, offset: 256)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 512, align: 1, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "lastRead", file: !130, line: 13, baseType: !854, size: 8, align: 8, offset: 768)
!854 = !DIBasicType(name: ".bytes.readOp", size: 8, encoding: DW_ATE_signed)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "buffering", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 6080)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "sendBuf", file: !130, line: 13, baseType: !96, size: 192, align: 64, offset: 6144)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "bytesSent", file: !130, line: 13, baseType: !227, size: 64, align: 64, offset: 6336)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "packetsSent", file: !130, line: 13, baseType: !227, size: 64, align: 64, offset: 6400)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "warnCount", file: !130, line: 13, baseType: !15, size: 64, align: 64, offset: 6464)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "activeCall", file: !130, line: 13, baseType: !631, size: 32, align: 32, offset: 6528)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", file: !130, line: 13, baseType: !650, size: 128, align: 8, offset: 6560)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "tcpConn", file: !130, line: 13, baseType: !474, size: 128, align: 64, offset: 1600)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "connectionOk", file: !130, line: 13, baseType: !86, size: 8, align: 8, offset: 1728)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "connResetLock", file: !130, line: 13, baseType: !628, size: 64, align: 32, offset: 1760)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "reverser", file: !130, line: 13, baseType: !701, size: 448, align: 64, offset: 1856)
!866 = !DILocation(line: 34, column: 3, scope: !133)
!867 = !DILocation(line: 34, column: 7, scope: !868, inlinedAt: !869)
!868 = distinct !DISubprogram(name: "main.parseFlags", scope: null, file: !7, line: 33, type: !111, isLocal: true, isDefinition: true, scopeLine: 33, isOptimized: false, unit: !1, retainedNodes: !3)
!869 = distinct !DILocation(line: 18, column: 2, scope: !133)
!870 = !DILocation(line: 35, column: 7, scope: !868, inlinedAt: !869)
!871 = !DILocation(line: 36, column: 7, scope: !868, inlinedAt: !869)
!872 = !DILocation(line: 37, column: 7, scope: !868, inlinedAt: !869)
!873 = !DILocation(line: 38, column: 7, scope: !868, inlinedAt: !869)
!874 = !DILocation(line: 39, column: 7, scope: !868, inlinedAt: !869)
!875 = !DILocation(line: 40, column: 7, scope: !868, inlinedAt: !869)
!876 = !DILocation(line: 41, column: 7, scope: !868, inlinedAt: !869)
!877 = !DILocation(line: 42, column: 7, scope: !868, inlinedAt: !869)
!878 = !DILocation(line: 43, column: 7, scope: !868, inlinedAt: !869)
!879 = !DILocation(line: 44, column: 7, scope: !868, inlinedAt: !869)
!880 = !DILocation(line: 46, column: 13, scope: !868, inlinedAt: !869)
!881 = !DILocation(line: 47, column: 7, scope: !868, inlinedAt: !869)
!882 = !DILocation(line: 49, column: 13, scope: !868, inlinedAt: !869)
!883 = !DILocation(line: 49, column: 47, scope: !868, inlinedAt: !869)
!884 = !DILocation(line: 49, column: 80, scope: !868, inlinedAt: !869)
!885 = !DILocation(line: 49, column: 108, scope: !868, inlinedAt: !869)
!886 = !DILocation(line: 49, column: 115, scope: !868, inlinedAt: !869)
!887 = !DILocation(line: 50, column: 3, scope: !868, inlinedAt: !869)
!888 = !DILocation(line: 51, column: 6, scope: !868, inlinedAt: !869)
!889 = !DILocation(line: 54, column: 13, scope: !868, inlinedAt: !869)
!890 = !DILocation(line: 55, column: 21, scope: !868, inlinedAt: !869)
!891 = !DILocation(line: 62, column: 13, scope: !868, inlinedAt: !869)
!892 = !DILocation(line: 55, column: 44, scope: !868, inlinedAt: !869)
!893 = !DILocation(line: 56, column: 19, scope: !868, inlinedAt: !869)
!894 = !DILocation(line: 56, column: 8, scope: !868, inlinedAt: !869)
!895 = !DILocation(line: 57, column: 9, scope: !868, inlinedAt: !869)
!896 = !DILocation(line: 58, column: 7, scope: !868, inlinedAt: !869)
!897 = !DILocation(line: 63, column: 21, scope: !868, inlinedAt: !869)
!898 = !DILocation(line: 75, column: 13, scope: !868, inlinedAt: !869)
!899 = !DILocation(line: 63, column: 44, scope: !868, inlinedAt: !869)
!900 = !DILocation(line: 64, column: 19, scope: !868, inlinedAt: !869)
!901 = !DILocation(line: 64, column: 8, scope: !868, inlinedAt: !869)
!902 = !DILocation(line: 65, column: 9, scope: !868, inlinedAt: !869)
!903 = !DILocation(line: 66, column: 7, scope: !868, inlinedAt: !869)
!904 = !DILocation(line: 68, column: 20, scope: !868, inlinedAt: !869)
!905 = !DILocation(line: 68, column: 42, scope: !868, inlinedAt: !869)
!906 = !DILocation(line: 69, column: 19, scope: !868, inlinedAt: !869)
!907 = !DILocation(line: 69, column: 8, scope: !868, inlinedAt: !869)
!908 = !DILocation(line: 70, column: 9, scope: !868, inlinedAt: !869)
!909 = !DILocation(line: 71, column: 7, scope: !868, inlinedAt: !869)
!910 = !DILocation(line: 76, column: 20, scope: !868, inlinedAt: !869)
!911 = !DILocation(line: 87, column: 13, scope: !868, inlinedAt: !869)
!912 = !DILocation(line: 76, column: 42, scope: !868, inlinedAt: !869)
!913 = !DILocation(line: 77, column: 19, scope: !868, inlinedAt: !869)
!914 = !DILocation(line: 77, column: 8, scope: !868, inlinedAt: !869)
!915 = !DILocation(line: 78, column: 9, scope: !868, inlinedAt: !869)
!916 = !DILocation(line: 79, column: 7, scope: !868, inlinedAt: !869)
!917 = !DILocation(line: 81, column: 11, scope: !868, inlinedAt: !869)
!918 = !DILocation(line: 81, column: 18, scope: !868, inlinedAt: !869)
