; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22conn\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22tls\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/tls\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/tls\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22x509\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/x509\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/x509\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22pem\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/pem\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/pem\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22errors\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./pkt.go", directory: "/home/wangcong/go_path/src/github.com/twitchyliquid64/subnet/subnet/conn")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "conn.TLSConfig", linkageName: "command_line_arguments.TLSConfig", scope: null, file: !10, line: 19, type: !11, isLocal: false, isDefinition: true, scopeLine: 19, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DIFile(filename: "tls.go", directory: ".")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !62, !62, !62}
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Config,error}", file: !14, size: 192, align: 8, elements: !15)
!14 = !DIFile(filename: "", directory: "")
!15 = !{!16, !344}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 4, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !10, line: 4, size: 2944, align: 8, elements: !19)
!19 = !{!20, !110, !152, !319, !333, !401, !414, !422, !438, !445, !446, !447, !449, !450, !451, !452, !453, !454, !458, !486, !487, !488, !489, !490, !492, !500, !510, !518}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Rand", file: !10, line: 4, baseType: !21, size: 128, align: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !10, line: 4, size: 128, align: 8, elements: !22)
!22 = !{!23, !109}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !14, size: 128, align: 8, elements: !26)
!26 = !{!27, !86}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 4, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !30)
!30 = !{!31, !33, !34, !35, !37, !38, !39, !49, !58, !60, !67, !85}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !32, size: 64, align: 64)
!32 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !32, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !36, size: 8, align: 8, offset: 160)
!36 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !36, size: 8, align: 8, offset: 168)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !36, size: 8, align: 8, offset: 176)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !42)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!32, !47, !32}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIBasicType(name: "void")
!49 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !50, size: 64, align: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !52)
!52 = !{!53}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !47, !47}
!57 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !59, size: 64, align: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !61, size: 64, align: 64, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !63)
!63 = !{!64, !65}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !59, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !66, size: 64, align: 64, offset: 64)
!66 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !68, size: 64, align: 64, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !70)
!70 = !{!71, !72, !73}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !61, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !61, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !74, size: 192, align: 64, offset: 128)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !14, size: 192, align: 8, elements: !75)
!75 = !{!76, !83, !84}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !79)
!79 = !{!71, !72, !80, !81, !82}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !47, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !47, size: 64, align: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !47, size: 64, align: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !14, line: 1, baseType: !66, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !14, line: 1, baseType: !66, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !47, size: 64, align: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !14, line: 4, baseType: !87, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !47, !106}
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !14, size: 192, align: 8, elements: !91)
!91 = !{!92, !93}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !14, line: 4, baseType: !66, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !14, line: 4, baseType: !94, size: 128, align: 64, offset: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !95)
!95 = !{!96, !105}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !14, size: 128, align: 8, elements: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 1, baseType: !28, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !14, line: 1, baseType: !102, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!62, !47}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !47, size: 64, align: 64, offset: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !14, size: 192, align: 8, elements: !107)
!107 = !{!108, !83, !84}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !59, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !47, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Time", file: !10, line: 4, baseType: !111, size: 64, align: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 4, size: 64, align: 8, elements: !113)
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 4, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!118}
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !10, line: 4, size: 192, align: 8, elements: !119)
!119 = !{!120, !122, !124}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !10, line: 4, baseType: !121, size: 64, align: 64)
!121 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !10, line: 4, baseType: !123, size: 64, align: 64, offset: 64)
!123 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !10, line: 4, baseType: !125, size: 64, align: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !10, line: 4, size: 704, align: 8, elements: !127)
!127 = !{!128, !129, !138, !149, !150, !151}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !10, line: 4, baseType: !62, size: 128, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !10, line: 4, baseType: !130, size: 192, align: 64, offset: 128)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !14, size: 192, align: 8, elements: !131)
!131 = !{!132, !83, !84}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !10, line: 4, size: 256, align: 8, elements: !135)
!135 = !{!128, !136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !10, line: 4, baseType: !66, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !10, line: 4, baseType: !57, size: 8, align: 8, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !10, line: 4, baseType: !139, size: 192, align: 64, offset: 320)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !14, size: 192, align: 8, elements: !140)
!140 = !{!141, !83, !84}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !10, line: 4, size: 128, align: 8, elements: !144)
!144 = !{!145, !146, !147, !148}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !10, line: 4, baseType: !123, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !10, line: 4, baseType: !36, size: 8, align: 8, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !10, line: 4, baseType: !57, size: 8, align: 8, offset: 72)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !10, line: 4, baseType: !57, size: 8, align: 8, offset: 80)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !10, line: 4, baseType: !123, size: 64, align: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !10, line: 4, baseType: !123, size: 64, align: 64, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !10, line: 4, baseType: !133, size: 64, align: 64, offset: 640)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Certificates", file: !10, line: 4, baseType: !153, size: 192, align: 64, offset: 192)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,int,int}", file: !14, size: 192, align: 8, elements: !154)
!154 = !{!155, !83, !84}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !10, line: 4, size: 768, align: 8, elements: !158)
!158 = !{!159, !164, !168, !169, !170}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Certificate", file: !10, line: 4, baseType: !160, size: 192, align: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !14, size: 192, align: 8, elements: !161)
!161 = !{!162, !83, !84}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "PrivateKey", file: !10, line: 4, baseType: !165, size: 128, align: 64, offset: 192)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !10, line: 4, size: 128, align: 8, elements: !166)
!166 = !{!167, !109}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 1, baseType: !28, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPStaple", file: !10, line: 4, baseType: !106, size: 192, align: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !10, line: 4, baseType: !160, size: 192, align: 64, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Leaf", file: !10, line: 4, baseType: !171, size: 64, align: 64, offset: 704)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !10, line: 4, size: 10624, align: 8, elements: !173)
!173 = !{!174, !175, !176, !177, !178, !179, !180, !182, !184, !186, !187, !200, !229, !230, !231, !232, !234, !244, !245, !250, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !275, !298, !299, !300, !301, !312, !313, !314, !315, !316, !317, !318}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !10, line: 4, baseType: !106, size: 192, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !10, line: 4, baseType: !106, size: 192, align: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !10, line: 4, baseType: !106, size: 192, align: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !10, line: 4, baseType: !106, size: 192, align: 64, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !10, line: 4, baseType: !106, size: 192, align: 64, offset: 768)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !10, line: 4, baseType: !106, size: 192, align: 64, offset: 960)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !10, line: 4, baseType: !181, size: 64, align: 64, offset: 1152)
!181 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !10, line: 4, baseType: !183, size: 64, align: 64, offset: 1216)
!183 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !10, line: 4, baseType: !185, size: 128, align: 64, offset: 1280)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecrypterOpts", file: !10, line: 5, size: 128, align: 8, elements: !166)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !10, line: 4, baseType: !66, size: 64, align: 64, offset: 1408)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !10, line: 4, baseType: !188, size: 64, align: 64, offset: 1472)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !10, line: 4, size: 256, align: 8, elements: !190)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !10, line: 4, baseType: !57, size: 8, align: 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !10, line: 4, baseType: !193, size: 192, align: 64, offset: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !10, line: 4, size: 192, align: 8, elements: !194)
!194 = !{!195, !198, !199}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !66, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !66, size: 64, align: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !10, line: 4, baseType: !201, size: 1984, align: 64, offset: 1536)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !10, line: 4, size: 1984, align: 8, elements: !202)
!202 = !{!203, !207, !208, !209, !210, !211, !212, !213, !214, !215, !228}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !10, line: 4, baseType: !204, size: 192, align: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !14, size: 192, align: 8, elements: !205)
!205 = !{!206, !83, !84}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !61, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !10, line: 4, baseType: !204, size: 192, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !10, line: 4, baseType: !204, size: 192, align: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !10, line: 4, baseType: !204, size: 192, align: 64, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !10, line: 4, baseType: !204, size: 192, align: 64, offset: 768)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !10, line: 4, baseType: !204, size: 192, align: 64, offset: 960)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !10, line: 4, baseType: !204, size: 192, align: 64, offset: 1152)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !10, line: 4, baseType: !62, size: 128, align: 64, offset: 1344)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !10, line: 4, baseType: !62, size: 128, align: 64, offset: 1472)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !10, line: 4, baseType: !216, size: 192, align: 64, offset: 1600)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !14, size: 192, align: 8, elements: !217)
!217 = !{!218, !83, !84}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !10, line: 4, size: 320, align: 8, elements: !221)
!221 = !{!222, !227}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !10, line: 4, baseType: !223, size: 192, align: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !10, line: 4, size: 192, align: 8, elements: !224)
!224 = !{!225, !198, !199}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !10, line: 4, baseType: !185, size: 128, align: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !10, line: 4, baseType: !216, size: 192, align: 64, offset: 1792)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !10, line: 4, baseType: !201, size: 1984, align: 64, offset: 3520)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !10, line: 4, baseType: !118, size: 192, align: 64, offset: 5504)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !10, line: 4, baseType: !118, size: 192, align: 64, offset: 5696)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !10, line: 4, baseType: !233, size: 64, align: 64, offset: 5888)
!233 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !10, line: 4, baseType: !235, size: 192, align: 64, offset: 5952)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !14, size: 192, align: 8, elements: !236)
!236 = !{!237, !83, !84}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !10, line: 4, size: 448, align: 8, elements: !240)
!240 = !{!241, !242, !243}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !10, line: 4, baseType: !223, size: 192, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !10, line: 4, baseType: !57, size: 8, align: 8, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !10, line: 4, baseType: !106, size: 192, align: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !10, line: 4, baseType: !235, size: 192, align: 64, offset: 6144)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !10, line: 4, baseType: !246, size: 192, align: 64, offset: 6336)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !14, size: 192, align: 8, elements: !247)
!247 = !{!248, !83, !84}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !10, line: 4, baseType: !251, size: 192, align: 64, offset: 6528)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !14, size: 192, align: 8, elements: !252)
!252 = !{!253, !83, !84}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !10, line: 4, baseType: !246, size: 192, align: 64, offset: 6720)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !10, line: 4, baseType: !57, size: 8, align: 8, offset: 6912)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !10, line: 4, baseType: !57, size: 8, align: 8, offset: 6920)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !10, line: 4, baseType: !66, size: 64, align: 64, offset: 6976)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !10, line: 4, baseType: !57, size: 8, align: 8, offset: 7040)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !10, line: 4, baseType: !106, size: 192, align: 64, offset: 7104)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !10, line: 4, baseType: !106, size: 192, align: 64, offset: 7296)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !10, line: 4, baseType: !204, size: 192, align: 64, offset: 7488)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !10, line: 4, baseType: !204, size: 192, align: 64, offset: 7680)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !10, line: 4, baseType: !204, size: 192, align: 64, offset: 7872)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !10, line: 4, baseType: !204, size: 192, align: 64, offset: 8064)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !10, line: 4, baseType: !268, size: 192, align: 64, offset: 8256)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !14, size: 192, align: 8, elements: !269)
!269 = !{!270, !83, !84}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !10, line: 4, size: 192, align: 8, elements: !273)
!273 = !{!274, !198, !199}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !59, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !10, line: 4, baseType: !276, size: 192, align: 64, offset: 8448)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !14, size: 192, align: 8, elements: !277)
!277 = !{!278, !83, !84}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !10, line: 4, size: 1024, align: 8, elements: !282)
!282 = !{!283, !284, !285, !292, !293, !294, !295, !296, !297}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !10, line: 4, baseType: !62, size: 128, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !10, line: 4, baseType: !62, size: 128, align: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !10, line: 4, baseType: !286, size: 64, align: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !10, line: 4, size: 320, align: 8, elements: !288)
!288 = !{!289, !290, !291}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !10, line: 4, baseType: !62, size: 128, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !10, line: 4, baseType: !62, size: 128, align: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !10, line: 4, baseType: !57, size: 8, align: 8, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !10, line: 4, baseType: !62, size: 128, align: 64, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !10, line: 4, baseType: !62, size: 128, align: 64, offset: 448)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !10, line: 4, baseType: !62, size: 128, align: 64, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !10, line: 4, baseType: !57, size: 8, align: 8, offset: 704)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !10, line: 4, baseType: !62, size: 128, align: 64, offset: 768)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !10, line: 4, baseType: !62, size: 128, align: 64, offset: 896)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !10, line: 4, baseType: !57, size: 8, align: 8, offset: 8640)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !10, line: 4, baseType: !204, size: 192, align: 64, offset: 8704)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !10, line: 4, baseType: !204, size: 192, align: 64, offset: 8896)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !10, line: 4, baseType: !302, size: 192, align: 64, offset: 9088)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !14, size: 192, align: 8, elements: !303)
!303 = !{!304, !83, !84}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !10, line: 4, size: 384, align: 8, elements: !308)
!308 = !{!309, !310}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !10, line: 4, baseType: !272, size: 192, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !10, line: 4, baseType: !311, size: 192, align: 64, offset: 192)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !10, line: 4, size: 192, align: 8, elements: !273)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !10, line: 4, baseType: !302, size: 192, align: 64, offset: 9280)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !10, line: 4, baseType: !204, size: 192, align: 64, offset: 9472)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !10, line: 4, baseType: !204, size: 192, align: 64, offset: 9664)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !10, line: 4, baseType: !204, size: 192, align: 64, offset: 9856)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !10, line: 4, baseType: !204, size: 192, align: 64, offset: 10048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !10, line: 4, baseType: !204, size: 192, align: 64, offset: 10240)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !10, line: 4, baseType: !246, size: 192, align: 64, offset: 10432)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "NameToCertificate", file: !10, line: 4, baseType: !320, size: 64, align: 64, offset: 384)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !322)
!322 = !{!323, !324, !325, !326, !328, !329, !330, !331, !332}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !66, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !36, size: 8, align: 8, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !36, size: 8, align: 8, offset: 72)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !327, size: 16, align: 16, offset: 80)
!327 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !47, size: 64, align: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !47, size: 64, align: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !32, size: 64, align: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !47, size: 64, align: 64, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "GetCertificate", file: !10, line: 4, baseType: !334, size: 64, align: 64, offset: 448)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 4, size: 64, align: 8, elements: !336)
!336 = !{!337}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 4, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!341, !345}
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,error}", file: !14, size: 192, align: 8, elements: !342)
!342 = !{!343, !344}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 4, baseType: !156, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 4, baseType: !94, size: 128, align: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientHelloInfo", file: !10, line: 4, size: 1408, align: 8, elements: !347)
!347 = !{!348, !353, !354, !360, !361, !367, !368, !369}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuites", file: !10, line: 4, baseType: !349, size: 192, align: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint16,int,int}", file: !14, size: 192, align: 8, elements: !350)
!350 = !{!351, !83, !84}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !10, line: 4, baseType: !62, size: 128, align: 64, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedCurves", file: !10, line: 4, baseType: !355, size: 192, align: 64, offset: 320)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*CurveID,int,int}", file: !14, size: 192, align: 8, elements: !356)
!356 = !{!357, !83, !84}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIBasicType(name: "CurveID", size: 16, encoding: DW_ATE_unsigned)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedPoints", file: !10, line: 4, baseType: !106, size: 192, align: 64, offset: 512)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureSchemes", file: !10, line: 4, baseType: !362, size: 192, align: 64, offset: 704)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*SignatureScheme,int,int}", file: !14, size: 192, align: 8, elements: !363)
!363 = !{!364, !83, !84}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIBasicType(name: "SignatureScheme", size: 16, encoding: DW_ATE_unsigned)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedProtos", file: !10, line: 4, baseType: !204, size: 192, align: 64, offset: 896)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedVersions", file: !10, line: 4, baseType: !349, size: 192, align: 64, offset: 1088)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Conn", file: !10, line: 4, baseType: !370, size: 128, align: 64, offset: 1280)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !10, line: 4, size: 128, align: 8, elements: !371)
!371 = !{!372, !109}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)Addr,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void)Addr,*func(*void,Time)error,*func(*void,Time)error,*func(*void,Time)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !14, size: 576, align: 8, elements: !375)
!375 = !{!27, !376, !380, !392, !393, !394, !398, !399, !400}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !14, line: 4, baseType: !377, size: 64, align: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!94, !47}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "LocalAddr", file: !14, line: 4, baseType: !381, size: 64, align: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!384, !47}
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "Addr", file: !10, line: 4, size: 128, align: 8, elements: !385)
!385 = !{!386, !109}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)string}", file: !14, size: 192, align: 8, elements: !389)
!389 = !{!27, !390, !391}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Network", file: !14, line: 4, baseType: !102, size: 64, align: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !14, line: 4, baseType: !102, size: 64, align: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !14, line: 4, baseType: !87, size: 64, align: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !14, line: 4, baseType: !381, size: 64, align: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "SetDeadline", file: !14, line: 4, baseType: !395, size: 64, align: 64, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!94, !47, !118}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "SetReadDeadline", file: !14, line: 4, baseType: !395, size: 64, align: 64, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "SetWriteDeadline", file: !14, line: 4, baseType: !395, size: 64, align: 64, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !14, line: 4, baseType: !87, size: 64, align: 64, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "GetClientCertificate", file: !10, line: 4, baseType: !402, size: 64, align: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 4, size: 64, align: 8, elements: !404)
!404 = !{!405}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 4, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!341, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertificateRequestInfo", file: !10, line: 4, size: 384, align: 8, elements: !411)
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptableCAs", file: !10, line: 4, baseType: !160, size: 192, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureSchemes", file: !10, line: 4, baseType: !362, size: 192, align: 64, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "GetConfigForClient", file: !10, line: 4, baseType: !415, size: 64, align: 64, offset: 576)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 4, size: 64, align: 8, elements: !417)
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 4, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!13, !345}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "VerifyPeerCertificate", file: !10, line: 4, baseType: !423, size: 64, align: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 4, size: 64, align: 8, elements: !425)
!425 = !{!426}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 4, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!94, !160, !430}
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !14, size: 192, align: 8, elements: !431)
!431 = !{!432, !83, !84}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !14, size: 192, align: 8, elements: !435)
!435 = !{!436, !83, !84}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "RootCAs", file: !10, line: 4, baseType: !439, size: 64, align: 64, offset: 704)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertPool", file: !10, line: 4, size: 320, align: 8, elements: !441)
!441 = !{!442, !443, !444}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "bySubjectKeyId", file: !10, line: 4, baseType: !320, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "byName", file: !10, line: 4, baseType: !320, size: 64, align: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "certs", file: !10, line: 4, baseType: !434, size: 192, align: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "NextProtos", file: !10, line: 4, baseType: !204, size: 192, align: 64, offset: 768)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !10, line: 4, baseType: !62, size: 128, align: 64, offset: 960)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAuth", file: !10, line: 4, baseType: !448, size: 64, align: 64, offset: 1088)
!448 = !DIBasicType(name: "ClientAuthType", size: 64, encoding: DW_ATE_signed)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ClientCAs", file: !10, line: 4, baseType: !439, size: 64, align: 64, offset: 1152)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "InsecureSkipVerify", file: !10, line: 4, baseType: !57, size: 8, align: 8, offset: 1216)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuites", file: !10, line: 4, baseType: !349, size: 192, align: 64, offset: 1280)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "PreferServerCipherSuites", file: !10, line: 4, baseType: !57, size: 8, align: 8, offset: 1472)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "SessionTicketsDisabled", file: !10, line: 4, baseType: !57, size: 8, align: 8, offset: 1480)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "SessionTicketKey", file: !10, line: 4, baseType: !455, size: 256, align: 8, offset: 1488)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 256, align: 1, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ClientSessionCache", file: !10, line: 4, baseType: !459, size: 128, align: 64, offset: 1792)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientSessionCache", file: !10, line: 4, size: 128, align: 8, elements: !460)
!460 = !{!461, !109}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)struct{*ClientSessionState,bool},*func(*void,string,*ClientSessionState)void}", file: !14, size: 192, align: 8, elements: !464)
!464 = !{!27, !465, !482}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !14, line: 4, baseType: !466, size: 64, align: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!469, !47, !62}
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ClientSessionState,bool}", file: !14, size: 128, align: 8, elements: !470)
!470 = !{!471, !481}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "session", file: !14, line: 4, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientSessionState", file: !10, line: 4, size: 832, align: 8, elements: !474)
!474 = !{!475, !476, !477, !478, !479, !480}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "sessionTicket", file: !10, line: 4, baseType: !106, size: 192, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "vers", file: !10, line: 4, baseType: !327, size: 16, align: 16, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "cipherSuite", file: !10, line: 4, baseType: !327, size: 16, align: 16, offset: 208)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "masterSecret", file: !10, line: 4, baseType: !106, size: 192, align: 64, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "serverCertificates", file: !10, line: 4, baseType: !434, size: 192, align: 64, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "verifiedChains", file: !10, line: 4, baseType: !430, size: 192, align: 64, offset: 640)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !14, line: 4, baseType: !57, size: 8, align: 8, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "Put", file: !14, line: 4, baseType: !483, size: 64, align: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!48, !47, !62, !472}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "MinVersion", file: !10, line: 4, baseType: !327, size: 16, align: 16, offset: 1920)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "MaxVersion", file: !10, line: 4, baseType: !327, size: 16, align: 16, offset: 1936)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "CurvePreferences", file: !10, line: 4, baseType: !355, size: 192, align: 64, offset: 1984)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "DynamicRecordSizingDisabled", file: !10, line: 4, baseType: !57, size: 8, align: 8, offset: 2176)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Renegotiation", file: !10, line: 4, baseType: !491, size: 64, align: 64, offset: 2240)
!491 = !DIBasicType(name: "RenegotiationSupport", size: 64, encoding: DW_ATE_signed)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "KeyLogWriter", file: !10, line: 4, baseType: !493, size: 128, align: 64, offset: 2304)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !10, line: 4, size: 128, align: 8, elements: !494)
!494 = !{!495, !109}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !496, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !14, size: 128, align: 8, elements: !498)
!498 = !{!27, !499}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !14, line: 4, baseType: !87, size: 64, align: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "serverInitOnce", file: !10, line: 4, baseType: !501, size: 96, align: 32, offset: 2432)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once", file: !10, line: 4, size: 96, align: 8, elements: !502)
!502 = !{!503, !509}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !10, line: 4, baseType: !504, size: 64, align: 32)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !10, line: 4, size: 64, align: 8, elements: !505)
!505 = !{!506, !508}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !10, line: 4, baseType: !507, size: 32, align: 32)
!507 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !10, line: 4, baseType: !8, size: 32, align: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "done", file: !10, line: 4, baseType: !8, size: 32, align: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !10, line: 4, baseType: !511, size: 192, align: 32, offset: 2528)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !10, line: 4, size: 192, align: 8, elements: !512)
!512 = !{!513, !514, !515, !516, !517}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !10, line: 4, baseType: !504, size: 64, align: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !10, line: 4, baseType: !8, size: 32, align: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !10, line: 4, baseType: !8, size: 32, align: 32, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !10, line: 4, baseType: !507, size: 32, align: 32, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !10, line: 4, baseType: !507, size: 32, align: 32, offset: 160)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sessionTicketKeys", file: !10, line: 4, baseType: !519, size: 192, align: 64, offset: 2752)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.crypto/tls.ticketKey,int,int}", file: !14, size: 192, align: 8, elements: !520)
!520 = !{!521, !83, !84}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !522, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: ".crypto/tls.ticketKey", file: !10, line: 4, size: 384, align: 8, elements: !524)
!524 = !{!525, !529, !530}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "keyName", file: !10, line: 4, baseType: !526, size: 128, align: 8)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 128, align: 1, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 16)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "aesKey", file: !10, line: 4, baseType: !526, size: 128, align: 8, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "hmacKey", file: !10, line: 4, baseType: !526, size: 128, align: 8, offset: 256)
!531 = !DILocalVariable(name: "caCertPath", arg: 3, scope: !9, file: !10, line: 19, type: !62)
!532 = !DILocation(line: 19, column: 41, scope: !9)
!533 = !DILocalVariable(name: "certPemPath", arg: 1, scope: !9, file: !10, line: 19, type: !62)
!534 = !DILocation(line: 19, column: 16, scope: !9)
!535 = !DILocalVariable(name: "keyPemPath", arg: 2, scope: !9, file: !10, line: 19, type: !62)
!536 = !DILocation(line: 19, column: 29, scope: !9)
!537 = !DILocalVariable(name: "$ret0", scope: !9, file: !10, line: 19, type: !17)
!538 = !DILocation(line: 19, column: 61, scope: !9)
!539 = !DILocation(line: 20, column: 6, scope: !540)
!540 = distinct !DILexicalBlock(scope: !9, file: !10, line: 19, column: 1)
!541 = !DILocalVariable(name: "caCertParsed", scope: !540, file: !10, line: 20, type: !437)
!542 = !DILocation(line: 20, column: 6, scope: !9)
!543 = !DILocation(line: 21, column: 16, scope: !540)
!544 = !DILocation(line: 22, column: 27, scope: !545)
!545 = distinct !DILexicalBlock(scope: !540, file: !10, line: 21, column: 22)
!546 = !DILocalVariable(name: "err", scope: !545, file: !10, line: 22, type: !94)
!547 = !DILocation(line: 22, column: 3, scope: !540)
!548 = !DILocation(line: 23, column: 10, scope: !545)
!549 = !DILocation(line: 46, column: 26, scope: !540)
!550 = !DILocation(line: 40, column: 17, scope: !540)
!551 = !DILocation(line: 38, column: 29, scope: !540)
!552 = !DILocation(line: 36, column: 16, scope: !540)
!553 = !DILocation(line: 36, column: 21, scope: !540)
!554 = !DILocalVariable(name: "gTLSConfig", scope: !540, file: !10, line: 36, type: !17)
!555 = !DILocation(line: 36, column: 2, scope: !9)
!556 = !DILocation(line: 72, column: 17, scope: !540)
!557 = !DILocation(line: 24, column: 4, scope: !545)
!558 = !DILocalVariable(name: "$ret1", scope: !9, file: !10, line: 19, type: !94)
!559 = !DILocation(line: 19, column: 74, scope: !9)
!560 = !DILocalVariable(name: "pemBytes", scope: !545, file: !10, line: 22, type: !106)
!561 = !DILocation(line: 26, column: 26, scope: !545)
!562 = !DILocalVariable(name: "certDERBlock", scope: !545, file: !10, line: 26, type: !563)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "Block", file: !10, line: 5, size: 384, align: 8, elements: !565)
!565 = !{!566, !567, !568}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !10, line: 5, baseType: !62, size: 128, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "Headers", file: !10, line: 5, baseType: !320, size: 64, align: 64, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "Bytes", file: !10, line: 5, baseType: !106, size: 192, align: 64, offset: 192)
!569 = !DILocation(line: 26, column: 3, scope: !540)
!570 = !DILocation(line: 27, column: 19, scope: !545)
!571 = !DILocation(line: 28, column: 23, scope: !545)
!572 = !DILocation(line: 28, column: 4, scope: !545)
!573 = !DILocation(line: 30, column: 57, scope: !545)
!574 = !DILocation(line: 30, column: 28, scope: !545)
!575 = !DILocation(line: 30, column: 21, scope: !545)
!576 = !DILocation(line: 31, column: 10, scope: !545)
!577 = !DILocation(line: 32, column: 4, scope: !545)
!578 = !DILocation(line: 73, column: 24, scope: !579)
!579 = distinct !DILexicalBlock(scope: !540, file: !10, line: 72, column: 23)
!580 = !DILocalVariable(name: "err", scope: !579, file: !10, line: 73, type: !94)
!581 = !DILocation(line: 73, column: 3, scope: !540)
!582 = !DILocation(line: 74, column: 10, scope: !579)
!583 = !DILocation(line: 80, column: 16, scope: !540)
!584 = !DILocation(line: 75, column: 4, scope: !579)
!585 = !DILocation(line: 77, column: 13, scope: !579)
!586 = !DILocation(line: 77, column: 29, scope: !579)
!587 = !DILocation(line: 77, column: 27, scope: !579)
!588 = !DILocation(line: 81, column: 7, scope: !540)
!589 = !DILocation(line: 86, column: 2, scope: !540)
!590 = !DILocation(line: 83, column: 13, scope: !540)
!591 = !DILocation(line: 83, column: 25, scope: !540)
!592 = distinct !DISubprogram(name: "conn.TLSConfig..func1", scope: null, file: !10, line: 46, type: !428, isLocal: true, isDefinition: true, scopeLine: 46, isOptimized: false, unit: !1, retainedNodes: !3)
!593 = !DILocalVariable(name: "verifiedChains", arg: 2, scope: !592, file: !10, line: 46, type: !430)
!594 = !DILocation(line: 46, column: 50, scope: !592)
!595 = !DILocalVariable(name: "rawCerts", arg: 1, scope: !592, file: !10, line: 46, type: !160)
!596 = !DILocation(line: 46, column: 31, scope: !592)
!597 = !DILocation(line: 47, column: 7, scope: !592)
!598 = !DILocation(line: 47, column: 20, scope: !592)
!599 = !DILocalVariable(name: "$ret2", scope: !592, file: !10, line: 46, type: !94)
!600 = !DILocation(line: 46, column: 88, scope: !592)
!601 = !DILocation(line: 48, column: 5, scope: !592)
!602 = !DILocation(line: 50, column: 4, scope: !603)
!603 = distinct !DILexicalBlock(scope: !592, file: !10, line: 50, column: 4)
!604 = !DILocation(line: 51, column: 29, scope: !605)
!605 = distinct !DILexicalBlock(scope: !603, file: !10, line: 50, column: 31)
!606 = !DILocalVariable(name: "err", scope: !605, file: !10, line: 51, type: !94)
!607 = !DILocation(line: 51, column: 5, scope: !603)
!608 = !DILocation(line: 53, column: 6, scope: !605)
!609 = !DILocation(line: 55, column: 46, scope: !605)
!610 = !DILocation(line: 55, column: 26, scope: !605)
!611 = !DILocalVariable(name: "certErr", scope: !605, file: !10, line: 55, type: !94)
!612 = !DILocation(line: 55, column: 5, scope: !603)
!613 = !DILocation(line: 56, column: 40, scope: !605)
!614 = !DILocation(line: 56, column: 18, scope: !605)
!615 = !DILocation(line: 56, column: 27, scope: !605)
!616 = !DILocation(line: 56, column: 47, scope: !605)
!617 = !DILocation(line: 56, column: 82, scope: !605)
!618 = !DILocation(line: 56, column: 60, scope: !605)
!619 = !DILocation(line: 56, column: 70, scope: !605)
!620 = !DILocation(line: 56, column: 5, scope: !605)
!621 = !DILocation(line: 57, column: 23, scope: !605)
!622 = !DILocation(line: 59, column: 16, scope: !605)
!623 = !DILocation(line: 60, column: 24, scope: !624)
!624 = distinct !DILexicalBlock(scope: !605, file: !10, line: 60, column: 6)
!625 = !DILocalVariable(name: "crlErr", scope: !624, file: !10, line: 60, type: !94)
!626 = !DILocation(line: 60, column: 9, scope: !605)
!627 = !DILocation(line: 60, column: 53, scope: !624)
!628 = !DILocation(line: 0, scope: !605)
!629 = !DILocation(line: 64, column: 127, scope: !605)
!630 = !DILocation(line: 64, column: 152, scope: !605)
!631 = !DILocation(line: 64, column: 9, scope: !605)
