; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22subnet\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22tls\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/tls\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/tls\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22gob\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/gob\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/gob\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./client.go", directory: "/home/wangcong/go_path/src/github.com/twitchyliquid64/subnet/subnet")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "subnet.Close..1command_line_arguments.Client", linkageName: "command_line_arguments.Client.Close", scope: null, file: !10, line: 314, type: !11, isLocal: false, isDefinition: true, scopeLine: 314, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DIFile(filename: "client.go", directory: ".")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !84, !84}
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !14)
!14 = !{!15, !83}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !18, size: 128, align: 8, elements: !19)
!18 = !DIFile(filename: "", directory: "")
!19 = !{!20, !79}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 1, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !23)
!23 = !{!24, !26, !27, !28, !30, !31, !32, !42, !51, !53, !60, !78}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 160)
!29 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 168)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 176)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !33, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !35)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!25, !40, !25}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "void")
!42 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !43, size: 64, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !45)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !40, !40}
!50 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !52, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !54, size: 64, align: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !52, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !61, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !63)
!63 = !{!64, !65, !66}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !54, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !54, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !67, size: 192, align: 64, offset: 128)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !18, size: 192, align: 8, elements: !68)
!68 = !{!69, !76, !77}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !72)
!72 = !{!64, !65, !73, !74, !75}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !18, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !18, line: 1, baseType: !59, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !18, line: 1, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!55, !40}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "Client", file: !10, line: 19, size: 2304, align: 8, elements: !86)
!86 = !{!87, !88, !89, !90, !91, !101, !107, !108, !113, !120, !121, !124, !125, !156, !574, !690, !691, !692, !693}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "debugMessages", file: !10, line: 20, baseType: !50, size: 8, align: 8)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "newGateway", file: !10, line: 21, baseType: !55, size: 128, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "serverAddr", file: !10, line: 22, baseType: !55, size: 128, align: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "port", file: !10, line: 23, baseType: !55, size: 128, align: 64, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "wg", file: !10, line: 25, baseType: !92, size: 128, align: 32, offset: 448)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "WaitGroup", file: !10, line: 10, size: 128, align: 8, elements: !93)
!93 = !{!94, !96, !100}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "noCopy", file: !10, line: 10, baseType: !95, align: 8)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: ".sync.noCopy", file: !10, line: 4, align: 8, elements: !3)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "state1", file: !10, line: 10, baseType: !97, size: 96, align: 8)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 96, align: 1, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 12)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !10, line: 10, baseType: !8, size: 32, align: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "serverIP", file: !10, line: 26, baseType: !102, size: 192, align: 64, offset: 576)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !10, line: 4, size: 192, align: 8, elements: !103)
!103 = !{!104, !105, !106}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !52, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !59, size: 64, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "localAddr", file: !10, line: 27, baseType: !102, size: 192, align: 64, offset: 768)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "additionalAddrs", file: !10, line: 28, baseType: !109, size: 192, align: 64, offset: 960)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !18, size: 192, align: 8, elements: !110)
!110 = !{!111, !76, !77}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "localNetMask", file: !10, line: 29, baseType: !114, size: 64, align: 64, offset: 1152)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !10, line: 4, size: 384, align: 8, elements: !116)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !10, line: 4, baseType: !102, size: 192, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !10, line: 4, baseType: !119, size: 192, align: 64, offset: 192)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !10, line: 4, size: 192, align: 8, elements: !103)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "isShuttingDown", file: !10, line: 30, baseType: !50, size: 8, align: 8, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "packetsIn", file: !10, line: 33, baseType: !122, size: 64, align: 64, offset: 1280)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !7, line: 1, align: 8, elements: !3)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "packetsDevOut", file: !10, line: 34, baseType: !122, size: 64, align: 64, offset: 1344)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "intf", file: !10, line: 36, baseType: !126, size: 64, align: 64, offset: 1408)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interface", file: !10, line: 15, size: 320, align: 8, elements: !128)
!128 = !{!129, !130, !155}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "isTAP", file: !10, line: 15, baseType: !50, size: 8, align: 8)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ReadWriteCloser", file: !10, line: 15, baseType: !131, size: 128, align: 64, offset: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteCloser", file: !10, line: 15, size: 128, align: 8, elements: !132)
!132 = !{!133, !154}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 15, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !18, size: 256, align: 8, elements: !136)
!136 = !{!137, !138, !142, !153}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 15, baseType: !21, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !18, line: 15, baseType: !139, size: 64, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!13, !40}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !18, line: 15, baseType: !143, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!146, !40, !150}
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !18, size: 192, align: 8, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !18, line: 4, baseType: !59, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !18, line: 4, baseType: !13, size: 128, align: 64, offset: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !18, size: 192, align: 8, elements: !151)
!151 = !{!152, !76, !77}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !52, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !18, line: 15, baseType: !143, size: 64, align: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !10, line: 15, baseType: !55, size: 128, align: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tlsConf", file: !10, line: 37, baseType: !157, size: 64, align: 64, offset: 1472)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !10, line: 4, size: 2944, align: 8, elements: !159)
!159 = !{!160, !169, !211, !362, !376, !441, !454, !465, !481, !488, !489, !490, !492, !493, !494, !495, !496, !497, !501, !529, !530, !531, !532, !533, !535, !543, !553, !561}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Rand", file: !10, line: 4, baseType: !161, size: 128, align: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !10, line: 4, size: 128, align: 8, elements: !162)
!162 = !{!163, !154}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !18, size: 128, align: 8, elements: !166)
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 4, baseType: !21, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !18, line: 4, baseType: !143, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Time", file: !10, line: 4, baseType: !170, size: 64, align: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 4, size: 64, align: 8, elements: !172)
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 4, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!177}
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !10, line: 4, size: 192, align: 8, elements: !178)
!178 = !{!179, !181, !183}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !10, line: 4, baseType: !180, size: 64, align: 64)
!180 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !10, line: 4, baseType: !182, size: 64, align: 64, offset: 64)
!182 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !10, line: 4, baseType: !184, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !10, line: 4, size: 704, align: 8, elements: !186)
!186 = !{!187, !188, !197, !208, !209, !210}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !10, line: 4, baseType: !55, size: 128, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !10, line: 4, baseType: !189, size: 192, align: 64, offset: 128)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !18, size: 192, align: 8, elements: !190)
!190 = !{!191, !76, !77}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !10, line: 4, size: 256, align: 8, elements: !194)
!194 = !{!187, !195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !10, line: 4, baseType: !59, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !10, line: 4, baseType: !198, size: 192, align: 64, offset: 320)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !18, size: 192, align: 8, elements: !199)
!199 = !{!200, !76, !77}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !10, line: 4, size: 128, align: 8, elements: !203)
!203 = !{!204, !205, !206, !207}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !10, line: 4, baseType: !182, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !10, line: 4, baseType: !29, size: 8, align: 8, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 72)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 80)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !10, line: 4, baseType: !182, size: 64, align: 64, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !10, line: 4, baseType: !182, size: 64, align: 64, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !10, line: 4, baseType: !192, size: 64, align: 64, offset: 640)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Certificates", file: !10, line: 4, baseType: !212, size: 192, align: 64, offset: 192)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,int,int}", file: !18, size: 192, align: 8, elements: !213)
!213 = !{!214, !76, !77}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !10, line: 4, size: 768, align: 8, elements: !217)
!217 = !{!218, !223, !227, !228, !229}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Certificate", file: !10, line: 4, baseType: !219, size: 192, align: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !18, size: 192, align: 8, elements: !220)
!220 = !{!221, !76, !77}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "PrivateKey", file: !10, line: 4, baseType: !224, size: 128, align: 64, offset: 192)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !10, line: 4, size: 128, align: 8, elements: !225)
!225 = !{!226, !154}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 1, baseType: !21, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPStaple", file: !10, line: 4, baseType: !150, size: 192, align: 64, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !10, line: 4, baseType: !219, size: 192, align: 64, offset: 512)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Leaf", file: !10, line: 4, baseType: !230, size: 64, align: 64, offset: 704)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !10, line: 4, size: 10624, align: 8, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !238, !239, !241, !243, !244, !245, !256, !285, !286, !287, !288, !290, !300, !301, !306, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !347, !348, !349, !350, !355, !356, !357, !358, !359, !360, !361}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !10, line: 4, baseType: !150, size: 192, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !10, line: 4, baseType: !150, size: 192, align: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !10, line: 4, baseType: !150, size: 192, align: 64, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !10, line: 4, baseType: !150, size: 192, align: 64, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !10, line: 4, baseType: !150, size: 192, align: 64, offset: 768)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !10, line: 4, baseType: !150, size: 192, align: 64, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !10, line: 4, baseType: !240, size: 64, align: 64, offset: 1152)
!240 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !10, line: 4, baseType: !242, size: 64, align: 64, offset: 1216)
!242 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !10, line: 4, baseType: !224, size: 128, align: 64, offset: 1280)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !10, line: 4, baseType: !59, size: 64, align: 64, offset: 1408)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !10, line: 4, baseType: !246, size: 64, align: 64, offset: 1472)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !10, line: 4, size: 256, align: 8, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !10, line: 4, baseType: !50, size: 8, align: 8)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !10, line: 4, baseType: !251, size: 192, align: 64, offset: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !10, line: 4, size: 192, align: 8, elements: !252)
!252 = !{!253, !105, !106}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !10, line: 4, baseType: !257, size: 1984, align: 64, offset: 1536)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !10, line: 4, size: 1984, align: 8, elements: !258)
!258 = !{!259, !263, !264, !265, !266, !267, !268, !269, !270, !271, !284}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !10, line: 4, baseType: !260, size: 192, align: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !18, size: 192, align: 8, elements: !261)
!261 = !{!262, !76, !77}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !54, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !10, line: 4, baseType: !260, size: 192, align: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !10, line: 4, baseType: !260, size: 192, align: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !10, line: 4, baseType: !260, size: 192, align: 64, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !10, line: 4, baseType: !260, size: 192, align: 64, offset: 768)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !10, line: 4, baseType: !260, size: 192, align: 64, offset: 960)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !10, line: 4, baseType: !260, size: 192, align: 64, offset: 1152)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !10, line: 4, baseType: !55, size: 128, align: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !10, line: 4, baseType: !55, size: 128, align: 64, offset: 1472)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !10, line: 4, baseType: !272, size: 192, align: 64, offset: 1600)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !18, size: 192, align: 8, elements: !273)
!273 = !{!274, !76, !77}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !10, line: 4, size: 320, align: 8, elements: !277)
!277 = !{!278, !283}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !10, line: 4, baseType: !279, size: 192, align: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !10, line: 4, size: 192, align: 8, elements: !280)
!280 = !{!281, !105, !106}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !10, line: 4, baseType: !224, size: 128, align: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !10, line: 4, baseType: !272, size: 192, align: 64, offset: 1792)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !10, line: 4, baseType: !257, size: 1984, align: 64, offset: 3520)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !10, line: 4, baseType: !177, size: 192, align: 64, offset: 5504)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !10, line: 4, baseType: !177, size: 192, align: 64, offset: 5696)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !10, line: 4, baseType: !289, size: 64, align: 64, offset: 5888)
!289 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !10, line: 4, baseType: !291, size: 192, align: 64, offset: 5952)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !18, size: 192, align: 8, elements: !292)
!292 = !{!293, !76, !77}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !10, line: 4, size: 448, align: 8, elements: !296)
!296 = !{!297, !298, !299}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !10, line: 4, baseType: !279, size: 192, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !10, line: 4, baseType: !150, size: 192, align: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !10, line: 4, baseType: !291, size: 192, align: 64, offset: 6144)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !10, line: 4, baseType: !302, size: 192, align: 64, offset: 6336)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !18, size: 192, align: 8, elements: !303)
!303 = !{!304, !76, !77}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !10, line: 4, baseType: !307, size: 192, align: 64, offset: 6528)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !18, size: 192, align: 8, elements: !308)
!308 = !{!309, !76, !77}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !10, line: 4, baseType: !302, size: 192, align: 64, offset: 6720)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 6912)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 6920)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !10, line: 4, baseType: !59, size: 64, align: 64, offset: 6976)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 7040)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !10, line: 4, baseType: !150, size: 192, align: 64, offset: 7104)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !10, line: 4, baseType: !150, size: 192, align: 64, offset: 7296)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !10, line: 4, baseType: !260, size: 192, align: 64, offset: 7488)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !10, line: 4, baseType: !260, size: 192, align: 64, offset: 7680)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !10, line: 4, baseType: !260, size: 192, align: 64, offset: 7872)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !10, line: 4, baseType: !260, size: 192, align: 64, offset: 8064)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !10, line: 4, baseType: !109, size: 192, align: 64, offset: 8256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !10, line: 4, baseType: !325, size: 192, align: 64, offset: 8448)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !18, size: 192, align: 8, elements: !326)
!326 = !{!327, !76, !77}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !10, line: 4, size: 1024, align: 8, elements: !331)
!331 = !{!332, !333, !334, !341, !342, !343, !344, !345, !346}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !10, line: 4, baseType: !55, size: 128, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !10, line: 4, baseType: !55, size: 128, align: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !10, line: 4, baseType: !335, size: 64, align: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !10, line: 4, size: 320, align: 8, elements: !337)
!337 = !{!338, !339, !340}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !10, line: 4, baseType: !55, size: 128, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !10, line: 4, baseType: !55, size: 128, align: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !10, line: 4, baseType: !55, size: 128, align: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !10, line: 4, baseType: !55, size: 128, align: 64, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !10, line: 4, baseType: !55, size: 128, align: 64, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 704)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !10, line: 4, baseType: !55, size: 128, align: 64, offset: 768)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !10, line: 4, baseType: !55, size: 128, align: 64, offset: 896)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 8640)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !10, line: 4, baseType: !260, size: 192, align: 64, offset: 8704)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !10, line: 4, baseType: !260, size: 192, align: 64, offset: 8896)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !10, line: 4, baseType: !351, size: 192, align: 64, offset: 9088)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !18, size: 192, align: 8, elements: !352)
!352 = !{!353, !76, !77}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !10, line: 4, baseType: !351, size: 192, align: 64, offset: 9280)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !10, line: 4, baseType: !260, size: 192, align: 64, offset: 9472)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !10, line: 4, baseType: !260, size: 192, align: 64, offset: 9664)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !10, line: 4, baseType: !260, size: 192, align: 64, offset: 9856)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !10, line: 4, baseType: !260, size: 192, align: 64, offset: 10048)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !10, line: 4, baseType: !260, size: 192, align: 64, offset: 10240)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !10, line: 4, baseType: !302, size: 192, align: 64, offset: 10432)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "NameToCertificate", file: !10, line: 4, baseType: !363, size: 64, align: 64, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !365)
!365 = !{!366, !367, !368, !369, !371, !372, !373, !374, !375}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !59, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 72)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !370, size: 16, align: 16, offset: 80)
!370 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !25, size: 64, align: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "GetCertificate", file: !10, line: 4, baseType: !377, size: 64, align: 64, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 4, size: 64, align: 8, elements: !379)
!379 = !{!380}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 4, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!384, !388}
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,error}", file: !18, size: 192, align: 8, elements: !385)
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 4, baseType: !215, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 4, baseType: !13, size: 128, align: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientHelloInfo", file: !10, line: 4, size: 1408, align: 8, elements: !390)
!390 = !{!391, !396, !397, !403, !404, !410, !411, !412}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuites", file: !10, line: 4, baseType: !392, size: 192, align: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint16,int,int}", file: !18, size: 192, align: 8, elements: !393)
!393 = !{!394, !76, !77}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !10, line: 4, baseType: !55, size: 128, align: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedCurves", file: !10, line: 4, baseType: !398, size: 192, align: 64, offset: 320)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*CurveID,int,int}", file: !18, size: 192, align: 8, elements: !399)
!399 = !{!400, !76, !77}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIBasicType(name: "CurveID", size: 16, encoding: DW_ATE_unsigned)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedPoints", file: !10, line: 4, baseType: !150, size: 192, align: 64, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureSchemes", file: !10, line: 4, baseType: !405, size: 192, align: 64, offset: 704)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*SignatureScheme,int,int}", file: !18, size: 192, align: 8, elements: !406)
!406 = !{!407, !76, !77}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIBasicType(name: "SignatureScheme", size: 16, encoding: DW_ATE_unsigned)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedProtos", file: !10, line: 4, baseType: !260, size: 192, align: 64, offset: 896)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedVersions", file: !10, line: 4, baseType: !392, size: 192, align: 64, offset: 1088)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Conn", file: !10, line: 4, baseType: !413, size: 128, align: 64, offset: 1280)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !10, line: 4, size: 128, align: 8, elements: !414)
!414 = !{!415, !154}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !416, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)Addr,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void)Addr,*func(*void,Time)error,*func(*void,Time)error,*func(*void,Time)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !18, size: 576, align: 8, elements: !418)
!418 = !{!167, !419, !420, !432, !433, !434, !438, !439, !440}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !18, line: 4, baseType: !139, size: 64, align: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "LocalAddr", file: !18, line: 4, baseType: !421, size: 64, align: 64, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!424, !40}
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "Addr", file: !10, line: 4, size: 128, align: 8, elements: !425)
!425 = !{!426, !154}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)string}", file: !18, size: 192, align: 8, elements: !429)
!429 = !{!167, !430, !431}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "Network", file: !18, line: 4, baseType: !80, size: 64, align: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !18, line: 4, baseType: !80, size: 64, align: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !18, line: 4, baseType: !143, size: 64, align: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !18, line: 4, baseType: !421, size: 64, align: 64, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "SetDeadline", file: !18, line: 4, baseType: !435, size: 64, align: 64, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!13, !40, !177}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "SetReadDeadline", file: !18, line: 4, baseType: !435, size: 64, align: 64, offset: 384)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "SetWriteDeadline", file: !18, line: 4, baseType: !435, size: 64, align: 64, offset: 448)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !18, line: 4, baseType: !143, size: 64, align: 64, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "GetClientCertificate", file: !10, line: 4, baseType: !442, size: 64, align: 64, offset: 512)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 4, size: 64, align: 8, elements: !444)
!444 = !{!445}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 4, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!384, !449}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertificateRequestInfo", file: !10, line: 4, size: 384, align: 8, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptableCAs", file: !10, line: 4, baseType: !219, size: 192, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureSchemes", file: !10, line: 4, baseType: !405, size: 192, align: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "GetConfigForClient", file: !10, line: 4, baseType: !455, size: 64, align: 64, offset: 576)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 4, size: 64, align: 8, elements: !457)
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 4, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!462, !388}
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Config,error}", file: !18, size: 192, align: 8, elements: !463)
!463 = !{!464, !387}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 4, baseType: !40, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "VerifyPeerCertificate", file: !10, line: 4, baseType: !466, size: 64, align: 64, offset: 640)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 4, size: 64, align: 8, elements: !468)
!468 = !{!469}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 4, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!13, !219, !473}
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !18, size: 192, align: 8, elements: !474)
!474 = !{!475, !76, !77}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !476, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !18, size: 192, align: 8, elements: !478)
!478 = !{!479, !76, !77}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !480, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "RootCAs", file: !10, line: 4, baseType: !482, size: 64, align: 64, offset: 704)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertPool", file: !10, line: 4, size: 320, align: 8, elements: !484)
!484 = !{!485, !486, !487}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "bySubjectKeyId", file: !10, line: 4, baseType: !363, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "byName", file: !10, line: 4, baseType: !363, size: 64, align: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "certs", file: !10, line: 4, baseType: !477, size: 192, align: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "NextProtos", file: !10, line: 4, baseType: !260, size: 192, align: 64, offset: 768)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !10, line: 4, baseType: !55, size: 128, align: 64, offset: 960)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAuth", file: !10, line: 4, baseType: !491, size: 64, align: 64, offset: 1088)
!491 = !DIBasicType(name: "ClientAuthType", size: 64, encoding: DW_ATE_signed)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ClientCAs", file: !10, line: 4, baseType: !482, size: 64, align: 64, offset: 1152)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "InsecureSkipVerify", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 1216)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuites", file: !10, line: 4, baseType: !392, size: 192, align: 64, offset: 1280)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "PreferServerCipherSuites", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 1472)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "SessionTicketsDisabled", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 1480)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "SessionTicketKey", file: !10, line: 4, baseType: !498, size: 256, align: 8, offset: 1488)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 256, align: 1, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ClientSessionCache", file: !10, line: 4, baseType: !502, size: 128, align: 64, offset: 1792)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientSessionCache", file: !10, line: 4, size: 128, align: 8, elements: !503)
!503 = !{!504, !154}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !505, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)struct{*ClientSessionState,bool},*func(*void,string,*ClientSessionState)void}", file: !18, size: 192, align: 8, elements: !507)
!507 = !{!167, !508, !525}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !18, line: 4, baseType: !509, size: 64, align: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!512, !40, !55}
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ClientSessionState,bool}", file: !18, size: 128, align: 8, elements: !513)
!513 = !{!514, !524}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "session", file: !18, line: 4, baseType: !515, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientSessionState", file: !10, line: 4, size: 832, align: 8, elements: !517)
!517 = !{!518, !519, !520, !521, !522, !523}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sessionTicket", file: !10, line: 4, baseType: !150, size: 192, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "vers", file: !10, line: 4, baseType: !370, size: 16, align: 16, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "cipherSuite", file: !10, line: 4, baseType: !370, size: 16, align: 16, offset: 208)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "masterSecret", file: !10, line: 4, baseType: !150, size: 192, align: 64, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "serverCertificates", file: !10, line: 4, baseType: !477, size: 192, align: 64, offset: 448)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "verifiedChains", file: !10, line: 4, baseType: !473, size: 192, align: 64, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !18, line: 4, baseType: !50, size: 8, align: 8, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Put", file: !18, line: 4, baseType: !526, size: 64, align: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!41, !40, !55, !515}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "MinVersion", file: !10, line: 4, baseType: !370, size: 16, align: 16, offset: 1920)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "MaxVersion", file: !10, line: 4, baseType: !370, size: 16, align: 16, offset: 1936)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "CurvePreferences", file: !10, line: 4, baseType: !398, size: 192, align: 64, offset: 1984)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "DynamicRecordSizingDisabled", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 2176)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Renegotiation", file: !10, line: 4, baseType: !534, size: 64, align: 64, offset: 2240)
!534 = !DIBasicType(name: "RenegotiationSupport", size: 64, encoding: DW_ATE_signed)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "KeyLogWriter", file: !10, line: 4, baseType: !536, size: 128, align: 64, offset: 2304)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !10, line: 4, size: 128, align: 8, elements: !537)
!537 = !{!538, !154}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !539, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !18, size: 128, align: 8, elements: !541)
!541 = !{!167, !542}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !18, line: 4, baseType: !143, size: 64, align: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "serverInitOnce", file: !10, line: 4, baseType: !544, size: 96, align: 32, offset: 2432)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once", file: !10, line: 4, size: 96, align: 8, elements: !545)
!545 = !{!546, !552}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !10, line: 4, baseType: !547, size: 64, align: 32)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !10, line: 4, size: 64, align: 8, elements: !548)
!548 = !{!549, !551}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !10, line: 4, baseType: !550, size: 32, align: 32)
!550 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !10, line: 4, baseType: !8, size: 32, align: 32, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "done", file: !10, line: 4, baseType: !8, size: 32, align: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !10, line: 4, baseType: !554, size: 192, align: 32, offset: 2528)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !10, line: 4, size: 192, align: 8, elements: !555)
!555 = !{!556, !557, !558, !559, !560}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !10, line: 4, baseType: !547, size: 64, align: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !10, line: 4, baseType: !8, size: 32, align: 32, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !10, line: 4, baseType: !8, size: 32, align: 32, offset: 96)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !10, line: 4, baseType: !550, size: 32, align: 32, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !10, line: 4, baseType: !550, size: 32, align: 32, offset: 160)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "sessionTicketKeys", file: !10, line: 4, baseType: !562, size: 192, align: 64, offset: 2752)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.crypto/tls.ticketKey,int,int}", file: !18, size: 192, align: 8, elements: !563)
!563 = !{!564, !76, !77}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !565, size: 64, align: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: ".crypto/tls.ticketKey", file: !10, line: 4, size: 384, align: 8, elements: !567)
!567 = !{!568, !572, !573}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "keyName", file: !10, line: 4, baseType: !569, size: 128, align: 8)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 128, align: 1, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 16)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "aesKey", file: !10, line: 4, baseType: !569, size: 128, align: 8, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "hmacKey", file: !10, line: 4, baseType: !569, size: 128, align: 8, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "tlsConn", file: !10, line: 38, baseType: !575, size: 64, align: 64, offset: 1536)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !10, line: 4, size: 6720, align: 8, elements: !577)
!577 = !{!578, !579, !580, !581, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !670, !671, !672, !673, !683, !684, !685, !686, !687, !688, !689}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "conn", file: !10, line: 4, baseType: !413, size: 128, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "isClient", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "handshakeMutex", file: !10, line: 4, baseType: !547, size: 64, align: 32, offset: 160)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "handshakeCond", file: !10, line: 4, baseType: !582, size: 64, align: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cond", file: !10, line: 4, size: 448, align: 8, elements: !584)
!584 = !{!585, !586, !598, !606}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "noCopy", file: !10, line: 4, baseType: !95, align: 8)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "L", file: !10, line: 4, baseType: !587, size: 128, align: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "Locker", file: !10, line: 4, size: 128, align: 8, elements: !588)
!588 = !{!589, !154}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !590, size: 64, align: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void}", file: !18, size: 192, align: 8, elements: !592)
!592 = !{!167, !593, !597}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", file: !18, line: 4, baseType: !594, size: 64, align: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!41, !40}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Unlock", file: !18, line: 4, baseType: !594, size: 64, align: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "notify", file: !10, line: 4, baseType: !599, size: 256, align: 64, offset: 128)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: ".sync.notifyList", file: !10, line: 4, size: 256, align: 8, elements: !600)
!600 = !{!601, !602, !603, !604, !605}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "wait", file: !10, line: 4, baseType: !8, size: 32, align: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "notify", file: !10, line: 4, baseType: !8, size: 32, align: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !10, line: 4, baseType: !25, size: 64, align: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !10, line: 4, baseType: !40, size: 64, align: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !10, line: 4, baseType: !40, size: 64, align: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "checker", file: !10, line: 4, baseType: !607, size: 64, align: 64, offset: 384)
!607 = !DIBasicType(name: ".sync.copyChecker", size: 64, encoding: DW_ATE_unsigned)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "handshakeErr", file: !10, line: 4, baseType: !13, size: 128, align: 64, offset: 320)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "vers", file: !10, line: 4, baseType: !370, size: 16, align: 16, offset: 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "haveVers", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 464)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "config", file: !10, line: 4, baseType: !157, size: 64, align: 64, offset: 512)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "handshakeComplete", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 576)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "handshakes", file: !10, line: 4, baseType: !59, size: 64, align: 64, offset: 640)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "didResume", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 704)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "cipherSuite", file: !10, line: 4, baseType: !370, size: 16, align: 16, offset: 720)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ocspResponse", file: !10, line: 4, baseType: !150, size: 192, align: 64, offset: 768)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "scts", file: !10, line: 4, baseType: !219, size: 192, align: 64, offset: 960)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "peerCertificates", file: !10, line: 4, baseType: !477, size: 192, align: 64, offset: 1152)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "verifiedChains", file: !10, line: 4, baseType: !473, size: 192, align: 64, offset: 1344)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "serverName", file: !10, line: 4, baseType: !55, size: 128, align: 64, offset: 1536)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "secureRenegotiation", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 1664)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "clientFinishedIsFirst", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 1672)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "closeNotifyErr", file: !10, line: 4, baseType: !13, size: 128, align: 64, offset: 1728)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "closeNotifySent", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 1856)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "clientFinished", file: !10, line: 4, baseType: !97, size: 96, align: 8, offset: 1864)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "serverFinished", file: !10, line: 4, baseType: !97, size: 96, align: 8, offset: 1960)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "clientProtocol", file: !10, line: 4, baseType: !55, size: 128, align: 64, offset: 2112)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "clientProtocolFallback", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 2240)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "in", file: !10, line: 4, baseType: !630, size: 1408, align: 64, offset: 2304)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: ".crypto/tls.halfConn", file: !10, line: 4, size: 1408, align: 8, elements: !631)
!631 = !{!632, !633, !634, !635, !636, !651, !655, !662, !666, !667, !668, !669}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "Mutex", file: !10, line: 4, baseType: !547, size: 64, align: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !10, line: 4, baseType: !13, size: 128, align: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "version", file: !10, line: 4, baseType: !370, size: 16, align: 16, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", file: !10, line: 4, baseType: !224, size: 128, align: 64, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "mac", file: !10, line: 4, baseType: !637, size: 128, align: 64, offset: 384)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: ".crypto/tls.macFunction", file: !10, line: 4, size: 128, align: 8, elements: !638)
!638 = !{!639, !154}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !640, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int},struct{*uint8,int,int},struct{*uint8,int,int},struct{*uint8,int,int},struct{*uint8,int,int})struct{*uint8,int,int},*func(*void)int}", file: !18, size: 192, align: 8, elements: !642)
!642 = !{!167, !643, !647}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "MAC", file: !18, line: 4, baseType: !644, size: 64, align: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!150, !40, !150, !150, !150, !150, !150}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !18, line: 4, baseType: !648, size: 64, align: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!59, !40}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !10, line: 4, baseType: !652, size: 64, align: 8, offset: 512)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 64, align: 1, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 8)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "bfree", file: !10, line: 4, baseType: !656, size: 64, align: 64, offset: 576)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: ".crypto/tls.block", file: !10, line: 4, size: 320, align: 8, elements: !658)
!658 = !{!659, !660, !661}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "data", file: !10, line: 4, baseType: !150, size: 192, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "off", file: !10, line: 4, baseType: !59, size: 64, align: 64, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !10, line: 4, baseType: !40, size: 64, align: 64, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "additionalData", file: !10, line: 4, baseType: !663, size: 104, align: 8, offset: 640)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 104, align: 1, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 13)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "nextCipher", file: !10, line: 4, baseType: !224, size: 128, align: 64, offset: 768)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "nextMac", file: !10, line: 4, baseType: !637, size: 128, align: 64, offset: 896)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "inDigestBuf", file: !10, line: 4, baseType: !150, size: 192, align: 64, offset: 1024)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "outDigestBuf", file: !10, line: 4, baseType: !150, size: 192, align: 64, offset: 1216)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "out", file: !10, line: 4, baseType: !630, size: 1408, align: 64, offset: 3712)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "rawInput", file: !10, line: 4, baseType: !656, size: 64, align: 64, offset: 5120)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "input", file: !10, line: 4, baseType: !656, size: 64, align: 64, offset: 5184)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "hand", file: !10, line: 4, baseType: !674, size: 832, align: 64, offset: 5248)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", file: !10, line: 4, size: 832, align: 8, elements: !675)
!675 = !{!676, !660, !677, !681}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !10, line: 4, baseType: !150, size: 192, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "bootstrap", file: !10, line: 4, baseType: !678, size: 512, align: 8, offset: 256)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 512, align: 1, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lastRead", file: !10, line: 4, baseType: !682, size: 8, align: 8, offset: 768)
!682 = !DIBasicType(name: ".bytes.readOp", size: 8, encoding: DW_ATE_signed)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "buffering", file: !10, line: 4, baseType: !50, size: 8, align: 8, offset: 6080)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "sendBuf", file: !10, line: 4, baseType: !150, size: 192, align: 64, offset: 6144)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "bytesSent", file: !10, line: 4, baseType: !182, size: 64, align: 64, offset: 6336)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "packetsSent", file: !10, line: 4, baseType: !182, size: 64, align: 64, offset: 6400)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "warnCount", file: !10, line: 4, baseType: !59, size: 64, align: 64, offset: 6464)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "activeCall", file: !10, line: 4, baseType: !550, size: 32, align: 32, offset: 6528)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", file: !10, line: 4, baseType: !569, size: 128, align: 8, offset: 6560)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "tcpConn", file: !10, line: 39, baseType: !413, size: 128, align: 64, offset: 1600)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "connectionOk", file: !10, line: 42, baseType: !50, size: 8, align: 8, offset: 1728)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "connResetLock", file: !10, line: 43, baseType: !547, size: 64, align: 32, offset: 1760)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "reverser", file: !10, line: 45, baseType: !694, size: 448, align: 64, offset: 1856)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reverser", file: !695, line: 12, size: 448, align: 8, elements: !696)
!695 = !DIFile(filename: "reverser.go", directory: ".")
!696 = !{!697, !707, !708, !709}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "RouteDeletions", file: !695, line: 13, baseType: !698, size: 192, align: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.command-line-arguments.routeEntries,int,int}", file: !18, size: 192, align: 8, elements: !699)
!699 = !{!700, !76, !77}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !701, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.routeEntries", file: !695, line: 21, size: 512, align: 8, elements: !703)
!703 = !{!704, !705, !706}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "dest", file: !695, line: 22, baseType: !102, size: 192, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "via", file: !695, line: 23, baseType: !102, size: 192, align: 64, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "dev", file: !695, line: 24, baseType: !55, size: 128, align: 64, offset: 384)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "updateGateway", file: !695, line: 15, baseType: !50, size: 8, align: 8, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "newGW", file: !695, line: 16, baseType: !55, size: 128, align: 64, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "interfaceToClose", file: !695, line: 18, baseType: !126, size: 64, align: 64, offset: 384)
!710 = !DILocalVariable(name: "c", arg: 1, scope: !9, file: !10, line: 314, type: !84)
!711 = !DILocation(line: 314, column: 1, scope: !9)
!712 = !DILocation(line: 315, column: 3, scope: !713)
!713 = distinct !DILexicalBlock(scope: !9, file: !10, line: 314, column: 1)
!714 = !DILocation(line: 315, column: 19, scope: !713)
!715 = !DILocation(line: 316, column: 3, scope: !713)
!716 = !DILocation(line: 316, column: 12, scope: !713)
!717 = !DILocation(line: 317, column: 3, scope: !713)
!718 = !DILocation(line: 317, column: 11, scope: !713)
!719 = !DILocation(line: 318, column: 8, scope: !713)
!720 = !DILocation(line: 318, column: 13, scope: !713)
!721 = !DILocalVariable(name: "e", scope: !713, file: !10, line: 318, type: !13)
!722 = !DILocation(line: 318, column: 2, scope: !9)
!723 = !DILocation(line: 319, column: 7, scope: !713)
!724 = !DILocalVariable(name: "$ret4", scope: !9, file: !10, line: 314, type: !13)
!725 = !DILocation(line: 314, column: 26, scope: !9)
!726 = !DILocation(line: 320, column: 3, scope: !713)
!727 = distinct !DISubprogram(name: "subnet.Run..1command_line_arguments.Client", linkageName: "command_line_arguments.Client.Run", scope: null, file: !10, line: 140, type: !728, isLocal: false, isDefinition: true, scopeLine: 140, isOptimized: false, unit: !1, retainedNodes: !3)
!728 = !DISubroutineType(types: !729)
!729 = !{!41, !84, !84}
!730 = !DILocalVariable(name: "c", arg: 1, scope: !727, file: !10, line: 140, type: !84)
!731 = !DILocation(line: 140, column: 1, scope: !727)
!732 = !DILocation(line: 142, column: 6, scope: !733)
!733 = distinct !DILexicalBlock(scope: !727, file: !10, line: 140, column: 1)
!734 = !DILocation(line: 142, column: 18, scope: !733)
!735 = !DILocation(line: 0, scope: !736)
!736 = distinct !DILexicalBlock(scope: !733, file: !10, line: 142, column: 24)
!737 = !DILocation(line: 150, column: 50, scope: !733)
!738 = !DILocation(line: 143, column: 43, scope: !736)
!739 = !DILocation(line: 143, column: 48, scope: !736)
!740 = !DILocation(line: 143, column: 58, scope: !736)
!741 = !DILocation(line: 143, column: 10, scope: !736)
!742 = !DILocalVariable(name: "err", scope: !736, file: !10, line: 143, type: !13)
!743 = !DILocation(line: 143, column: 3, scope: !733)
!744 = !DILocation(line: 144, column: 10, scope: !736)
!745 = !DILocation(line: 145, column: 45, scope: !736)
!746 = !DILocation(line: 145, column: 8, scope: !736)
!747 = !DILocation(line: 146, column: 4, scope: !736)
!748 = !DILocation(line: 150, column: 29, scope: !733)
!749 = !DILocation(line: 150, column: 34, scope: !733)
!750 = !DILocation(line: 150, column: 9, scope: !733)
!751 = !DILocalVariable(name: "err", scope: !733, file: !10, line: 150, type: !13)
!752 = !DILocation(line: 150, column: 2, scope: !727)
!753 = !DILocation(line: 151, column: 9, scope: !733)
!754 = !DILocation(line: 156, column: 2, scope: !733)
!755 = !DILocation(line: 157, column: 2, scope: !733)
!756 = !DILocation(line: 158, column: 21, scope: !733)
!757 = !DILocation(line: 158, column: 29, scope: !733)
!758 = !DILocation(line: 158, column: 43, scope: !733)
!759 = !DILocation(line: 158, column: 50, scope: !733)
!760 = !DILocation(line: 158, column: 2, scope: !733)
!761 = !DILocation(line: 159, column: 22, scope: !733)
!762 = !DILocation(line: 159, column: 30, scope: !733)
!763 = !DILocation(line: 159, column: 2, scope: !733)
!764 = !DILocation(line: 152, column: 56, scope: !733)
!765 = !DILocation(line: 152, column: 61, scope: !733)
!766 = !DILocation(line: 152, column: 73, scope: !733)
!767 = !DILocation(line: 152, column: 7, scope: !733)
!768 = !DILocation(line: 153, column: 3, scope: !733)
!769 = distinct !DISubprogram(name: "subnet.connectionProblem..1command_line_arguments.Client", linkageName: "command_line_arguments.Client.connectionProblem", scope: null, file: !10, line: 251, type: !728, isLocal: false, isDefinition: true, scopeLine: 251, isOptimized: false, unit: !1, retainedNodes: !3)
!770 = !DILocalVariable(name: "c", arg: 1, scope: !769, file: !10, line: 251, type: !84)
!771 = !DILocation(line: 251, column: 1, scope: !769)
!772 = !DILocation(line: 252, column: 7, scope: !769)
!773 = !DILocation(line: 289, column: 1, scope: !769)
!774 = !DILocation(line: 252, column: 5, scope: !769)
!775 = !DILocation(line: 255, column: 6, scope: !769)
!776 = !DILocation(line: 255, column: 2, scope: !769)
!777 = !DILocation(line: 259, column: 3, scope: !769)
!778 = !DILocation(line: 259, column: 17, scope: !769)
!779 = !DILocation(line: 260, column: 2, scope: !769)
!780 = !DILocation(line: 262, column: 6, scope: !769)
!781 = !DILocation(line: 262, column: 2, scope: !769)
!782 = !DILocation(line: 263, column: 7, scope: !769)
!783 = !DILocation(line: 264, column: 18, scope: !769)
!784 = !DILocation(line: 265, column: 4, scope: !769)
!785 = !DILocation(line: 265, column: 12, scope: !769)
!786 = !DILocation(line: 266, column: 8, scope: !769)
!787 = !DILocalVariable(name: "i", scope: !788, file: !10, line: 268, type: !59)
!788 = distinct !DILexicalBlock(scope: !769, file: !10, line: 268, column: 3)
!789 = !DILocation(line: 268, column: 7, scope: !769)
!790 = !DILocation(line: 269, column: 37, scope: !791)
!791 = distinct !DILexicalBlock(scope: !788, file: !10, line: 268, column: 25)
!792 = !DILocation(line: 269, column: 24, scope: !791)
!793 = !DILocalVariable(name: "err", scope: !791, file: !10, line: 269, type: !13)
!794 = !DILocation(line: 269, column: 4, scope: !788)
!795 = !DILocation(line: 271, column: 11, scope: !791)
!796 = !DILocation(line: 272, column: 5, scope: !791)
!797 = !DILocation(line: 276, column: 20, scope: !791)
!798 = !DILocation(line: 279, column: 11, scope: !791)
!799 = !DILocation(line: 272, column: 12, scope: !791)
!800 = !DILocation(line: 272, column: 27, scope: !791)
!801 = !DILocation(line: 273, column: 5, scope: !791)
!802 = !DILocation(line: 273, column: 12, scope: !791)
!803 = !DILocation(line: 273, column: 27, scope: !791)
!804 = !DILocation(line: 274, column: 15, scope: !791)
!805 = !DILocation(line: 275, column: 38, scope: !791)
!806 = !DILocation(line: 275, column: 21, scope: !791)
!807 = !DILocation(line: 275, column: 15, scope: !791)
!808 = !DILocation(line: 276, column: 12, scope: !791)
!809 = !DILocation(line: 284, column: 71, scope: !791)
!810 = !DILocation(line: 280, column: 20, scope: !791)
!811 = !DILocation(line: 281, column: 9, scope: !791)
!812 = !DILocation(line: 284, column: 82, scope: !791)
!813 = !DILocation(line: 284, column: 84, scope: !791)
!814 = !DILocation(line: 284, column: 9, scope: !791)
!815 = !DILocation(line: 285, column: 28, scope: !791)
!816 = !DILocation(line: 285, column: 10, scope: !791)
!817 = !DILocation(line: 268, column: 21, scope: !788)
!818 = !DILocation(line: 253, column: 3, scope: !769)
!819 = distinct !DISubprogram(name: "subnet.init..1command_line_arguments.Client", linkageName: "command_line_arguments.Client.init", scope: null, file: !10, line: 94, type: !820, isLocal: false, isDefinition: true, scopeLine: 94, isOptimized: false, unit: !1, retainedNodes: !3)
!820 = !DISubroutineType(types: !821)
!821 = !{!13, !84, !84, !55, !55}
!822 = !DILocalVariable(name: "c", arg: 1, scope: !819, file: !10, line: 94, type: !84)
!823 = !DILocation(line: 94, column: 1, scope: !819)
!824 = !DILocalVariable(name: "serverAddr", arg: 2, scope: !819, file: !10, line: 94, type: !55)
!825 = !DILocation(line: 94, column: 23, scope: !819)
!826 = !DILocalVariable(name: "port", arg: 3, scope: !819, file: !10, line: 94, type: !55)
!827 = !DILocation(line: 94, column: 35, scope: !819)
!828 = !DILocation(line: 95, column: 34, scope: !829)
!829 = distinct !DILexicalBlock(scope: !819, file: !10, line: 94, column: 1)
!830 = !DILocation(line: 95, column: 22, scope: !829)
!831 = !DILocalVariable(name: "err", scope: !829, file: !10, line: 95, type: !13)
!832 = !DILocation(line: 95, column: 2, scope: !819)
!833 = !DILocation(line: 96, column: 9, scope: !829)
!834 = !DILocation(line: 97, column: 3, scope: !829)
!835 = !DILocalVariable(name: "$ret2", scope: !819, file: !10, line: 94, type: !13)
!836 = !DILocation(line: 94, column: 48, scope: !819)
!837 = !DILocation(line: 99, column: 2, scope: !829)
!838 = !DILocation(line: 99, column: 9, scope: !829)
!839 = !DILocation(line: 99, column: 24, scope: !829)
!840 = !DILocation(line: 100, column: 9, scope: !829)
!841 = !DILocation(line: 100, column: 24, scope: !829)
!842 = !DILocation(line: 101, column: 3, scope: !829)
!843 = !DILocation(line: 100, column: 2, scope: !829)
!844 = !DILocation(line: 101, column: 12, scope: !829)
!845 = !DILocation(line: 103, column: 18, scope: !829)
!846 = !DILocation(line: 103, column: 35, scope: !829)
!847 = !DILocation(line: 103, column: 3, scope: !829)
!848 = !DILocation(line: 103, column: 12, scope: !829)
!849 = !DILocation(line: 105, column: 13, scope: !850)
!850 = distinct !DILexicalBlock(scope: !829, file: !10, line: 105, column: 2)
!851 = !DILocation(line: 105, column: 21, scope: !850)
!852 = !DILocalVariable(name: "err", scope: !850, file: !10, line: 105, type: !13)
!853 = !DILocation(line: 105, column: 5, scope: !829)
!854 = !DILocation(line: 105, column: 39, scope: !850)
!855 = !DILocation(line: 106, column: 3, scope: !850)
!856 = !DILocation(line: 109, column: 3, scope: !829)
!857 = !DILocation(line: 109, column: 17, scope: !829)
!858 = !DILocation(line: 111, column: 22, scope: !859)
!859 = distinct !DILexicalBlock(scope: !829, file: !10, line: 111, column: 2)
!860 = !DILocation(line: 111, column: 27, scope: !859)
!861 = !DILocation(line: 111, column: 37, scope: !859)
!862 = !DILocation(line: 111, column: 50, scope: !859)
!863 = !DILocation(line: 111, column: 66, scope: !859)
!864 = !DILocation(line: 111, column: 12, scope: !859)
!865 = !DILocalVariable(name: "err", scope: !859, file: !10, line: 111, type: !13)
!866 = !DILocation(line: 111, column: 5, scope: !829)
!867 = !DILocation(line: 111, column: 87, scope: !859)
!868 = !DILocation(line: 112, column: 3, scope: !859)
!869 = !DILocation(line: 114, column: 55, scope: !829)
!870 = !DILocation(line: 114, column: 60, scope: !829)
!871 = !DILocation(line: 114, column: 80, scope: !829)
!872 = !DILocation(line: 114, column: 99, scope: !829)
!873 = !DILocation(line: 114, column: 112, scope: !829)
!874 = !DILocation(line: 114, column: 118, scope: !829)
!875 = !DILocation(line: 114, column: 6, scope: !829)
!876 = !DILocation(line: 116, column: 6, scope: !829)
!877 = !DILocation(line: 116, column: 18, scope: !829)
!878 = !DILocation(line: 118, column: 29, scope: !879)
!879 = distinct !DILexicalBlock(scope: !829, file: !10, line: 116, column: 24)
!880 = !DILocalVariable(name: "gw", scope: !879, file: !10, line: 118, type: !55)
!881 = !DILocation(line: 118, column: 3, scope: !829)
!882 = !DILocalVariable(name: "gatewayDevice", scope: !879, file: !10, line: 118, type: !55)
!883 = !DILocalVariable(name: "err", scope: !879, file: !10, line: 118, type: !13)
!884 = !DILocation(line: 119, column: 10, scope: !879)
!885 = !DILocation(line: 136, column: 2, scope: !829)
!886 = !DILocation(line: 120, column: 4, scope: !879)
!887 = !DILocation(line: 122, column: 18, scope: !879)
!888 = !DILocation(line: 123, column: 7, scope: !879)
!889 = !DILocation(line: 126, column: 23, scope: !890)
!890 = distinct !DILexicalBlock(scope: !879, file: !10, line: 126, column: 3)
!891 = !DILocation(line: 126, column: 59, scope: !890)
!892 = !DILocalVariable(name: "gateway", scope: !879, file: !10, line: 122, type: !102)
!893 = !DILocation(line: 122, column: 3, scope: !829)
!894 = !DILocation(line: 126, column: 13, scope: !890)
!895 = !DILocalVariable(name: "err", scope: !890, file: !10, line: 126, type: !13)
!896 = !DILocation(line: 126, column: 6, scope: !879)
!897 = !DILocation(line: 126, column: 80, scope: !890)
!898 = !DILocation(line: 127, column: 4, scope: !890)
!899 = !DILocation(line: 129, column: 68, scope: !879)
!900 = !DILocation(line: 129, column: 7, scope: !879)
!901 = !DILocation(line: 130, column: 4, scope: !879)
!902 = !DILocation(line: 130, column: 13, scope: !879)
!903 = distinct !DISubprogram(name: "subnet.netRecvRoutine..1command_line_arguments.Client", linkageName: "command_line_arguments.Client.netRecvRoutine", scope: null, file: !10, line: 212, type: !728, isLocal: false, isDefinition: true, scopeLine: 212, isOptimized: false, unit: !1, retainedNodes: !3)
!904 = !DILocalVariable(name: "c", arg: 1, scope: !903, file: !10, line: 212, type: !84)
!905 = !DILocation(line: 212, column: 1, scope: !903)
!906 = !DILocation(line: 213, column: 3, scope: !903)
!907 = !DILocation(line: 249, column: 1, scope: !903)
!908 = !DILocation(line: 213, column: 6, scope: !903)
!909 = !DILocation(line: 214, column: 9, scope: !903)
!910 = !DILocation(line: 214, column: 2, scope: !903)
!911 = !DILocation(line: 217, column: 30, scope: !912)
!912 = distinct !DILexicalBlock(scope: !903, file: !10, line: 216, column: 24)
!913 = !DILocation(line: 217, column: 18, scope: !912)
!914 = !DILocalVariable(name: "pktType", scope: !915, file: !10, line: 220, type: !916)
!915 = distinct !DILexicalBlock(scope: !912, file: !10, line: 219, column: 22)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIBasicType(name: "PktType", size: 8, encoding: DW_ATE_unsigned)
!918 = !DILocation(line: 220, column: 8, scope: !912)
!919 = !DILocation(line: 221, column: 26, scope: !915)
!920 = !DILocation(line: 221, column: 18, scope: !915)
!921 = !DILocalVariable(name: "err", scope: !915, file: !10, line: 221, type: !13)
!922 = !DILocation(line: 221, column: 4, scope: !912)
!923 = !DILocation(line: 223, column: 11, scope: !915)
!924 = !DILocation(line: 232, column: 11, scope: !915)
!925 = !DILocation(line: 224, column: 10, scope: !915)
!926 = !DILocation(line: 224, column: 8, scope: !915)
!927 = !DILocation(line: 225, column: 44, scope: !915)
!928 = !DILocation(line: 225, column: 10, scope: !915)
!929 = !DILocation(line: 226, column: 7, scope: !915)
!930 = !DILocation(line: 247, column: 8, scope: !912)
!931 = !DILocation(line: 234, column: 9, scope: !915)
!932 = !DILocation(line: 236, column: 9, scope: !933)
!933 = distinct !DILexicalBlock(scope: !915, file: !10, line: 236, column: 5)
!934 = !DILocation(line: 234, column: 49, scope: !915)
!935 = !DILocalVariable(name: "ipPkt", scope: !933, file: !10, line: 236, type: !936)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPPacket", file: !938, line: 10, size: 448, align: 8, elements: !939)
!938 = !DIFile(filename: "dev_packet.go", directory: ".")
!939 = !{!940, !941, !942}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !938, line: 11, baseType: !150, size: 192, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "Dest", file: !938, line: 12, baseType: !102, size: 192, align: 64, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "Protocol", file: !938, line: 13, baseType: !943, size: 8, align: 8, offset: 384)
!943 = !DIBasicType(name: "IPProtocol", size: 8, encoding: DW_ATE_unsigned)
!944 = !DILocation(line: 236, column: 9, scope: !915)
!945 = !DILocation(line: 237, column: 27, scope: !933)
!946 = !DILocation(line: 237, column: 19, scope: !933)
!947 = !DILocalVariable(name: "err", scope: !933, file: !10, line: 237, type: !13)
!948 = !DILocation(line: 237, column: 5, scope: !915)
!949 = !DILocation(line: 238, column: 12, scope: !933)
!950 = !DILocation(line: 239, column: 53, scope: !933)
!951 = !DILocation(line: 239, column: 10, scope: !933)
!952 = !DILocation(line: 240, column: 7, scope: !933)
!953 = !DILocation(line: 244, column: 6, scope: !933)
!954 = !DILocation(line: 244, column: 21, scope: !933)
!955 = !DILocation(line: 219, column: 8, scope: !912)
!956 = !DILocation(line: 220, column: 8, scope: !915)
!957 = !DILocation(line: 216, column: 8, scope: !903)
!958 = !DILocation(line: 216, column: 6, scope: !903)
!959 = !DILocation(line: 229, column: 5, scope: !903)
!960 = distinct !DISubprogram(name: "subnet.netSendRoutine..1command_line_arguments.Client", linkageName: "command_line_arguments.Client.netSendRoutine", scope: null, file: !10, line: 162, type: !728, isLocal: false, isDefinition: true, scopeLine: 162, isOptimized: false, unit: !1, retainedNodes: !3)
!961 = !DILocalVariable(name: "c", arg: 1, scope: !960, file: !10, line: 162, type: !84)
!962 = !DILocation(line: 162, column: 1, scope: !960)
!963 = !DILocation(line: 163, column: 3, scope: !960)
!964 = !DILocation(line: 200, column: 1, scope: !960)
!965 = !DILocation(line: 163, column: 6, scope: !960)
!966 = !DILocation(line: 164, column: 9, scope: !960)
!967 = !DILocation(line: 164, column: 2, scope: !960)
!968 = !DILocation(line: 167, column: 30, scope: !969)
!969 = distinct !DILexicalBlock(scope: !960, file: !10, line: 166, column: 24)
!970 = !DILocation(line: 167, column: 18, scope: !969)
!971 = !DILocation(line: 168, column: 14, scope: !969)
!972 = !DILocalVariable(name: "connOK", scope: !969, file: !10, line: 168, type: !50)
!973 = !DILocation(line: 168, column: 3, scope: !960)
!974 = !DILocation(line: 169, column: 3, scope: !969)
!975 = !DILocation(line: 170, column: 5, scope: !969)
!976 = !DILocation(line: 173, column: 8, scope: !969)
!977 = !DILocation(line: 173, column: 22, scope: !969)
!978 = !DILocalVariable(name: "pkt", scope: !979, file: !10, line: 174, type: !936)
!979 = distinct !DILexicalBlock(scope: !969, file: !10, line: 173, column: 32)
!980 = !DILocation(line: 174, column: 4, scope: !969)
!981 = !DILocalVariable(name: "ok", scope: !979, file: !10, line: 174, type: !50)
!982 = !DILocation(line: 174, column: 18, scope: !979)
!983 = !DILocation(line: 174, column: 4, scope: !979)
!984 = !DILocation(line: 175, column: 7, scope: !979)
!985 = !DILocation(line: 179, column: 10, scope: !979)
!986 = !DILocation(line: 197, column: 8, scope: !969)
!987 = !DILocation(line: 179, column: 15, scope: !979)
!988 = !DILocation(line: 179, column: 4, scope: !979)
!989 = !DILocation(line: 184, column: 31, scope: !979)
!990 = !DILocation(line: 184, column: 18, scope: !979)
!991 = !DILocalVariable(name: "err", scope: !979, file: !10, line: 184, type: !13)
!992 = !DILocation(line: 184, column: 4, scope: !969)
!993 = !DILocation(line: 185, column: 11, scope: !979)
!994 = !DILocation(line: 186, column: 9, scope: !979)
!995 = !DILocation(line: 190, column: 25, scope: !979)
!996 = !DILocation(line: 190, column: 17, scope: !979)
!997 = !DILocation(line: 186, column: 35, scope: !979)
!998 = !DILocation(line: 187, column: 6, scope: !979)
!999 = !DILocation(line: 191, column: 11, scope: !979)
!1000 = !DILocation(line: 192, column: 9, scope: !979)
!1001 = !DILocation(line: 192, column: 35, scope: !979)
!1002 = !DILocation(line: 193, column: 6, scope: !979)
!1003 = !DILocation(line: 198, column: 19, scope: !969)
!1004 = !DILocation(line: 202, column: 21, scope: !1005, inlinedAt: !1008)
!1005 = distinct !DISubprogram(name: "subnet.dropSendBuffer", scope: null, file: !10, line: 202, type: !1006, isLocal: true, isDefinition: true, scopeLine: 202, isOptimized: false, unit: !1, retainedNodes: !3)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!41, !122}
!1008 = distinct !DILocation(line: 198, column: 3, scope: !969)
!1009 = !DILocalVariable(name: "buffer", arg: 1, scope: !1005, file: !10, line: 202, type: !122)
!1010 = !DILocation(line: 204, column: 3, scope: !1005, inlinedAt: !1008)
!1011 = !DILocation(line: 205, column: 3, scope: !1005, inlinedAt: !1008)
!1012 = !DILocation(line: 206, column: 3, scope: !1005, inlinedAt: !1008)
!1013 = !DILocation(line: 207, column: 4, scope: !1005, inlinedAt: !1008)
!1014 = !DILocation(line: 166, column: 8, scope: !960)
!1015 = !DILocation(line: 166, column: 6, scope: !960)
!1016 = distinct !DISubprogram(name: "subnet.sendLocalAddr..1command_line_arguments.Client", linkageName: "command_line_arguments.Client.sendLocalAddr", scope: null, file: !10, line: 291, type: !1017, isLocal: false, isDefinition: true, scopeLine: 291, isOptimized: false, unit: !1, retainedNodes: !3)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!13, !84, !84, !1019}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DICompositeType(tag: DW_TAG_structure_type, name: "Encoder", file: !10, line: 5, size: 1280, align: 8, elements: !1021)
!1021 = !{!1022, !1023, !1028, !1029, !1047, !1048, !1049}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !10, line: 5, baseType: !547, size: 64, align: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !10, line: 5, baseType: !1024, size: 192, align: 64, offset: 64)
!1024 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Writer,int,int}", file: !18, size: 192, align: 8, elements: !1025)
!1025 = !{!1026, !76, !77}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "sent", file: !10, line: 5, baseType: !363, size: 64, align: 64, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "countState", file: !10, line: 5, baseType: !1030, size: 64, align: 64, offset: 320)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.encoderState", file: !10, line: 5, size: 448, align: 8, elements: !1032)
!1032 = !{!1033, !1034, !1040, !1041, !1042, !1046}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "enc", file: !10, line: 5, baseType: !40, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !10, line: 5, baseType: !1035, size: 64, align: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/gob.encBuffer", file: !10, line: 5, size: 704, align: 8, elements: !1037)
!1037 = !{!1038, !1039}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "data", file: !10, line: 5, baseType: !150, size: 192, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", file: !10, line: 5, baseType: !678, size: 512, align: 8, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "sendZero", file: !10, line: 5, baseType: !50, size: 8, align: 8, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "fieldnum", file: !10, line: 5, baseType: !59, size: 64, align: 64, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !10, line: 5, baseType: !1043, size: 72, align: 8, offset: 256)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 72, align: 1, elements: !1044)
!1044 = !{!1045}
!1045 = !DISubrange(count: 9)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !10, line: 5, baseType: !40, size: 64, align: 64, offset: 384)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "freeList", file: !10, line: 5, baseType: !1030, size: 64, align: 64, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "byteBuf", file: !10, line: 5, baseType: !1036, size: 704, align: 64, offset: 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !10, line: 5, baseType: !13, size: 128, align: 64, offset: 1152)
!1050 = !DILocalVariable(name: "c", arg: 1, scope: !1016, file: !10, line: 291, type: !84)
!1051 = !DILocation(line: 291, column: 1, scope: !1016)
!1052 = !DILocalVariable(name: "encoder", arg: 2, scope: !1016, file: !10, line: 291, type: !1019)
!1053 = !DILocation(line: 291, column: 32, scope: !1016)
!1054 = !DILocation(line: 292, column: 29, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1016, file: !10, line: 291, column: 1)
!1056 = !DILocation(line: 292, column: 16, scope: !1055)
!1057 = !DILocalVariable(name: "err", scope: !1055, file: !10, line: 292, type: !13)
!1058 = !DILocation(line: 292, column: 2, scope: !1016)
!1059 = !DILocation(line: 293, column: 9, scope: !1055)
!1060 = !DILocation(line: 294, column: 7, scope: !1055)
!1061 = !DILocation(line: 294, column: 33, scope: !1055)
!1062 = !DILocation(line: 296, column: 24, scope: !1055)
!1063 = !DILocation(line: 296, column: 15, scope: !1055)
!1064 = !DILocation(line: 297, column: 9, scope: !1055)
!1065 = !DILocalVariable(name: "$ret3", scope: !1016, file: !10, line: 291, type: !13)
!1066 = !DILocation(line: 291, column: 54, scope: !1016)
!1067 = !DILocation(line: 298, column: 3, scope: !1055)
!1068 = !DILocation(line: 300, column: 2, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1055, file: !10, line: 300, column: 2)
!1070 = !DILocation(line: 301, column: 29, scope: !1069)
!1071 = !DILocation(line: 301, column: 16, scope: !1069)
!1072 = !DILocation(line: 302, column: 10, scope: !1069)
!1073 = !DILocation(line: 303, column: 8, scope: !1069)
!1074 = !DILocation(line: 303, column: 34, scope: !1069)
!1075 = !DILocation(line: 305, column: 24, scope: !1069)
!1076 = !DILocation(line: 305, column: 16, scope: !1069)
!1077 = !DILocation(line: 306, column: 10, scope: !1069)
!1078 = !DILocation(line: 307, column: 4, scope: !1069)
!1079 = !DILocation(line: 310, column: 2, scope: !1055)
!1080 = distinct !DISubprogram(name: "subnet.AddRouteEntry..1command_line_arguments.Reverser", linkageName: "command_line_arguments.Reverser.AddRouteEntry", scope: null, file: !695, line: 29, type: !1081, isLocal: false, isDefinition: true, scopeLine: 29, isOptimized: false, unit: !1, retainedNodes: !3)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!41, !1083, !1083, !102, !102, !55}
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!1084 = !DILocalVariable(name: "via", arg: 3, scope: !1080, file: !695, line: 29, type: !102)
!1085 = !DILocation(line: 29, column: 54, scope: !1080)
!1086 = !DILocalVariable(name: "destination", arg: 2, scope: !1080, file: !695, line: 29, type: !102)
