; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22cert\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22rand\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/rand\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/rand\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22rsa\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/rsa\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/rsa\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22x509\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/x509\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/x509\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./crl.go", directory: "/home/wangcong/go_path/src/github.com/twitchyliquid64/subnet/subnet/cert")
!3 = !{}
!4 = !{!5, !32, !35, !88, !150}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.crl", linkageName: "command_line_arguments.crl", scope: !1, file: !7, line: 21, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "crl.go", directory: ".")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.command-line-arguments.blacklistEntry,int,int}", file: !9, size: 192, align: 8, elements: !10)
!9 = !DIFile(filename: "", directory: "")
!10 = !{!11, !28, !29}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.blacklistEntry", file: !7, line: 15, size: 384, align: 8, elements: !14)
!14 = !{!15, !24, !30}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "Justification", file: !7, line: 16, baseType: !16, size: 128, align: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !17, line: 1, size: 128, align: 8, elements: !18)
!17 = !DIFile(filename: "<built-in>", directory: "")
!18 = !{!19, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !17, line: 1, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !17, line: 1, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !7, line: 17, baseType: !25, size: 192, align: 64, offset: 128)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !9, size: 192, align: 8, elements: !26)
!26 = !{!27, !28, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !20, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !9, line: 1, baseType: !23, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !9, line: 1, baseType: !23, size: 64, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "AddedEpoch", file: !7, line: 18, baseType: !31, size: 64, align: 64, offset: 320)
!31 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !17, line: 1, type: !34, isLocal: false, isDefinition: true)
!34 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "os.Stderr", linkageName: "os.Stderr", scope: !1, file: !7, line: 11, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !7, line: 10, size: 64, align: 8, elements: !39)
!39 = !{!40}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !7, line: 10, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !7, line: 10, size: 640, align: 8, elements: !43)
!43 = !{!44, !77, !78, !86, !87}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !7, line: 10, baseType: !45, size: 384, align: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !7, line: 10, size: 384, align: 8, elements: !46)
!46 = !{!47, !54, !55, !60, !71, !72, !74, !75, !76}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !7, line: 10, baseType: !48, size: 128, align: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !7, line: 10, size: 128, align: 8, elements: !49)
!49 = !{!50, !52, !53}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 10, baseType: !51, size: 64, align: 64)
!51 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !7, line: 10, baseType: !34, size: 32, align: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !7, line: 10, baseType: !34, size: 32, align: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !7, line: 10, baseType: !23, size: 64, align: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !7, line: 10, baseType: !56, size: 64, align: 64, offset: 192)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !7, line: 10, size: 64, align: 8, elements: !57)
!57 = !{!58}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !7, line: 10, baseType: !59, size: 64, align: 64)
!59 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !7, line: 10, baseType: !61, size: 64, align: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !9, size: 192, align: 8, elements: !63)
!63 = !{!64, !28, !29}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !7, line: 10, size: 128, align: 8, elements: !67)
!67 = !{!68, !69}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !7, line: 10, baseType: !20, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !7, line: 10, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !7, line: 10, baseType: !34, size: 32, align: 32, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !7, line: 10, baseType: !73, size: 8, align: 8, offset: 352)
!73 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !7, line: 10, baseType: !73, size: 8, align: 8, offset: 360)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !7, line: 10, baseType: !73, size: 8, align: 8, offset: 368)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !7, line: 10, baseType: !73, size: 8, align: 8, offset: 376)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 10, baseType: !16, size: 128, align: 64, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !7, line: 10, baseType: !79, size: 64, align: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !7, line: 10, size: 256, align: 8, elements: !81)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 10, baseType: !25, size: 192, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !7, line: 10, baseType: !84, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !7, line: 10, align: 8, elements: !3)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !7, line: 10, baseType: !73, size: 8, align: 8, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !7, line: 10, baseType: !73, size: 8, align: 8, offset: 584)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "command_line_arguments.ErrInsecureKeyBitSize", linkageName: "command_line_arguments.ErrInsecureKeyBitSize", scope: !1, file: !90, line: 19, type: !91, isLocal: false, isDefinition: true)
!90 = !DIFile(filename: "gen.go", directory: ".")
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !17, line: 1, size: 128, align: 8, elements: !92)
!92 = !{!93, !149}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !17, line: 1, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !9, size: 128, align: 8, elements: !96)
!96 = !{!97, !145}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 1, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !17, line: 1, size: 576, align: 8, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !106, !107, !117, !125, !126, !128, !144}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !17, line: 1, baseType: !59, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !17, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !17, line: 1, baseType: !34, size: 32, align: 32, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !17, line: 1, baseType: !21, size: 8, align: 8, offset: 160)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !17, line: 1, baseType: !21, size: 8, align: 8, offset: 168)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !17, line: 1, baseType: !21, size: 8, align: 8, offset: 176)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !17, line: 1, baseType: !108, size: 64, align: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !17, line: 1, size: 64, align: 8, elements: !110)
!110 = !{!111}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !17, line: 1, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!59, !115, !59}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIBasicType(name: "void")
!117 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !17, line: 1, baseType: !118, size: 64, align: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !17, line: 1, size: 64, align: 8, elements: !120)
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !17, line: 1, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!73, !115, !115}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !17, line: 1, baseType: !20, size: 64, align: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !17, line: 1, baseType: !127, size: 64, align: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !17, line: 1, baseType: !129, size: 64, align: 64, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !17, line: 1, size: 320, align: 8, elements: !131)
!131 = !{!132, !133, !134}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !17, line: 1, baseType: !127, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !17, line: 1, baseType: !127, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !17, line: 1, baseType: !135, size: 192, align: 64, offset: 128)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !9, size: 192, align: 8, elements: !136)
!136 = !{!137, !28, !29}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !17, line: 1, size: 320, align: 8, elements: !140)
!140 = !{!132, !133, !141, !142, !143}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !17, line: 1, baseType: !115, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !17, line: 1, baseType: !115, size: 64, align: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !17, line: 1, baseType: !115, size: 64, align: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !17, line: 1, baseType: !115, size: 64, align: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !9, line: 1, baseType: !146, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!16, !115}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !17, line: 1, baseType: !115, size: 64, align: 64, offset: 64)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "crypto_rand.Reader", linkageName: "crypto_rand.Reader", scope: !1, file: !90, line: 4, type: !152, isLocal: false, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !7, line: 4, size: 128, align: 8, elements: !153)
!153 = !{!154, !167}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 4, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !9, size: 128, align: 8, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 4, baseType: !98, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !9, line: 4, baseType: !160, size: 64, align: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!163, !115, !25}
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !9, size: 192, align: 8, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !9, line: 4, baseType: !23, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !9, line: 4, baseType: !91, size: 128, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !115, size: 64, align: 64, offset: 64)
!168 = distinct !DISubprogram(name: "cert.readCRL", scope: null, file: !7, line: 24, type: !169, isLocal: true, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !1, retainedNodes: !3)
!169 = !DISubroutineType(types: !170)
!170 = !{!171, !16}
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*.command-line-arguments.blacklistEntry,int,int},error}", file: !9, size: 320, align: 8, elements: !172)
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 24, baseType: !8, size: 192, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 24, baseType: !91, size: 128, align: 64, offset: 192)
!175 = !DILocalVariable(name: "path", arg: 1, scope: !168, file: !7, line: 24, type: !16)
!176 = !DILocation(line: 24, column: 14, scope: !168)
!177 = !DILocalVariable(name: "$ret1", scope: !168, file: !7, line: 24, type: !91)
!178 = !DILocation(line: 24, column: 46, scope: !168)
!179 = !DILocation(line: 25, column: 6, scope: !180)
!180 = distinct !DILexicalBlock(scope: !168, file: !7, line: 24, column: 1)
!181 = !DILocation(line: 37, column: 1, scope: !168)
!182 = !DILocalVariable(name: "temp", scope: !180, file: !7, line: 25, type: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!184 = !DILocation(line: 25, column: 6, scope: !168)
!185 = !DILocation(line: 26, column: 15, scope: !180)
!186 = !DILocalVariable(name: "f", scope: !180, file: !7, line: 26, type: !37)
!187 = !DILocation(line: 26, column: 2, scope: !168)
!188 = !DILocalVariable(name: "err", scope: !180, file: !7, line: 26, type: !91)
!189 = !DILocation(line: 27, column: 9, scope: !180)
!190 = !DILocation(line: 28, column: 3, scope: !180)
!191 = !DILocation(line: 30, column: 2, scope: !180)
!192 = !DILocation(line: 32, column: 23, scope: !180)
!193 = !DILocation(line: 32, column: 12, scope: !180)
!194 = !DILocalVariable(name: "d", scope: !180, file: !7, line: 32, type: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "Decoder", file: !7, line: 6, size: 3648, align: 8, elements: !197)
!197 = !{!198, !199, !200, !237, !238, !239, !240, !241, !242}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !7, line: 6, baseType: !152, size: 128, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 6, baseType: !25, size: 192, align: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "d", file: !7, line: 6, baseType: !201, size: 2112, align: 64, offset: 320)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/json.decodeState", file: !7, line: 6, size: 2112, align: 8, elements: !202)
!202 = !{!203, !204, !205, !228, !229, !234, !235, !236}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "data", file: !7, line: 6, baseType: !25, size: 192, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "off", file: !7, line: 6, baseType: !23, size: 64, align: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "scan", file: !7, line: 6, baseType: !206, size: 704, align: 64, offset: 256)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/json.scanner", file: !7, line: 6, size: 704, align: 8, elements: !207)
!207 = !{!208, !217, !218, !223, !224, !225, !226, !227}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "step", file: !7, line: 6, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 6, size: 64, align: 8, elements: !211)
!211 = !{!212}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 6, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!23, !216, !21}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "endTop", file: !7, line: 6, baseType: !73, size: 8, align: 8, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "parseState", file: !7, line: 6, baseType: !219, size: 192, align: 64, offset: 128)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !9, size: 192, align: 8, elements: !220)
!220 = !{!221, !28, !29}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !7, line: 6, baseType: !91, size: 128, align: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "redo", file: !7, line: 6, baseType: !73, size: 8, align: 8, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "redoCode", file: !7, line: 6, baseType: !23, size: 64, align: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "redoState", file: !7, line: 6, baseType: !209, size: 64, align: 64, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", file: !7, line: 6, baseType: !31, size: 64, align: 64, offset: 640)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "nextscan", file: !7, line: 6, baseType: !206, size: 704, align: 64, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "errorContext", file: !7, line: 6, baseType: !230, size: 256, align: 64, offset: 1664)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,string}", file: !9, size: 256, align: 8, elements: !231)
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Struct", file: !9, line: 6, baseType: !16, size: 128, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Field", file: !9, line: 6, baseType: !16, size: 128, align: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "savedError", file: !7, line: 6, baseType: !91, size: 128, align: 64, offset: 1920)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "useNumber", file: !7, line: 6, baseType: !73, size: 8, align: 8, offset: 2048)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "disallowUnknownFields", file: !7, line: 6, baseType: !73, size: 8, align: 8, offset: 2056)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "scanp", file: !7, line: 6, baseType: !23, size: 64, align: 64, offset: 2432)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "scanned", file: !7, line: 6, baseType: !31, size: 64, align: 64, offset: 2496)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "scan", file: !7, line: 6, baseType: !206, size: 704, align: 64, offset: 2560)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !7, line: 6, baseType: !91, size: 128, align: 64, offset: 3264)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tokenState", file: !7, line: 6, baseType: !23, size: 64, align: 64, offset: 3392)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tokenStack", file: !7, line: 6, baseType: !219, size: 192, align: 64, offset: 3456)
!243 = !DILocation(line: 32, column: 2, scope: !168)
!244 = !DILocation(line: 33, column: 21, scope: !245)
!245 = distinct !DILexicalBlock(scope: !180, file: !7, line: 33, column: 2)
!246 = !DILocation(line: 33, column: 13, scope: !245)
!247 = !DILocalVariable(name: "err", scope: !245, file: !7, line: 33, type: !91)
!248 = !DILocation(line: 33, column: 5, scope: !180)
!249 = !DILocation(line: 33, column: 33, scope: !245)
!250 = !DILocation(line: 34, column: 3, scope: !245)
!251 = !DILocation(line: 28, column: 3, scope: !168)
!252 = distinct !DISubprogram(name: "cert.command_line_arguments..thunk0", scope: null, file: !7, line: 30, type: !253, isLocal: true, isDefinition: true, scopeLine: 30, isOptimized: false, unit: !1, retainedNodes: !3)
!253 = !DISubroutineType(types: !254)
!254 = !{!73, !255}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*File}", file: !9, size: 64, align: 8, elements: !257)
!257 = !{!258}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !9, line: 30, baseType: !37, size: 64, align: 64)
!259 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !252, file: !7, line: 30, type: !255)
!260 = !DILocation(line: 30, column: 2, scope: !252)
!261 = !DILocalVariable(name: "$ret16", scope: !252, file: !7, line: 30, type: !73)
!262 = distinct !DISubprogram(name: "cert.AddToCRL", linkageName: "command_line_arguments.AddToCRL", scope: null, file: !7, line: 41, type: !263, isLocal: false, isDefinition: true, scopeLine: 41, isOptimized: false, unit: !1, retainedNodes: !3)
!263 = !DISubroutineType(types: !264)
!264 = !{!91, !16, !16, !16}
!265 = !DILocalVariable(name: "crlPath", arg: 1, scope: !262, file: !7, line: 41, type: !16)
!266 = !DILocation(line: 41, column: 15, scope: !262)
!267 = !DILocalVariable(name: "certPath", arg: 2, scope: !262, file: !7, line: 41, type: !16)
!268 = !DILocation(line: 41, column: 24, scope: !262)
!269 = !DILocalVariable(name: "justification", arg: 3, scope: !262, file: !7, line: 41, type: !16)
!270 = !DILocation(line: 41, column: 34, scope: !262)
!271 = !DILocation(line: 42, column: 26, scope: !272)
!272 = distinct !DILexicalBlock(scope: !262, file: !7, line: 41, column: 1)
!273 = !DILocalVariable(name: "err", scope: !272, file: !7, line: 42, type: !91)
!274 = !DILocation(line: 42, column: 2, scope: !262)
!275 = !DILocation(line: 43, column: 9, scope: !272)
!276 = !DILocalVariable(name: "$ret2", scope: !262, file: !7, line: 41, type: !91)
!277 = !DILocation(line: 41, column: 56, scope: !262)
!278 = !DILocation(line: 44, column: 3, scope: !272)
!279 = !DILocalVariable(name: "pemBytes", scope: !272, file: !7, line: 42, type: !25)
!280 = !DILocation(line: 46, column: 25, scope: !272)
!281 = !DILocalVariable(name: "certDERBlock", scope: !272, file: !7, line: 46, type: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "Block", file: !7, line: 5, size: 384, align: 8, elements: !284)
!284 = !{!285, !286, !300}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !7, line: 5, baseType: !16, size: 128, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Headers", file: !7, line: 5, baseType: !287, size: 64, align: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !17, line: 1, size: 384, align: 8, elements: !289)
!289 = !{!290, !291, !292, !293, !295, !296, !297, !298, !299}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !17, line: 1, baseType: !23, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !17, line: 1, baseType: !21, size: 8, align: 8, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !17, line: 1, baseType: !21, size: 8, align: 8, offset: 72)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !17, line: 1, baseType: !294, size: 16, align: 16, offset: 80)
!294 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !17, line: 1, baseType: !34, size: 32, align: 32, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !17, line: 1, baseType: !115, size: 64, align: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !17, line: 1, baseType: !115, size: 64, align: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !17, line: 1, baseType: !59, size: 64, align: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !17, line: 1, baseType: !115, size: 64, align: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Bytes", file: !7, line: 5, baseType: !25, size: 192, align: 64, offset: 192)
!301 = !DILocation(line: 46, column: 2, scope: !262)
!302 = !DILocation(line: 47, column: 18, scope: !272)
!303 = !DILocation(line: 48, column: 17, scope: !272)
!304 = !DILocation(line: 48, column: 3, scope: !272)
!305 = !DILocation(line: 50, column: 49, scope: !272)
!306 = !DILocation(line: 50, column: 20, scope: !272)
!307 = !DILocalVariable(name: "cert", scope: !272, file: !7, line: 50, type: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !7, line: 5, size: 10624, align: 8, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !316, !317, !319, !321, !325, !326, !339, !367, !368, !401, !402, !404, !414, !415, !420, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !445, !468, !469, !470, !471, !482, !483, !484, !485, !486, !487, !488}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !7, line: 5, baseType: !25, size: 192, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !7, line: 5, baseType: !25, size: 192, align: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !7, line: 5, baseType: !25, size: 192, align: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !7, line: 5, baseType: !25, size: 192, align: 64, offset: 576)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !7, line: 5, baseType: !25, size: 192, align: 64, offset: 768)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !7, line: 5, baseType: !25, size: 192, align: 64, offset: 960)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !7, line: 5, baseType: !318, size: 64, align: 64, offset: 1152)
!318 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !7, line: 5, baseType: !320, size: 64, align: 64, offset: 1216)
!320 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !7, line: 5, baseType: !322, size: 128, align: 64, offset: 1280)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "Token", file: !7, line: 6, size: 128, align: 8, elements: !323)
!323 = !{!324, !167}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !7, line: 1, baseType: !98, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !7, line: 5, baseType: !23, size: 64, align: 64, offset: 1408)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !7, line: 5, baseType: !327, size: 64, align: 64, offset: 1472)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !7, line: 5, size: 256, align: 8, elements: !329)
!329 = !{!330, !331}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !7, line: 5, baseType: !73, size: 8, align: 8)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !7, line: 5, baseType: !332, size: 192, align: 64, offset: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !7, line: 5, size: 192, align: 8, elements: !333)
!333 = !{!334, !337, !338}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !7, line: 1, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !7, line: 1, baseType: !23, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !7, line: 1, baseType: !23, size: 64, align: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !7, line: 5, baseType: !340, size: 1984, align: 64, offset: 1536)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !7, line: 5, size: 1984, align: 8, elements: !341)
!341 = !{!342, !346, !347, !348, !349, !350, !351, !352, !353, !354, !366}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !7, line: 5, baseType: !343, size: 192, align: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !9, size: 192, align: 8, elements: !344)
!344 = !{!345, !28, !29}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !127, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !7, line: 5, baseType: !343, size: 192, align: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !7, line: 5, baseType: !343, size: 192, align: 64, offset: 384)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !7, line: 5, baseType: !343, size: 192, align: 64, offset: 576)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !7, line: 5, baseType: !343, size: 192, align: 64, offset: 768)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !7, line: 5, baseType: !343, size: 192, align: 64, offset: 960)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !7, line: 5, baseType: !343, size: 192, align: 64, offset: 1152)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !7, line: 5, baseType: !16, size: 128, align: 64, offset: 1344)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !7, line: 5, baseType: !16, size: 128, align: 64, offset: 1472)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !7, line: 5, baseType: !355, size: 192, align: 64, offset: 1600)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !9, size: 192, align: 8, elements: !356)
!356 = !{!357, !28, !29}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !7, line: 5, size: 320, align: 8, elements: !360)
!360 = !{!361, !365}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !7, line: 5, baseType: !362, size: 192, align: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !7, line: 5, size: 192, align: 8, elements: !363)
!363 = !{!364, !337, !338}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !7, line: 1, baseType: !222, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 5, baseType: !322, size: 128, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !7, line: 5, baseType: !355, size: 192, align: 64, offset: 1792)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !7, line: 5, baseType: !340, size: 1984, align: 64, offset: 3520)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !7, line: 5, baseType: !369, size: 192, align: 64, offset: 5504)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 5, size: 192, align: 8, elements: !370)
!370 = !{!371, !372, !373}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 5, baseType: !51, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 5, baseType: !31, size: 64, align: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 5, baseType: !374, size: 64, align: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 5, size: 704, align: 8, elements: !376)
!376 = !{!377, !378, !387, !398, !399, !400}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 5, baseType: !16, size: 128, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 5, baseType: !379, size: 192, align: 64, offset: 128)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !9, size: 192, align: 8, elements: !380)
!380 = !{!381, !28, !29}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 5, size: 256, align: 8, elements: !384)
!384 = !{!377, !385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 5, baseType: !23, size: 64, align: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 5, baseType: !73, size: 8, align: 8, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 5, baseType: !388, size: 192, align: 64, offset: 320)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !9, size: 192, align: 8, elements: !389)
!389 = !{!390, !28, !29}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 5, size: 128, align: 8, elements: !393)
!393 = !{!394, !395, !396, !397}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 5, baseType: !31, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 5, baseType: !21, size: 8, align: 8, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 5, baseType: !73, size: 8, align: 8, offset: 72)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 5, baseType: !73, size: 8, align: 8, offset: 80)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 5, baseType: !31, size: 64, align: 64, offset: 512)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 5, baseType: !31, size: 64, align: 64, offset: 576)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 5, baseType: !382, size: 64, align: 64, offset: 640)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !7, line: 5, baseType: !369, size: 192, align: 64, offset: 5696)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !7, line: 5, baseType: !403, size: 64, align: 64, offset: 5888)
!403 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !7, line: 5, baseType: !405, size: 192, align: 64, offset: 5952)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !9, size: 192, align: 8, elements: !406)
!406 = !{!407, !28, !29}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !7, line: 5, size: 448, align: 8, elements: !410)
!410 = !{!411, !412, !413}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !7, line: 5, baseType: !362, size: 192, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !7, line: 5, baseType: !73, size: 8, align: 8, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 5, baseType: !25, size: 192, align: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !7, line: 5, baseType: !405, size: 192, align: 64, offset: 6144)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !7, line: 5, baseType: !416, size: 192, align: 64, offset: 6336)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !9, size: 192, align: 8, elements: !417)
!417 = !{!418, !28, !29}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !7, line: 5, baseType: !421, size: 192, align: 64, offset: 6528)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !9, size: 192, align: 8, elements: !422)
!422 = !{!423, !28, !29}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !7, line: 5, baseType: !416, size: 192, align: 64, offset: 6720)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !7, line: 5, baseType: !73, size: 8, align: 8, offset: 6912)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !7, line: 5, baseType: !73, size: 8, align: 8, offset: 6920)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !7, line: 5, baseType: !23, size: 64, align: 64, offset: 6976)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !7, line: 5, baseType: !73, size: 8, align: 8, offset: 7040)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !7, line: 5, baseType: !25, size: 192, align: 64, offset: 7104)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !7, line: 5, baseType: !25, size: 192, align: 64, offset: 7296)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !7, line: 5, baseType: !343, size: 192, align: 64, offset: 7488)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !7, line: 5, baseType: !343, size: 192, align: 64, offset: 7680)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !7, line: 5, baseType: !343, size: 192, align: 64, offset: 7872)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !7, line: 5, baseType: !343, size: 192, align: 64, offset: 8064)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !7, line: 5, baseType: !438, size: 192, align: 64, offset: 8256)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !9, size: 192, align: 8, elements: !439)
!439 = !{!440, !28, !29}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !7, line: 5, size: 192, align: 8, elements: !443)
!443 = !{!444, !337, !338}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !7, line: 1, baseType: !20, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !7, line: 5, baseType: !446, size: 192, align: 64, offset: 8448)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !9, size: 192, align: 8, elements: !447)
!447 = !{!448, !28, !29}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !7, line: 5, size: 1024, align: 8, elements: !452)
!452 = !{!453, !454, !455, !462, !463, !464, !465, !466, !467}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !7, line: 5, baseType: !16, size: 128, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !7, line: 5, baseType: !16, size: 128, align: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !7, line: 5, baseType: !456, size: 64, align: 64, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !7, line: 5, size: 320, align: 8, elements: !458)
!458 = !{!459, !460, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !7, line: 5, baseType: !16, size: 128, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !7, line: 5, baseType: !16, size: 128, align: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !7, line: 5, baseType: !73, size: 8, align: 8, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !7, line: 5, baseType: !16, size: 128, align: 64, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !7, line: 5, baseType: !16, size: 128, align: 64, offset: 448)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !7, line: 5, baseType: !16, size: 128, align: 64, offset: 576)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !7, line: 5, baseType: !73, size: 8, align: 8, offset: 704)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !7, line: 5, baseType: !16, size: 128, align: 64, offset: 768)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !7, line: 5, baseType: !16, size: 128, align: 64, offset: 896)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !7, line: 5, baseType: !73, size: 8, align: 8, offset: 8640)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !7, line: 5, baseType: !343, size: 192, align: 64, offset: 8704)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !7, line: 5, baseType: !343, size: 192, align: 64, offset: 8896)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !7, line: 5, baseType: !472, size: 192, align: 64, offset: 9088)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !9, size: 192, align: 8, elements: !473)
!473 = !{!474, !28, !29}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !475, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !7, line: 5, size: 384, align: 8, elements: !478)
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !7, line: 5, baseType: !442, size: 192, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !7, line: 5, baseType: !481, size: 192, align: 64, offset: 192)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !7, line: 5, size: 192, align: 8, elements: !443)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !7, line: 5, baseType: !472, size: 192, align: 64, offset: 9280)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !7, line: 5, baseType: !343, size: 192, align: 64, offset: 9472)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !7, line: 5, baseType: !343, size: 192, align: 64, offset: 9664)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !7, line: 5, baseType: !343, size: 192, align: 64, offset: 9856)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !7, line: 5, baseType: !343, size: 192, align: 64, offset: 10048)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !7, line: 5, baseType: !343, size: 192, align: 64, offset: 10240)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !7, line: 5, baseType: !416, size: 192, align: 64, offset: 10432)
!489 = !DILocation(line: 50, column: 2, scope: !262)
!490 = !DILocation(line: 51, column: 9, scope: !272)
!491 = !DILocation(line: 52, column: 3, scope: !272)
!492 = !DILocation(line: 54, column: 47, scope: !272)
!493 = !DILocation(line: 54, column: 22, scope: !272)
!494 = !DILocation(line: 55, column: 9, scope: !272)
!495 = !DILocation(line: 56, column: 3, scope: !272)
!496 = !DILocation(line: 59, column: 18, scope: !272)
!497 = !DILocation(line: 60, column: 9, scope: !272)
!498 = !DILocation(line: 60, column: 23, scope: !272)
!499 = !DILocation(line: 60, column: 19, scope: !272)
!500 = !DILocation(line: 61, column: 3, scope: !272)
!501 = !DILocation(line: 66, column: 23, scope: !272)
!502 = !DILocation(line: 66, column: 28, scope: !272)
!503 = !DILocation(line: 63, column: 12, scope: !272)
!504 = !DILocation(line: 63, column: 28, scope: !272)
!505 = !DILocation(line: 63, column: 10, scope: !272)
!506 = !DILocation(line: 69, column: 37, scope: !272)
!507 = !DILocation(line: 69, column: 23, scope: !272)
!508 = !DILocation(line: 70, column: 9, scope: !272)
!509 = !DILocation(line: 71, column: 3, scope: !272)
!510 = !DILocalVariable(name: "crlData", scope: !272, file: !7, line: 69, type: !25)
!511 = !DILocation(line: 69, column: 2, scope: !262)
!512 = !DILocation(line: 73, column: 16, scope: !272)
!513 = !DILocation(line: 73, column: 2, scope: !272)
!514 = distinct !DISubprogram(name: "cert.InitCRL", linkageName: "command_line_arguments.InitCRL", scope: null, file: !7, line: 77, type: !515, isLocal: false, isDefinition: true, scopeLine: 77, isOptimized: false, unit: !1, retainedNodes: !3)
!515 = !DISubroutineType(types: !516)
!516 = !{!91, !16}
!517 = !DILocalVariable(name: "param", arg: 1, scope: !514, file: !7, line: 77, type: !16)
!518 = !DILocation(line: 77, column: 14, scope: !514)
!519 = !DILocalVariable(name: "path", scope: !514, file: !7, line: 77, type: !127)
!520 = !DILocation(line: 78, column: 12, scope: !521)
!521 = distinct !DILexicalBlock(scope: !514, file: !7, line: 77, column: 1)
!522 = !DILocalVariable(name: "err", scope: !521, file: !7, line: 78, type: !91)
!523 = !DILocation(line: 78, column: 2, scope: !514)
!524 = !DILocation(line: 79, column: 9, scope: !521)
!525 = !DILocation(line: 80, column: 3, scope: !521)
!526 = !DILocalVariable(name: "$ret3", scope: !514, file: !7, line: 77, type: !91)
!527 = !DILocation(line: 77, column: 27, scope: !514)
!528 = !DILocation(line: 82, column: 6, scope: !521)
!529 = !DILocation(line: 83, column: 5, scope: !521)
!530 = !DILocation(line: 83, column: 2, scope: !521)
!531 = !DILocation(line: 94, column: 2, scope: !521)
!532 = distinct !DISubprogram(name: "cert.InitCRL..func1", scope: null, file: !7, line: 83, type: !533, isLocal: true, isDefinition: true, scopeLine: 83, isOptimized: false, unit: !1, retainedNodes: !3)
!533 = !DISubroutineType(types: !534)
!534 = !{!116}
!535 = !DILocation(line: 85, column: 9, scope: !536)
!536 = distinct !DILexicalBlock(scope: !532, file: !7, line: 84, column: 7)
!537 = !DILocation(line: 86, column: 22, scope: !536)
!538 = !DILocation(line: 86, column: 14, scope: !536)
!539 = !DILocalVariable(name: "err", scope: !536, file: !7, line: 86, type: !91)
!540 = !DILocation(line: 86, column: 4, scope: !532)
!541 = !DILocation(line: 87, column: 11, scope: !536)
!542 = !DILocation(line: 88, column: 9, scope: !536)
!543 = !DILocation(line: 90, column: 59, scope: !536)
!544 = !DILocation(line: 90, column: 9, scope: !536)
!545 = !DILocation(line: 90, column: 20, scope: !536)
!546 = distinct !DISubprogram(name: "cert.command_line_arguments..thunk1", scope: null, file: !7, line: 83, type: !547, isLocal: true, isDefinition: true, scopeLine: 83, isOptimized: false, unit: !1, retainedNodes: !3)
!547 = !DISubroutineType(types: !548)
!548 = !{!116, !549}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*__go_descriptor}", file: !9, size: 64, align: 8, elements: !551)
!551 = !{!552}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !9, line: 83, baseType: !553, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 83, size: 64, align: 8, elements: !555)
!555 = !{!556}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 83, baseType: !557, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!558 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !546, file: !7, line: 83, type: !549)
!559 = !DILocation(line: 83, column: 2, scope: !546)
!560 = distinct !DISubprogram(name: "cert.CheckCRL", linkageName: "command_line_arguments.CheckCRL", scope: null, file: !7, line: 98, type: !561, isLocal: false, isDefinition: true, scopeLine: 98, isOptimized: false, unit: !1, retainedNodes: !3)
!561 = !DISubroutineType(types: !562)
!562 = !{!91, !308}
!563 = !DILocalVariable(name: "cert", arg: 1, scope: !560, file: !7, line: 98, type: !308)
!564 = !DILocation(line: 98, column: 15, scope: !560)
!565 = !DILocation(line: 99, column: 9, scope: !566)
!566 = distinct !DILexicalBlock(scope: !560, file: !7, line: 98, column: 1)
!567 = !DILocation(line: 99, column: 14, scope: !566)
!568 = !DILocalVariable(name: "$ret4", scope: !560, file: !7, line: 98, type: !91)
!569 = !DILocation(line: 98, column: 39, scope: !560)
!570 = !DILocation(line: 100, column: 3, scope: !566)
!571 = !DILocation(line: 102, column: 47, scope: !566)
!572 = !DILocation(line: 102, column: 22, scope: !566)
!573 = !DILocalVariable(name: "err", scope: !566, file: !7, line: 102, type: !91)
!574 = !DILocation(line: 102, column: 2, scope: !560)
!575 = !DILocation(line: 103, column: 9, scope: !566)
!576 = !DILocation(line: 104, column: 3, scope: !566)
!577 = !DILocalVariable(name: "i", scope: !578, file: !7, line: 107, type: !23)
!578 = distinct !DILexicalBlock(scope: !566, file: !7, line: 107, column: 2)
!579 = !DILocation(line: 107, column: 6, scope: !566)
!580 = !DILocation(line: 107, column: 2, scope: !578)
!581 = !DILocalVariable(name: "pubKey", scope: !566, file: !7, line: 102, type: !25)
!582 = !DILocation(line: 108, column: 12, scope: !578)
!583 = !DILocation(line: 108, column: 41, scope: !578)
!584 = !DILocation(line: 109, column: 15, scope: !578)
!585 = !DILocation(line: 109, column: 4, scope: !578)
!586 = !DILocation(line: 112, column: 2, scope: !566)
!587 = distinct !DISubprogram(name: "cert.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 1, type: !533, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!588 = !DILocation(line: 1, column: 1, scope: !589)
!589 = !DILexicalBlockFile(scope: !587, file: !17, discriminator: 0)
!590 = !DILocation(line: 19, column: 36, scope: !591)
!591 = !DILexicalBlockFile(scope: !587, file: !90, discriminator: 0)
!592 = !DILocation(line: 19, column: 5, scope: !591)
!593 = distinct !DISubprogram(name: "cert.LoadPrivateCertPEM", linkageName: "command_line_arguments.LoadPrivateCertPEM", scope: null, file: !90, line: 22, type: !594, isLocal: false, isDefinition: true, scopeLine: 22, isOptimized: false, unit: !1, retainedNodes: !3)
!594 = !DISubroutineType(types: !595)
!595 = !{!596, !25, !25}
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,*PrivateKey,error}", file: !9, size: 256, align: 8, elements: !597)
!597 = !{!598, !599, !630}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 22, baseType: !308, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 22, baseType: !600, size: 64, align: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !7, line: 5, size: 768, align: 8, elements: !602)
!602 = !{!603, !608, !609, !614}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !7, line: 5, baseType: !604, size: 128, align: 64)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "PublicKey", file: !7, line: 5, size: 128, align: 8, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "N", file: !7, line: 5, baseType: !327, size: 64, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "E", file: !7, line: 5, baseType: !23, size: 64, align: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "D", file: !7, line: 5, baseType: !327, size: 64, align: 64, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Primes", file: !7, line: 5, baseType: !610, size: 192, align: 64, offset: 192)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Int,int,int}", file: !9, size: 192, align: 8, elements: !611)
!611 = !{!612, !28, !29}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !613, size: 64, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Precomputed", file: !7, line: 5, baseType: !615, size: 384, align: 64, offset: 384)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrecomputedValues", file: !7, line: 5, size: 384, align: 8, elements: !616)
!616 = !{!617, !618, !619, !620}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Dp", file: !7, line: 5, baseType: !327, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Dq", file: !7, line: 5, baseType: !327, size: 64, align: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Qinv", file: !7, line: 5, baseType: !327, size: 64, align: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "CRTValues", file: !7, line: 5, baseType: !621, size: 192, align: 64, offset: 192)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*CRTValue,int,int}", file: !9, size: 192, align: 8, elements: !622)
!622 = !{!623, !28, !29}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !624, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "CRTValue", file: !7, line: 5, size: 192, align: 8, elements: !626)
!626 = !{!627, !628, !629}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Exp", file: !7, line: 5, baseType: !327, size: 64, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Coeff", file: !7, line: 5, baseType: !327, size: 64, align: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "R", file: !7, line: 5, baseType: !327, size: 64, align: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 22, baseType: !91, size: 128, align: 64, offset: 128)
!631 = !DILocalVariable(name: "keyBytes", arg: 2, scope: !593, file: !90, line: 22, type: !25)
!632 = !DILocation(line: 22, column: 43, scope: !593)
!633 = !DILocalVariable(name: "bytesCert", arg: 1, scope: !593, file: !90, line: 22, type: !25)
!634 = !DILocation(line: 22, column: 25, scope: !593)
!635 = !DILocalVariable(name: "$ret5", scope: !593, file: !90, line: 22, type: !308)
!636 = !DILocation(line: 22, column: 61, scope: !593)
!637 = !DILocalVariable(name: "$ret6", scope: !593, file: !90, line: 22, type: !600)
!638 = !DILocation(line: 22, column: 80, scope: !593)
!639 = !DILocation(line: 23, column: 25, scope: !640)
!640 = distinct !DILexicalBlock(scope: !593, file: !90, line: 22, column: 1)
!641 = !DILocalVariable(name: "certDERBlock", scope: !640, file: !90, line: 23, type: !282)
!642 = !DILocation(line: 23, column: 2, scope: !593)
!643 = !DILocation(line: 24, column: 18, scope: !640)
!644 = !DILocation(line: 25, column: 27, scope: !640)
!645 = !DILocalVariable(name: "$ret7", scope: !593, file: !90, line: 22, type: !91)
!646 = !DILocation(line: 22, column: 97, scope: !593)
!647 = !DILocation(line: 25, column: 3, scope: !640)
!648 = !DILocation(line: 27, column: 49, scope: !640)
!649 = !DILocation(line: 27, column: 20, scope: !640)
!650 = !DILocalVariable(name: "cert", scope: !640, file: !90, line: 27, type: !308)
!651 = !DILocation(line: 27, column: 2, scope: !593)
!652 = !DILocalVariable(name: "err", scope: !640, file: !90, line: 27, type: !91)
!653 = !DILocation(line: 28, column: 9, scope: !640)
!654 = !DILocation(line: 29, column: 3, scope: !640)
!655 = !DILocation(line: 32, column: 21, scope: !640)
!656 = !DILocalVariable(name: "keyBlock", scope: !640, file: !90, line: 32, type: !282)
!657 = !DILocation(line: 32, column: 2, scope: !593)
!658 = !DILocation(line: 33, column: 14, scope: !640)
!659 = !DILocation(line: 34, column: 27, scope: !640)
!660 = !DILocation(line: 34, column: 3, scope: !640)
!661 = !DILocation(line: 36, column: 49, scope: !640)
!662 = !DILocation(line: 36, column: 20, scope: !640)
!663 = !DILocation(line: 37, column: 9, scope: !640)
!664 = !DILocation(line: 38, column: 3, scope: !640)
!665 = !DILocalVariable(name: "priv", scope: !640, file: !90, line: 36, type: !600)
!666 = !DILocation(line: 36, column: 2, scope: !593)
!667 = !DILocation(line: 40, column: 2, scope: !640)
!668 = distinct !DISubprogram(name: "cert.LoadPrivateCertFromFilePEM", linkageName: "command_line_arguments.LoadPrivateCertFromFilePEM", scope: null, file: !90, line: 45, type: !669, isLocal: false, isDefinition: true, scopeLine: 45, isOptimized: false, unit: !1, retainedNodes: !3)
!669 = !DISubroutineType(types: !670)
!670 = !{!596, !16, !16}
!671 = !DILocalVariable(name: "certPath", arg: 1, scope: !668, file: !90, line: 45, type: !16)
!672 = !DILocation(line: 45, column: 33, scope: !668)
!673 = !DILocalVariable(name: "keyPath", arg: 2, scope: !668, file: !90, line: 45, type: !16)
!674 = !DILocation(line: 45, column: 43, scope: !668)
!675 = !DILocalVariable(name: "$ret8", scope: !668, file: !90, line: 45, type: !308)
!676 = !DILocation(line: 45, column: 60, scope: !668)
!677 = !DILocalVariable(name: "$ret9", scope: !668, file: !90, line: 45, type: !600)
!678 = !DILocation(line: 45, column: 79, scope: !668)
!679 = !DILocation(line: 46, column: 27, scope: !680)
!680 = distinct !DILexicalBlock(scope: !668, file: !90, line: 45, column: 1)
!681 = !DILocalVariable(name: "err", scope: !680, file: !90, line: 46, type: !91)
!682 = !DILocation(line: 46, column: 2, scope: !668)
!683 = !DILocation(line: 47, column: 9, scope: !680)
!684 = !DILocalVariable(name: "$ret10", scope: !668, file: !90, line: 45, type: !91)
!685 = !DILocation(line: 45, column: 96, scope: !668)
!686 = !DILocation(line: 48, column: 3, scope: !680)
!687 = !DILocation(line: 50, column: 26, scope: !680)
!688 = !DILocation(line: 51, column: 9, scope: !680)
!689 = !DILocation(line: 52, column: 3, scope: !680)
!690 = !DILocalVariable(name: "certBytes", scope: !680, file: !90, line: 46, type: !25)
!691 = !DILocalVariable(name: "keyBytes", scope: !680, file: !90, line: 50, type: !25)
!692 = !DILocation(line: 50, column: 2, scope: !668)
!693 = !DILocation(line: 54, column: 9, scope: !680)
!694 = !DILocation(line: 54, column: 2, scope: !680)
!695 = distinct !DISubprogram(name: "cert.GenerateRSA", linkageName: "command_line_arguments.GenerateRSA", scope: null, file: !90, line: 58, type: !696, isLocal: false, isDefinition: true, scopeLine: 58, isOptimized: false, unit: !1, retainedNodes: !3)
!696 = !DISubroutineType(types: !697)
!697 = !{!698, !23}
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*PrivateKey,error}", file: !9, size: 192, align: 8, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 5, baseType: !600, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 5, baseType: !91, size: 128, align: 64, offset: 64)
!702 = !DILocalVariable(name: "bitSize", arg: 1, scope: !695, file: !90, line: 58, type: !23)
!703 = !DILocation(line: 58, column: 18, scope: !695)
!704 = !DILocalVariable(name: "$ret11", scope: !695, file: !90, line: 58, type: !600)
!705 = !DILocation(line: 58, column: 32, scope: !695)
!706 = !DILocation(line: 59, column: 13, scope: !695)
!707 = !DILocation(line: 60, column: 3, scope: !695)
!708 = !DILocation(line: 63, column: 13, scope: !695)
!709 = !DILocation(line: 63, column: 2, scope: !695)
!710 = distinct !DISubprogram(name: "cert.makeBasicCert", scope: null, file: !90, line: 66, type: !711, isLocal: true, isDefinition: true, scopeLine: 66, isOptimized: false, unit: !1, retainedNodes: !3)
!711 = !DISubroutineType(types: !712)
!712 = !{!308, !369}
!713 = !DILocalVariable(name: "now", arg: 1, scope: !710, file: !90, line: 66, type: !369)
!714 = !DILocation(line: 66, column: 20, scope: !710)
!715 = !DILocalVariable(name: "$ret13", scope: !710, file: !90, line: 66, type: !308)
!716 = !DILocation(line: 66, column: 35, scope: !710)
!717 = !DILocation(line: 69, column: 40, scope: !718)
!718 = distinct !DILexicalBlock(scope: !710, file: !90, line: 66, column: 1)
!719 = !DILocalVariable(name: "subjectKeyNum", scope: !718, file: !90, line: 69, type: !51)
!720 = !DILocation(line: 69, column: 2, scope: !710)
!721 = !DILocation(line: 70, column: 24, scope: !718)
!722 = !DILocalVariable(name: "subjectKeyBytes", scope: !718, file: !90, line: 70, type: !25)
!723 = !DILocation(line: 70, column: 6, scope: !710)
!724 = !DILocation(line: 71, column: 9, scope: !718)
!725 = !DILocation(line: 74, column: 48, scope: !718)
!726 = !DILocation(line: 74, column: 21, scope: !718)
!727 = !DILocation(line: 81, column: 20, scope: !718)
!728 = !DILocation(line: 76, column: 24, scope: !718)
!729 = !DILocation(line: 77, column: 24, scope: !718)
!730 = !DILocation(line: 78, column: 24, scope: !718)
!731 = !DILocation(line: 82, column: 17, scope: !718)
!732 = !DILocation(line: 82, column: 32, scope: !718)
!733 = !DILocation(line: 73, column: 9, scope: !718)
!734 = !DILocation(line: 73, column: 15, scope: !718)
!735 = !DILocation(line: 73, column: 2, scope: !718)
!736 = distinct !DISubprogram(name: "cert.IssueClientCert", linkageName: "command_line_arguments.IssueClientCert", scope: null, file: !90, line: 87, type: !737, isLocal: false, isDefinition: true, scopeLine: 87, isOptimized: false, unit: !1, retainedNodes: !3)
!737 = !DISubroutineType(types: !738)
!738 = !{!91, !16, !16, !16, !16}
!739 = !DILocalVariable(name: "clientKeyPath", arg: 4, scope: !736, file: !90, line: 87, type: !16)
!740 = !DILocation(line: 87, column: 61, scope: !736)
!741 = !DILocalVariable(name: "CACertPath", arg: 1, scope: !736, file: !90, line: 87, type: !16)
!742 = !DILocation(line: 87, column: 22, scope: !736)
!743 = !DILocalVariable(name: "CAKeyPath", arg: 2, scope: !736, file: !90, line: 87, type: !16)
!744 = !DILocation(line: 87, column: 34, scope: !736)
!745 = !DILocalVariable(name: "clientCertPath", arg: 3, scope: !736, file: !90, line: 87, type: !16)
!746 = !DILocation(line: 87, column: 45, scope: !736)
!747 = !DILocation(line: 88, column: 26, scope: !748)
!748 = distinct !DILexicalBlock(scope: !736, file: !90, line: 87, column: 1)
!749 = !DILocation(line: 88, column: 31, scope: !748)
!750 = !DILocation(line: 88, column: 16, scope: !748)
!751 = !DILocation(line: 89, column: 14, scope: !748)
!752 = !DILocalVariable(name: "now", scope: !748, file: !90, line: 89, type: !369)
!753 = !DILocation(line: 89, column: 2, scope: !736)
!754 = !DILocation(line: 94, column: 10, scope: !748)
!755 = !DILocalVariable(name: "cert", scope: !748, file: !90, line: 94, type: !308)
!756 = !DILocation(line: 94, column: 2, scope: !736)
!757 = !DILocation(line: 95, column: 6, scope: !748)
!758 = !DILocation(line: 95, column: 12, scope: !748)
!759 = !DILocation(line: 96, column: 6, scope: !748)
