; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22command\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22cli\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/codegangsta/cli\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/codegangsta/cli\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22constants\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/timakin/gopli/constants\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/timakin/gopli/constants\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22database\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/timakin/gopli/database\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/timakin/gopli/database\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22lib\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3)
!2 = !DIFile(filename: "./sync.go", directory: "/home/wangcong/go_path/src/github.com/timakin/gopli/command")
!3 = !{}
!4 = distinct !DISubprogram(name: "command.CmdSync", linkageName: "command_line_arguments.CmdSync", scope: null, file: !5, line: 11, type: !6, isLocal: false, isDefinition: true, scopeLine: 11, isOptimized: false, unit: !1, retainedNodes: !3)
!5 = !DIFile(filename: "sync.go", directory: ".")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !9}
!8 = !DIBasicType(name: "void")
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !5, line: 4, size: 2688, align: 8, elements: !11)
!11 = !{!12, !313, !314, !315, !316, !317}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "App", file: !5, line: 4, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "App", file: !5, line: 4, size: 3392, align: 8, elements: !15)
!15 = !{!16, !25, !26, !27, !28, !29, !30, !31, !220, !221, !222, !223, !224, !233, !234, !235, !236, !237, !245, !246, !281, !289, !290, !291, !292, !293, !294, !302, !303, !311, !312}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !5, line: 4, baseType: !17, size: 128, align: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !18, line: 1, size: 128, align: 8, elements: !19)
!18 = !DIFile(filename: "<built-in>", directory: "")
!19 = !{!20, !23}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !18, line: 1, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !18, line: 1, baseType: !24, size: 64, align: 64, offset: 64)
!24 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "HelpName", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Usage", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "UsageText", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ArgsUsage", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 512)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 640)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Description", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 768)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Commands", file: !5, line: 4, baseType: !32, size: 192, align: 64, offset: 896)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Command,int,int}", file: !33, size: 192, align: 8, elements: !34)
!33 = !DIFile(filename: "", directory: "")
!34 = !{!35, !45, !46}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "Command", file: !5, line: 4, size: 2368, align: 8, elements: !38)
!38 = !{!16, !39, !40, !47, !48, !49, !50, !51, !52, !58, !125, !126, !130, !138, !144, !212, !213, !214, !215, !216, !217, !218, !219}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ShortName", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "Aliases", file: !5, line: 4, baseType: !41, size: 192, align: 64, offset: 256)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !33, size: 192, align: 8, elements: !42)
!42 = !{!43, !45, !46}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !33, line: 1, baseType: !24, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !33, line: 1, baseType: !24, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "Usage", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "UsageText", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 576)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Description", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 704)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ArgsUsage", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 832)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "Category", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 960)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "BashComplete", file: !5, line: 4, baseType: !53, size: 64, align: 64, offset: 1088)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 4, size: 64, align: 8, elements: !55)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 4, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Before", file: !5, line: 4, baseType: !59, size: 64, align: 64, offset: 1152)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 4, size: 64, align: 8, elements: !61)
!61 = !{!62}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 4, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !57}
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !18, line: 1, size: 128, align: 8, elements: !67)
!67 = !{!68, !124}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !18, line: 1, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !33, size: 128, align: 8, elements: !71)
!71 = !{!72, !120}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !33, line: 1, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !18, line: 1, size: 576, align: 8, elements: !75)
!75 = !{!76, !78, !79, !81, !82, !83, !84, !92, !101, !102, !103, !119}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !18, line: 1, baseType: !77, size: 64, align: 64)
!77 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !18, line: 1, baseType: !77, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !18, line: 1, baseType: !80, size: 32, align: 32, offset: 128)
!80 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !18, line: 1, baseType: !22, size: 8, align: 8, offset: 160)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !18, line: 1, baseType: !22, size: 8, align: 8, offset: 168)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !18, line: 1, baseType: !22, size: 8, align: 8, offset: 176)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !18, line: 1, baseType: !85, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !18, line: 1, size: 64, align: 8, elements: !87)
!87 = !{!88}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !18, line: 1, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!77, !57, !77}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !18, line: 1, baseType: !93, size: 64, align: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !18, line: 1, size: 64, align: 8, elements: !95)
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !18, line: 1, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !57, !57}
!100 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !18, line: 1, baseType: !21, size: 64, align: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !18, line: 1, baseType: !44, size: 64, align: 64, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !18, line: 1, baseType: !104, size: 64, align: 64, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !18, line: 1, size: 320, align: 8, elements: !106)
!106 = !{!107, !108, !109}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !18, line: 1, baseType: !44, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !18, line: 1, baseType: !44, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !18, line: 1, baseType: !110, size: 192, align: 64, offset: 128)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !33, size: 192, align: 8, elements: !111)
!111 = !{!112, !45, !46}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !18, line: 1, size: 320, align: 8, elements: !115)
!115 = !{!107, !108, !116, !117, !118}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !18, line: 1, baseType: !57, size: 64, align: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !18, line: 1, baseType: !57, size: 64, align: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !18, line: 1, baseType: !57, size: 64, align: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !18, line: 1, baseType: !57, size: 64, align: 64, offset: 512)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !33, line: 1, baseType: !121, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!17, !57}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !18, line: 1, baseType: !57, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "After", file: !5, line: 4, baseType: !59, size: 64, align: 64, offset: 1216)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Action", file: !5, line: 4, baseType: !127, size: 128, align: 64, offset: 1280)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !33, size: 128, align: 8, elements: !128)
!128 = !{!72, !129}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !33, line: 1, baseType: !57, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "OnUsageError", file: !5, line: 4, baseType: !131, size: 64, align: 64, offset: 1408)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 4, size: 64, align: 8, elements: !133)
!133 = !{!134}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 4, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!66, !57, !66, !100}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "Subcommands", file: !5, line: 4, baseType: !139, size: 192, align: 64, offset: 1472)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "Commands", file: !5, line: 4, size: 192, align: 8, elements: !140)
!140 = !{!141, !142, !143}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !5, line: 1, baseType: !57, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !5, line: 1, baseType: !24, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !5, line: 1, baseType: !24, size: 64, align: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !5, line: 4, baseType: !145, size: 192, align: 64, offset: 1664)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Flag,int,int}", file: !33, size: 192, align: 8, elements: !146)
!146 = !{!147, !45, !46}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", file: !5, line: 4, size: 128, align: 8, elements: !150)
!150 = !{!151, !209}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 4, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*FlagSet)void,*func(*void)string,*func(*void)string}", file: !33, size: 256, align: 8, elements: !154)
!154 = !{!155, !156, !210, !211}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !33, line: 4, baseType: !73, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Apply", file: !33, line: 4, baseType: !157, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!8, !57, !160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "FlagSet", file: !5, line: 4, size: 768, align: 8, elements: !162)
!162 = !{!163, !171, !172, !173, !187, !188, !189, !191}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Usage", file: !5, line: 4, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 4, size: 64, align: 8, elements: !166)
!166 = !{!167}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 4, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!8}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "parsed", file: !5, line: 4, baseType: !100, size: 8, align: 8, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "actual", file: !5, line: 4, baseType: !174, size: 64, align: 64, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !18, line: 1, size: 384, align: 8, elements: !176)
!176 = !{!177, !178, !179, !180, !182, !183, !184, !185, !186}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !18, line: 1, baseType: !24, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !18, line: 1, baseType: !22, size: 8, align: 8, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !18, line: 1, baseType: !22, size: 8, align: 8, offset: 72)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !18, line: 1, baseType: !181, size: 16, align: 16, offset: 80)
!181 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !18, line: 1, baseType: !80, size: 32, align: 32, offset: 96)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !18, line: 1, baseType: !57, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !18, line: 1, baseType: !57, size: 64, align: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !18, line: 1, baseType: !77, size: 64, align: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !18, line: 1, baseType: !57, size: 64, align: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "formal", file: !5, line: 4, baseType: !174, size: 64, align: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "args", file: !5, line: 4, baseType: !41, size: 192, align: 64, offset: 384)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "errorHandling", file: !5, line: 4, baseType: !190, size: 64, align: 64, offset: 576)
!190 = !DIBasicType(name: "ErrorHandling", size: 64, encoding: DW_ATE_signed)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "output", file: !5, line: 4, baseType: !192, size: 128, align: 64, offset: 640)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !5, line: 4, size: 128, align: 8, elements: !193)
!193 = !{!194, !209}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 4, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !33, size: 128, align: 8, elements: !197)
!197 = !{!155, !198}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !33, line: 4, baseType: !199, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!202, !57, !206}
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !33, size: 192, align: 8, elements: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !33, line: 4, baseType: !24, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !33, line: 4, baseType: !66, size: 128, align: 64, offset: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !33, size: 192, align: 8, elements: !207)
!207 = !{!208, !45, !46}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !21, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !5, line: 1, baseType: !57, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "GetName", file: !33, line: 4, baseType: !121, size: 64, align: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !33, line: 4, baseType: !121, size: 64, align: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "SkipFlagParsing", file: !5, line: 4, baseType: !100, size: 8, align: 8, offset: 1856)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "SkipArgReorder", file: !5, line: 4, baseType: !100, size: 8, align: 8, offset: 1864)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "HideHelp", file: !5, line: 4, baseType: !100, size: 8, align: 8, offset: 1872)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Hidden", file: !5, line: 4, baseType: !100, size: 8, align: 8, offset: 1880)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "UseShortOptionHandling", file: !5, line: 4, baseType: !100, size: 8, align: 8, offset: 1888)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "HelpName", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 1920)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "commandNamePath", file: !5, line: 4, baseType: !41, size: 192, align: 64, offset: 2048)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "CustomHelpTemplate", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 2240)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !5, line: 4, baseType: !145, size: 192, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "EnableBashCompletion", file: !5, line: 4, baseType: !100, size: 8, align: 8, offset: 1280)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "HideHelp", file: !5, line: 4, baseType: !100, size: 8, align: 8, offset: 1288)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "HideVersion", file: !5, line: 4, baseType: !100, size: 8, align: 8, offset: 1296)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "categories", file: !5, line: 4, baseType: !225, size: 192, align: 64, offset: 1344)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "CommandCategories", file: !5, line: 4, size: 192, align: 8, elements: !226)
!226 = !{!227, !142, !143}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !5, line: 1, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "CommandCategory", file: !5, line: 4, size: 320, align: 8, elements: !231)
!231 = !{!16, !232}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Commands", file: !5, line: 4, baseType: !139, size: 192, align: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "BashComplete", file: !5, line: 4, baseType: !53, size: 64, align: 64, offset: 1536)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Before", file: !5, line: 4, baseType: !59, size: 64, align: 64, offset: 1600)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "After", file: !5, line: 4, baseType: !59, size: 64, align: 64, offset: 1664)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Action", file: !5, line: 4, baseType: !127, size: 128, align: 64, offset: 1728)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "CommandNotFound", file: !5, line: 4, baseType: !238, size: 64, align: 64, offset: 1856)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 4, size: 64, align: 8, elements: !240)
!240 = !{!241}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 4, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!8, !57, !17}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "OnUsageError", file: !5, line: 4, baseType: !131, size: 64, align: 64, offset: 1920)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Compiled", file: !5, line: 4, baseType: !247, size: 192, align: 64, offset: 1984)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !5, line: 4, size: 192, align: 8, elements: !248)
!248 = !{!249, !251, !253}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !5, line: 4, baseType: !250, size: 64, align: 64)
!250 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !5, line: 4, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !5, line: 4, baseType: !254, size: 64, align: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !5, line: 4, size: 704, align: 8, elements: !256)
!256 = !{!257, !258, !267, !278, !279, !280}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !5, line: 4, baseType: !17, size: 128, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !5, line: 4, baseType: !259, size: 192, align: 64, offset: 128)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !33, size: 192, align: 8, elements: !260)
!260 = !{!261, !45, !46}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !5, line: 4, size: 256, align: 8, elements: !264)
!264 = !{!257, !265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !5, line: 4, baseType: !24, size: 64, align: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !5, line: 4, baseType: !100, size: 8, align: 8, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !5, line: 4, baseType: !268, size: 192, align: 64, offset: 320)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !33, size: 192, align: 8, elements: !269)
!269 = !{!270, !45, !46}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !5, line: 4, size: 128, align: 8, elements: !273)
!273 = !{!274, !275, !276, !277}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !5, line: 4, baseType: !252, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !5, line: 4, baseType: !22, size: 8, align: 8, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !5, line: 4, baseType: !100, size: 8, align: 8, offset: 72)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !5, line: 4, baseType: !100, size: 8, align: 8, offset: 80)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !5, line: 4, baseType: !252, size: 64, align: 64, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !5, line: 4, baseType: !252, size: 64, align: 64, offset: 576)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !5, line: 4, baseType: !262, size: 64, align: 64, offset: 640)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Authors", file: !5, line: 4, baseType: !282, size: 192, align: 64, offset: 2176)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Author,int,int}", file: !33, size: 192, align: 8, elements: !283)
!283 = !{!284, !45, !46}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !33, line: 1, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "Author", file: !5, line: 4, size: 256, align: 8, elements: !287)
!287 = !{!16, !288}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Email", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Copyright", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 2368)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Author", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 2496)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Email", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 2624)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Writer", file: !5, line: 4, baseType: !192, size: 128, align: 64, offset: 2752)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ErrWriter", file: !5, line: 4, baseType: !192, size: 128, align: 64, offset: 2880)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ExitErrHandler", file: !5, line: 4, baseType: !295, size: 64, align: 64, offset: 3008)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 4, size: 64, align: 8, elements: !297)
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 4, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!8, !57, !66}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Metadata", file: !5, line: 4, baseType: !174, size: 64, align: 64, offset: 3072)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraInfo", file: !5, line: 4, baseType: !304, size: 64, align: 64, offset: 3136)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 4, size: 64, align: 8, elements: !306)
!306 = !{!307}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 4, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!174}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "CustomAppHelpTemplate", file: !5, line: 4, baseType: !17, size: 128, align: 64, offset: 3200)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "didSetup", file: !5, line: 4, baseType: !100, size: 8, align: 8, offset: 3328)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Command", file: !5, line: 4, baseType: !37, size: 2368, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "shellComplete", file: !5, line: 4, baseType: !100, size: 8, align: 8, offset: 2432)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flagSet", file: !5, line: 4, baseType: !160, size: 64, align: 64, offset: 2496)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "setFlags", file: !5, line: 4, baseType: !174, size: 64, align: 64, offset: 2560)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "parentContext", file: !5, line: 4, baseType: !57, size: 64, align: 64, offset: 2624)
!318 = !DILocalVariable(name: "c", arg: 1, scope: !4, file: !5, line: 11, type: !9)
!319 = !DILocation(line: 11, column: 14, scope: !4)
!320 = !DILocation(line: 13, column: 2, scope: !321)
!321 = distinct !DILexicalBlock(scope: !4, file: !5, line: 11, column: 1)
!322 = !DILocation(line: 49, column: 1, scope: !4)
!323 = !DILocation(line: 16, column: 27, scope: !321)
!324 = !DILocation(line: 16, column: 13, scope: !321)
!325 = !DILocalVariable(name: "tmlconf", scope: !321, file: !5, line: 16, type: !326)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: ".github.com/timakin/gopli/lib.tomlConfig", file: !5, line: 7, size: 128, align: 8, elements: !327)
!327 = !{!328, !329}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Database", file: !5, line: 7, baseType: !174, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "SSH", file: !5, line: 7, baseType: !174, size: 64, align: 64, offset: 64)
!330 = !DILocation(line: 16, column: 2, scope: !4)
!331 = !DILocation(line: 19, column: 59, scope: !321)
!332 = !DILocation(line: 19, column: 90, scope: !321)
!333 = !DILocation(line: 19, column: 48, scope: !321)
!334 = !DILocation(line: 19, column: 57, scope: !321)
!335 = !DILocation(line: 19, column: 84, scope: !321)
!336 = !DILocation(line: 19, column: 88, scope: !321)
!337 = !DILocation(line: 19, column: 27, scope: !321)
!338 = !DILocalVariable(name: "fetcher", scope: !321, file: !5, line: 19, type: !339)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "DBFetcher", file: !5, line: 6, size: 128, align: 8, elements: !340)
!340 = !{!341, !209}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 6, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error}", file: !33, size: 128, align: 8, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !33, line: 6, baseType: !73, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Fetch", file: !33, line: 6, baseType: !63, size: 64, align: 64, offset: 64)
!347 = !DILocation(line: 19, column: 2, scope: !4)
!348 = !DILocalVariable(name: "err", scope: !321, file: !5, line: 19, type: !66)
!349 = !DILocation(line: 20, column: 9, scope: !321)
!350 = !DILocation(line: 21, column: 52, scope: !321)
!351 = !DILocation(line: 24, column: 2, scope: !321)
!352 = !DILocation(line: 21, column: 3, scope: !321)
!353 = !DILocation(line: 21, column: 44, scope: !321)
!354 = !DILocation(line: 27, column: 15, scope: !321)
!355 = !DILocation(line: 28, column: 9, scope: !321)
!356 = !DILocation(line: 29, column: 34, scope: !321)
!357 = !DILocation(line: 33, column: 61, scope: !321)
!358 = !DILocation(line: 29, column: 3, scope: !321)
!359 = !DILocation(line: 29, column: 26, scope: !321)
!360 = !DILocation(line: 33, column: 90, scope: !321)
!361 = !DILocation(line: 33, column: 59, scope: !321)
!362 = !DILocation(line: 33, column: 88, scope: !321)
!363 = !DILocation(line: 33, column: 28, scope: !321)
!364 = !DILocalVariable(name: "inserter", scope: !321, file: !5, line: 33, type: !365)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "DBInserter", file: !5, line: 6, size: 128, align: 8, elements: !366)
!366 = !{!367, !209}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 6, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)error}", file: !33, size: 192, align: 8, elements: !370)
!370 = !{!345, !371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Clean", file: !33, line: 6, baseType: !63, size: 64, align: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Insert", file: !33, line: 6, baseType: !63, size: 64, align: 64, offset: 128)
!373 = !DILocation(line: 33, column: 2, scope: !4)
!374 = !DILocation(line: 34, column: 9, scope: !321)
!375 = !DILocation(line: 35, column: 53, scope: !321)
!376 = !DILocation(line: 39, column: 16, scope: !321)
!377 = !DILocation(line: 35, column: 3, scope: !321)
!378 = !DILocation(line: 35, column: 45, scope: !321)
!379 = !DILocation(line: 40, column: 9, scope: !321)
!380 = !DILocation(line: 41, column: 34, scope: !321)
!381 = !DILocation(line: 45, column: 16, scope: !321)
!382 = !DILocation(line: 41, column: 3, scope: !321)
!383 = !DILocation(line: 41, column: 26, scope: !321)
!384 = !DILocation(line: 46, column: 9, scope: !321)
!385 = !DILocation(line: 47, column: 35, scope: !321)
!386 = !DILocation(line: 47, column: 3, scope: !321)
!387 = !DILocation(line: 47, column: 27, scope: !321)
!388 = distinct !DISubprogram(name: "command.command_line_arguments..thunk0", scope: null, file: !5, line: 24, type: !389, isLocal: true, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !1, retainedNodes: !3)
!389 = !DISubroutineType(types: !390)
!390 = !{!100, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !18, line: 1, align: 8, elements: !3)
!393 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !388, file: !5, line: 24, type: !391)
!394 = !DILocation(line: 24, column: 2, scope: !388)
!395 = !DILocalVariable(name: "$ret0", scope: !388, file: !5, line: 24, type: !100)
!396 = distinct !DISubprogram(name: "command.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !5, line: 1, type: !169, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!397 = !DILocation(line: 1, column: 1, scope: !398)
!398 = !DILexicalBlockFile(scope: !396, file: !18, discriminator: 0)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "command"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "command-line-arguments"
	.ascii ";\n"
	.ascii "import "
	.ascii "cli"
	.ascii " "
	.ascii "github.com/codegangsta/cli"
	.ascii " \""
	.ascii "github.com/codegangsta/cli"
	.ascii "\";\n"
	.ascii "import "
	.ascii "constants"
	.ascii " "
	.ascii "github.com/timakin/gopli/constants"
	.ascii " \""
	.ascii "github.com/timakin/gopli/constants"
	.ascii "\";\n"
	.ascii "import "
	.ascii "database"
	.ascii " "
	.ascii "github.com/timakin/gopli/database"
	.ascii " \""
	.ascii "github.com/timakin/gopli/database"
	.ascii "\";\n"
	.ascii "import "
	.ascii "lib"
	.ascii " "
	.ascii "github.com/timakin/gopli/lib"
	.ascii " \""
	.ascii "github.com/timakin/gopli/lib"
	.ascii "\";\n"
	.ascii "init"
	.ascii " "
	.ascii "bufio"
	.ascii " "
	.ascii "bufio..import"
	.ascii " "
	.ascii "bytes"
	.ascii " "
	.ascii "bytes..import"
	.ascii " "
	.ascii "context"
	.ascii " "
	.ascii "context..import"
	.ascii " "
	.ascii "crypto"
	.ascii " "
	.ascii "crypto..import"
	.ascii " "
	.ascii "cipher"
	.ascii " "
	.ascii "crypto_cipher..import"
	.ascii " "
	.ascii "des"
	.ascii " "
	.ascii "crypto_des..import"
	.ascii " "
	.ascii "dsa"
	.ascii " "
	.ascii "crypto_dsa..import"
	.ascii " "
	.ascii "ecdsa"
	.ascii " "
	.ascii "crypto_ecdsa..import"
	.ascii " "
	.ascii "elliptic"
	.ascii " "
	.ascii "crypto_elliptic..import"
	.ascii " "
	.ascii "md5"
	.ascii " "
	.ascii "crypto_md5..import"
	.ascii " "
	.ascii "rand"
	.ascii " "
	.ascii "crypto_rand..import"
	.ascii " "
	.ascii "rsa"
	.ascii " "
	.ascii "crypto_rsa..import"
	.ascii " "
	.ascii "sha1"
	.ascii " "
	.ascii "crypto_sha1..import"
	.ascii " "
	.ascii "sha256"
	.ascii " "
	.ascii "crypto_sha256..import"
	.ascii " "
	.ascii "sha512"
	.ascii " "
	.ascii "crypto_sha512..import"
	.ascii " "
	.ascii "x509"
	.ascii " "
	.ascii "crypto_x509..import"
	.ascii " "
	.ascii "pkix"
	.ascii " "
