; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22database\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22constants\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/timakin/gopli/constants\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/timakin/gopli/constants\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22lib\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/timakin/gopli/lib\22"
module asm "\09.ascii \22 \5C\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./database.go", directory: "/home/wangcong/go_path/src/github.com/timakin/gopli/database")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "database.command_line_arguments.DBConnector..hash", linkageName: "command_line_arguments.command_line_arguments.DBConnector..hash", scope: null, file: !7, line: 1, type: !10, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !13, !12}
!12 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "void")
!15 = !DILocalVariable(name: "key", arg: 1, scope: !9, file: !7, line: 1, type: !13)
!16 = !DILocation(line: 1, column: 1, scope: !9)
!17 = !DILocalVariable(name: "seed", arg: 2, scope: !9, file: !7, line: 1, type: !12)
!18 = !DILocalVariable(name: "$ret11", scope: !9, file: !7, line: 1, type: !12)
!19 = distinct !DISubprogram(name: "database.command_line_arguments.DBConnector..eq", linkageName: "command_line_arguments.command_line_arguments.DBConnector..eq", scope: null, file: !7, line: 1, type: !20, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !13, !13}
!22 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!23 = !DILocalVariable(name: "key1", arg: 1, scope: !19, file: !7, line: 1, type: !13)
!24 = !DILocation(line: 1, column: 1, scope: !19)
!25 = !DILocalVariable(name: "key2", arg: 2, scope: !19, file: !7, line: 1, type: !13)
!26 = !DILocalVariable(name: "$ret12", scope: !19, file: !7, line: 1, type: !22)
!27 = distinct !DISubprogram(name: "database.CreateFetcher", linkageName: "command_line_arguments.CreateFetcher", scope: null, file: !28, line: 32, type: !29, isLocal: false, isDefinition: true, scopeLine: 32, isOptimized: false, unit: !1, retainedNodes: !3)
!28 = !DIFile(filename: "database.go", directory: ".")
!29 = !DISubroutineType(types: !30)
!30 = !{!31, !110, !119}
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{DBFetcher,error}", file: !32, size: 256, align: 8, elements: !33)
!32 = !DIFile(filename: "", directory: "")
!33 = !{!34, !109}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "fetcher", file: !32, line: 32, baseType: !35, size: 128, align: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "DBFetcher", file: !28, line: 13, size: 128, align: 8, elements: !36)
!36 = !{!37, !108}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 13, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error}", file: !32, size: 128, align: 8, elements: !40)
!40 = !{!41, !92}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !32, line: 13, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !44)
!44 = !{!45, !46, !47, !48, !50, !51, !52, !58, !64, !66, !73, !91}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !12, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !49, size: 8, align: 8, offset: 160)
!49 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !49, size: 8, align: 8, offset: 168)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !49, size: 8, align: 8, offset: 176)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !53, size: 64, align: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !55)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !59, size: 64, align: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !61)
!61 = !{!62}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !65, size: 64, align: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !67, size: 64, align: 64, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !69)
!69 = !{!70, !71}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !65, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !72, size: 64, align: 64, offset: 64)
!72 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !74, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !67, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !67, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !80, size: 192, align: 64, offset: 128)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !32, size: 192, align: 8, elements: !81)
!81 = !{!82, !89, !90}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !85)
!85 = !{!77, !78, !86, !87, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !32, line: 1, baseType: !72, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !32, line: 1, baseType: !72, size: 64, align: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Fetch", file: !32, line: 13, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !13}
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !97)
!97 = !{!98, !107}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !32, size: 128, align: 8, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !32, line: 1, baseType: !42, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !32, line: 1, baseType: !104, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!68, !13}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !28, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !32, line: 32, baseType: !96, size: 128, align: 64, offset: 128)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "Database", file: !28, line: 4, size: 768, align: 8, elements: !111)
!111 = !{!112, !113, !114, !115, !116, !117, !118}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !28, line: 4, baseType: !68, size: 128, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ManagementSystem", file: !28, line: 4, baseType: !68, size: 128, align: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !28, line: 4, baseType: !68, size: 128, align: 64, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !28, line: 4, baseType: !68, size: 128, align: 64, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Password", file: !28, line: 4, baseType: !68, size: 128, align: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !28, line: 4, baseType: !72, size: 64, align: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "IsContainer", file: !28, line: 4, baseType: !22, size: 8, align: 8, offset: 704)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSH", file: !28, line: 4, size: 512, align: 8, elements: !120)
!120 = !{!112, !121, !122, !123}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Port", file: !28, line: 4, baseType: !68, size: 128, align: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !28, line: 4, baseType: !68, size: 128, align: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !28, line: 4, baseType: !68, size: 128, align: 64, offset: 384)
!124 = !DILocalVariable(name: "sshConf", arg: 2, scope: !27, file: !28, line: 32, type: !119)
!125 = !DILocation(line: 32, column: 37, scope: !27)
!126 = !DILocalVariable(name: "dbConf", arg: 1, scope: !27, file: !28, line: 32, type: !110)
!127 = !DILocation(line: 32, column: 20, scope: !27)
!128 = !DILocation(line: 34, column: 34, scope: !129)
!129 = distinct !DILexicalBlock(scope: !27, file: !28, line: 32, column: 1)
!130 = !DILocation(line: 34, column: 48, scope: !129)
!131 = !DILocation(line: 34, column: 12, scope: !129)
!132 = !DILocalVariable(name: "config", scope: !129, file: !28, line: 34, type: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientConfig", file: !28, line: 5, size: 1600, align: 8, elements: !135)
!135 = !{!136, !166, !167, !208, !244, !252, !253, !254}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Config", file: !28, line: 5, baseType: !137, size: 768, align: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !28, line: 5, size: 768, align: 8, elements: !138)
!138 = !{!139, !158, !160, !164, !165}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Rand", file: !28, line: 5, baseType: !140, size: 128, align: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !28, line: 5, size: 128, align: 8, elements: !141)
!141 = !{!142, !108}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 5, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !32, size: 128, align: 8, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !32, line: 5, baseType: !42, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !32, line: 5, baseType: !148, size: 64, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !13, !155}
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !32, size: 192, align: 8, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !32, line: 5, baseType: !72, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !32, line: 5, baseType: !96, size: 128, align: 64, offset: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !32, size: 192, align: 8, elements: !156)
!156 = !{!157, !89, !90}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !65, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "RekeyThreshold", file: !28, line: 5, baseType: !159, size: 64, align: 64, offset: 128)
!159 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "KeyExchanges", file: !28, line: 5, baseType: !161, size: 192, align: 64, offset: 192)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !32, size: 192, align: 8, elements: !162)
!162 = !{!163, !89, !90}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !67, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Ciphers", file: !28, line: 5, baseType: !161, size: 192, align: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "MACs", file: !28, line: 5, baseType: !161, size: 192, align: 64, offset: 576)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !28, line: 5, baseType: !68, size: 128, align: 64, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Auth", file: !28, line: 5, baseType: !168, size: 192, align: 64, offset: 896)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AuthMethod,int,int}", file: !32, size: 192, align: 8, elements: !169)
!169 = !{!170, !89, !90}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "AuthMethod", file: !28, line: 5, size: 128, align: 8, elements: !173)
!173 = !{!174, !108}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 5, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int},string,.golang.org/x/crypto/ssh.packetConn,Reader)struct{.golang.org/x/crypto/ssh.authResult,struct{*string,int,int},error},*func(*void)string}", file: !32, size: 192, align: 8, elements: !177)
!177 = !{!146, !178, !207}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "auth", file: !32, line: 5, baseType: !179, size: 64, align: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!182, !13, !155, !68, !188, !140}
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.golang.org/x/crypto/ssh.authResult,struct{*string,int,int},error}", file: !32, size: 384, align: 8, elements: !183)
!183 = !{!184, !186, !187}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 5, baseType: !185, size: 64, align: 64)
!185 = !DIBasicType(name: ".golang.org/x/crypto/ssh.authResult", size: 64, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 5, baseType: !161, size: 192, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 5, baseType: !96, size: 128, align: 64, offset: 256)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: ".golang.org/x/crypto/ssh.packetConn", file: !28, line: 5, size: 128, align: 8, elements: !189)
!189 = !{!190, !108}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 5, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)struct{struct{*uint8,int,int},error},*func(*void,struct{*uint8,int,int})error}", file: !32, size: 256, align: 8, elements: !193)
!193 = !{!146, !194, !195, !203}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !32, line: 5, baseType: !93, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "readPacket", file: !32, line: 5, baseType: !196, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!199, !13}
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !32, size: 320, align: 8, elements: !200)
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 5, baseType: !155, size: 192, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 5, baseType: !96, size: 128, align: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "writePacket", file: !32, line: 5, baseType: !204, size: 64, align: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!96, !13, !155}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "method", file: !32, line: 5, baseType: !104, size: 64, align: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "HostKeyCallback", file: !28, line: 5, baseType: !209, size: 64, align: 64, offset: 1088)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !28, line: 5, size: 64, align: 8, elements: !211)
!211 = !{!212}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !28, line: 5, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!96, !68, !216, !224}
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "Addr", file: !28, line: 5, size: 128, align: 8, elements: !217)
!217 = !{!218, !108}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 5, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)string}", file: !32, size: 192, align: 8, elements: !221)
!221 = !{!146, !222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Network", file: !32, line: 5, baseType: !104, size: 64, align: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !32, line: 5, baseType: !104, size: 64, align: 64, offset: 128)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "PublicKey", file: !28, line: 5, size: 128, align: 8, elements: !225)
!225 = !{!226, !108}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 5, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{*uint8,int,int},*func(*void)string,*func(*void,struct{*uint8,int,int},*Signature)error}", file: !32, size: 256, align: 8, elements: !229)
!229 = !{!146, !230, !234, !235}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Marshal", file: !32, line: 5, baseType: !231, size: 64, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!155, !13}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !32, line: 5, baseType: !104, size: 64, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Verify", file: !32, line: 5, baseType: !236, size: 64, align: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!96, !13, !155, !239}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "Signature", file: !28, line: 5, size: 320, align: 8, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Format", file: !28, line: 5, baseType: !68, size: 128, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Blob", file: !28, line: 5, baseType: !155, size: 192, align: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "BannerCallback", file: !28, line: 5, baseType: !245, size: 64, align: 64, offset: 1152)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !28, line: 5, size: 64, align: 8, elements: !247)
!247 = !{!248}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !28, line: 5, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!96, !68}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ClientVersion", file: !28, line: 5, baseType: !68, size: 128, align: 64, offset: 1216)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "HostKeyAlgorithms", file: !28, line: 5, baseType: !161, size: 192, align: 64, offset: 1344)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Timeout", file: !28, line: 5, baseType: !255, size: 64, align: 64, offset: 1536)
!255 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!256 = !DILocation(line: 34, column: 2, scope: !27)
!257 = !DILocation(line: 35, column: 62, scope: !129)
!258 = !DILocation(line: 35, column: 45, scope: !129)
!259 = !DILocation(line: 35, column: 26, scope: !129)
!260 = !DILocalVariable(name: "srcHostConn", scope: !129, file: !28, line: 35, type: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "Client", file: !28, line: 6, size: 640, align: 8, elements: !263)
!263 = !{!264, !345, !355, !368, !369}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Conn", file: !28, line: 6, baseType: !265, size: 128, align: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !28, line: 6, size: 128, align: 8, elements: !266)
!266 = !{!267, !108}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 6, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{*uint8,int,int},*func(*void)error,*func(*void)Addr,*func(*void,string,struct{*uint8,int,int})struct{Channel,*__go_channel,error},*func(*void)Addr,*func(*void,string,bool,struct{*uint8,int,int})struct{bool,struct{*uint8,int,int},error},*func(*void)struct{*uint8,int,int},*func(*void)struct{*uint8,int,int},*func(*void)string,*func(*void)error}", file: !32, size: 704, align: 8, elements: !270)
!270 = !{!271, !272, !273, !274, !278, !332, !333, !341, !342, !343, !344}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !32, line: 6, baseType: !42, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ClientVersion", file: !32, line: 6, baseType: !231, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !32, line: 6, baseType: !93, size: 64, align: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "LocalAddr", file: !32, line: 6, baseType: !275, size: 64, align: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!216, !13}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "OpenChannel", file: !32, line: 6, baseType: !279, size: 64, align: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!282, !13, !68, !155}
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Channel,*__go_channel,error}", file: !32, size: 320, align: 8, elements: !283)
!283 = !{!284, !328, !331}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 6, baseType: !285, size: 128, align: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "Channel", file: !28, line: 6, size: 128, align: 8, elements: !286)
!286 = !{!287, !108}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 6, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,string,bool,struct{*uint8,int,int})struct{bool,error},*func(*void)ReadWriter,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !32, size: 448, align: 8, elements: !290)
!290 = !{!271, !291, !292, !293, !301, !308, !327}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !32, line: 6, baseType: !93, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "CloseWrite", file: !32, line: 6, baseType: !93, size: 64, align: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !32, line: 6, baseType: !294, size: 64, align: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!297, !13, !155}
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !32, size: 192, align: 8, elements: !298)
!298 = !{!299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 6, baseType: !72, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 6, baseType: !96, size: 128, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "SendRequest", file: !32, line: 6, baseType: !302, size: 64, align: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!305, !13, !68, !22, !155}
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,error}", file: !32, size: 192, align: 8, elements: !306)
!306 = !{!307, !300}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 6, baseType: !22, size: 8, align: 8)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Stderr", file: !32, line: 6, baseType: !309, size: 64, align: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!312, !13}
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriter", file: !28, line: 6, size: 128, align: 8, elements: !313)
!313 = !{!314, !108}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 6, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !32, size: 192, align: 8, elements: !317)
!317 = !{!271, !318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !32, line: 6, baseType: !148, size: 64, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !32, line: 6, baseType: !320, size: 64, align: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!323, !13, !155}
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !32, size: 192, align: 8, elements: !324)
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !32, line: 6, baseType: !72, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !32, line: 6, baseType: !96, size: 128, align: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !32, line: 6, baseType: !294, size: 64, align: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 6, baseType: !329, size: 64, align: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !7, line: 1, align: 8, elements: !3)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 6, baseType: !96, size: 128, align: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !32, line: 6, baseType: !275, size: 64, align: 64, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "SendRequest", file: !32, line: 6, baseType: !334, size: 64, align: 64, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!337, !13, !68, !22, !155}
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,struct{*uint8,int,int},error}", file: !32, size: 384, align: 8, elements: !338)
!338 = !{!307, !339, !340}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 6, baseType: !155, size: 192, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 6, baseType: !96, size: 128, align: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ServerVersion", file: !32, line: 6, baseType: !231, size: 64, align: 64, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "SessionID", file: !32, line: 6, baseType: !231, size: 64, align: 64, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !32, line: 6, baseType: !104, size: 64, align: 64, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Wait", file: !32, line: 6, baseType: !93, size: 64, align: 64, offset: 640)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "handleForwardsOnce", file: !28, line: 6, baseType: !346, size: 96, align: 32, offset: 128)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once", file: !28, line: 6, size: 96, align: 8, elements: !347)
!347 = !{!348, !354}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !28, line: 6, baseType: !349, size: 64, align: 32)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !28, line: 6, size: 64, align: 8, elements: !350)
!350 = !{!351, !353}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !28, line: 6, baseType: !352, size: 32, align: 32)
!352 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !28, line: 6, baseType: !8, size: 32, align: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "done", file: !28, line: 6, baseType: !8, size: 32, align: 32, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "forwards", file: !28, line: 6, baseType: !356, size: 256, align: 64, offset: 256)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: ".golang.org/x/crypto/ssh.forwardList", file: !28, line: 6, size: 256, align: 8, elements: !357)
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Mutex", file: !28, line: 6, baseType: !349, size: 64, align: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "entries", file: !28, line: 6, baseType: !360, size: 192, align: 64, offset: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.golang.org/x/crypto/ssh.forwardEntry,int,int}", file: !32, size: 192, align: 8, elements: !361)
!361 = !{!362, !89, !90}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: ".golang.org/x/crypto/ssh.forwardEntry", file: !28, line: 6, size: 192, align: 8, elements: !365)
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "laddr", file: !28, line: 6, baseType: !216, size: 128, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !28, line: 6, baseType: !329, size: 64, align: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !28, line: 6, baseType: !349, size: 64, align: 32, offset: 512)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "channelHandlers", file: !28, line: 6, baseType: !370, size: 64, align: 64, offset: 576)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !372)
!372 = !{!373, !374, !375, !376, !378, !379, !380, !381, !382}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !72, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !49, size: 8, align: 8, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !49, size: 8, align: 8, offset: 72)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !377, size: 16, align: 16, offset: 80)
!377 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !12, size: 64, align: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 320)
!383 = !DILocation(line: 35, column: 2, scope: !27)
!384 = !DILocalVariable(name: "err", scope: !27, file: !28, line: 32, type: !96)
!385 = !DILocation(line: 32, column: 70, scope: !27)
!386 = !DILocation(line: 36, column: 9, scope: !129)
!387 = !DILocalVariable(name: "fetcher", scope: !27, file: !28, line: 32, type: !35)
!388 = !DILocation(line: 32, column: 51, scope: !27)
!389 = !DILocation(line: 37, column: 3, scope: !129)
!390 = !DILocation(line: 41, column: 2, scope: !129)
!391 = !DILocation(line: 45, column: 23, scope: !129)
!392 = !DILocation(line: 46, column: 23, scope: !129)
!393 = !DILocation(line: 47, column: 23, scope: !129)
!394 = !DILocation(line: 48, column: 23, scope: !129)
!395 = !DILocation(line: 42, column: 10, scope: !129)
!396 = !DILocation(line: 42, column: 11, scope: !129)
!397 = !DILocation(line: 42, column: 3, scope: !129)
!398 = !DILocation(line: 51, column: 3, scope: !129)
!399 = distinct !DISubprogram(name: "database.Fetch..1command_line_arguments.MySQLFetcher", linkageName: "command_line_arguments.MySQLFetcher.Fetch", scope: null, file: !400, line: 18, type: !401, isLocal: false, isDefinition: true, scopeLine: 18, isOptimized: false, unit: !1, retainedNodes: !3)
!400 = !DIFile(filename: "mysql.go", directory: ".")
!401 = !DISubroutineType(types: !402)
!402 = !{!96, !403, !403}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "MySQLFetcher", file: !400, line: 15, size: 768, align: 8, elements: !405)
!405 = !{!406, !407, !408, !409, !410, !411, !412}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "SSHClient", file: !400, line: 23, baseType: !261, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !400, line: 24, baseType: !68, size: 128, align: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ManagementSystem", file: !400, line: 25, baseType: !68, size: 128, align: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !400, line: 26, baseType: !68, size: 128, align: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !400, line: 27, baseType: !68, size: 128, align: 64, offset: 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Password", file: !400, line: 28, baseType: !68, size: 128, align: 64, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "IsContainer", file: !400, line: 29, baseType: !22, size: 8, align: 8, offset: 704)
!413 = !DILocalVariable(name: "param", arg: 1, scope: !399, file: !400, line: 18, type: !403)
!414 = !DILocation(line: 18, column: 1, scope: !399)
!415 = !DILocalVariable(name: "$ret2", scope: !399, file: !400, line: 18, type: !96)
!416 = !DILocation(line: 18, column: 38, scope: !399)
!417 = !DILocation(line: 75, column: 1, scope: !399)
!418 = !DILocalVariable(name: "fetcher", scope: !399, file: !400, line: 18, type: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!420 = !DILocation(line: 19, column: 6, scope: !421)
!421 = distinct !DILexicalBlock(scope: !399, file: !400, line: 18, column: 1)
!422 = !DILocation(line: 20, column: 18, scope: !421)
!423 = !DILocation(line: 20, column: 25, scope: !421)
!424 = !DILocation(line: 20, column: 35, scope: !421)
!425 = !DILocalVariable(name: "session", scope: !421, file: !400, line: 20, type: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "Session", file: !28, line: 6, size: 1088, align: 8, elements: !428)
!428 = !{!429, !430, !438, !439, !440, !441, !453, !454, !455, !456, !457, !464}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Stdin", file: !28, line: 6, baseType: !140, size: 128, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "Stdout", file: !28, line: 6, baseType: !431, size: 128, align: 64, offset: 128)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !28, line: 6, size: 128, align: 8, elements: !432)
!432 = !{!433, !108}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 6, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !32, size: 128, align: 8, elements: !436)
!436 = !{!271, !437}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !32, line: 6, baseType: !320, size: 64, align: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Stderr", file: !28, line: 6, baseType: !431, size: 128, align: 64, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ch", file: !28, line: 6, baseType: !285, size: 128, align: 64, offset: 384)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "started", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "copyFuncs", file: !28, line: 6, baseType: !442, size: 192, align: 64, offset: 576)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**__go_descriptor,int,int}", file: !32, size: 192, align: 8, elements: !443)
!443 = !{!444, !89, !90}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !28, line: 5, size: 64, align: 8, elements: !448)
!448 = !{!449}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !28, line: 5, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!96}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "errors", file: !28, line: 6, baseType: !329, size: 64, align: 64, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "stdinpipe", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutpipe", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 840)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "stderrpipe", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 848)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "stdinPipeWriter", file: !28, line: 6, baseType: !458, size: 128, align: 64, offset: 896)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "WriteCloser", file: !28, line: 6, size: 128, align: 8, elements: !459)
!459 = !{!460, !108}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 6, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !32, size: 192, align: 8, elements: !463)
!463 = !{!271, !291, !319}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "exitStatus", file: !28, line: 6, baseType: !329, size: 64, align: 64, offset: 1024)
!465 = !DILocation(line: 20, column: 2, scope: !399)
!466 = !DILocalVariable(name: "err", scope: !421, file: !400, line: 20, type: !96)
!467 = !DILocation(line: 21, column: 9, scope: !421)
!468 = !DILocation(line: 24, column: 2, scope: !421)
!469 = !DILocation(line: 26, column: 6, scope: !421)
!470 = !DILocalVariable(name: "listTableStdoutBuf", scope: !421, file: !400, line: 26, type: !471)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", file: !400, line: 4, size: 832, align: 8, elements: !473)
!473 = !{!474, !475, !476, !480}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !400, line: 4, baseType: !155, size: 192, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "off", file: !400, line: 4, baseType: !72, size: 64, align: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "bootstrap", file: !400, line: 4, baseType: !477, size: 512, align: 8, offset: 256)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 512, align: 1, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "lastRead", file: !400, line: 4, baseType: !481, size: 8, align: 8, offset: 768)
!481 = !DIBasicType(name: ".bytes.readOp", size: 8, encoding: DW_ATE_signed)
!482 = !DILocation(line: 26, column: 6, scope: !399)
!483 = !DILocation(line: 27, column: 9, scope: !421)
!484 = !DILocation(line: 27, column: 17, scope: !421)
!485 = !DILocation(line: 28, column: 54, scope: !421)
!486 = !DILocation(line: 28, column: 61, scope: !421)
!487 = !DILocation(line: 28, column: 68, scope: !421)
!488 = !DILocation(line: 28, column: 75, scope: !421)
!489 = !DILocation(line: 28, column: 82, scope: !421)
!490 = !DILocation(line: 28, column: 89, scope: !421)
!491 = !DILocation(line: 28, column: 22, scope: !421)
!492 = !DILocalVariable(name: "listTableCmd", scope: !421, file: !400, line: 28, type: !68)
!493 = !DILocation(line: 28, column: 2, scope: !399)
!494 = !DILocation(line: 29, column: 15, scope: !421)
!495 = !DILocation(line: 31, column: 15, scope: !496)
!496 = distinct !DILexicalBlock(scope: !421, file: !400, line: 31, column: 2)
!497 = !DILocalVariable(name: "err", scope: !496, file: !400, line: 31, type: !96)
!498 = !DILocation(line: 31, column: 5, scope: !421)
!499 = !DILocation(line: 31, column: 49, scope: !496)
!500 = !DILocalVariable(name: "tableListSavePath", scope: !421, file: !400, line: 35, type: !68)
!501 = !DILocation(line: 35, column: 2, scope: !399)
!502 = !DILocation(line: 36, column: 56, scope: !421)
!503 = !DILocation(line: 36, column: 9, scope: !421)
!504 = !DILocation(line: 37, column: 6, scope: !421)
!505 = !DILocation(line: 39, column: 6, scope: !421)
!506 = !DILocation(line: 40, column: 17, scope: !421)
!507 = !DILocalVariable(name: "tables", scope: !421, file: !400, line: 40, type: !161)
!508 = !DILocation(line: 40, column: 2, scope: !399)
!509 = !DILocation(line: 41, column: 9, scope: !421)
!510 = !DILocation(line: 45, column: 2, scope: !421)
!511 = !DILocalVariable(name: "sem", scope: !421, file: !400, line: 45, type: !512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!513 = !DILocation(line: 45, column: 2, scope: !399)
!514 = !DILocation(line: 45, column: 9, scope: !421)
!515 = !DILocation(line: 46, column: 6, scope: !421)
!516 = !DILocalVariable(name: "wg", scope: !421, file: !400, line: 46, type: !517)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "WaitGroup", file: !400, line: 12, size: 128, align: 8, elements: !519)
!519 = !{!520, !522, !526}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "noCopy", file: !400, line: 12, baseType: !521, align: 8)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: ".sync.noCopy", file: !28, line: 6, align: 8, elements: !3)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "state1", file: !400, line: 12, baseType: !523, size: 96, align: 8)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 96, align: 1, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 12)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !400, line: 12, baseType: !8, size: 32, align: 32, offset: 96)
!527 = !DILocation(line: 46, column: 6, scope: !399)
!528 = !DILocation(line: 47, column: 2, scope: !529)
!529 = distinct !DILexicalBlock(scope: !421, file: !400, line: 47, column: 2)
!530 = !DILocation(line: 48, column: 5, scope: !529)
!531 = !DILocation(line: 49, column: 6, scope: !529)
!532 = !DILocation(line: 49, column: 3, scope: !529)
!533 = !DILocation(line: 72, column: 4, scope: !421)
!534 = !DILocation(line: 73, column: 6, scope: !421)
!535 = !DILocation(line: 22, column: 3, scope: !399)
!536 = distinct !DISubprogram(name: "database.command_line_arguments.MySQLFetcher..hash", linkageName: "command_line_arguments.command_line_arguments.MySQLFetcher..hash", scope: null, file: !7, line: 1, type: !10, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!537 = !DILocalVariable(name: "key", arg: 1, scope: !536, file: !7, line: 1, type: !13)
!538 = !DILocation(line: 1, column: 1, scope: !536)
!539 = !DILocalVariable(name: "seed", arg: 2, scope: !536, file: !7, line: 1, type: !12)
!540 = !DILocalVariable(name: "$ret13", scope: !536, file: !7, line: 1, type: !12)
!541 = distinct !DISubprogram(name: "database.command_line_arguments.MySQLFetcher..eq", linkageName: "command_line_arguments.command_line_arguments.MySQLFetcher..eq", scope: null, file: !7, line: 1, type: !20, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!542 = !DILocalVariable(name: "key1", arg: 1, scope: !541, file: !7, line: 1, type: !13)
!543 = !DILocation(line: 1, column: 1, scope: !541)
!544 = !DILocalVariable(name: "key2", arg: 2, scope: !541, file: !7, line: 1, type: !13)
!545 = !DILocalVariable(name: "$ret14", scope: !541, file: !7, line: 1, type: !22)
!546 = distinct !DISubprogram(name: "database.CreateInserter", linkageName: "command_line_arguments.CreateInserter", scope: null, file: !28, line: 55, type: !547, isLocal: false, isDefinition: true, scopeLine: 55, isOptimized: false, unit: !1, retainedNodes: !3)
!547 = !DISubroutineType(types: !548)
!548 = !{!549, !110, !119}
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{DBInserter,error}", file: !32, size: 256, align: 8, elements: !550)
!550 = !{!551, !561}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "inserter", file: !32, line: 55, baseType: !552, size: 128, align: 64)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "DBInserter", file: !28, line: 17, size: 128, align: 8, elements: !553)
!553 = !{!554, !108}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 17, baseType: !555, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)error}", file: !32, size: 192, align: 8, elements: !557)
!557 = !{!558, !559, !560}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !32, line: 17, baseType: !42, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Clean", file: !32, line: 17, baseType: !93, size: 64, align: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Insert", file: !32, line: 17, baseType: !93, size: 64, align: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !32, line: 55, baseType: !96, size: 128, align: 64, offset: 128)
!562 = !DILocalVariable(name: "sshConf", arg: 2, scope: !546, file: !28, line: 55, type: !119)
!563 = !DILocation(line: 55, column: 38, scope: !546)
!564 = !DILocalVariable(name: "dbConf", arg: 1, scope: !546, file: !28, line: 55, type: !110)
!565 = !DILocation(line: 55, column: 21, scope: !546)
!566 = !DILocalVariable(name: "sshConf", arg: 1, scope: !567, file: !28, line: 85, type: !119)
!567 = distinct !DISubprogram(name: "database.generateSSHSign", scope: null, file: !28, line: 85, type: !568, isLocal: true, isDefinition: true, scopeLine: 85, isOptimized: false, unit: !1, retainedNodes: !3)
!568 = !DISubroutineType(types: !569)
!569 = !{!570, !119}
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ClientConfig,error}", file: !32, size: 192, align: 8, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 85, baseType: !133, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !32, line: 85, baseType: !96, size: 128, align: 64, offset: 64)
!574 = !DILocation(line: 85, column: 22, scope: !567, inlinedAt: !575)
!575 = distinct !DILocation(line: 56, column: 17, scope: !576)
!576 = distinct !DILexicalBlock(scope: !546, file: !28, line: 55, column: 1)
!577 = !DILocalVariable(name: "$ret0", scope: !567, file: !28, line: 85, type: !133)
!578 = !DILocation(line: 85, column: 36, scope: !567, inlinedAt: !575)
!579 = !DILocation(line: 86, column: 18, scope: !580, inlinedAt: !575)
!580 = distinct !DILexicalBlock(scope: !567, file: !28, line: 85, column: 1)
!581 = !DILocation(line: 86, column: 49, scope: !580, inlinedAt: !575)
!582 = !DILocalVariable(name: "$ret1", scope: !567, file: !28, line: 85, type: !96)
!583 = !DILocation(line: 85, column: 55, scope: !567, inlinedAt: !575)
!584 = !DILocation(line: 87, column: 3, scope: !580, inlinedAt: !575)
!585 = !DILocation(line: 89, column: 17, scope: !580, inlinedAt: !575)
!586 = !DILocalVariable(name: "usr", scope: !580, file: !28, line: 89, type: !587)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "User", file: !28, line: 8, size: 640, align: 8, elements: !589)
!589 = !{!590, !591, !592, !593, !594}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Uid", file: !28, line: 8, baseType: !68, size: 128, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Gid", file: !28, line: 8, baseType: !68, size: 128, align: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Username", file: !28, line: 8, baseType: !68, size: 128, align: 64, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !28, line: 8, baseType: !68, size: 128, align: 64, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "HomeDir", file: !28, line: 8, baseType: !68, size: 128, align: 64, offset: 512)
!595 = !DILocation(line: 89, column: 2, scope: !567, inlinedAt: !575)
!596 = !DILocation(line: 90, column: 56, scope: !580, inlinedAt: !575)
!597 = !DILocation(line: 90, column: 27, scope: !580, inlinedAt: !575)
!598 = !DILocalVariable(name: "keypathString", scope: !580, file: !28, line: 90, type: !68)
!599 = !DILocation(line: 90, column: 2, scope: !567, inlinedAt: !575)
!600 = !DILocation(line: 91, column: 25, scope: !580, inlinedAt: !575)
!601 = !DILocalVariable(name: "keypath", scope: !580, file: !28, line: 91, type: !68)
!602 = !DILocation(line: 91, column: 2, scope: !567, inlinedAt: !575)
!603 = !DILocation(line: 92, column: 21, scope: !580, inlinedAt: !575)
!604 = !DILocalVariable(name: "err", scope: !580, file: !28, line: 92, type: !96)
!605 = !DILocation(line: 92, column: 2, scope: !567, inlinedAt: !575)
!606 = !DILocation(line: 93, column: 9, scope: !580, inlinedAt: !575)
!607 = !DILocation(line: 94, column: 3, scope: !580, inlinedAt: !575)
!608 = !DILocalVariable(name: "key", scope: !580, file: !28, line: 92, type: !155)
!609 = !DILocation(line: 97, column: 21, scope: !580, inlinedAt: !575)
!610 = !DILocation(line: 98, column: 9, scope: !580, inlinedAt: !575)
!611 = !DILocation(line: 99, column: 3, scope: !580, inlinedAt: !575)
!612 = !DILocation(line: 105, column: 8, scope: !580, inlinedAt: !575)
!613 = !DILocation(line: 104, column: 9, scope: !580, inlinedAt: !575)
!614 = !DILocation(line: 102, column: 12, scope: !580, inlinedAt: !575)
!615 = !DILocation(line: 102, column: 17, scope: !580, inlinedAt: !575)
!616 = !DILocalVariable(name: "config", scope: !580, file: !28, line: 102, type: !133)
!617 = !DILocation(line: 102, column: 2, scope: !567, inlinedAt: !575)
!618 = !DILocation(line: 108, column: 2, scope: !580, inlinedAt: !575)
!619 = !DILocation(line: 0, scope: !576)
!620 = !DILocalVariable(name: "config", scope: !576, file: !28, line: 56, type: !133)
!621 = !DILocation(line: 56, column: 2, scope: !546)
!622 = !DILocalVariable(name: "err", scope: !546, file: !28, line: 55, type: !96)
!623 = !DILocation(line: 55, column: 73, scope: !546)
!624 = !DILocalVariable(name: "inserter", scope: !546, file: !28, line: 55, type: !552)
!625 = !DILocation(line: 55, column: 52, scope: !546)
!626 = !DILocation(line: 58, column: 3, scope: !576)
!627 = !DILocalVariable(name: "dstHostConn", scope: !576, file: !28, line: 60, type: !261)
!628 = !DILocation(line: 60, column: 6, scope: !546)
!629 = !DILocation(line: 61, column: 18, scope: !576)
!630 = !DILocation(line: 61, column: 49, scope: !576)
!631 = !DILocation(line: 71, column: 2, scope: !576)
!632 = !DILocation(line: 64, column: 45, scope: !576)
!633 = !DILocation(line: 64, column: 26, scope: !576)
!634 = !DILocation(line: 65, column: 10, scope: !576)
!635 = !DILocation(line: 66, column: 4, scope: !576)
!636 = !DILocation(line: 75, column: 23, scope: !576)
!637 = !DILocation(line: 76, column: 23, scope: !576)
!638 = !DILocation(line: 77, column: 23, scope: !576)
!639 = !DILocation(line: 78, column: 23, scope: !576)
!640 = !DILocation(line: 72, column: 10, scope: !576)
!641 = !DILocation(line: 72, column: 11, scope: !576)
!642 = !DILocation(line: 72, column: 3, scope: !576)
!643 = !DILocation(line: 81, column: 3, scope: !576)
!644 = distinct !DISubprogram(name: "database.Clean..1command_line_arguments.MySQLInserter", linkageName: "command_line_arguments.MySQLInserter.Clean", scope: null, file: !400, line: 77, type: !645, isLocal: false, isDefinition: true, scopeLine: 77, isOptimized: false, unit: !1, retainedNodes: !3)
!645 = !DISubroutineType(types: !646)
!646 = !{!96, !647, !647}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "MySQLInserter", file: !400, line: 16, size: 768, align: 8, elements: !405)
!649 = !DILocalVariable(name: "param", arg: 1, scope: !644, file: !400, line: 77, type: !647)
!650 = !DILocation(line: 77, column: 1, scope: !644)
!651 = !DILocalVariable(name: "inserter", scope: !644, file: !400, line: 77, type: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!653 = !DILocation(line: 78, column: 6, scope: !654)
!654 = distinct !DILexicalBlock(scope: !644, file: !400, line: 77, column: 1)
!655 = !DILocalVariable(name: "tableListSavePath", scope: !654, file: !400, line: 80, type: !68)
!656 = !DILocation(line: 80, column: 2, scope: !644)
!657 = !DILocation(line: 81, column: 17, scope: !654)
!658 = !DILocalVariable(name: "err", scope: !654, file: !400, line: 81, type: !96)
!659 = !DILocation(line: 81, column: 2, scope: !644)
!660 = !DILocalVariable(name: "tables", scope: !654, file: !400, line: 79, type: !161)
!661 = !DILocation(line: 79, column: 6, scope: !644)
!662 = !DILocation(line: 82, column: 9, scope: !654)
!663 = !DILocation(line: 83, column: 3, scope: !654)
!664 = !DILocalVariable(name: "$ret3", scope: !644, file: !400, line: 77, type: !96)
!665 = !DILocation(line: 77, column: 40, scope: !644)
!666 = !DILocation(line: 86, column: 2, scope: !654)
!667 = !DILocalVariable(name: "sem", scope: !654, file: !400, line: 86, type: !512)
!668 = !DILocation(line: 86, column: 2, scope: !644)
!669 = !DILocation(line: 86, column: 9, scope: !654)
!670 = !DILocation(line: 87, column: 6, scope: !654)
!671 = !DILocalVariable(name: "wg", scope: !654, file: !400, line: 87, type: !517)
!672 = !DILocation(line: 87, column: 6, scope: !644)
!673 = !DILocation(line: 88, column: 2, scope: !674)
!674 = distinct !DILexicalBlock(scope: !654, file: !400, line: 88, column: 2)
!675 = !DILocation(line: 89, column: 5, scope: !674)
!676 = !DILocation(line: 90, column: 6, scope: !674)
!677 = !DILocation(line: 90, column: 3, scope: !674)
!678 = !DILocation(line: 146, column: 4, scope: !654)
!679 = !DILocation(line: 147, column: 6, scope: !654)
!680 = !DILocation(line: 148, column: 2, scope: !654)
!681 = distinct !DISubprogram(name: "database.Insert..1command_line_arguments.MySQLInserter", linkageName: "command_line_arguments.MySQLInserter.Insert", scope: null, file: !400, line: 151, type: !645, isLocal: false, isDefinition: true, scopeLine: 151, isOptimized: false, unit: !1, retainedNodes: !3)
!682 = !DILocalVariable(name: "param", arg: 1, scope: !681, file: !400, line: 151, type: !647)
!683 = !DILocation(line: 151, column: 1, scope: !681)
!684 = !DILocalVariable(name: "inserter", scope: !681, file: !400, line: 151, type: !652)
!685 = !DILocation(line: 152, column: 6, scope: !686)
!686 = distinct !DILexicalBlock(scope: !681, file: !400, line: 151, column: 1)
!687 = !DILocalVariable(name: "tableListSavePath", scope: !686, file: !400, line: 154, type: !68)
!688 = !DILocation(line: 154, column: 2, scope: !681)
!689 = !DILocation(line: 155, column: 17, scope: !686)
!690 = !DILocalVariable(name: "err", scope: !686, file: !400, line: 155, type: !96)
!691 = !DILocation(line: 155, column: 2, scope: !681)
!692 = !DILocalVariable(name: "tables", scope: !686, file: !400, line: 153, type: !161)
!693 = !DILocation(line: 153, column: 6, scope: !681)
!694 = !DILocation(line: 156, column: 9, scope: !686)
!695 = !DILocation(line: 157, column: 3, scope: !686)
!696 = !DILocalVariable(name: "$ret4", scope: !681, file: !400, line: 151, type: !96)
!697 = !DILocation(line: 151, column: 41, scope: !681)
!698 = !DILocation(line: 159, column: 2, scope: !686)
!699 = !DILocalVariable(name: "sem", scope: !686, file: !400, line: 159, type: !512)
!700 = !DILocation(line: 159, column: 2, scope: !681)
!701 = !DILocation(line: 159, column: 9, scope: !686)
!702 = !DILocation(line: 160, column: 6, scope: !686)
!703 = !DILocalVariable(name: "wg", scope: !686, file: !400, line: 160, type: !517)
!704 = !DILocation(line: 160, column: 6, scope: !681)
!705 = !DILocation(line: 161, column: 2, scope: !706)
!706 = distinct !DILexicalBlock(scope: !686, file: !400, line: 161, column: 2)
!707 = !DILocation(line: 162, column: 5, scope: !706)
!708 = !DILocation(line: 163, column: 6, scope: !706)
!709 = !DILocation(line: 163, column: 3, scope: !706)
!710 = !DILocation(line: 202, column: 5, scope: !706)
!711 = !DILocation(line: 204, column: 6, scope: !686)
!712 = !DILocation(line: 205, column: 6, scope: !686)
!713 = !DILocation(line: 206, column: 2, scope: !686)
!714 = distinct !DISubprogram(name: "database.command_line_arguments.MySQLInserter..hash", linkageName: "command_line_arguments.command_line_arguments.MySQLInserter..hash", scope: null, file: !7, line: 1, type: !10, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!715 = !DILocalVariable(name: "key", arg: 1, scope: !714, file: !7, line: 1, type: !13)
!716 = !DILocation(line: 1, column: 1, scope: !714)
!717 = !DILocalVariable(name: "seed", arg: 2, scope: !714, file: !7, line: 1, type: !12)
!718 = !DILocalVariable(name: "$ret15", scope: !714, file: !7, line: 1, type: !12)
!719 = distinct !DISubprogram(name: "database.command_line_arguments.MySQLInserter..eq", linkageName: "command_line_arguments.command_line_arguments.MySQLInserter..eq", scope: null, file: !7, line: 1, type: !20, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!720 = !DILocalVariable(name: "key1", arg: 1, scope: !719, file: !7, line: 1, type: !13)
!721 = !DILocation(line: 1, column: 1, scope: !719)
!722 = !DILocalVariable(name: "key2", arg: 2, scope: !719, file: !7, line: 1, type: !13)
!723 = !DILocalVariable(name: "$ret16", scope: !719, file: !7, line: 1, type: !22)
!724 = distinct !DISubprogram(name: "database.command_line_arguments..thunk0", scope: null, file: !400, line: 24, type: !725, isLocal: true, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !1, retainedNodes: !3)
!725 = !DISubroutineType(types: !726)
!726 = !{!22, !727}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Session}", file: !32, size: 64, align: 8, elements: !729)
!729 = !{!730}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !32, line: 24, baseType: !426, size: 64, align: 64)
!731 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !724, file: !400, line: 24, type: !727)
!732 = !DILocation(line: 24, column: 2, scope: !724)
!733 = !DILocalVariable(name: "$ret5", scope: !724, file: !400, line: 24, type: !22)
!734 = distinct !DISubprogram(name: "database.func1", scope: null, file: !400, line: 49, type: !735, isLocal: true, isDefinition: true, scopeLine: 49, isOptimized: false, unit: !1, retainedNodes: !3)
!735 = !DISubroutineType(types: !736)
!736 = !{!14, !68}
!737 = !DILocalVariable(name: "table", arg: 1, scope: !734, file: !400, line: 49, type: !68)
!738 = !DILocation(line: 49, column: 11, scope: !734)
!739 = !DILocation(line: 50, column: 4, scope: !740)
!740 = distinct !DILexicalBlock(scope: !734, file: !400, line: 49, column: 6)
!741 = !DILocation(line: 50, column: 8, scope: !740)
!742 = !DILocation(line: 70, column: 3, scope: !734)
!743 = !DILocation(line: 51, column: 10, scope: !740)
!744 = !DILocation(line: 51, column: 4, scope: !740)
!745 = !DILocation(line: 52, column: 10, scope: !740)
!746 = !DILocation(line: 52, column: 4, scope: !740)
!747 = !DILocation(line: 53, column: 20, scope: !740)
!748 = !DILocation(line: 53, column: 27, scope: !740)
!749 = !DILocation(line: 53, column: 37, scope: !740)
!750 = !DILocalVariable(name: "session", scope: !740, file: !400, line: 53, type: !426)
!751 = !DILocation(line: 53, column: 4, scope: !734)
!752 = !DILocalVariable(name: "err", scope: !740, file: !400, line: 53, type: !96)
!753 = !DILocation(line: 54, column: 11, scope: !740)
!754 = !DILocation(line: 57, column: 4, scope: !740)
!755 = !DILocation(line: 55, column: 11, scope: !740)
!756 = !DILocation(line: 55, column: 5, scope: !740)
!757 = !DILocation(line: 59, column: 8, scope: !740)
!758 = !DILocalVariable(name: "fetchResult", scope: !740, file: !400, line: 59, type: !471)
!759 = !DILocation(line: 59, column: 8, scope: !734)
!760 = !DILocation(line: 60, column: 11, scope: !740)
!761 = !DILocation(line: 60, column: 19, scope: !740)
!762 = !DILocation(line: 61, column: 58, scope: !740)
!763 = !DILocation(line: 61, column: 65, scope: !740)
!764 = !DILocation(line: 61, column: 72, scope: !740)
!765 = !DILocation(line: 61, column: 79, scope: !740)
!766 = !DILocation(line: 61, column: 90, scope: !740)
!767 = !DILocation(line: 61, column: 97, scope: !740)
!768 = !DILocation(line: 61, column: 24, scope: !740)
!769 = !DILocalVariable(name: "fetchRowsCmd", scope: !740, file: !400, line: 61, type: !68)
!770 = !DILocation(line: 61, column: 4, scope: !734)
!771 = !DILocation(line: 62, column: 35, scope: !740)
!772 = !DILocation(line: 62, column: 8, scope: !740)
!773 = !DILocation(line: 63, column: 17, scope: !740)
!774 = !DILocation(line: 64, column: 11, scope: !740)
!775 = !DILocation(line: 67, column: 33, scope: !740)
!776 = !DILocation(line: 65, column: 11, scope: !740)
!777 = !DILocation(line: 65, column: 5, scope: !740)
!778 = !DILocation(line: 68, column: 46, scope: !740)
!779 = !DILocalVariable(name: "dumpSavePath", scope: !740, file: !400, line: 67, type: !68)
!780 = !DILocation(line: 67, column: 4, scope: !734)
!781 = !DILocation(line: 68, column: 11, scope: !740)
!782 = !DILocation(line: 69, column: 44, scope: !740)
!783 = !DILocation(line: 69, column: 8, scope: !740)
!784 = distinct !DISubprogram(name: "database.command_line_arguments..thunk1", scope: null, file: !400, line: 49, type: !785, isLocal: true, isDefinition: true, scopeLine: 49, isOptimized: false, unit: !1, retainedNodes: !3)
!785 = !DISubroutineType(types: !786)
!786 = !{!14, !787}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*__go_descriptor,string}", file: !32, size: 192, align: 8, elements: !789)
!789 = !{!790, !796}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !32, line: 49, baseType: !791, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !400, line: 49, size: 64, align: 8, elements: !793)
!793 = !{!794}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !400, line: 49, baseType: !795, size: 64, align: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !32, line: 49, baseType: !68, size: 128, align: 64, offset: 64)
!797 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !784, file: !400, line: 49, type: !787)
!798 = !DILocation(line: 49, column: 3, scope: !784)
!799 = distinct !DISubprogram(name: "database.command_line_arguments..thunk2", scope: null, file: !400, line: 51, type: !800, isLocal: true, isDefinition: true, scopeLine: 51, isOptimized: false, unit: !1, retainedNodes: !3)
!800 = !DISubroutineType(types: !801)
!801 = !{!22, !802}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*WaitGroup}", file: !32, size: 64, align: 8, elements: !804)
!804 = !{!805}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !32, line: 51, baseType: !517, size: 64, align: 64)
!806 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !799, file: !400, line: 51, type: !802)
!807 = !DILocation(line: 51, column: 4, scope: !799)
!808 = !DILocalVariable(name: "$ret6", scope: !799, file: !400, line: 51, type: !22)
!809 = distinct !DISubprogram(name: "database.func2", scope: null, file: !400, line: 52, type: !810, isLocal: true, isDefinition: true, scopeLine: 52, isOptimized: false, unit: !1, retainedNodes: !3)
!810 = !DISubroutineType(types: !811)
!811 = !{!14}
!812 = !DILocation(line: 52, column: 21, scope: !809)
!813 = !DILocation(line: 52, column: 19, scope: !809)
!814 = distinct !DISubprogram(name: "database.command_line_arguments..thunk3", scope: null, file: !400, line: 52, type: !815, isLocal: true, isDefinition: true, scopeLine: 52, isOptimized: false, unit: !1, retainedNodes: !3)
!815 = !DISubroutineType(types: !816)
!816 = !{!14, !817}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*__go_descriptor}", file: !32, size: 64, align: 8, elements: !819)
!819 = !{!820}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !32, line: 52, baseType: !821, size: 64, align: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !28, line: 6, size: 64, align: 8, elements: !823)
!823 = !{!824}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !28, line: 6, baseType: !825, size: 64, align: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!826 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !814, file: !400, line: 52, type: !817)
!827 = !DILocation(line: 52, column: 4, scope: !814)
!828 = distinct !DISubprogram(name: "database.command_line_arguments..thunk4", scope: null, file: !400, line: 57, type: !725, isLocal: true, isDefinition: true, scopeLine: 57, isOptimized: false, unit: !1, retainedNodes: !3)
!829 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !828, file: !400, line: 57, type: !727)
!830 = !DILocation(line: 57, column: 4, scope: !828)
!831 = !DILocalVariable(name: "$ret7", scope: !828, file: !400, line: 57, type: !22)
!832 = distinct !DISubprogram(name: "database.func1", scope: null, file: !400, line: 90, type: !735, isLocal: true, isDefinition: true, scopeLine: 90, isOptimized: false, unit: !1, retainedNodes: !3)
!833 = !DILocalVariable(name: "table", arg: 1, scope: !832, file: !400, line: 90, type: !68)
!834 = !DILocation(line: 90, column: 11, scope: !832)
!835 = !DILocation(line: 91, column: 4, scope: !832)
!836 = !DILocation(line: 91, column: 8, scope: !832)
!837 = !DILocation(line: 144, column: 3, scope: !832)
!838 = !DILocation(line: 92, column: 10, scope: !832)
!839 = !DILocation(line: 92, column: 4, scope: !832)
!840 = !DILocation(line: 93, column: 10, scope: !832)
!841 = !DILocation(line: 93, column: 4, scope: !832)
!842 = !DILocation(line: 95, column: 34, scope: !832)
!843 = !DILocation(line: 95, column: 8, scope: !832)
!844 = !DILocation(line: 97, column: 7, scope: !832)
!845 = !DILocation(line: 97, column: 15, scope: !832)
!846 = !DILocation(line: 97, column: 21, scope: !832)
!847 = !DILocation(line: 97, column: 39, scope: !832)
!848 = !DILocation(line: 97, column: 47, scope: !832)
!849 = !DILocation(line: 97, column: 53, scope: !832)
!850 = !DILocalVariable(name: "cleanTablesCmd", scope: !851, file: !400, line: 98, type: !852)
!851 = distinct !DILexicalBlock(scope: !832, file: !400, line: 97, column: 68)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cmd", file: !400, line: 11, size: 2624, align: 8, elements: !854)
!854 = !{!855, !856, !857, !858, !859, !860, !861, !862, !915, !961, !976, !1010, !1071, !1072, !1073, !1074, !1085, !1086, !1087, !1088}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !400, line: 11, baseType: !68, size: 128, align: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "Args", file: !400, line: 11, baseType: !161, size: 192, align: 64, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "Env", file: !400, line: 11, baseType: !161, size: 192, align: 64, offset: 320)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "Dir", file: !400, line: 11, baseType: !68, size: 128, align: 64, offset: 512)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "Stdin", file: !400, line: 11, baseType: !140, size: 128, align: 64, offset: 640)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "Stdout", file: !400, line: 11, baseType: !431, size: 128, align: 64, offset: 768)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "Stderr", file: !400, line: 11, baseType: !431, size: 128, align: 64, offset: 896)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraFiles", file: !400, line: 11, baseType: !863, size: 192, align: 64, offset: 1024)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**File,int,int}", file: !32, size: 192, align: 8, elements: !864)
!864 = !{!865, !89, !90}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !866, size: 64, align: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !28, line: 7, size: 64, align: 8, elements: !869)
!869 = !{!870}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !28, line: 7, baseType: !871, size: 64, align: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !28, line: 7, size: 640, align: 8, elements: !873)
!873 = !{!874, !904, !905, !913, !914}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !28, line: 7, baseType: !875, size: 384, align: 64)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !28, line: 7, size: 384, align: 8, elements: !876)
!876 = !{!877, !883, !884, !888, !899, !900, !901, !902, !903}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !28, line: 7, baseType: !878, size: 128, align: 64)
!878 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !28, line: 7, size: 128, align: 8, elements: !879)
!879 = !{!880, !881, !882}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !28, line: 7, baseType: !159, size: 64, align: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !28, line: 7, baseType: !8, size: 32, align: 32, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !28, line: 7, baseType: !8, size: 32, align: 32, offset: 96)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !28, line: 7, baseType: !72, size: 64, align: 64, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !28, line: 7, baseType: !885, size: 64, align: 64, offset: 192)
!885 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !28, line: 7, size: 64, align: 8, elements: !886)
!886 = !{!887}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !28, line: 7, baseType: !12, size: 64, align: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !28, line: 7, baseType: !889, size: 64, align: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !32, size: 192, align: 8, elements: !891)
!891 = !{!892, !89, !90}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !893, size: 64, align: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !28, line: 7, size: 128, align: 8, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !28, line: 7, baseType: !65, size: 64, align: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !28, line: 7, baseType: !898, size: 64, align: 64, offset: 64)
!898 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !28, line: 7, baseType: !8, size: 32, align: 32, offset: 320)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !28, line: 7, baseType: !22, size: 8, align: 8, offset: 352)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !28, line: 7, baseType: !22, size: 8, align: 8, offset: 360)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !28, line: 7, baseType: !22, size: 8, align: 8, offset: 368)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !28, line: 7, baseType: !22, size: 8, align: 8, offset: 376)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !28, line: 7, baseType: !68, size: 128, align: 64, offset: 384)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !28, line: 7, baseType: !906, size: 64, align: 64, offset: 512)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !28, line: 7, size: 256, align: 8, elements: !908)
!908 = !{!909, !910}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !28, line: 7, baseType: !155, size: 192, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !28, line: 7, baseType: !911, size: 64, align: 64, offset: 192)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !28, line: 7, align: 8, elements: !3)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !28, line: 7, baseType: !22, size: 8, align: 8, offset: 576)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !28, line: 7, baseType: !22, size: 8, align: 8, offset: 584)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "SysProcAttr", file: !400, line: 11, baseType: !916, size: 64, align: 64, offset: 1216)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "SysProcAttr", file: !400, line: 10, size: 1280, align: 8, elements: !918)
!918 = !{!919, !920, !932, !933, !934, !935, !936, !937, !938, !939, !940, !942, !943, !944, !954, !955, !956}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "Chroot", file: !400, line: 10, baseType: !68, size: 128, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "Credential", file: !400, line: 10, baseType: !921, size: 64, align: 64, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "Credential", file: !400, line: 10, size: 320, align: 8, elements: !923)
!923 = !{!924, !925, !926, !931}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "Uid", file: !400, line: 10, baseType: !8, size: 32, align: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "Gid", file: !400, line: 10, baseType: !8, size: 32, align: 32, offset: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "Groups", file: !400, line: 10, baseType: !927, size: 192, align: 64, offset: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint32,int,int}", file: !32, size: 192, align: 8, elements: !928)
!928 = !{!929, !89, !90}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "NoSetGroups", file: !400, line: 10, baseType: !22, size: 8, align: 8, offset: 256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "Ptrace", file: !400, line: 10, baseType: !22, size: 8, align: 8, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "Setsid", file: !400, line: 10, baseType: !22, size: 8, align: 8, offset: 200)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "Setpgid", file: !400, line: 10, baseType: !22, size: 8, align: 8, offset: 208)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "Setctty", file: !400, line: 10, baseType: !22, size: 8, align: 8, offset: 216)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "Noctty", file: !400, line: 10, baseType: !22, size: 8, align: 8, offset: 224)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "Ctty", file: !400, line: 10, baseType: !72, size: 64, align: 64, offset: 256)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "Foreground", file: !400, line: 10, baseType: !22, size: 8, align: 8, offset: 320)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "Pgid", file: !400, line: 10, baseType: !72, size: 64, align: 64, offset: 384)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "Pdeathsig", file: !400, line: 10, baseType: !941, size: 64, align: 64, offset: 448)
!941 = !DIBasicType(name: "Signal", size: 64, encoding: DW_ATE_signed)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "Cloneflags", file: !400, line: 10, baseType: !12, size: 64, align: 64, offset: 512)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "Unshareflags", file: !400, line: 10, baseType: !12, size: 64, align: 64, offset: 576)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "UidMappings", file: !400, line: 10, baseType: !945, size: 192, align: 64, offset: 640)
!945 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*SysProcIDMap,int,int}", file: !32, size: 192, align: 8, elements: !946)
!946 = !{!947, !89, !90}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DICompositeType(tag: DW_TAG_structure_type, name: "SysProcIDMap", file: !400, line: 10, size: 192, align: 8, elements: !950)
!950 = !{!951, !952, !953}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ContainerID", file: !400, line: 10, baseType: !72, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "HostID", file: !400, line: 10, baseType: !72, size: 64, align: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !400, line: 10, baseType: !72, size: 64, align: 64, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "GidMappings", file: !400, line: 10, baseType: !945, size: 192, align: 64, offset: 832)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "GidMappingsEnableSetgroups", file: !400, line: 10, baseType: !22, size: 8, align: 8, offset: 1024)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "AmbientCaps", file: !400, line: 10, baseType: !957, size: 192, align: 64, offset: 1088)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !32, size: 192, align: 8, elements: !958)
!958 = !{!959, !89, !90}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "Process", file: !400, line: 11, baseType: !962, size: 64, align: 64, offset: 1280)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "Process", file: !400, line: 10, size: 384, align: 8, elements: !964)
!964 = !{!965, !966, !967, !968}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "Pid", file: !400, line: 10, baseType: !72, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "handle", file: !400, line: 10, baseType: !12, size: 64, align: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "isdone", file: !400, line: 10, baseType: !8, size: 32, align: 32, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "sigMu", file: !400, line: 10, baseType: !969, size: 192, align: 32, offset: 160)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !400, line: 10, size: 192, align: 8, elements: !970)
!970 = !{!971, !972, !973, !974, !975}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !400, line: 10, baseType: !349, size: 64, align: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !400, line: 10, baseType: !8, size: 32, align: 32, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !400, line: 10, baseType: !8, size: 32, align: 32, offset: 96)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !400, line: 10, baseType: !352, size: 32, align: 32, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !400, line: 10, baseType: !352, size: 32, align: 32, offset: 160)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessState", file: !400, line: 11, baseType: !977, size: 64, align: 64, offset: 1344)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProcessState", file: !400, line: 10, size: 192, align: 8, elements: !979)
!979 = !{!980, !981, !983}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "pid", file: !400, line: 10, baseType: !72, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !400, line: 10, baseType: !982, size: 32, align: 32, offset: 64)
!982 = !DIBasicType(name: "WaitStatus", size: 32, encoding: DW_ATE_unsigned)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "rusage", file: !400, line: 10, baseType: !984, size: 64, align: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rusage", file: !400, line: 10, size: 1152, align: 8, elements: !986)
!986 = !{!987, !994, !995, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "Utime", file: !400, line: 10, baseType: !988, size: 128, align: 64)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timeval", file: !400, line: 10, size: 128, align: 8, elements: !989)
!989 = !{!990, !992}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "Sec", file: !400, line: 10, baseType: !991, size: 64, align: 64)
!991 = !DIBasicType(name: "Timeval_sec_t", size: 64, encoding: DW_ATE_signed)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "Usec", file: !400, line: 10, baseType: !993, size: 64, align: 64, offset: 64)
!993 = !DIBasicType(name: "Timeval_usec_t", size: 64, encoding: DW_ATE_signed)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "Stime", file: !400, line: 10, baseType: !988, size: 128, align: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "Maxrss", file: !400, line: 10, baseType: !996, size: 64, align: 64, offset: 256)
!996 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "Ixrss", file: !400, line: 10, baseType: !996, size: 64, align: 64, offset: 320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "Idrss", file: !400, line: 10, baseType: !996, size: 64, align: 64, offset: 384)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "Isrss", file: !400, line: 10, baseType: !996, size: 64, align: 64, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "Minflt", file: !400, line: 10, baseType: !996, size: 64, align: 64, offset: 512)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "Majflt", file: !400, line: 10, baseType: !996, size: 64, align: 64, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "Nswap", file: !400, line: 10, baseType: !996, size: 64, align: 64, offset: 640)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "Inblock", file: !400, line: 10, baseType: !996, size: 64, align: 64, offset: 704)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "Oublock", file: !400, line: 10, baseType: !996, size: 64, align: 64, offset: 768)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "Msgsnd", file: !400, line: 10, baseType: !996, size: 64, align: 64, offset: 832)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "Msgrcv", file: !400, line: 10, baseType: !996, size: 64, align: 64, offset: 896)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "Nsignals", file: !400, line: 10, baseType: !996, size: 64, align: 64, offset: 960)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "Nvcsw", file: !400, line: 10, baseType: !996, size: 64, align: 64, offset: 1024)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "Nivcsw", file: !400, line: 10, baseType: !996, size: 64, align: 64, offset: 1088)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !400, line: 11, baseType: !1011, size: 128, align: 64, offset: 1408)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !400, line: 11, size: 128, align: 8, elements: !1012)
!1012 = !{!1013, !1070}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !400, line: 11, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,PublicKey)PublicKey}", file: !32, size: 320, align: 8, elements: !1016)
!1016 = !{!1017, !1018, !1058, !1062, !1063}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !32, line: 11, baseType: !42, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !32, line: 11, baseType: !1019, size: 64, align: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!1022, !13}
!1022 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !32, size: 256, align: 8, elements: !1023)
!1023 = !{!1024, !1057}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !32, line: 11, baseType: !1025, size: 192, align: 64)
!1025 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !28, line: 6, size: 192, align: 8, elements: !1026)
!1026 = !{!1027, !1028, !1029}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !28, line: 6, baseType: !159, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !28, line: 6, baseType: !996, size: 64, align: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !28, line: 6, baseType: !1030, size: 64, align: 64, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !28, line: 6, size: 704, align: 8, elements: !1032)
!1032 = !{!1033, !1034, !1043, !1054, !1055, !1056}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !28, line: 6, baseType: !68, size: 128, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !28, line: 6, baseType: !1035, size: 192, align: 64, offset: 128)
!1035 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !32, size: 192, align: 8, elements: !1036)
!1036 = !{!1037, !89, !90}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !28, line: 6, size: 256, align: 8, elements: !1040)
!1040 = !{!1033, !1041, !1042}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !28, line: 6, baseType: !72, size: 64, align: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !28, line: 6, baseType: !1044, size: 192, align: 64, offset: 320)
!1044 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !32, size: 192, align: 8, elements: !1045)
!1045 = !{!1046, !89, !90}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !28, line: 6, size: 128, align: 8, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1053}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !28, line: 6, baseType: !996, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !28, line: 6, baseType: !49, size: 8, align: 8, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 72)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 80)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !28, line: 6, baseType: !996, size: 64, align: 64, offset: 512)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !28, line: 6, baseType: !996, size: 64, align: 64, offset: 576)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !28, line: 6, baseType: !1038, size: 64, align: 64, offset: 640)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !32, line: 11, baseType: !22, size: 8, align: 8, offset: 192)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !32, line: 11, baseType: !1059, size: 64, align: 64, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!329, !13}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !32, line: 11, baseType: !93, size: 64, align: 64, offset: 192)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !32, line: 11, baseType: !1064, size: 64, align: 64, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!1067, !13, !1067}
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "PublicKey", file: !28, line: 6, size: 128, align: 8, elements: !1068)
!1068 = !{!1069, !108}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !28, line: 1, baseType: !42, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !400, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "lookPathErr", file: !400, line: 11, baseType: !96, size: 128, align: 64, offset: 1536)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "finished", file: !400, line: 11, baseType: !22, size: 8, align: 8, offset: 1664)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "childFiles", file: !400, line: 11, baseType: !863, size: 192, align: 64, offset: 1728)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "closeAfterStart", file: !400, line: 11, baseType: !1075, size: 192, align: 64, offset: 1920)
!1075 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Closer,int,int}", file: !32, size: 192, align: 8, elements: !1076)
!1076 = !{!1077, !89, !90}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !32, line: 1, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DICompositeType(tag: DW_TAG_structure_type, name: "Closer", file: !28, line: 6, size: 128, align: 8, elements: !1080)
!1080 = !{!1081, !108}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 6, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error}", file: !32, size: 128, align: 8, elements: !1084)
!1084 = !{!271, !291}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "closeAfterWait", file: !400, line: 11, baseType: !1075, size: 192, align: 64, offset: 2112)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "goroutine", file: !400, line: 11, baseType: !442, size: 192, align: 64, offset: 2304)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "errch", file: !400, line: 11, baseType: !329, size: 64, align: 64, offset: 2496)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "waitDone", file: !400, line: 11, baseType: !329, size: 64, align: 64, offset: 2560)
!1089 = !DILocation(line: 98, column: 9, scope: !832)
!1090 = !DILocation(line: 99, column: 53, scope: !851)
!1091 = !DILocation(line: 99, column: 61, scope: !851)
!1092 = !DILocation(line: 125, column: 12, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !832, file: !400, line: 123, column: 6)
!1094 = !DILocation(line: 125, column: 20, scope: !1093)
!1095 = !DILocation(line: 99, column: 18, scope: !851)
!1096 = !DILocalVariable(name: "query", scope: !851, file: !400, line: 99, type: !68)
!1097 = !DILocation(line: 99, column: 5, scope: !832)
