; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22lib\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22toml\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/BurntSushi/toml\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/BurntSushi/toml\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22pp\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/k0kubun/pp\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/k0kubun/pp\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22constants\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/timakin/gopli/constants\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./conn.go", directory: "/home/wangcong/go_path/src/github.com/timakin/gopli/lib")
!3 = !{}
!4 = !{!5, !19}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.tableBlackList", linkageName: "command_line_arguments.tableBlackList", scope: !1, file: !7, line: 8, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "file.go", directory: ".")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 512, align: 8, elements: !17)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !10, line: 1, size: 128, align: 8, elements: !11)
!10 = !DIFile(filename: "<built-in>", directory: "")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !10, line: 1, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !10, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!17 = !{!18}
!18 = !DISubrange(count: 4)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !10, line: 1, type: !21, isLocal: false, isDefinition: true)
!21 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!22 = distinct !DISubprogram(name: "lib.LoadSrcSSHConf", linkageName: "command_line_arguments.LoadSrcSSHConf", scope: null, file: !23, line: 15, type: !24, isLocal: false, isDefinition: true, scopeLine: 15, isOptimized: false, unit: !1, retainedNodes: !3)
!23 = !DIFile(filename: "conn.go", directory: ".")
!24 = !DISubroutineType(types: !25)
!25 = !{!26, !9, !9}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientConfig", file: !23, line: 4, size: 1600, align: 8, elements: !28)
!28 = !{!29, !124, !125, !169, !205, !213, !214, !215}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "Config", file: !23, line: 4, baseType: !30, size: 768, align: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !23, line: 4, size: 768, align: 8, elements: !31)
!31 = !{!32, !116, !118, !122, !123}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Rand", file: !23, line: 4, baseType: !33, size: 128, align: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !23, line: 4, size: 128, align: 8, elements: !34)
!34 = !{!35, !115}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !23, line: 4, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !38, size: 128, align: 8, elements: !39)
!38 = !DIFile(filename: "", directory: "")
!39 = !{!40, !92}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !38, line: 4, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !10, line: 1, size: 576, align: 8, elements: !43)
!43 = !{!44, !46, !47, !48, !49, !50, !51, !61, !70, !71, !73, !91}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !10, line: 1, baseType: !45, size: 64, align: 64)
!45 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !10, line: 1, baseType: !45, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !10, line: 1, baseType: !21, size: 32, align: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 160)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 168)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 176)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !10, line: 1, baseType: !52, size: 64, align: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 1, size: 64, align: 8, elements: !54)
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 1, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!45, !59, !45}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIBasicType(name: "void")
!61 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !10, line: 1, baseType: !62, size: 64, align: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 1, size: 64, align: 8, elements: !64)
!64 = !{!65}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 1, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !59, !59}
!69 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !10, line: 1, baseType: !13, size: 64, align: 64, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !10, line: 1, baseType: !72, size: 64, align: 64, offset: 384)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !10, line: 1, baseType: !74, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !10, line: 1, size: 320, align: 8, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !10, line: 1, baseType: !72, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !10, line: 1, baseType: !72, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !10, line: 1, baseType: !80, size: 192, align: 64, offset: 128)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !38, size: 192, align: 8, elements: !81)
!81 = !{!82, !89, !90}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !10, line: 1, size: 320, align: 8, elements: !85)
!85 = !{!77, !78, !86, !87, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !10, line: 1, baseType: !59, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !10, line: 1, baseType: !59, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !10, line: 1, baseType: !59, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !38, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !38, line: 1, baseType: !16, size: 64, align: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !10, line: 1, baseType: !59, size: 64, align: 64, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !38, line: 4, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !59, !112}
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !38, size: 192, align: 8, elements: !97)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !38, line: 4, baseType: !16, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !38, line: 4, baseType: !100, size: 128, align: 64, offset: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !10, line: 1, size: 128, align: 8, elements: !101)
!101 = !{!102, !111}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 1, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !38, size: 128, align: 8, elements: !105)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !38, line: 1, baseType: !41, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !38, line: 1, baseType: !108, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!9, !59}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !38, size: 192, align: 8, elements: !113)
!113 = !{!114, !89, !90}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !13, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !23, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "RekeyThreshold", file: !23, line: 4, baseType: !117, size: 64, align: 64, offset: 128)
!117 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "KeyExchanges", file: !23, line: 4, baseType: !119, size: 192, align: 64, offset: 192)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !38, size: 192, align: 8, elements: !120)
!120 = !{!121, !89, !90}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !72, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Ciphers", file: !23, line: 4, baseType: !119, size: 192, align: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "MACs", file: !23, line: 4, baseType: !119, size: 192, align: 64, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !23, line: 4, baseType: !9, size: 128, align: 64, offset: 768)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Auth", file: !23, line: 4, baseType: !126, size: 192, align: 64, offset: 896)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AuthMethod,int,int}", file: !38, size: 192, align: 8, elements: !127)
!127 = !{!128, !89, !90}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "AuthMethod", file: !23, line: 4, size: 128, align: 8, elements: !131)
!131 = !{!132, !115}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !23, line: 4, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int},string,.golang.org/x/crypto/ssh.packetConn,Reader)struct{.golang.org/x/crypto/ssh.authResult,struct{*string,int,int},error},*func(*void)string}", file: !38, size: 192, align: 8, elements: !135)
!135 = !{!40, !136, !168}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "auth", file: !38, line: 4, baseType: !137, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!140, !59, !112, !9, !146, !33}
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.golang.org/x/crypto/ssh.authResult,struct{*string,int,int},error}", file: !38, size: 384, align: 8, elements: !141)
!141 = !{!142, !144, !145}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 4, baseType: !143, size: 64, align: 64)
!143 = !DIBasicType(name: ".golang.org/x/crypto/ssh.authResult", size: 64, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 4, baseType: !119, size: 192, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 4, baseType: !100, size: 128, align: 64, offset: 256)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: ".golang.org/x/crypto/ssh.packetConn", file: !23, line: 4, size: 128, align: 8, elements: !147)
!147 = !{!148, !115}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !23, line: 4, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)struct{struct{*uint8,int,int},error},*func(*void,struct{*uint8,int,int})error}", file: !38, size: 256, align: 8, elements: !151)
!151 = !{!40, !152, !156, !164}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !38, line: 4, baseType: !153, size: 64, align: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!100, !59}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "readPacket", file: !38, line: 4, baseType: !157, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!160, !59}
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !38, size: 320, align: 8, elements: !161)
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 4, baseType: !112, size: 192, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 4, baseType: !100, size: 128, align: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "writePacket", file: !38, line: 4, baseType: !165, size: 64, align: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!100, !59, !112}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "method", file: !38, line: 4, baseType: !108, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "HostKeyCallback", file: !23, line: 4, baseType: !170, size: 64, align: 64, offset: 1088)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !23, line: 4, size: 64, align: 8, elements: !172)
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !23, line: 4, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!100, !9, !177, !185}
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "Addr", file: !23, line: 4, size: 128, align: 8, elements: !178)
!178 = !{!179, !115}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !23, line: 4, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)string}", file: !38, size: 192, align: 8, elements: !182)
!182 = !{!40, !183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Network", file: !38, line: 4, baseType: !108, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !38, line: 4, baseType: !108, size: 64, align: 64, offset: 128)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "PublicKey", file: !23, line: 4, size: 128, align: 8, elements: !186)
!186 = !{!187, !115}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !23, line: 4, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{*uint8,int,int},*func(*void)string,*func(*void,struct{*uint8,int,int},*Signature)error}", file: !38, size: 256, align: 8, elements: !190)
!190 = !{!40, !191, !195, !196}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Marshal", file: !38, line: 4, baseType: !192, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!112, !59}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !38, line: 4, baseType: !108, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Verify", file: !38, line: 4, baseType: !197, size: 64, align: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!100, !59, !112, !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "Signature", file: !23, line: 4, size: 320, align: 8, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Format", file: !23, line: 4, baseType: !9, size: 128, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Blob", file: !23, line: 4, baseType: !112, size: 192, align: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "BannerCallback", file: !23, line: 4, baseType: !206, size: 64, align: 64, offset: 1152)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !23, line: 4, size: 64, align: 8, elements: !208)
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !23, line: 4, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!100, !9}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ClientVersion", file: !23, line: 4, baseType: !9, size: 128, align: 64, offset: 1216)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "HostKeyAlgorithms", file: !23, line: 4, baseType: !119, size: 192, align: 64, offset: 1344)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Timeout", file: !23, line: 4, baseType: !216, size: 64, align: 64, offset: 1536)
!216 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!217 = !DILocalVariable(name: "sshUser", arg: 1, scope: !22, file: !23, line: 15, type: !9)
!218 = !DILocation(line: 15, column: 21, scope: !22)
!219 = !DILocalVariable(name: "keypath", arg: 2, scope: !22, file: !23, line: 15, type: !9)
!220 = !DILocation(line: 15, column: 37, scope: !22)
!221 = !DILocalVariable(name: "$ret0", scope: !22, file: !23, line: 15, type: !26)
!222 = !DILocation(line: 15, column: 53, scope: !22)
!223 = !DILocation(line: 16, column: 17, scope: !224)
!224 = distinct !DILexicalBlock(scope: !22, file: !23, line: 15, column: 1)
!225 = !DILocalVariable(name: "usr", scope: !224, file: !23, line: 16, type: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "User", file: !23, line: 6, size: 640, align: 8, elements: !228)
!228 = !{!229, !230, !231, !232, !233}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Uid", file: !23, line: 6, baseType: !9, size: 128, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Gid", file: !23, line: 6, baseType: !9, size: 128, align: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Username", file: !23, line: 6, baseType: !9, size: 128, align: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !23, line: 6, baseType: !9, size: 128, align: 64, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "HomeDir", file: !23, line: 6, baseType: !9, size: 128, align: 64, offset: 512)
!234 = !DILocation(line: 16, column: 2, scope: !22)
!235 = !DILocation(line: 17, column: 45, scope: !224)
!236 = !DILocation(line: 17, column: 20, scope: !224)
!237 = !DILocation(line: 18, column: 28, scope: !224)
!238 = !DILocalVariable(name: "absKeyPath", scope: !224, file: !23, line: 18, type: !9)
!239 = !DILocation(line: 18, column: 2, scope: !22)
!240 = !DILocation(line: 19, column: 21, scope: !224)
!241 = !DILocalVariable(name: "err", scope: !224, file: !23, line: 19, type: !100)
!242 = !DILocation(line: 19, column: 2, scope: !22)
!243 = !DILocation(line: 20, column: 9, scope: !224)
!244 = !DILocalVariable(name: "key", scope: !224, file: !23, line: 19, type: !112)
!245 = !DILocation(line: 24, column: 21, scope: !224)
!246 = !DILocation(line: 25, column: 9, scope: !224)
!247 = !DILocation(line: 21, column: 48, scope: !224)
!248 = !DILocation(line: 21, column: 7, scope: !224)
!249 = !DILocation(line: 32, column: 8, scope: !224)
!250 = !DILocation(line: 31, column: 9, scope: !224)
!251 = !DILocation(line: 29, column: 12, scope: !224)
!252 = !DILocation(line: 29, column: 17, scope: !224)
!253 = !DILocalVariable(name: "config", scope: !224, file: !23, line: 29, type: !26)
!254 = !DILocation(line: 29, column: 2, scope: !22)
!255 = !DILocation(line: 35, column: 2, scope: !224)
!256 = !DILocation(line: 26, column: 49, scope: !224)
!257 = !DILocation(line: 26, column: 7, scope: !224)
!258 = distinct !DISubprogram(name: "lib.SetupMultiCore", linkageName: "command_line_arguments.SetupMultiCore", scope: null, file: !259, line: 8, type: !260, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!259 = !DIFile(filename: "cpu.go", directory: ".")
!260 = !DISubroutineType(types: !261)
!261 = !{!60}
!262 = !DILocation(line: 9, column: 17, scope: !263)
!263 = distinct !DILexicalBlock(scope: !258, file: !259, line: 8, column: 1)
!264 = !DILocalVariable(name: "maxProcs", scope: !263, file: !259, line: 9, type: !9)
!265 = !DILocation(line: 9, column: 2, scope: !258)
!266 = !DILocation(line: 11, column: 14, scope: !263)
!267 = !DILocation(line: 12, column: 19, scope: !268)
!268 = distinct !DILexicalBlock(scope: !263, file: !259, line: 11, column: 20)
!269 = !DILocalVariable(name: "cpus", scope: !268, file: !259, line: 12, type: !16)
!270 = !DILocation(line: 12, column: 3, scope: !263)
!271 = !DILocation(line: 13, column: 11, scope: !268)
!272 = distinct !DISubprogram(name: "lib.Isnil", linkageName: "command_line_arguments.Isnil", scope: null, file: !273, line: 8, type: !274, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!273 = !DIFile(filename: "dir.go", directory: ".")
!274 = !DISubroutineType(types: !275)
!275 = !{!69, !276}
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "PublicKey", file: !23, line: 4, size: 128, align: 8, elements: !277)
!277 = !{!278, !115}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !23, line: 1, baseType: !41, size: 64, align: 64)
!279 = !DILocalVariable(name: "x", arg: 1, scope: !272, file: !273, line: 8, type: !276)
!280 = !DILocation(line: 8, column: 12, scope: !272)
!281 = !DILocalVariable(name: "$ret1", scope: !272, file: !273, line: 8, type: !69)
!282 = !DILocation(line: 8, column: 27, scope: !272)
!283 = !DILocation(line: 9, column: 11, scope: !272)
!284 = !DILocation(line: 9, column: 23, scope: !272)
!285 = !DILocation(line: 9, column: 2, scope: !272)
!286 = distinct !DISubprogram(name: "lib.DeleteTmpDir", linkageName: "command_line_arguments.DeleteTmpDir", scope: null, file: !273, line: 12, type: !287, isLocal: false, isDefinition: true, scopeLine: 12, isOptimized: false, unit: !1, retainedNodes: !3)
!287 = !DISubroutineType(types: !288)
!288 = !{!60, !9}
!289 = !DILocalVariable(name: "dirPath", arg: 1, scope: !286, file: !273, line: 12, type: !9)
!290 = !DILocation(line: 12, column: 19, scope: !286)
!291 = !DILocation(line: 13, column: 12, scope: !292)
!292 = distinct !DILexicalBlock(scope: !286, file: !273, line: 12, column: 1)
!293 = !DILocalVariable(name: "err", scope: !292, file: !273, line: 13, type: !100)
!294 = !DILocation(line: 13, column: 2, scope: !286)
!295 = !DILocation(line: 14, column: 9, scope: !292)
!296 = !DILocation(line: 15, column: 12, scope: !292)
!297 = !DILocation(line: 15, column: 6, scope: !292)
!298 = distinct !DISubprogram(name: "lib.ReadLines", linkageName: "command_line_arguments.ReadLines", scope: null, file: !7, line: 19, type: !299, isLocal: false, isDefinition: true, scopeLine: 19, isOptimized: false, unit: !1, retainedNodes: !3)
!299 = !DISubroutineType(types: !300)
!300 = !{!301, !9}
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*string,int,int},error}", file: !38, size: 320, align: 8, elements: !302)
!302 = !{!303, !304}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 19, baseType: !119, size: 192, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 19, baseType: !100, size: 128, align: 64, offset: 192)
!305 = !DILocalVariable(name: "path", arg: 1, scope: !298, file: !7, line: 19, type: !9)
!306 = !DILocation(line: 19, column: 16, scope: !298)
!307 = !DILocalVariable(name: "$ret4", scope: !298, file: !7, line: 19, type: !100)
!308 = !DILocation(line: 19, column: 40, scope: !298)
!309 = !DILocation(line: 20, column: 18, scope: !310)
!310 = distinct !DILexicalBlock(scope: !298, file: !7, line: 19, column: 1)
!311 = !DILocation(line: 35, column: 1, scope: !298)
!312 = !DILocalVariable(name: "file", scope: !310, file: !7, line: 20, type: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !23, line: 9, size: 64, align: 8, elements: !315)
!315 = !{!316}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !23, line: 9, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !23, line: 9, size: 640, align: 8, elements: !319)
!319 = !{!320, !350, !351, !359, !360}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !23, line: 9, baseType: !321, size: 384, align: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !23, line: 9, size: 384, align: 8, elements: !322)
!322 = !{!323, !329, !330, !334, !345, !346, !347, !348, !349}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !23, line: 9, baseType: !324, size: 128, align: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !23, line: 9, size: 128, align: 8, elements: !325)
!325 = !{!326, !327, !328}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !23, line: 9, baseType: !117, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !23, line: 9, baseType: !21, size: 32, align: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !23, line: 9, baseType: !21, size: 32, align: 32, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !23, line: 9, baseType: !16, size: 64, align: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !23, line: 9, baseType: !331, size: 64, align: 64, offset: 192)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !23, line: 9, size: 64, align: 8, elements: !332)
!332 = !{!333}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !23, line: 9, baseType: !45, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !23, line: 9, baseType: !335, size: 64, align: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !38, size: 192, align: 8, elements: !337)
!337 = !{!338, !89, !90}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !23, line: 9, size: 128, align: 8, elements: !341)
!341 = !{!342, !343}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !23, line: 9, baseType: !13, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !23, line: 9, baseType: !344, size: 64, align: 64, offset: 64)
!344 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !23, line: 9, baseType: !21, size: 32, align: 32, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !23, line: 9, baseType: !69, size: 8, align: 8, offset: 352)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !23, line: 9, baseType: !69, size: 8, align: 8, offset: 360)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !23, line: 9, baseType: !69, size: 8, align: 8, offset: 368)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !23, line: 9, baseType: !69, size: 8, align: 8, offset: 376)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !23, line: 9, baseType: !9, size: 128, align: 64, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !23, line: 9, baseType: !352, size: 64, align: 64, offset: 512)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !23, line: 9, size: 256, align: 8, elements: !354)
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !23, line: 9, baseType: !112, size: 192, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !23, line: 9, baseType: !357, size: 64, align: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !23, line: 9, align: 8, elements: !3)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !23, line: 9, baseType: !69, size: 8, align: 8, offset: 576)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !23, line: 9, baseType: !69, size: 8, align: 8, offset: 584)
!361 = !DILocation(line: 20, column: 2, scope: !298)
!362 = !DILocalVariable(name: "err", scope: !310, file: !7, line: 20, type: !100)
!363 = !DILocation(line: 21, column: 9, scope: !310)
!364 = !DILocation(line: 22, column: 3, scope: !310)
!365 = !DILocation(line: 24, column: 2, scope: !310)
!366 = !DILocation(line: 27, column: 30, scope: !310)
!367 = !DILocation(line: 27, column: 19, scope: !310)
!368 = !DILocation(line: 28, column: 13, scope: !310)
!369 = !DILocation(line: 29, column: 27, scope: !310)
!370 = !DILocalVariable(name: "table", arg: 1, scope: !371, file: !7, line: 10, type: !9)
!371 = distinct !DISubprogram(name: "lib.isInBlackList", scope: null, file: !7, line: 10, type: !372, isLocal: true, isDefinition: true, scopeLine: 10, isOptimized: false, unit: !1, retainedNodes: !3)
!372 = !DISubroutineType(types: !373)
!373 = !{!69, !9}
!374 = !DILocation(line: 10, column: 20, scope: !371, inlinedAt: !375)
!375 = distinct !DILocation(line: 29, column: 6, scope: !310)
!376 = !DILocalVariable(name: "$ret2", scope: !371, file: !7, line: 10, type: !69)
!377 = !DILocation(line: 10, column: 34, scope: !371, inlinedAt: !375)
!378 = !DILocalVariable(name: "blackListElem", scope: !379, file: !7, line: 11, type: !9)
!379 = distinct !DILexicalBlock(scope: !371, file: !7, line: 11, column: 2)
!380 = !DILocation(line: 11, column: 6, scope: !371, inlinedAt: !375)
!381 = !DILocation(line: 12, column: 20, scope: !379, inlinedAt: !375)
!382 = !DILocation(line: 32, column: 32, scope: !310)
!383 = !DILocation(line: 32, column: 11, scope: !310)
!384 = !DILocation(line: 32, column: 9, scope: !310)
!385 = !DILocation(line: 34, column: 23, scope: !310)
!386 = !DILocation(line: 34, column: 2, scope: !310)
!387 = !DILocation(line: 22, column: 3, scope: !298)
!388 = distinct !DISubprogram(name: "lib.command_line_arguments..thunk0", scope: null, file: !7, line: 24, type: !389, isLocal: true, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !1, retainedNodes: !3)
!389 = !DISubroutineType(types: !390)
!390 = !{!69, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*File}", file: !38, size: 64, align: 8, elements: !393)
!393 = !{!394}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !38, line: 24, baseType: !313, size: 64, align: 64)
!395 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !388, file: !7, line: 24, type: !391)
!396 = !DILocation(line: 24, column: 2, scope: !388)
!397 = !DILocalVariable(name: "$ret5", scope: !388, file: !7, line: 24, type: !69)
!398 = distinct !DISubprogram(name: "lib.LoadTomlConf", linkageName: "command_line_arguments.LoadTomlConf", scope: null, file: !399, line: 16, type: !400, isLocal: false, isDefinition: true, scopeLine: 16, isOptimized: false, unit: !1, retainedNodes: !3)
!399 = !DIFile(filename: "toml.go", directory: ".")
!400 = !DISubroutineType(types: !401)
!401 = !{!402, !9}
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.tomlConfig", file: !399, line: 11, size: 128, align: 8, elements: !403)
!403 = !{!404, !418}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Database", file: !399, line: 12, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !10, line: 1, size: 384, align: 8, elements: !407)
!407 = !{!408, !409, !410, !411, !413, !414, !415, !416, !417}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !10, line: 1, baseType: !16, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 72)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !10, line: 1, baseType: !412, size: 16, align: 16, offset: 80)
!412 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !10, line: 1, baseType: !21, size: 32, align: 32, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !10, line: 1, baseType: !59, size: 64, align: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !10, line: 1, baseType: !59, size: 64, align: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !10, line: 1, baseType: !45, size: 64, align: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !10, line: 1, baseType: !59, size: 64, align: 64, offset: 320)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "SSH", file: !399, line: 13, baseType: !405, size: 64, align: 64, offset: 64)
!419 = !DILocalVariable(name: "configPath", arg: 1, scope: !398, file: !399, line: 16, type: !9)
!420 = !DILocation(line: 16, column: 19, scope: !398)
!421 = !DILocation(line: 16, column: 39, scope: !398)
!422 = !DILocalVariable(name: "tmlconf", scope: !398, file: !399, line: 16, type: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!424 = !DILocation(line: 17, column: 6, scope: !398)
!425 = !DILocation(line: 18, column: 43, scope: !426)
!426 = distinct !DILexicalBlock(scope: !398, file: !399, line: 18, column: 2)
!427 = !DILocation(line: 18, column: 20, scope: !426)
!428 = !DILocalVariable(name: "err", scope: !426, file: !399, line: 18, type: !100)
!429 = !DILocation(line: 18, column: 5, scope: !398)
!430 = !DILocation(line: 18, column: 58, scope: !426)
!431 = !DILocation(line: 22, column: 6, scope: !398)
!432 = !DILocation(line: 23, column: 2, scope: !398)
!433 = !DILocation(line: 19, column: 12, scope: !426)
!434 = !DILocation(line: 19, column: 6, scope: !426)
!435 = distinct !DISubprogram(name: "lib.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", linkageName: "command_line_arguments.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", scope: null, file: !10, line: 1, type: !57, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!436 = !DILocalVariable(name: "key", arg: 1, scope: !435, file: !10, line: 1, type: !59)
!437 = !DILocation(line: 1, column: 1, scope: !435)
!438 = !DILocalVariable(name: "seed", arg: 2, scope: !435, file: !10, line: 1, type: !45)
!439 = !DILocalVariable(name: "$ret24", scope: !435, file: !10, line: 1, type: !45)
!440 = distinct !DISubprogram(name: "lib.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", linkageName: "command_line_arguments.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", scope: null, file: !10, line: 1, type: !67, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!441 = !DILocalVariable(name: "key1", arg: 1, scope: !440, file: !10, line: 1, type: !59)
!442 = !DILocation(line: 1, column: 1, scope: !440)
!443 = !DILocalVariable(name: "key2", arg: 2, scope: !440, file: !10, line: 1, type: !59)
!444 = !DILocalVariable(name: "$ret25", scope: !440, file: !10, line: 1, type: !69)
!445 = distinct !DISubprogram(name: "lib.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !23, line: 1, type: !260, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!446 = !DILocation(line: 1, column: 1, scope: !447)
!447 = !DILexicalBlockFile(scope: !445, file: !10, discriminator: 0)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "lib"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "command-line-arguments"
	.ascii ";\n"
	.ascii "import "
	.ascii "bufio"
	.ascii " "
	.ascii "bufio"
	.ascii " \""
	.ascii "bufio"
	.ascii "\";\n"
	.ascii "import "
	.ascii "toml"
	.ascii " "
	.ascii "github.com/BurntSushi/toml"
	.ascii " \""
	.ascii "github.com/BurntSushi/toml"
	.ascii "\";\n"
	.ascii "import "
	.ascii "pp"
	.ascii " "
	.ascii "github.com/k0kubun/pp"
	.ascii " \""
	.ascii "github.com/k0kubun/pp"
	.ascii "\";\n"
	.ascii "import "
	.ascii "constants"
	.ascii " "
	.ascii "github.com/timakin/gopli/constants"
	.ascii " \""
	.ascii "github.com/timakin/gopli/constants"
	.ascii "\";\n"
	.ascii "import "
	.ascii "ssh"
	.ascii " "
	.ascii "golang.org/x/crypto/ssh"
	.ascii " \""
	.ascii "golang.org/x/crypto/ssh"
	.ascii "\";\n"
	.ascii "import "
	.ascii "ioutil"
	.ascii " "
	.ascii "io/ioutil"
	.ascii " \""
	.ascii "io/ioutil"
	.ascii "\";\n"
	.ascii "import "
	.ascii "log"
	.ascii " "
	.ascii "log"
	.ascii " \""
	.ascii "log"
	.ascii "\";\n"
	.ascii "import "
	.ascii "os"
	.ascii " "
	.ascii "os"
