; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22cli\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/codegangsta/cli\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/codegangsta/cli\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22command\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/timakin/gopli/command\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/timakin/gopli/command\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22os\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22os\22"
module asm "\09.ascii \22 \5C\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./commands.go", directory: "/home/wangcong/go_path/src/github.com/timakin/gopli")
!3 = !{}
!4 = !{!5, !152, !212, !214, !265}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "main.GlobalFlags", linkageName: "main.GlobalFlags", scope: !1, file: !7, line: 11, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "commands.go", directory: ".")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Flag,int,int}", file: !9, size: 192, align: 8, elements: !10)
!9 = !DIFile(filename: "", directory: "")
!10 = !{!11, !77, !78}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", file: !7, line: 7, size: 128, align: 8, elements: !14)
!14 = !{!15, !149}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 7, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*FlagSet)void,*func(*void)string,*func(*void)string}", file: !9, size: 256, align: 8, elements: !18)
!18 = !{!19, !80, !150, !151}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 7, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !22, line: 1, size: 576, align: 8, elements: !23)
!22 = !DIFile(filename: "<built-in>", directory: "")
!23 = !{!24, !26, !27, !29, !31, !32, !33, !43, !52, !54, !61, !79}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !22, line: 1, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !22, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !22, line: 1, baseType: !28, size: 32, align: 32, offset: 128)
!28 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !22, line: 1, baseType: !30, size: 8, align: 8, offset: 160)
!30 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !22, line: 1, baseType: !30, size: 8, align: 8, offset: 168)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !22, line: 1, baseType: !30, size: 8, align: 8, offset: 176)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !22, line: 1, baseType: !34, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !22, line: 1, size: 64, align: 8, elements: !36)
!36 = !{!37}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !22, line: 1, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!25, !41, !25}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIBasicType(name: "void")
!43 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !22, line: 1, baseType: !44, size: 64, align: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !22, line: 1, size: 64, align: 8, elements: !46)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !22, line: 1, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !41, !41}
!51 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !22, line: 1, baseType: !53, size: 64, align: 64, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !22, line: 1, baseType: !55, size: 64, align: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !22, line: 1, size: 128, align: 8, elements: !57)
!57 = !{!58, !59}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !22, line: 1, baseType: !53, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !22, line: 1, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !22, line: 1, baseType: !62, size: 64, align: 64, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !22, line: 1, size: 320, align: 8, elements: !64)
!64 = !{!65, !66, !67}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !22, line: 1, baseType: !55, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !22, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !22, line: 1, baseType: !68, size: 192, align: 64, offset: 128)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !9, size: 192, align: 8, elements: !69)
!69 = !{!70, !77, !78}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !22, line: 1, size: 320, align: 8, elements: !73)
!73 = !{!65, !66, !74, !75, !76}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !22, line: 1, baseType: !41, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !22, line: 1, baseType: !41, size: 64, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !22, line: 1, baseType: !41, size: 64, align: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !9, line: 1, baseType: !60, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !9, line: 1, baseType: !60, size: 64, align: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !22, line: 1, baseType: !41, size: 64, align: 64, offset: 512)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Apply", file: !9, line: 7, baseType: !81, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!42, !41, !84}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "FlagSet", file: !7, line: 7, size: 768, align: 8, elements: !86)
!86 = !{!87, !95, !96, !97, !111, !112, !116, !118}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Usage", file: !7, line: 7, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 7, size: 64, align: 8, elements: !90)
!90 = !{!91}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 7, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!42}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "parsed", file: !7, line: 7, baseType: !51, size: 8, align: 8, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "actual", file: !7, line: 7, baseType: !98, size: 64, align: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !22, line: 1, size: 384, align: 8, elements: !100)
!100 = !{!101, !102, !103, !104, !106, !107, !108, !109, !110}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !22, line: 1, baseType: !60, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !22, line: 1, baseType: !30, size: 8, align: 8, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !22, line: 1, baseType: !30, size: 8, align: 8, offset: 72)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !22, line: 1, baseType: !105, size: 16, align: 16, offset: 80)
!105 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !22, line: 1, baseType: !28, size: 32, align: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !22, line: 1, baseType: !41, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !22, line: 1, baseType: !41, size: 64, align: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !22, line: 1, baseType: !25, size: 64, align: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !22, line: 1, baseType: !41, size: 64, align: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "formal", file: !7, line: 7, baseType: !98, size: 64, align: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "args", file: !7, line: 7, baseType: !113, size: 192, align: 64, offset: 384)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !9, size: 192, align: 8, elements: !114)
!114 = !{!115, !77, !78}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !55, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "errorHandling", file: !7, line: 7, baseType: !117, size: 64, align: 64, offset: 576)
!117 = !DIBasicType(name: "ErrorHandling", size: 64, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "output", file: !7, line: 7, baseType: !119, size: 128, align: 64, offset: 640)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !7, line: 4, size: 128, align: 8, elements: !120)
!120 = !{!121, !149}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 4, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !9, size: 128, align: 8, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 4, baseType: !20, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !9, line: 4, baseType: !127, size: 64, align: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!130, !41, !146}
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !9, size: 192, align: 8, elements: !131)
!131 = !{!132, !133}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !9, line: 4, baseType: !60, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !9, line: 4, baseType: !134, size: 128, align: 64, offset: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !22, line: 1, size: 128, align: 8, elements: !135)
!135 = !{!136, !145}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !22, line: 1, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !9, size: 128, align: 8, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 1, baseType: !20, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !9, line: 1, baseType: !142, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!56, !41}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !22, line: 1, baseType: !41, size: 64, align: 64, offset: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !9, size: 192, align: 8, elements: !147)
!147 = !{!148, !77, !78}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !53, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !41, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "GetName", file: !9, line: 7, baseType: !142, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !9, line: 7, baseType: !142, size: 64, align: 64, offset: 192)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "main.Commands", linkageName: "main.Commands", scope: !1, file: !7, line: 13, type: !154, isLocal: false, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Command,int,int}", file: !9, size: 192, align: 8, elements: !155)
!155 = !{!156, !77, !78}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "Command", file: !7, line: 7, size: 2368, align: 8, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !176, !184, !185, !189, !197, !203, !204, !205, !206, !207, !208, !209, !210, !211}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !7, line: 7, baseType: !56, size: 128, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ShortName", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Aliases", file: !7, line: 7, baseType: !113, size: 192, align: 64, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Usage", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 448)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "UsageText", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Description", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ArgsUsage", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 832)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Category", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "BashComplete", file: !7, line: 7, baseType: !169, size: 64, align: 64, offset: 1088)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 7, size: 64, align: 8, elements: !171)
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 7, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!42, !41}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Before", file: !7, line: 7, baseType: !177, size: 64, align: 64, offset: 1152)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 7, size: 64, align: 8, elements: !179)
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 7, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!134, !41}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "After", file: !7, line: 7, baseType: !177, size: 64, align: 64, offset: 1216)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Action", file: !7, line: 7, baseType: !186, size: 128, align: 64, offset: 1280)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !9, size: 128, align: 8, elements: !187)
!187 = !{!140, !188}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !9, line: 1, baseType: !41, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "OnUsageError", file: !7, line: 7, baseType: !190, size: 64, align: 64, offset: 1408)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 7, size: 64, align: 8, elements: !192)
!192 = !{!193}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 7, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!134, !41, !134, !51}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Subcommands", file: !7, line: 7, baseType: !198, size: 192, align: 64, offset: 1472)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "Commands", file: !7, line: 7, size: 192, align: 8, elements: !199)
!199 = !{!200, !201, !202}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !7, line: 1, baseType: !41, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !7, line: 1, baseType: !60, size: 64, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !7, line: 1, baseType: !60, size: 64, align: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !7, line: 7, baseType: !8, size: 192, align: 64, offset: 1664)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "SkipFlagParsing", file: !7, line: 7, baseType: !51, size: 8, align: 8, offset: 1856)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "SkipArgReorder", file: !7, line: 7, baseType: !51, size: 8, align: 8, offset: 1864)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "HideHelp", file: !7, line: 7, baseType: !51, size: 8, align: 8, offset: 1872)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Hidden", file: !7, line: 7, baseType: !51, size: 8, align: 8, offset: 1880)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "UseShortOptionHandling", file: !7, line: 7, baseType: !51, size: 8, align: 8, offset: 1888)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "HelpName", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 1920)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "commandNamePath", file: !7, line: 7, baseType: !113, size: 192, align: 64, offset: 2048)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "CustomHelpTemplate", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 2240)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !22, line: 1, type: !28, isLocal: false, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "os.Stderr", linkageName: "os.Stderr", scope: !1, file: !7, line: 5, type: !216, isLocal: false, isDefinition: true)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !7, line: 5, size: 64, align: 8, elements: !218)
!218 = !{!219}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !7, line: 5, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !7, line: 5, size: 640, align: 8, elements: !222)
!222 = !{!223, !254, !255, !263, !264}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !7, line: 5, baseType: !224, size: 384, align: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !7, line: 5, size: 384, align: 8, elements: !225)
!225 = !{!226, !233, !234, !238, !249, !250, !251, !252, !253}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !7, line: 5, baseType: !227, size: 128, align: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !7, line: 5, size: 128, align: 8, elements: !228)
!228 = !{!229, !231, !232}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 5, baseType: !230, size: 64, align: 64)
!230 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !7, line: 5, baseType: !28, size: 32, align: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !7, line: 5, baseType: !28, size: 32, align: 32, offset: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !7, line: 5, baseType: !60, size: 64, align: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !7, line: 5, baseType: !235, size: 64, align: 64, offset: 192)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !7, line: 5, size: 64, align: 8, elements: !236)
!236 = !{!237}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !7, line: 5, baseType: !25, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !7, line: 5, baseType: !239, size: 64, align: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !9, size: 192, align: 8, elements: !241)
!241 = !{!242, !77, !78}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !7, line: 5, size: 128, align: 8, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !7, line: 5, baseType: !53, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !7, line: 5, baseType: !248, size: 64, align: 64, offset: 64)
!248 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !7, line: 5, baseType: !28, size: 32, align: 32, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !7, line: 5, baseType: !51, size: 8, align: 8, offset: 352)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !7, line: 5, baseType: !51, size: 8, align: 8, offset: 360)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !7, line: 5, baseType: !51, size: 8, align: 8, offset: 368)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !7, line: 5, baseType: !51, size: 8, align: 8, offset: 376)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 5, baseType: !56, size: 128, align: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !7, line: 5, baseType: !256, size: 64, align: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !7, line: 5, size: 256, align: 8, elements: !258)
!258 = !{!259, !260}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 5, baseType: !146, size: 192, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !7, line: 5, baseType: !261, size: 64, align: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !7, line: 5, align: 8, elements: !3)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !7, line: 5, baseType: !51, size: 8, align: 8, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !7, line: 5, baseType: !51, size: 8, align: 8, offset: 584)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "os.Args", linkageName: "os.Args", scope: !1, file: !7, line: 5, type: !113, isLocal: false, isDefinition: true)
!267 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !7, line: 1, type: !93, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!268 = !DILocation(line: 1, column: 1, scope: !269)
!269 = !DILexicalBlockFile(scope: !267, file: !22, discriminator: 0)
!270 = !DILocation(line: 18, column: 11, scope: !271)
!271 = !DILexicalBlockFile(scope: !267, file: !7, discriminator: 0)
!272 = !DILocation(line: 14, column: 2, scope: !271)
!273 = !DILocation(line: 13, column: 16, scope: !271)
!274 = !DILocation(line: 13, column: 5, scope: !271)
!275 = distinct !DISubprogram(name: "main.CommandNotFound", linkageName: "main.CommandNotFound", scope: null, file: !7, line: 35, type: !276, isLocal: false, isDefinition: true, scopeLine: 35, isOptimized: false, unit: !1, retainedNodes: !3)
!276 = !DISubroutineType(types: !277)
!277 = !{!42, !278, !56}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !7, line: 7, size: 2688, align: 8, elements: !280)
!280 = !{!281, !381, !382, !383, !384, !385}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "App", file: !7, line: 7, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "App", file: !7, line: 7, size: 3392, align: 8, elements: !284)
!284 = !{!160, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !305, !306, !307, !308, !309, !314, !315, !349, !357, !358, !359, !360, !361, !362, !370, !371, !379, !380}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "HelpName", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Usage", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "UsageText", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ArgsUsage", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 640)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Description", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 768)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Commands", file: !7, line: 7, baseType: !154, size: 192, align: 64, offset: 896)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !7, line: 7, baseType: !8, size: 192, align: 64, offset: 1088)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "EnableBashCompletion", file: !7, line: 7, baseType: !51, size: 8, align: 8, offset: 1280)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "HideHelp", file: !7, line: 7, baseType: !51, size: 8, align: 8, offset: 1288)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "HideVersion", file: !7, line: 7, baseType: !51, size: 8, align: 8, offset: 1296)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "categories", file: !7, line: 7, baseType: !297, size: 192, align: 64, offset: 1344)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "CommandCategories", file: !7, line: 7, size: 192, align: 8, elements: !298)
!298 = !{!299, !201, !202}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !7, line: 1, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "CommandCategory", file: !7, line: 7, size: 320, align: 8, elements: !303)
!303 = !{!160, !304}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Commands", file: !7, line: 7, baseType: !198, size: 192, align: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "BashComplete", file: !7, line: 7, baseType: !169, size: 64, align: 64, offset: 1536)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Before", file: !7, line: 7, baseType: !177, size: 64, align: 64, offset: 1600)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "After", file: !7, line: 7, baseType: !177, size: 64, align: 64, offset: 1664)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Action", file: !7, line: 7, baseType: !186, size: 128, align: 64, offset: 1728)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "CommandNotFound", file: !7, line: 7, baseType: !310, size: 64, align: 64, offset: 1856)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 7, size: 64, align: 8, elements: !312)
!312 = !{!313}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 7, baseType: !41, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "OnUsageError", file: !7, line: 7, baseType: !190, size: 64, align: 64, offset: 1920)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Compiled", file: !7, line: 7, baseType: !316, size: 192, align: 64, offset: 1984)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 5, size: 192, align: 8, elements: !317)
!317 = !{!318, !319, !321}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 5, baseType: !230, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 5, baseType: !320, size: 64, align: 64, offset: 64)
!320 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 5, baseType: !322, size: 64, align: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 5, size: 704, align: 8, elements: !324)
!324 = !{!325, !326, !335, !346, !347, !348}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 5, baseType: !56, size: 128, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 5, baseType: !327, size: 192, align: 64, offset: 128)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !9, size: 192, align: 8, elements: !328)
!328 = !{!329, !77, !78}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 5, size: 256, align: 8, elements: !332)
!332 = !{!325, !333, !334}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 5, baseType: !60, size: 64, align: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 5, baseType: !51, size: 8, align: 8, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 5, baseType: !336, size: 192, align: 64, offset: 320)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !9, size: 192, align: 8, elements: !337)
!337 = !{!338, !77, !78}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 5, size: 128, align: 8, elements: !341)
!341 = !{!342, !343, !344, !345}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 5, baseType: !320, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 5, baseType: !30, size: 8, align: 8, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 5, baseType: !51, size: 8, align: 8, offset: 72)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 5, baseType: !51, size: 8, align: 8, offset: 80)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 5, baseType: !320, size: 64, align: 64, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 5, baseType: !320, size: 64, align: 64, offset: 576)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 5, baseType: !330, size: 64, align: 64, offset: 640)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Authors", file: !7, line: 7, baseType: !350, size: 192, align: 64, offset: 2176)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Author,int,int}", file: !9, size: 192, align: 8, elements: !351)
!351 = !{!352, !77, !78}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "Author", file: !7, line: 7, size: 256, align: 8, elements: !355)
!355 = !{!160, !356}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Email", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Copyright", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 2368)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Author", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 2496)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Email", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 2624)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Writer", file: !7, line: 7, baseType: !119, size: 128, align: 64, offset: 2752)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ErrWriter", file: !7, line: 7, baseType: !119, size: 128, align: 64, offset: 2880)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ExitErrHandler", file: !7, line: 7, baseType: !363, size: 64, align: 64, offset: 3008)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 7, size: 64, align: 8, elements: !365)
!365 = !{!366}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 7, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!42, !41, !134}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Metadata", file: !7, line: 7, baseType: !98, size: 64, align: 64, offset: 3072)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraInfo", file: !7, line: 7, baseType: !372, size: 64, align: 64, offset: 3136)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 7, size: 64, align: 8, elements: !374)
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 7, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!98}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "CustomAppHelpTemplate", file: !7, line: 7, baseType: !56, size: 128, align: 64, offset: 3200)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "didSetup", file: !7, line: 7, baseType: !51, size: 8, align: 8, offset: 3328)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Command", file: !7, line: 7, baseType: !158, size: 2368, align: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "shellComplete", file: !7, line: 7, baseType: !51, size: 8, align: 8, offset: 2432)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "flagSet", file: !7, line: 7, baseType: !84, size: 64, align: 64, offset: 2496)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "setFlags", file: !7, line: 7, baseType: !98, size: 64, align: 64, offset: 2560)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "parentContext", file: !7, line: 7, baseType: !41, size: 64, align: 64, offset: 2624)
!386 = !DILocalVariable(name: "c", arg: 1, scope: !275, file: !7, line: 35, type: !278)
!387 = !DILocation(line: 35, column: 22, scope: !275)
!388 = !DILocalVariable(name: "command", arg: 2, scope: !275, file: !7, line: 35, type: !56)
!389 = !DILocation(line: 35, column: 38, scope: !275)
!390 = !DILocation(line: 36, column: 76, scope: !275)
!391 = !DILocation(line: 36, column: 80, scope: !275)
!392 = !DILocation(line: 36, column: 6, scope: !275)
!393 = !DILocation(line: 36, column: 17, scope: !275)
!394 = !DILocation(line: 37, column: 5, scope: !275)
!395 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !396, line: 9, type: !93, isLocal: false, isDefinition: true, scopeLine: 9, isOptimized: false, unit: !1, retainedNodes: !3)
!396 = !DIFile(filename: "main.go", directory: ".")
!397 = !DILocation(line: 11, column: 13, scope: !398)
!398 = distinct !DILexicalBlock(scope: !395, file: !396, line: 9, column: 1)
!399 = !DILocalVariable(name: "app", scope: !398, file: !396, line: 11, type: !282)
!400 = !DILocation(line: 11, column: 2, scope: !395)
!401 = !DILocation(line: 12, column: 5, scope: !398)
!402 = !DILocation(line: 12, column: 11, scope: !398)
!403 = !DILocation(line: 13, column: 5, scope: !398)
!404 = !DILocation(line: 13, column: 14, scope: !398)
!405 = !DILocation(line: 14, column: 5, scope: !398)
!406 = !DILocation(line: 14, column: 13, scope: !398)
!407 = !DILocation(line: 15, column: 5, scope: !398)
!408 = !DILocation(line: 15, column: 12, scope: !398)
!409 = !DILocation(line: 16, column: 5, scope: !398)
!410 = !DILocation(line: 16, column: 12, scope: !398)
!411 = !DILocation(line: 18, column: 5, scope: !398)
!412 = !DILocation(line: 18, column: 12, scope: !398)
!413 = !DILocation(line: 19, column: 5, scope: !398)
!414 = !DILocation(line: 19, column: 15, scope: !398)
!415 = !DILocation(line: 20, column: 5, scope: !398)
!416 = !DILocation(line: 20, column: 22, scope: !398)
!417 = !DILocation(line: 22, column: 5, scope: !398)
!418 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", scope: null, file: !22, line: 1, type: !39, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!419 = !DILocalVariable(name: "key", arg: 1, scope: !418, file: !22, line: 1, type: !41)
!420 = !DILocation(line: 1, column: 1, scope: !418)
!421 = !DILocalVariable(name: "seed", arg: 2, scope: !418, file: !22, line: 1, type: !25)
!422 = !DILocalVariable(name: "$ret14", scope: !418, file: !22, line: 1, type: !25)
!423 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", scope: null, file: !22, line: 1, type: !49, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!424 = !DILocalVariable(name: "key1", arg: 1, scope: !423, file: !22, line: 1, type: !41)
!425 = !DILocation(line: 1, column: 1, scope: !423)
!426 = !DILocalVariable(name: "key2", arg: 2, scope: !423, file: !22, line: 1, type: !41)
!427 = !DILocalVariable(name: "$ret15", scope: !423, file: !22, line: 1, type: !51)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "main"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "main"
	.ascii ";\n"
	.ascii "import "
	.ascii "fmt"
	.ascii " "
	.ascii "fmt"
	.ascii " \""
	.ascii "fmt"
	.ascii "\";\n"
	.ascii "import "
	.ascii "cli"
	.ascii " "
	.ascii "github.com/codegangsta/cli"
	.ascii " \""
	.ascii "github.com/codegangsta/cli"
	.ascii "\";\n"
	.ascii "import "
	.ascii "command"
	.ascii " "
	.ascii "github.com/timakin/gopli/command"
	.ascii " \""
	.ascii "github.com/timakin/gopli/command"
	.ascii "\";\n"
