; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22agent\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22gzip\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22compress/gzip\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22compress/gzip\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22rand\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/rand\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/rand\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/json\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./bindata.go", directory: "/home/wangcong/go_path/src/github.com/AdRoll/hologram/agent")
!3 = !{}
!4 = !{!5, !17, !37, !39, !193, !196, !204, !264, !266, !268}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments._test_ssh_key", linkageName: "command_line_arguments._test_ssh_key", scope: !1, file: !7, line: 78, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "bindata.go", directory: ".")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !9, size: 192, align: 8, elements: !10)
!9 = !DIFile(filename: "", directory: "")
!10 = !{!11, !14, !16}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !9, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!15 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !9, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "command_line_arguments._bindata", linkageName: "command_line_arguments._bindata", scope: !1, file: !7, line: 138, type: !19, isLocal: true, isDefinition: true)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !21, line: 1, size: 384, align: 8, elements: !22)
!21 = !DIFile(filename: "<built-in>", directory: "")
!22 = !{!23, !24, !25, !26, !28, !30, !33, !34, !36}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !21, line: 1, baseType: !15, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !21, line: 1, baseType: !13, size: 8, align: 8, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !21, line: 1, baseType: !13, size: 8, align: 8, offset: 72)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !21, line: 1, baseType: !27, size: 16, align: 16, offset: 80)
!27 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !21, line: 1, baseType: !29, size: 32, align: 32, offset: 96)
!29 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !21, line: 1, baseType: !31, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIBasicType(name: "void")
!33 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !21, line: 1, baseType: !31, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !21, line: 1, baseType: !35, size: 64, align: 64, offset: 256)
!35 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !21, line: 1, baseType: !31, size: 64, align: 64, offset: 320)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !21, line: 1, type: !29, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "command_line_arguments._bintree", linkageName: "command_line_arguments._bintree", scope: !1, file: !7, line: 182, type: !41, isLocal: true, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments._bintree_t", file: !7, line: 177, size: 128, align: 8, elements: !43)
!43 = !{!44, !192}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "Func", file: !7, line: 178, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 178, size: 64, align: 8, elements: !47)
!47 = !{!48}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 178, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!52}
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.command-line-arguments.asset,error}", file: !9, size: 192, align: 8, elements: !53)
!53 = !{!54, !182}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 178, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.asset", file: !7, line: 47, size: 320, align: 8, elements: !57)
!57 = !{!58, !59}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", file: !7, line: 48, baseType: !8, size: 192, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "info", file: !7, line: 49, baseType: !60, size: 128, align: 64, offset: 192)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileInfo", file: !7, line: 22, size: 128, align: 8, elements: !61)
!61 = !{!62, !181}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 22, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)bool,*func(*void)Time,*func(*void)FileMode,*func(*void)string,*func(*void)int64,*func(*void)Token}", file: !9, size: 448, align: 8, elements: !65)
!65 = !{!66, !117, !121, !159, !164, !168, !172}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 22, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !21, line: 1, size: 576, align: 8, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !84, !93, !94, !100, !116}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !21, line: 1, baseType: !35, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !21, line: 1, baseType: !35, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !21, line: 1, baseType: !29, size: 32, align: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !21, line: 1, baseType: !13, size: 8, align: 8, offset: 160)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !21, line: 1, baseType: !13, size: 8, align: 8, offset: 168)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !21, line: 1, baseType: !13, size: 8, align: 8, offset: 176)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !21, line: 1, baseType: !77, size: 64, align: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !21, line: 1, size: 64, align: 8, elements: !79)
!79 = !{!80}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !21, line: 1, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!35, !31, !35}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !21, line: 1, baseType: !85, size: 64, align: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !21, line: 1, size: 64, align: 8, elements: !87)
!87 = !{!88}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !21, line: 1, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!92, !31, !31}
!92 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !21, line: 1, baseType: !12, size: 64, align: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !21, line: 1, baseType: !95, size: 64, align: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !21, line: 1, size: 128, align: 8, elements: !97)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !21, line: 1, baseType: !12, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !21, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !21, line: 1, baseType: !101, size: 64, align: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !21, line: 1, size: 320, align: 8, elements: !103)
!103 = !{!104, !105, !106}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !21, line: 1, baseType: !95, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !21, line: 1, baseType: !95, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !21, line: 1, baseType: !107, size: 192, align: 64, offset: 128)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !9, size: 192, align: 8, elements: !108)
!108 = !{!109, !14, !16}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !21, line: 1, size: 320, align: 8, elements: !112)
!112 = !{!104, !105, !113, !114, !115}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !21, line: 1, baseType: !31, size: 64, align: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !21, line: 1, baseType: !31, size: 64, align: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !21, line: 1, baseType: !31, size: 64, align: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !21, line: 1, baseType: !31, size: 64, align: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "IsDir", file: !9, line: 22, baseType: !118, size: 64, align: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!92, !31}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ModTime", file: !9, line: 22, baseType: !122, size: 64, align: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!125, !31}
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 19, size: 192, align: 8, elements: !126)
!126 = !{!127, !129, !131}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 19, baseType: !128, size: 64, align: 64)
!128 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 19, baseType: !130, size: 64, align: 64, offset: 64)
!130 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 19, baseType: !132, size: 64, align: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 19, size: 704, align: 8, elements: !134)
!134 = !{!135, !136, !145, !156, !157, !158}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 19, baseType: !96, size: 128, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 19, baseType: !137, size: 192, align: 64, offset: 128)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !9, size: 192, align: 8, elements: !138)
!138 = !{!139, !14, !16}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 19, size: 256, align: 8, elements: !142)
!142 = !{!135, !143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 19, baseType: !15, size: 64, align: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 19, baseType: !92, size: 8, align: 8, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 19, baseType: !146, size: 192, align: 64, offset: 320)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !9, size: 192, align: 8, elements: !147)
!147 = !{!148, !14, !16}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 19, size: 128, align: 8, elements: !151)
!151 = !{!152, !153, !154, !155}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 19, baseType: !130, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 19, baseType: !13, size: 8, align: 8, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 19, baseType: !92, size: 8, align: 8, offset: 72)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 19, baseType: !92, size: 8, align: 8, offset: 80)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 19, baseType: !130, size: 64, align: 64, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 19, baseType: !130, size: 64, align: 64, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 19, baseType: !140, size: 64, align: 64, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", file: !9, line: 22, baseType: !160, size: 64, align: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!163, !31}
!163 = !DIBasicType(name: "FileMode", size: 32, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !9, line: 22, baseType: !165, size: 64, align: 64, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!96, !31}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !9, line: 22, baseType: !169, size: 64, align: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!130, !31}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Sys", file: !9, line: 22, baseType: !173, size: 64, align: 64, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!176, !31}
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "Token", file: !177, line: 18, size: 128, align: 8, elements: !178)
!177 = !DIFile(filename: "metadata_service.go", directory: ".")
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !177, line: 1, baseType: !67, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !177, line: 1, baseType: !31, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !31, size: 64, align: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 178, baseType: !183, size: 128, align: 64, offset: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !21, line: 1, size: 128, align: 8, elements: !184)
!184 = !{!185, !191}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !21, line: 1, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !9, size: 128, align: 8, elements: !188)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 1, baseType: !67, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !9, line: 1, baseType: !165, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !21, line: 1, baseType: !31, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Children", file: !7, line: 179, baseType: !19, size: 64, align: 64, offset: 64)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "command_line_arguments.socketAddress", linkageName: "command_line_arguments.socketAddress", scope: !1, file: !195, line: 29, type: !96, isLocal: true, isDefinition: true)
!195 = !DIFile(filename: "ssh.go", directory: ".")
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "command_line_arguments.successfulKey", linkageName: "command_line_arguments.successfulKey", scope: !1, file: !195, line: 30, type: !198, isLocal: true, isDefinition: true)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !195, line: 24, size: 448, align: 8, elements: !200)
!200 = !{!201, !202, !203}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Format", file: !195, line: 24, baseType: !96, size: 128, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Blob", file: !195, line: 24, baseType: !8, size: 192, align: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Comment", file: !195, line: 24, baseType: !96, size: 128, align: 64, offset: 320)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "command_line_arguments.providedSSHKey", linkageName: "command_line_arguments.providedSSHKey", scope: !1, file: !195, line: 31, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "Signer", file: !195, line: 23, size: 128, align: 8, elements: !207)
!207 = !{!208, !263}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !195, line: 23, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)PublicKey,*func(*void,Reader,struct{*uint8,int,int})struct{*Signature,error}}", file: !9, size: 192, align: 8, elements: !211)
!211 = !{!212, !213, !240}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 23, baseType: !67, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !9, line: 23, baseType: !214, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!217, !31}
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "PublicKey", file: !218, line: 26, size: 128, align: 8, elements: !219)
!218 = !DIFile(filename: "client.go", directory: ".")
!219 = !{!220, !239}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !218, line: 26, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{*uint8,int,int},*func(*void)string,*func(*void,struct{*uint8,int,int},*Signature)error}", file: !9, size: 256, align: 8, elements: !223)
!223 = !{!224, !225, !229, !230}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 26, baseType: !67, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Marshal", file: !9, line: 26, baseType: !226, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!8, !31}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !9, line: 26, baseType: !165, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Verify", file: !9, line: 26, baseType: !231, size: 64, align: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!183, !31, !8, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "Signature", file: !218, line: 26, size: 320, align: 8, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Format", file: !218, line: 26, baseType: !96, size: 128, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Blob", file: !218, line: 26, baseType: !8, size: 192, align: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !218, line: 1, baseType: !31, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Sign", file: !9, line: 23, baseType: !241, size: 64, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!244, !31, !248, !8}
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Signature,error}", file: !9, size: 192, align: 8, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 23, baseType: !234, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 23, baseType: !183, size: 128, align: 64, offset: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !7, line: 18, size: 128, align: 8, elements: !249)
!249 = !{!250, !181}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 18, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !9, size: 128, align: 8, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 18, baseType: !67, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !9, line: 18, baseType: !256, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!259, !31, !8}
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !9, size: 192, align: 8, elements: !260)
!260 = !{!261, !262}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !9, line: 18, baseType: !15, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !9, line: 18, baseType: !183, size: 128, align: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !195, line: 1, baseType: !31, size: 64, align: 64, offset: 64)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "command_line_arguments.errNoKeys", linkageName: "command_line_arguments.errNoKeys", scope: !1, file: !195, line: 32, type: !183, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "command_line_arguments.errSSHKey", linkageName: "command_line_arguments.errSSHKey", scope: !1, file: !195, line: 33, type: !183, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "crypto_rand.Reader", linkageName: "crypto_rand.Reader", scope: !1, file: !195, line: 18, type: !248, isLocal: false, isDefinition: true)
!270 = distinct !DISubprogram(name: "agent.command_line_arguments.bindata_file_info..hash", linkageName: "command_line_arguments.command_line_arguments.bindata_file_info..hash", scope: null, file: !21, line: 1, type: !82, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!271 = !DILocalVariable(name: "key", arg: 1, scope: !270, file: !21, line: 1, type: !31)
!272 = !DILocation(line: 1, column: 1, scope: !270)
!273 = !DILocalVariable(name: "seed", arg: 2, scope: !270, file: !21, line: 1, type: !35)
!274 = !DILocalVariable(name: "$ret43", scope: !270, file: !21, line: 1, type: !35)
!275 = distinct !DISubprogram(name: "agent.command_line_arguments.bindata_file_info..eq", linkageName: "command_line_arguments.command_line_arguments.bindata_file_info..eq", scope: null, file: !21, line: 1, type: !90, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!276 = !DILocalVariable(name: "key1", arg: 1, scope: !275, file: !21, line: 1, type: !31)
!277 = !DILocation(line: 1, column: 1, scope: !275)
!278 = !DILocalVariable(name: "key2", arg: 2, scope: !275, file: !21, line: 1, type: !31)
!279 = !DILocalVariable(name: "$ret44", scope: !275, file: !21, line: 1, type: !92)
!280 = distinct !DISubprogram(name: "agent.IsDir.command_line_arguments.bindata_file_info", linkageName: "command_line_arguments.bindata_file_info.IsDir", scope: null, file: !7, line: 71, type: !281, isLocal: false, isDefinition: true, scopeLine: 71, isOptimized: false, unit: !1, retainedNodes: !3)
!281 = !DISubroutineType(types: !282)
!282 = !{!92, !283, !283}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.bindata_file_info", file: !7, line: 52, size: 448, align: 8, elements: !285)
!285 = !{!286, !287, !288, !289}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 53, baseType: !96, size: 128, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 54, baseType: !130, size: 64, align: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "mode", file: !7, line: 55, baseType: !163, size: 32, align: 32, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "modTime", file: !7, line: 56, baseType: !125, size: 192, align: 64, offset: 256)
!290 = !DILocalVariable(name: "pointer", arg: 1, scope: !280, file: !7, line: 71, type: !283)
!291 = !DILocation(line: 71, column: 1, scope: !280)
!292 = !DILocalVariable(name: "$ret6", scope: !280, file: !7, line: 71, type: !92)
!293 = !DILocation(line: 71, column: 37, scope: !280)
!294 = !DILocation(line: 72, column: 2, scope: !280)
!295 = distinct !DISubprogram(name: "agent.ModTime.command_line_arguments.bindata_file_info", linkageName: "command_line_arguments.bindata_file_info.ModTime", scope: null, file: !7, line: 68, type: !296, isLocal: false, isDefinition: true, scopeLine: 68, isOptimized: false, unit: !1, retainedNodes: !3)
!296 = !DISubroutineType(types: !297)
!297 = !{!125, !283, !283}
!298 = !DILocalVariable(name: "pointer", arg: 1, scope: !295, file: !7, line: 68, type: !283)
!299 = !DILocation(line: 68, column: 1, scope: !295)
!300 = !DILocation(line: 69, column: 11, scope: !295)
!301 = !DILocation(line: 69, column: 2, scope: !295)
!302 = distinct !DISubprogram(name: "agent.Mode.command_line_arguments.bindata_file_info", linkageName: "command_line_arguments.bindata_file_info.Mode", scope: null, file: !7, line: 65, type: !303, isLocal: false, isDefinition: true, scopeLine: 65, isOptimized: false, unit: !1, retainedNodes: !3)
!303 = !DISubroutineType(types: !304)
!304 = !{!163, !283, !283}
!305 = !DILocalVariable(name: "pointer", arg: 1, scope: !302, file: !7, line: 65, type: !283)
!306 = !DILocation(line: 65, column: 1, scope: !302)
!307 = !DILocalVariable(name: "fi", scope: !302, file: !7, line: 65, type: !284)
!308 = !DILocalVariable(name: "$ret4", scope: !302, file: !7, line: 65, type: !163)
!309 = !DILocation(line: 65, column: 36, scope: !302)
!310 = !DILocation(line: 66, column: 2, scope: !302)
!311 = distinct !DISubprogram(name: "agent.Name.command_line_arguments.bindata_file_info", linkageName: "command_line_arguments.bindata_file_info.Name", scope: null, file: !7, line: 59, type: !312, isLocal: false, isDefinition: true, scopeLine: 59, isOptimized: false, unit: !1, retainedNodes: !3)
!312 = !DISubroutineType(types: !313)
!313 = !{!96, !283, !283}
!314 = !DILocalVariable(name: "pointer", arg: 1, scope: !311, file: !7, line: 59, type: !283)
!315 = !DILocation(line: 59, column: 1, scope: !311)
!316 = !DILocalVariable(name: "fi", scope: !311, file: !7, line: 59, type: !284)
!317 = !DILocalVariable(name: "$ret2", scope: !311, file: !7, line: 59, type: !96)
!318 = !DILocation(line: 59, column: 36, scope: !311)
!319 = !DILocation(line: 60, column: 2, scope: !311)
!320 = distinct !DISubprogram(name: "agent.Size.command_line_arguments.bindata_file_info", linkageName: "command_line_arguments.bindata_file_info.Size", scope: null, file: !7, line: 62, type: !321, isLocal: false, isDefinition: true, scopeLine: 62, isOptimized: false, unit: !1, retainedNodes: !3)
!321 = !DISubroutineType(types: !322)
!322 = !{!130, !283, !283}
!323 = !DILocalVariable(name: "pointer", arg: 1, scope: !320, file: !7, line: 62, type: !283)
!324 = !DILocation(line: 62, column: 1, scope: !320)
!325 = !DILocalVariable(name: "fi", scope: !320, file: !7, line: 62, type: !284)
!326 = !DILocalVariable(name: "$ret3", scope: !320, file: !7, line: 62, type: !130)
!327 = !DILocation(line: 62, column: 36, scope: !320)
!328 = !DILocation(line: 63, column: 2, scope: !320)
!329 = distinct !DISubprogram(name: "agent.Sys.command_line_arguments.bindata_file_info", linkageName: "command_line_arguments.bindata_file_info.Sys", scope: null, file: !7, line: 74, type: !330, isLocal: false, isDefinition: true, scopeLine: 74, isOptimized: false, unit: !1, retainedNodes: !3)
!330 = !DISubroutineType(types: !331)
!331 = !{!176, !283, !283}
!332 = !DILocalVariable(name: "pointer", arg: 1, scope: !329, file: !7, line: 74, type: !283)
!333 = !DILocation(line: 74, column: 1, scope: !329)
!334 = !DILocalVariable(name: "$ret7", scope: !329, file: !7, line: 74, type: !176)
!335 = !DILocation(line: 74, column: 35, scope: !329)
!336 = !DILocation(line: 75, column: 2, scope: !329)
!337 = distinct !DISubprogram(name: "agent.test_ssh_key", scope: null, file: !7, line: 87, type: !50, isLocal: true, isDefinition: true, scopeLine: 87, isOptimized: false, unit: !1, retainedNodes: !3)
!338 = !DILocalVariable(name: "info", scope: !339, file: !7, line: 93, type: !284)
!339 = distinct !DILexicalBlock(scope: !337, file: !7, line: 87, column: 1)
!340 = !DILocation(line: 93, column: 2, scope: !337)
!341 = !DILocalVariable(name: "$ret10", scope: !337, file: !7, line: 87, type: !55)
!342 = !DILocation(line: 87, column: 22, scope: !337)
!343 = !DILocalVariable(name: "name", arg: 2, scope: !344, file: !7, line: 30, type: !96)
!344 = distinct !DISubprogram(name: "agent.bindata_read", scope: null, file: !7, line: 30, type: !345, isLocal: true, isDefinition: true, scopeLine: 30, isOptimized: false, unit: !1, retainedNodes: !3)
!345 = !DISubroutineType(types: !346)
!346 = !{!347, !8, !96}
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !9, size: 320, align: 8, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 23, baseType: !8, size: 192, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 23, baseType: !183, size: 128, align: 64, offset: 192)
!351 = !DILocation(line: 30, column: 32, scope: !344, inlinedAt: !352)
!352 = distinct !DILocation(line: 81, column: 9, scope: !353, inlinedAt: !356)
!353 = distinct !DISubprogram(name: "agent.test_ssh_key_bytes", scope: null, file: !7, line: 80, type: !354, isLocal: true, isDefinition: true, scopeLine: 80, isOptimized: false, unit: !1, retainedNodes: !3)
!354 = !DISubroutineType(types: !355)
!355 = !{!347}
!356 = distinct !DILocation(line: 88, column: 16, scope: !339)
!357 = !DILocalVariable(name: "data", arg: 1, scope: !344, file: !7, line: 30, type: !8)
!358 = !DILocation(line: 30, column: 19, scope: !344, inlinedAt: !352)
!359 = !DILocation(line: 31, column: 34, scope: !360, inlinedAt: !352)
!360 = distinct !DILexicalBlock(scope: !344, file: !7, line: 30, column: 1)
!361 = !DILocation(line: 31, column: 18, scope: !360, inlinedAt: !352)
!362 = !DILocalVariable(name: "gz", scope: !360, file: !7, line: 31, type: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !7, line: 19, size: 5312, align: 8, elements: !365)
!365 = !{!366, !374, !391, !403, !404, !405, !409, !410}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !7, line: 19, baseType: !367, size: 704, align: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "Header", file: !7, line: 19, size: 704, align: 8, elements: !368)
!368 = !{!369, !370, !371, !372, !373}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Comment", file: !7, line: 19, baseType: !96, size: 128, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Extra", file: !7, line: 19, baseType: !8, size: 192, align: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ModTime", file: !7, line: 19, baseType: !125, size: 192, align: 64, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !7, line: 19, baseType: !96, size: 128, align: 64, offset: 512)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "OS", file: !7, line: 19, baseType: !13, size: 8, align: 8, offset: 640)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !7, line: 19, baseType: !375, size: 128, align: 64, offset: 704)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !7, line: 19, size: 128, align: 8, elements: !376)
!376 = !{!377, !181}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 19, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void)struct{uint8,error}}", file: !9, size: 192, align: 8, elements: !380)
!380 = !{!381, !382, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 19, baseType: !67, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !9, line: 19, baseType: !256, size: 64, align: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ReadByte", file: !9, line: 19, baseType: !384, size: 64, align: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!387, !31}
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{uint8,error}", file: !9, size: 192, align: 8, elements: !388)
!388 = !{!389, !390}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 19, baseType: !13, size: 8, align: 8)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 19, baseType: !183, size: 128, align: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "decompressor", file: !7, line: 19, baseType: !392, size: 128, align: 64, offset: 832)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !7, line: 19, size: 128, align: 8, elements: !393)
!393 = !{!394, !181}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 19, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !9, size: 192, align: 8, elements: !397)
!397 = !{!381, !398, !402}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !9, line: 19, baseType: !399, size: 64, align: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!183, !31}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !9, line: 19, baseType: !256, size: 64, align: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "digest", file: !7, line: 19, baseType: !29, size: 32, align: 32, offset: 960)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 19, baseType: !29, size: 32, align: 32, offset: 992)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 19, baseType: !406, size: 4096, align: 8, offset: 1024)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 4096, align: 1, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 512)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !7, line: 19, baseType: !183, size: 128, align: 64, offset: 5120)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "multistream", file: !7, line: 19, baseType: !92, size: 8, align: 8, offset: 5248)
!411 = !DILocation(line: 31, column: 2, scope: !344, inlinedAt: !352)
!412 = !DILocalVariable(name: "err", scope: !360, file: !7, line: 31, type: !183)
!413 = !DILocation(line: 32, column: 9, scope: !360, inlinedAt: !352)
!414 = !DILocation(line: 33, column: 19, scope: !360, inlinedAt: !352)
!415 = !DILocation(line: 33, column: 47, scope: !360, inlinedAt: !352)
!416 = !DILocalVariable(name: "$ret1", scope: !344, file: !7, line: 30, type: !183)
!417 = !DILocation(line: 30, column: 54, scope: !344, inlinedAt: !352)
!418 = !DILocation(line: 33, column: 3, scope: !360, inlinedAt: !352)
!419 = !DILocation(line: 36, column: 6, scope: !360, inlinedAt: !352)
!420 = !DILocation(line: 37, column: 19, scope: !360, inlinedAt: !352)
!421 = !DILocation(line: 37, column: 25, scope: !360, inlinedAt: !352)
!422 = !DILocation(line: 37, column: 14, scope: !360, inlinedAt: !352)
!423 = !DILocation(line: 38, column: 4, scope: !360, inlinedAt: !352)
!424 = !DILocation(line: 40, column: 9, scope: !360, inlinedAt: !352)
!425 = !DILocation(line: 41, column: 19, scope: !360, inlinedAt: !352)
!426 = !DILocation(line: 41, column: 47, scope: !360, inlinedAt: !352)
!427 = !DILocation(line: 41, column: 3, scope: !360, inlinedAt: !352)
!428 = !DILocalVariable(name: "buf", scope: !360, file: !7, line: 36, type: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", file: !7, line: 18, size: 832, align: 8, elements: !431)
!431 = !{!432, !433, !434, !438}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 18, baseType: !8, size: 192, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "off", file: !7, line: 18, baseType: !15, size: 64, align: 64, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "bootstrap", file: !7, line: 18, baseType: !435, size: 512, align: 8, offset: 256)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 512, align: 1, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "lastRead", file: !7, line: 18, baseType: !439, size: 8, align: 8, offset: 768)
!439 = !DIBasicType(name: ".bytes.readOp", size: 8, encoding: DW_ATE_signed)
!440 = !DILocation(line: 36, column: 6, scope: !344, inlinedAt: !352)
!441 = !DILocation(line: 44, column: 12, scope: !360, inlinedAt: !352)
!442 = !DILocation(line: 44, column: 2, scope: !360, inlinedAt: !352)
!443 = !DILocation(line: 0, scope: !353, inlinedAt: !356)
!444 = !DILocation(line: 81, column: 2, scope: !353, inlinedAt: !356)
!445 = !DILocalVariable(name: "err", scope: !339, file: !7, line: 88, type: !183)
!446 = !DILocation(line: 88, column: 2, scope: !337)
!447 = !DILocation(line: 89, column: 9, scope: !339)
!448 = !DILocation(line: 88, column: 16, scope: !339)
!449 = !DILocalVariable(name: "$ret11", scope: !337, file: !7, line: 87, type: !183)
!450 = !DILocation(line: 87, column: 30, scope: !337)
!451 = !DILocation(line: 90, column: 3, scope: !339)
!452 = !DILocation(line: 93, column: 100, scope: !339)
!453 = !DILocation(line: 93, column: 10, scope: !339)
!454 = !DILocation(line: 94, column: 7, scope: !339)
!455 = !DILocation(line: 94, column: 8, scope: !339)
!456 = !DILocalVariable(name: "a", scope: !339, file: !7, line: 94, type: !55)
!457 = !DILocation(line: 94, column: 2, scope: !337)
!458 = !DILocation(line: 95, column: 2, scope: !339)
!459 = distinct !DISubprogram(name: "agent.Asset", linkageName: "command_line_arguments.Asset", scope: null, file: !7, line: 101, type: !460, isLocal: false, isDefinition: true, scopeLine: 101, isOptimized: false, unit: !1, retainedNodes: !3)
!460 = !DISubroutineType(types: !461)
!461 = !{!347, !96}
!462 = !DILocalVariable(name: "name", arg: 1, scope: !459, file: !7, line: 101, type: !96)
!463 = !DILocation(line: 101, column: 12, scope: !459)
!464 = !DILocation(line: 102, column: 28, scope: !465)
!465 = distinct !DILexicalBlock(scope: !459, file: !7, line: 101, column: 1)
!466 = !DILocalVariable(name: "cannonicalName", scope: !465, file: !7, line: 102, type: !96)
!467 = !DILocation(line: 102, column: 2, scope: !459)
!468 = !DILocalVariable(name: "f", scope: !469, file: !7, line: 103, type: !45)
!469 = distinct !DILexicalBlock(scope: !465, file: !7, line: 103, column: 2)
!470 = !DILocation(line: 103, column: 5, scope: !465)
!471 = !DILocalVariable(name: "ok", scope: !469, file: !7, line: 103, type: !92)
!472 = !DILocation(line: 103, column: 14, scope: !469)
!473 = !DILocation(line: 103, column: 5, scope: !469)
!474 = !DILocation(line: 103, column: 2, scope: !469)
!475 = !DILocation(line: 104, column: 13, scope: !476)
!476 = distinct !DILexicalBlock(scope: !469, file: !7, line: 103, column: 43)
!477 = !DILocalVariable(name: "a", scope: !476, file: !7, line: 104, type: !55)
!478 = !DILocation(line: 104, column: 3, scope: !469)
!479 = !DILocalVariable(name: "err", scope: !476, file: !7, line: 104, type: !183)
!480 = !DILocation(line: 105, column: 10, scope: !476)
!481 = !DILocation(line: 110, column: 18, scope: !465)
!482 = !DILocalVariable(name: "$ret13", scope: !459, file: !7, line: 101, type: !183)
!483 = !DILocation(line: 101, column: 34, scope: !459)
!484 = !DILocation(line: 110, column: 2, scope: !465)
!485 = !DILocation(line: 106, column: 20, scope: !476)
!486 = !DILocation(line: 106, column: 69, scope: !476)
!487 = !DILocation(line: 106, column: 4, scope: !476)
!488 = !DILocation(line: 108, column: 11, scope: !476)
!489 = !DILocation(line: 108, column: 3, scope: !476)
!490 = distinct !DISubprogram(name: "agent.AssetInfo", linkageName: "command_line_arguments.AssetInfo", scope: null, file: !7, line: 116, type: !491, isLocal: false, isDefinition: true, scopeLine: 116, isOptimized: false, unit: !1, retainedNodes: !3)
!491 = !DISubroutineType(types: !492)
!492 = !{!493, !96}
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{FileInfo,error}", file: !9, size: 256, align: 8, elements: !494)
!494 = !{!495, !496}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 116, baseType: !60, size: 128, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 116, baseType: !183, size: 128, align: 64, offset: 128)
!497 = !DILocalVariable(name: "name", arg: 1, scope: !490, file: !7, line: 116, type: !96)
!498 = !DILocation(line: 116, column: 16, scope: !490)
!499 = !DILocation(line: 117, column: 28, scope: !500)
!500 = distinct !DILexicalBlock(scope: !490, file: !7, line: 116, column: 1)
!501 = !DILocalVariable(name: "cannonicalName", scope: !500, file: !7, line: 117, type: !96)
!502 = !DILocation(line: 117, column: 2, scope: !490)
!503 = !DILocalVariable(name: "f", scope: !504, file: !7, line: 118, type: !45)
!504 = distinct !DILexicalBlock(scope: !500, file: !7, line: 118, column: 2)
!505 = !DILocation(line: 118, column: 5, scope: !500)
!506 = !DILocalVariable(name: "ok", scope: !504, file: !7, line: 118, type: !92)
!507 = !DILocation(line: 118, column: 14, scope: !504)
!508 = !DILocation(line: 118, column: 5, scope: !504)
!509 = !DILocation(line: 118, column: 2, scope: !504)
!510 = !DILocation(line: 119, column: 13, scope: !511)
!511 = distinct !DILexicalBlock(scope: !504, file: !7, line: 118, column: 43)
!512 = !DILocalVariable(name: "a", scope: !511, file: !7, line: 119, type: !55)
!513 = !DILocation(line: 119, column: 3, scope: !504)
!514 = !DILocalVariable(name: "err", scope: !511, file: !7, line: 119, type: !183)
!515 = !DILocation(line: 120, column: 10, scope: !511)
!516 = !DILocation(line: 125, column: 18, scope: !500)
!517 = !DILocalVariable(name: "$ret15", scope: !490, file: !7, line: 116, type: !183)
!518 = !DILocation(line: 116, column: 43, scope: !490)
!519 = !DILocation(line: 125, column: 2, scope: !500)
!520 = !DILocation(line: 121, column: 20, scope: !511)
!521 = !DILocation(line: 121, column: 73, scope: !511)
!522 = !DILocation(line: 121, column: 4, scope: !511)
!523 = !DILocation(line: 123, column: 11, scope: !511)
!524 = !DILocation(line: 123, column: 3, scope: !511)
!525 = distinct !DISubprogram(name: "agent.AssetNames", linkageName: "command_line_arguments.AssetNames", scope: null, file: !7, line: 129, type: !526, isLocal: false, isDefinition: true, scopeLine: 129, isOptimized: false, unit: !1, retainedNodes: !3)
!526 = !DISubroutineType(types: !527)
!527 = !{!528}
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !9, size: 192, align: 8, elements: !529)
!529 = !{!530, !14, !16}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !95, size: 64, align: 64)
!531 = !DILocation(line: 130, column: 33, scope: !532)
!532 = distinct !DILexicalBlock(scope: !525, file: !7, line: 129, column: 1)
!533 = !DILocation(line: 130, column: 29, scope: !532)
!534 = !DILocation(line: 130, column: 11, scope: !532)
!535 = !DILocation(line: 131, column: 2, scope: !536)
!536 = distinct !DILexicalBlock(scope: !532, file: !7, line: 131, column: 2)
!537 = !DILocation(line: 132, column: 11, scope: !536)
!538 = !DILocation(line: 132, column: 9, scope: !536)
!539 = !DILocation(line: 134, column: 2, scope: !532)
!540 = distinct !DISubprogram(name: "agent.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 15, type: !541, isLocal: false, isDefinition: true, scopeLine: 15, isOptimized: false, unit: !1, retainedNodes: !3)
!541 = !DISubroutineType(types: !542)
!542 = !{!32}
!543 = !DILocation(line: 1, column: 1, scope: !544)
!544 = !DILexicalBlockFile(scope: !540, file: !21, discriminator: 0)
!545 = !DILocation(line: 138, column: 16, scope: !546)
!546 = !DILexicalBlockFile(scope: !540, file: !7, discriminator: 0)
!547 = !DILocation(line: 138, column: 5, scope: !546)
!548 = !DILocation(line: 183, column: 44, scope: !546)
!549 = !DILocation(line: 183, column: 18, scope: !546)
!550 = !DILocation(line: 183, column: 19, scope: !546)
!551 = !DILocation(line: 182, column: 33, scope: !546)
!552 = !DILocation(line: 182, column: 16, scope: !546)
!553 = !DILocation(line: 182, column: 17, scope: !546)
!554 = !DILocation(line: 182, column: 5, scope: !546)
!555 = !DILocation(line: 32, column: 26, scope: !556)
!556 = !DILexicalBlockFile(scope: !540, file: !195, discriminator: 0)
!557 = !DILocation(line: 32, column: 2, scope: !556)
!558 = !DILocation(line: 33, column: 26, scope: !556)
!559 = !DILocation(line: 33, column: 2, scope: !556)
!560 = distinct !DISubprogram(name: "agent.AssetDir", linkageName: "command_line_arguments.AssetDir", scope: null, file: !7, line: 155, type: !561, isLocal: false, isDefinition: true, scopeLine: 155, isOptimized: false, unit: !1, retainedNodes: !3)
!561 = !DISubroutineType(types: !562)
!562 = !{!563, !96}
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*string,int,int},error}", file: !9, size: 320, align: 8, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 155, baseType: !528, size: 192, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 155, baseType: !183, size: 128, align: 64, offset: 192)
!567 = !DILocalVariable(name: "name", arg: 1, scope: !560, file: !7, line: 155, type: !96)
!568 = !DILocation(line: 155, column: 15, scope: !560)
!569 = !DILocation(line: 156, column: 10, scope: !570)
!570 = distinct !DILexicalBlock(scope: !560, file: !7, line: 155, column: 1)
!571 = !DILocalVariable(name: "node", scope: !570, file: !7, line: 156, type: !41)
!572 = !DILocation(line: 156, column: 2, scope: !560)
!573 = !DILocation(line: 157, column: 15, scope: !570)
!574 = !DILocation(line: 158, column: 29, scope: !575)
!575 = distinct !DILexicalBlock(scope: !570, file: !7, line: 157, column: 20)
!576 = !DILocalVariable(name: "cannonicalName", scope: !575, file: !7, line: 158, type: !96)
!577 = !DILocation(line: 158, column: 3, scope: !570)
!578 = !DILocation(line: 159, column: 23, scope: !575)
!579 = !DILocalVariable(name: "pathList", scope: !575, file: !7, line: 159, type: !528)
!580 = !DILocation(line: 159, column: 3, scope: !570)
!581 = !DILocation(line: 160, column: 3, scope: !582)
!582 = distinct !DILexicalBlock(scope: !575, file: !7, line: 160, column: 3)
!583 = !DILocation(line: 167, column: 9, scope: !570)
!584 = !DILocation(line: 161, column: 15, scope: !582)
!585 = !DILocation(line: 161, column: 24, scope: !582)
!586 = !DILocation(line: 162, column: 12, scope: !582)
!587 = !DILocation(line: 163, column: 21, scope: !582)
!588 = !DILocalVariable(name: "$ret18", scope: !560, file: !7, line: 155, type: !183)
!589 = !DILocation(line: 155, column: 39, scope: !560)
!590 = !DILocation(line: 163, column: 5, scope: !582)
!591 = !DILocation(line: 167, column: 15, scope: !570)
!592 = !DILocation(line: 168, column: 19, scope: !570)
!593 = !DILocation(line: 168, column: 3, scope: !570)
!594 = !DILocation(line: 170, column: 34, scope: !570)
!595 = !DILocation(line: 170, column: 26, scope: !570)
!596 = !DILocation(line: 170, column: 8, scope: !570)
!597 = !DILocation(line: 171, column: 24, scope: !598)
!598 = distinct !DILexicalBlock(scope: !570, file: !7, line: 171, column: 2)
!599 = !DILocation(line: 171, column: 2, scope: !598)
!600 = !DILocation(line: 172, column: 8, scope: !598)
!601 = !DILocation(line: 172, column: 6, scope: !598)
!602 = !DILocation(line: 174, column: 2, scope: !570)
!603 = distinct !DISubprogram(name: "agent.RestoreAsset", linkageName: "command_line_arguments.RestoreAsset", scope: null, file: !7, line: 187, type: !604, isLocal: false, isDefinition: true, scopeLine: 187, isOptimized: false, unit: !1, retainedNodes: !3)
!604 = !DISubroutineType(types: !605)
!605 = !{!183, !96, !96}
!606 = !DILocalVariable(name: "dir", arg: 1, scope: !603, file: !7, line: 187, type: !96)
!607 = !DILocation(line: 187, column: 19, scope: !603)
!608 = !DILocalVariable(name: "name", arg: 2, scope: !603, file: !7, line: 187, type: !96)
!609 = !DILocation(line: 187, column: 24, scope: !603)
!610 = !DILocation(line: 188, column: 15, scope: !611)
!611 = distinct !DILexicalBlock(scope: !603, file: !7, line: 187, column: 1)
!612 = !DILocalVariable(name: "err", scope: !611, file: !7, line: 188, type: !183)
!613 = !DILocation(line: 188, column: 2, scope: !603)
!614 = !DILocation(line: 189, column: 9, scope: !611)
!615 = !DILocalVariable(name: "$ret19", scope: !603, file: !7, line: 187, type: !183)
!616 = !DILocation(line: 187, column: 37, scope: !603)
!617 = !DILocation(line: 190, column: 3, scope: !611)
!618 = !DILocation(line: 192, column: 15, scope: !611)
!619 = !DILocalVariable(name: "info", scope: !611, file: !7, line: 192, type: !60)
!620 = !DILocation(line: 192, column: 2, scope: !603)
!621 = !DILocation(line: 193, column: 9, scope: !611)
!622 = !DILocation(line: 194, column: 3, scope: !611)
!623 = !DILocation(line: 196, column: 40, scope: !611)
!624 = !DILocation(line: 196, column: 20, scope: !611)
!625 = !DILocation(line: 196, column: 11, scope: !611)
!626 = !DILocation(line: 197, column: 9, scope: !611)
!627 = !DILocation(line: 198, column: 3, scope: !611)
!628 = !DILocation(line: 200, column: 25, scope: !611)
!629 = !DILocation(line: 200, column: 57, scope: !611)
!630 = !DILocalVariable(name: "data", scope: !611, file: !7, line: 188, type: !8)
!631 = !DILocation(line: 200, column: 15, scope: !611)
!632 = !DILocation(line: 201, column: 9, scope: !611)
!633 = !DILocation(line: 202, column: 3, scope: !611)
!634 = !DILocation(line: 204, column: 19, scope: !611)
!635 = !DILocation(line: 204, column: 45, scope: !611)
!636 = !DILocation(line: 204, column: 61, scope: !611)
!637 = !DILocation(line: 204, column: 11, scope: !611)
!638 = !DILocation(line: 205, column: 9, scope: !611)
!639 = !DILocation(line: 0, scope: !611)
!640 = distinct !DISubprogram(name: "agent._filePath", scope: null, file: !7, line: 227, type: !641, isLocal: true, isDefinition: true, scopeLine: 227, isOptimized: false, unit: !1, retainedNodes: !3)
!641 = !DISubroutineType(types: !642)
!642 = !{!96, !96, !96}
!643 = !DILocalVariable(name: "dir", arg: 1, scope: !640, file: !7, line: 227, type: !96)
!644 = !DILocation(line: 227, column: 16, scope: !640)
!645 = !DILocalVariable(name: "name", arg: 2, scope: !640, file: !7, line: 227, type: !96)
!646 = !DILocation(line: 227, column: 21, scope: !640)
!647 = !DILocation(line: 228, column: 28, scope: !648)
!648 = distinct !DILexicalBlock(scope: !640, file: !7, line: 227, column: 1)
!649 = !DILocalVariable(name: "cannonicalName", scope: !648, file: !7, line: 228, type: !96)
!650 = !DILocation(line: 228, column: 2, scope: !640)
!651 = !DILocation(line: 229, column: 53, scope: !648)
!652 = !DILocation(line: 229, column: 30, scope: !648)
!653 = !DILocation(line: 229, column: 23, scope: !648)
!654 = !DILocation(line: 229, column: 18, scope: !648)
!655 = !DILocation(line: 229, column: 2, scope: !648)
!656 = distinct !DISubprogram(name: "agent.RestoreAssets", linkageName: "command_line_arguments.RestoreAssets", scope: null, file: !7, line: 212, type: !604, isLocal: false, isDefinition: true, scopeLine: 212, isOptimized: false, unit: !1, retainedNodes: !3)
!657 = !DILocalVariable(name: "dir", arg: 1, scope: !656, file: !7, line: 212, type: !96)
!658 = !DILocation(line: 212, column: 20, scope: !656)
!659 = !DILocalVariable(name: "name", arg: 2, scope: !656, file: !7, line: 212, type: !96)
!660 = !DILocation(line: 212, column: 25, scope: !656)
!661 = !DILocation(line: 213, column: 19, scope: !662)
!662 = distinct !DILexicalBlock(scope: !656, file: !7, line: 212, column: 1)
!663 = !DILocalVariable(name: "children", scope: !662, file: !7, line: 213, type: !528)
!664 = !DILocation(line: 213, column: 2, scope: !656)
!665 = !DILocalVariable(name: "err", scope: !662, file: !7, line: 213, type: !183)
!666 = !DILocation(line: 214, column: 9, scope: !662)
!667 = !DILocation(line: 215, column: 10, scope: !662)
!668 = !DILocation(line: 215, column: 3, scope: !662)
!669 = !DILocation(line: 217, column: 3, scope: !670)
!670 = distinct !DILexicalBlock(scope: !662, file: !7, line: 217, column: 3)
!671 = !DILocation(line: 218, column: 34, scope: !670)
!672 = !DILocation(line: 218, column: 10, scope: !670)
!673 = !DILocation(line: 219, column: 11, scope: !670)
!674 = !DILocalVariable(name: "$ret20", scope: !656, file: !7, line: 212, type: !183)
!675 = !DILocation(line: 212, column: 38, scope: !656)
!676 = !DILocation(line: 220, column: 5, scope: !670)
!677 = !DILocation(line: 224, column: 2, scope: !662)
!678 = distinct !DISubprogram(name: "agent.command_line_arguments.client..hash", linkageName: "command_line_arguments.command_line_arguments.client..hash", scope: null, file: !21, line: 1, type: !82, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!679 = !DILocalVariable(name: "key", arg: 1, scope: !678, file: !21, line: 1, type: !31)
!680 = !DILocation(line: 1, column: 1, scope: !678)
!681 = !DILocalVariable(name: "seed", arg: 2, scope: !678, file: !21, line: 1, type: !35)
!682 = !DILocalVariable(name: "$ret45", scope: !678, file: !21, line: 1, type: !35)
!683 = distinct !DISubprogram(name: "agent.command_line_arguments.client..eq", linkageName: "command_line_arguments.command_line_arguments.client..eq", scope: null, file: !21, line: 1, type: !90, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!684 = !DILocalVariable(name: "key1", arg: 1, scope: !683, file: !21, line: 1, type: !31)
!685 = !DILocation(line: 1, column: 1, scope: !683)
!686 = !DILocalVariable(name: "key2", arg: 2, scope: !683, file: !21, line: 1, type: !31)
!687 = !DILocalVariable(name: "$ret46", scope: !683, file: !21, line: 1, type: !92)
!688 = distinct !DISubprogram(name: "agent.AssumeRole..1command_line_arguments.client", linkageName: "command_line_arguments.client.AssumeRole", scope: null, file: !218, line: 115, type: !689, isLocal: false, isDefinition: true, scopeLine: 115, isOptimized: false, unit: !1, retainedNodes: !3)
!689 = !DISubroutineType(types: !690)
!690 = !{!183, !691, !691, !96}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.client", file: !218, line: 44, size: 256, align: 8, elements: !693)
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "connectionString", file: !218, line: 45, baseType: !96, size: 128, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "cr", file: !218, line: 46, baseType: !696, size: 128, align: 64, offset: 128)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "CredentialsReceiver", file: !218, line: 34, size: 128, align: 8, elements: !697)
!697 = !{!698, !239}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !218, line: 34, baseType: !699, size: 64, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Client)void,*func(*void,*Credentials,string)void}", file: !9, size: 192, align: 8, elements: !701)
!701 = !{!702, !703, !719}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 34, baseType: !67, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "SetClient", file: !9, line: 34, baseType: !704, size: 64, align: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!32, !31, !707}
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "Client", file: !218, line: 39, size: 128, align: 8, elements: !708)
!708 = !{!709, !239}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !218, line: 39, baseType: !710, size: 64, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)error,*func(*void)error}", file: !9, size: 192, align: 8, elements: !712)
!712 = !{!713, !714, !718}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 39, baseType: !67, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "AssumeRole", file: !9, line: 39, baseType: !715, size: 64, align: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!183, !31, !96}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserCredentials", file: !9, line: 39, baseType: !399, size: 64, align: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "SetCredentials", file: !9, line: 34, baseType: !720, size: 64, align: 64, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!32, !31, !723, !96}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "Credentials", file: !218, line: 26, size: 256, align: 8, elements: !725)
!725 = !{!726, !728, !729, !731, !732}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_", file: !218, line: 26, baseType: !727, align: 8)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !21, line: 1, align: 8, elements: !3)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "AccessKeyId", file: !218, line: 26, baseType: !95, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Expiration", file: !218, line: 26, baseType: !730, size: 64, align: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "SecretAccessKey", file: !218, line: 26, baseType: !95, size: 64, align: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "SessionToken", file: !218, line: 26, baseType: !95, size: 64, align: 64, offset: 192)
!733 = !DILocalVariable(name: "c", arg: 1, scope: !688, file: !218, line: 115, type: !691)
!734 = !DILocation(line: 115, column: 1, scope: !688)
!735 = !DILocalVariable(name: "param", arg: 2, scope: !688, file: !218, line: 115, type: !96)
!736 = !DILocation(line: 115, column: 29, scope: !688)
!737 = !DILocalVariable(name: "role", scope: !688, file: !218, line: 115, type: !95)
!738 = !DILocation(line: 117, column: 15, scope: !739)
!739 = distinct !DILexicalBlock(scope: !688, file: !218, line: 115, column: 1)
!740 = !DILocation(line: 117, column: 25, scope: !739)
!741 = !DILocation(line: 116, column: 9, scope: !739)
!742 = !DILocation(line: 116, column: 19, scope: !739)
!743 = !DILocalVariable(name: "req", scope: !739, file: !218, line: 116, type: !744)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServerRequest", file: !218, line: 25, size: 512, align: 8, elements: !746)
!746 = !{!747, !754, !761, !767, !772, !780}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "AssumeRole", file: !218, line: 25, baseType: !748, size: 64, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "AssumeRole", file: !218, line: 25, size: 320, align: 8, elements: !750)
!750 = !{!751, !752, !753}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !218, line: 25, baseType: !95, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Role", file: !218, line: 25, baseType: !95, size: 64, align: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !218, line: 25, baseType: !8, size: 192, align: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ChallengeResponse", file: !218, line: 25, baseType: !755, size: 64, align: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHChallengeResponse", file: !218, line: 25, size: 448, align: 8, elements: !757)
!757 = !{!758, !759, !760}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !218, line: 25, baseType: !8, size: 192, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "Format", file: !218, line: 25, baseType: !95, size: 64, align: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !218, line: 25, baseType: !8, size: 192, align: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "TokenResponse", file: !218, line: 25, baseType: !762, size: 64, align: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "MFATokenResponse", file: !218, line: 25, size: 256, align: 8, elements: !764)
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "TokenValue", file: !218, line: 25, baseType: !95, size: 64, align: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !218, line: 25, baseType: !8, size: 192, align: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserCredentials", file: !218, line: 25, baseType: !768, size: 64, align: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "GetUserCredentials", file: !218, line: 25, size: 192, align: 8, elements: !770)
!770 = !{!771}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !218, line: 25, baseType: !8, size: 192, align: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "AddSSHkey", file: !218, line: 25, baseType: !773, size: 64, align: 64, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "AddSSHKey", file: !218, line: 25, size: 384, align: 8, elements: !775)
!775 = !{!776, !777, !778, !779}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Username", file: !218, line: 25, baseType: !95, size: 64, align: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "Passwordhash", file: !218, line: 25, baseType: !95, size: 64, align: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "Sshkeybytes", file: !218, line: 25, baseType: !95, size: 64, align: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !218, line: 25, baseType: !8, size: 192, align: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !218, line: 25, baseType: !8, size: 192, align: 64, offset: 320)
!781 = !DILocation(line: 116, column: 2, scope: !688)
!782 = !DILocation(line: 122, column: 10, scope: !739)
!783 = !DILocation(line: 122, column: 2, scope: !739)
!784 = distinct !DISubprogram(name: "agent.GetUserCredentials..1command_line_arguments.client", linkageName: "command_line_arguments.client.GetUserCredentials", scope: null, file: !218, line: 125, type: !785, isLocal: false, isDefinition: true, scopeLine: 125, isOptimized: false, unit: !1, retainedNodes: !3)
!785 = !DISubroutineType(types: !786)
!786 = !{!183, !691, !691}
!787 = !DILocalVariable(name: "c", arg: 1, scope: !784, file: !218, line: 125, type: !691)
!788 = !DILocation(line: 125, column: 1, scope: !784)
!789 = !DILocation(line: 127, column: 23, scope: !790)
!790 = distinct !DILexicalBlock(scope: !784, file: !218, line: 125, column: 1)
!791 = !DILocation(line: 126, column: 9, scope: !790)
!792 = !DILocation(line: 126, column: 19, scope: !790)
!793 = !DILocalVariable(name: "req", scope: !790, file: !218, line: 126, type: !744)
!794 = !DILocation(line: 126, column: 2, scope: !784)
!795 = !DILocation(line: 130, column: 10, scope: !790)
!796 = !DILocation(line: 130, column: 2, scope: !790)
!797 = distinct !DISubprogram(name: "agent.requestCredentials..1command_line_arguments.client", linkageName: "command_line_arguments.client.requestCredentials", scope: null, file: !218, line: 133, type: !798, isLocal: false, isDefinition: true, scopeLine: 133, isOptimized: false, unit: !1, retainedNodes: !3)
!798 = !DISubroutineType(types: !799)
!799 = !{!183, !691, !691, !744, !96}
!800 = !DILocalVariable(name: "c", arg: 1, scope: !797, file: !218, line: 133, type: !691)
!801 = !DILocation(line: 133, column: 1, scope: !797)
!802 = !DILocalVariable(name: "req", arg: 2, scope: !797, file: !218, line: 133, type: !744)
!803 = !DILocation(line: 133, column: 37, scope: !797)
!804 = !DILocalVariable(name: "role", arg: 3, scope: !797, file: !218, line: 133, type: !96)
!805 = !DILocation(line: 133, column: 66, scope: !797)
!806 = !DILocation(line: 134, column: 33, scope: !807)
!807 = distinct !DILexicalBlock(scope: !797, file: !218, line: 133, column: 1)
!808 = !DILocation(line: 134, column: 22, scope: !807)
!809 = !DILocalVariable(name: "conn", scope: !807, file: !218, line: 134, type: !810)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageReadWriteCloser", file: !218, line: 25, size: 128, align: 8, elements: !811)
!811 = !{!812, !239}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !218, line: 25, baseType: !813, size: 64, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)struct{*Message,error},*func(*void,*Message)error}", file: !9, size: 256, align: 8, elements: !815)
!815 = !{!816, !817, !818, !889}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 25, baseType: !67, size: 64, align: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !9, line: 25, baseType: !399, size: 64, align: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !9, line: 25, baseType: !819, size: 64, align: 64, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!822, !31}
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Message,error}", file: !9, size: 192, align: 8, elements: !823)
!823 = !{!824, !888}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 25, baseType: !825, size: 64, align: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !218, line: 25, size: 768, align: 8, elements: !827)
!827 = !{!828, !829, !832, !839, !840, !864, !873, !885, !886, !887}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !218, line: 25, baseType: !95, size: 64, align: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "Source", file: !218, line: 25, baseType: !830, size: 64, align: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIBasicType(name: "Message_Source", size: 32, encoding: DW_ATE_signed)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "Ping", file: !218, line: 25, baseType: !833, size: 64, align: 64, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ping", file: !218, line: 25, size: 256, align: 8, elements: !835)
!835 = !{!836, !766}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !218, line: 25, baseType: !837, size: 64, align: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIBasicType(name: "Ping_RequestResponse", size: 32, encoding: DW_ATE_signed)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ServerRequest", file: !218, line: 25, baseType: !744, size: 64, align: 64, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ServerResponse", file: !218, line: 25, baseType: !841, size: 64, align: 64, offset: 256)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServerResponse", file: !218, line: 25, size: 448, align: 8, elements: !843)
!843 = !{!844, !849, !852, !861, !760}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "Challenge", file: !218, line: 25, baseType: !845, size: 64, align: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHChallenge", file: !218, line: 25, size: 384, align: 8, elements: !847)
!847 = !{!848, !779}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "Challenge", file: !218, line: 25, baseType: !8, size: 192, align: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "VerificationFailure", file: !218, line: 25, baseType: !850, size: 64, align: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHVerificationFailure", file: !218, line: 25, size: 192, align: 8, elements: !770)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "Credentials", file: !218, line: 25, baseType: !853, size: 64, align: 64, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "STSCredentials", file: !218, line: 25, size: 448, align: 8, elements: !855)
!855 = !{!856, !857, !858, !859, !760}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "AccessKeyId", file: !218, line: 25, baseType: !95, size: 64, align: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "SecretAccessKey", file: !218, line: 25, baseType: !95, size: 64, align: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "AccessToken", file: !218, line: 25, baseType: !95, size: 64, align: 64, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "Expiration", file: !218, line: 25, baseType: !860, size: 64, align: 64, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "TokenRequest", file: !218, line: 25, baseType: !862, size: 64, align: 64, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "MFATokenRequest", file: !218, line: 25, size: 192, align: 8, elements: !770)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "AgentRequest", file: !218, line: 25, baseType: !865, size: 64, align: 64, offset: 320)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "AgentRequest", file: !218, line: 25, size: 576, align: 8, elements: !867)
!867 = !{!868, !869, !870, !871, !872}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "SshAgentSock", file: !218, line: 25, baseType: !95, size: 64, align: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "AssumeRole", file: !218, line: 25, baseType: !748, size: 64, align: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserCredentials", file: !218, line: 25, baseType: !768, size: 64, align: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "SshKeyFile", file: !218, line: 25, baseType: !8, size: 192, align: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !218, line: 25, baseType: !8, size: 192, align: 64, offset: 384)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "AgentResponse", file: !218, line: 25, baseType: !874, size: 64, align: 64, offset: 384)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "AgentResponse", file: !218, line: 25, size: 320, align: 8, elements: !876)
!876 = !{!877, !880, !753}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "Success", file: !218, line: 25, baseType: !878, size: 64, align: 64)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "Success", file: !218, line: 25, size: 192, align: 8, elements: !770)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "Failure", file: !218, line: 25, baseType: !881, size: 64, align: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "Failure", file: !218, line: 25, size: 256, align: 8, elements: !883)
!883 = !{!884, !766}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorMessage", file: !218, line: 25, baseType: !95, size: 64, align: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "Success", file: !218, line: 25, baseType: !878, size: 64, align: 64, offset: 448)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "Failure", file: !218, line: 25, baseType: !881, size: 64, align: 64, offset: 512)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !218, line: 25, baseType: !8, size: 192, align: 64, offset: 576)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 25, baseType: !183, size: 128, align: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !9, line: 25, baseType: !890, size: 64, align: 64, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!183, !31, !825}
!893 = !DILocation(line: 134, column: 2, scope: !797)
!894 = !DILocalVariable(name: "err", scope: !807, file: !218, line: 134, type: !183)
!895 = !DILocation(line: 135, column: 9, scope: !807)
!896 = !DILocalVariable(name: "$ret28", scope: !797, file: !218, line: 133, type: !183)
!897 = !DILocation(line: 133, column: 79, scope: !797)
!898 = !DILocation(line: 136, column: 3, scope: !807)
!899 = !DILocation(line: 139, column: 9, scope: !807)
!900 = !DILocation(line: 139, column: 19, scope: !807)
!901 = !DILocalVariable(name: "msg", scope: !807, file: !218, line: 139, type: !825)
!902 = !DILocation(line: 139, column: 2, scope: !797)
!903 = !DILocation(line: 141, column: 12, scope: !807)
!904 = !DILocation(line: 143, column: 9, scope: !807)
!905 = !DILocalVariable(name: "skip", scope: !906, file: !218, line: 147, type: !15)
!906 = distinct !DILexicalBlock(scope: !807, file: !218, line: 147, column: 2)
!907 = !DILocation(line: 147, column: 6, scope: !807)
!908 = !DILocation(line: 148, column: 18, scope: !906)
!909 = !DILocation(line: 149, column: 10, scope: !906)
!910 = !DILocation(line: 144, column: 3, scope: !807)
!911 = !DILocation(line: 150, column: 4, scope: !906)
!912 = !DILocation(line: 152, column: 9, scope: !906)
!913 = !DILocation(line: 152, column: 30, scope: !906)
!914 = !DILocation(line: 153, column: 25, scope: !915)
!915 = distinct !DILexicalBlock(scope: !906, file: !218, line: 152, column: 37)
!916 = !DILocalVariable(name: "serverResponse", scope: !915, file: !218, line: 153, type: !841)
!917 = !DILocation(line: 153, column: 4, scope: !906)
!918 = !DILocation(line: 154, column: 21, scope: !915)
!919 = !DILocation(line: 154, column: 37, scope: !915)
!920 = !DILocation(line: 199, column: 16, scope: !906)
!921 = !DILocation(line: 199, column: 28, scope: !906)
!922 = !DILocation(line: 155, column: 32, scope: !923)
!923 = distinct !DILexicalBlock(scope: !915, file: !218, line: 154, column: 44)
!924 = !DILocation(line: 155, column: 47, scope: !923)
!925 = !DILocalVariable(name: "challenge", scope: !923, file: !218, line: 155, type: !8)
!926 = !DILocation(line: 155, column: 5, scope: !915)
!927 = !DILocation(line: 157, column: 23, scope: !923)
!928 = !DILocalVariable(name: "signature", scope: !923, file: !218, line: 157, type: !234)
!929 = !DILocation(line: 157, column: 5, scope: !915)
!930 = !DILocalVariable(name: "err", scope: !923, file: !218, line: 157, type: !183)
!931 = !DILocation(line: 158, column: 12, scope: !923)
!932 = !DILocation(line: 178, column: 28, scope: !915)
!933 = !DILocation(line: 178, column: 46, scope: !915)
!934 = !DILocation(line: 159, column: 6, scope: !923)
!935 = !DILocation(line: 161, column: 18, scope: !923)
!936 = !DILocation(line: 162, column: 20, scope: !923)
!937 = !DILocation(line: 162, column: 6, scope: !923)
!938 = !DILocation(line: 168, column: 28, scope: !923)
!939 = !DILocation(line: 169, column: 29, scope: !923)
!940 = !DILocation(line: 167, column: 26, scope: !923)
!941 = !DILocation(line: 167, column: 36, scope: !923)
!942 = !DILocation(line: 166, column: 21, scope: !923)
!943 = !DILocation(line: 166, column: 31, scope: !923)
!944 = !DILocation(line: 165, column: 11, scope: !923)
!945 = !DILocation(line: 165, column: 21, scope: !923)
!946 = !DILocation(line: 174, column: 15, scope: !923)
!947 = !DILocation(line: 175, column: 12, scope: !923)
!948 = !DILocation(line: 179, column: 36, scope: !949)
!949 = distinct !DILexicalBlock(scope: !915, file: !218, line: 178, column: 53)
!950 = !DILocalVariable(name: "credsResponse", scope: !949, file: !218, line: 179, type: !853)
!951 = !DILocation(line: 179, column: 5, scope: !915)
!952 = !DILocation(line: 180, column: 5, scope: !949)
!953 = !DILocation(line: 180, column: 33, scope: !949)
!954 = !DILocation(line: 193, column: 28, scope: !915)
!955 = !DILocation(line: 193, column: 54, scope: !915)
!956 = !DILocalVariable(name: "accessKeyId", scope: !949, file: !218, line: 180, type: !95)
!957 = !DILocation(line: 180, column: 5, scope: !915)
!958 = !DILocation(line: 181, column: 5, scope: !949)
!959 = !DILocation(line: 181, column: 34, scope: !949)
!960 = !DILocalVariable(name: "sessionToken", scope: !949, file: !218, line: 181, type: !95)
!961 = !DILocation(line: 181, column: 5, scope: !915)
!962 = !DILocation(line: 182, column: 5, scope: !949)
!963 = !DILocation(line: 182, column: 37, scope: !949)
!964 = !DILocalVariable(name: "secretAccessKey", scope: !949, file: !218, line: 182, type: !95)
!965 = !DILocation(line: 182, column: 5, scope: !915)
!966 = !DILocation(line: 183, column: 42, scope: !949)
!967 = !DILocation(line: 183, column: 24, scope: !949)
!968 = !DILocation(line: 183, column: 5, scope: !949)
!969 = !DILocalVariable(name: "expiration", scope: !949, file: !218, line: 183, type: !730)
!970 = !DILocation(line: 183, column: 5, scope: !915)
!971 = !DILocation(line: 185, column: 14, scope: !949)
!972 = !DILocation(line: 185, column: 19, scope: !949)
!973 = !DILocalVariable(name: "creds", scope: !949, file: !218, line: 185, type: !723)
!974 = !DILocation(line: 185, column: 5, scope: !915)
!975 = !DILocation(line: 191, column: 9, scope: !949)
!976 = !DILocation(line: 192, column: 5, scope: !949)
!977 = !DILocation(line: 195, column: 5, scope: !915)
!978 = !DILocation(line: 197, column: 16, scope: !915)
!979 = !DILocation(line: 197, column: 5, scope: !915)
!980 = !DILocation(line: 200, column: 25, scope: !906)
!981 = !DILocation(line: 200, column: 18, scope: !906)
!982 = !DILocation(line: 200, column: 4, scope: !906)
!983 = !DILocation(line: 202, column: 15, scope: !906)
!984 = !DILocation(line: 202, column: 4, scope: !906)
!985 = distinct !DISubprogram(name: "agent.command_line_arguments.accessKeyClient..hash", linkageName: "command_line_arguments.command_line_arguments.accessKeyClient..hash", scope: null, file: !21, line: 1, type: !82, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!986 = !DILocalVariable(name: "key", arg: 1, scope: !985, file: !21, line: 1, type: !31)
!987 = !DILocation(line: 1, column: 1, scope: !985)
!988 = !DILocalVariable(name: "seed", arg: 2, scope: !985, file: !21, line: 1, type: !35)
!989 = !DILocalVariable(name: "$ret47", scope: !985, file: !21, line: 1, type: !35)
!990 = distinct !DISubprogram(name: "agent.command_line_arguments.accessKeyClient..eq", linkageName: "command_line_arguments.command_line_arguments.accessKeyClient..eq", scope: null, file: !21, line: 1, type: !90, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!991 = !DILocalVariable(name: "key1", arg: 1, scope: !990, file: !21, line: 1, type: !31)
!992 = !DILocation(line: 1, column: 1, scope: !990)
!993 = !DILocalVariable(name: "key2", arg: 2, scope: !990, file: !21, line: 1, type: !31)
!994 = !DILocalVariable(name: "$ret48", scope: !990, file: !21, line: 1, type: !92)
!995 = distinct !DISubprogram(name: "agent.AssumeRole..1command_line_arguments.accessKeyClient", linkageName: "command_line_arguments.accessKeyClient.AssumeRole", scope: null, file: !218, line: 81, type: !996, isLocal: false, isDefinition: true, scopeLine: 81, isOptimized: false, unit: !1, retainedNodes: !3)
!996 = !DISubroutineType(types: !997)
!997 = !{!183, !998, !998, !96}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.accessKeyClient", file: !218, line: 49, size: 384, align: 8, elements: !1000)
!1000 = !{!1001, !1031, !1032}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "credentialService", file: !218, line: 50, baseType: !1002, size: 128, align: 64)
!1002 = !DICompositeType(tag: DW_TAG_structure_type, name: "CredentialService", file: !218, line: 26, size: 128, align: 8, elements: !1003)
!1003 = !{!1004, !239}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !218, line: 26, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*User,string,bool)struct{*Credentials,error},*func(*void)struct{*Credentials,error}}", file: !9, size: 192, align: 8, elements: !1007)
!1007 = !{!224, !1008, !1027}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "AssumeRole", file: !9, line: 26, baseType: !1009, size: 64, align: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!1012, !31, !1016, !96, !92}
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Credentials,error}", file: !9, size: 192, align: 8, elements: !1013)
!1013 = !{!1014, !1015}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 26, baseType: !723, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 26, baseType: !183, size: 128, align: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DICompositeType(tag: DW_TAG_structure_type, name: "User", file: !218, line: 26, size: 640, align: 8, elements: !1018)
!1018 = !{!1019, !1020, !1025, !1026}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "Username", file: !218, line: 26, baseType: !96, size: 128, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "SSHKeys", file: !218, line: 26, baseType: !1021, size: 192, align: 64, offset: 128)
!1021 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*PublicKey,int,int}", file: !9, size: 192, align: 8, elements: !1022)
!1022 = !{!1023, !14, !16}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ARNs", file: !218, line: 26, baseType: !528, size: 192, align: 64, offset: 320)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultRole", file: !218, line: 26, baseType: !96, size: 128, align: 64, offset: 512)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "GetSessionToken", file: !9, line: 26, baseType: !1028, size: 64, align: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!1012, !31}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "iamUsername", file: !218, line: 51, baseType: !96, size: 128, align: 64, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "cr", file: !218, line: 52, baseType: !696, size: 128, align: 64, offset: 256)
!1033 = !DILocalVariable(name: "c", arg: 1, scope: !995, file: !218, line: 81, type: !998)
!1034 = !DILocation(line: 81, column: 1, scope: !995)
!1035 = !DILocalVariable(name: "role", arg: 2, scope: !995, file: !218, line: 81, type: !96)
!1036 = !DILocation(line: 81, column: 38, scope: !995)
!1037 = !DILocation(line: 82, column: 2, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !995, file: !218, line: 81, column: 1)
!1039 = !DILocalVariable(name: "user", scope: !1038, file: !218, line: 82, type: !1016)
!1040 = !DILocation(line: 82, column: 2, scope: !995)
!1041 = !DILocation(line: 83, column: 14, scope: !1038)
!1042 = !DILocation(line: 82, column: 17, scope: !1038)
!1043 = !DILocation(line: 85, column: 38, scope: !1038)
!1044 = !DILocalVariable(name: "err", scope: !1038, file: !218, line: 85, type: !183)
!1045 = !DILocation(line: 85, column: 2, scope: !995)
!1046 = !DILocation(line: 87, column: 9, scope: !1038)
!1047 = !DILocation(line: 88, column: 3, scope: !1038)
!1048 = !DILocalVariable(name: "$ret23", scope: !995, file: !218, line: 81, type: !183)
!1049 = !DILocation(line: 81, column: 51, scope: !995)
!1050 = !DILocalVariable(name: "response", scope: !1038, file: !218, line: 85, type: !723)
!1051 = !DILocation(line: 90, column: 6, scope: !1038)
!1052 = !DILocation(line: 91, column: 2, scope: !1038)
!1053 = distinct !DISubprogram(name: "agent.GetUserCredentials..1command_line_arguments.accessKeyClient", linkageName: "command_line_arguments.accessKeyClient.GetUserCredentials", scope: null, file: !218, line: 94, type: !1054, isLocal: false, isDefinition: true, scopeLine: 94, isOptimized: false, unit: !1, retainedNodes: !3)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!183, !998, !998}
!1056 = !DILocalVariable(name: "c", arg: 1, scope: !1053, file: !218, line: 94, type: !998)
!1057 = !DILocation(line: 94, column: 1, scope: !1053)
!1058 = !DILocation(line: 95, column: 20, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1053, file: !218, line: 94, column: 1)
!1060 = !DILocation(line: 95, column: 38, scope: !1059)
!1061 = !DILocalVariable(name: "err", scope: !1059, file: !218, line: 95, type: !183)
!1062 = !DILocation(line: 95, column: 2, scope: !1053)
!1063 = !DILocation(line: 97, column: 9, scope: !1059)
!1064 = !DILocation(line: 98, column: 3, scope: !1059)
!1065 = !DILocalVariable(name: "$ret24", scope: !1053, file: !218, line: 94, type: !183)
!1066 = !DILocation(line: 94, column: 48, scope: !1053)
!1067 = !DILocalVariable(name: "response", scope: !1059, file: !218, line: 95, type: !723)
!1068 = !DILocation(line: 100, column: 6, scope: !1059)
!1069 = !DILocation(line: 101, column: 2, scope: !1059)
!1070 = distinct !DISubprogram(name: "agent.AccessKeyClient", linkageName: "command_line_arguments.AccessKeyClient", scope: null, file: !218, line: 55, type: !1071, isLocal: false, isDefinition: true, scopeLine: 55, isOptimized: false, unit: !1, retainedNodes: !3)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!998, !696, !1073}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!1074 = !DILocalVariable(name: "cr", arg: 1, scope: !1070, file: !218, line: 55, type: !696)
!1075 = !DILocation(line: 55, column: 22, scope: !1070)
!1076 = !DILocalVariable(name: "accountAliases", arg: 2, scope: !1070, file: !218, line: 55, type: !1073)
!1077 = !DILocation(line: 55, column: 46, scope: !1070)
!1078 = !DILocalVariable(name: "$ret22", scope: !1070, file: !218, line: 55, type: !998)
!1079 = !DILocation(line: 55, column: 81, scope: !1070)
!1080 = !DILocation(line: 56, column: 2, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1070, file: !218, line: 55, column: 1)
!1082 = !DILocation(line: 56, column: 16, scope: !1081)
!1083 = !DILocalVariable(name: "config", scope: !1081, file: !218, line: 56, type: !1084)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !218, line: 26, size: 1280, align: 8, elements: !1086)
!1086 = !{!1087, !1089, !1123, !1124, !1125, !1126, !1439, !1442, !1457, !1458, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "CredentialsChainVerboseErrors", file: !218, line: 26, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "Credentials", file: !218, line: 26, baseType: !1090, size: 64, align: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DICompositeType(tag: DW_TAG_structure_type, name: "Credentials", file: !218, line: 26, size: 768, align: 8, elements: !1092)
!1092 = !{!1093, !1100, !1101, !1107}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "creds", file: !218, line: 26, baseType: !1094, size: 512, align: 64)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !218, line: 26, size: 512, align: 8, elements: !1095)
!1095 = !{!1096, !1097, !1098, !1099}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "AccessKeyID", file: !218, line: 26, baseType: !96, size: 128, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "SecretAccessKey", file: !218, line: 26, baseType: !96, size: 128, align: 64, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "SessionToken", file: !218, line: 26, baseType: !96, size: 128, align: 64, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ProviderName", file: !218, line: 26, baseType: !96, size: 128, align: 64, offset: 384)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "forceRefresh", file: !218, line: 26, baseType: !92, size: 8, align: 8, offset: 512)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !218, line: 26, baseType: !1102, size: 64, align: 32, offset: 544)
!1102 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 21, size: 64, align: 8, elements: !1103)
!1103 = !{!1104, !1106}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 21, baseType: !1105, size: 32, align: 32)
!1105 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 21, baseType: !29, size: 32, align: 32, offset: 32)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "provider", file: !218, line: 26, baseType: !1108, size: 128, align: 64, offset: 640)
!1108 = !DICompositeType(tag: DW_TAG_structure_type, name: "Provider", file: !218, line: 26, size: 128, align: 8, elements: !1109)
!1109 = !{!1110, !239}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !218, line: 26, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)bool,*func(*void)struct{Value,error}}", file: !9, size: 192, align: 8, elements: !1113)
!1113 = !{!224, !1114, !1115}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "IsExpired", file: !9, line: 26, baseType: !118, size: 64, align: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "Retrieve", file: !9, line: 26, baseType: !1116, size: 64, align: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!1119, !31}
!1119 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Value,error}", file: !9, size: 640, align: 8, elements: !1120)
!1120 = !{!1121, !1122}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 26, baseType: !1094, size: 512, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 26, baseType: !183, size: 128, align: 64, offset: 512)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "Endpoint", file: !218, line: 26, baseType: !95, size: 64, align: 64, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "Region", file: !218, line: 26, baseType: !95, size: 64, align: 64, offset: 192)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "DisableSSL", file: !218, line: 26, baseType: !1088, size: 64, align: 64, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "HTTPClient", file: !218, line: 26, baseType: !1127, size: 64, align: 64, offset: 320)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DICompositeType(tag: DW_TAG_structure_type, name: "Client", file: !218, line: 26, size: 384, align: 8, elements: !1129)
!1129 = !{!1130, !1392, !1404, !1437}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "Transport", file: !218, line: 26, baseType: !1131, size: 128, align: 64)
!1131 = !DICompositeType(tag: DW_TAG_structure_type, name: "RoundTripper", file: !218, line: 26, size: 128, align: 8, elements: !1132)
!1132 = !{!1133, !239}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !218, line: 26, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*Request)struct{*Response,error}}", file: !9, size: 128, align: 8, elements: !1136)
!1136 = !{!224, !1137}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "RoundTrip", file: !9, line: 26, baseType: !1138, size: 64, align: 64, offset: 64)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!1141, !31, !1160}
!1141 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Response,error}", file: !9, size: 192, align: 8, elements: !1142)
!1142 = !{!1143, !1015}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 26, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !218, line: 26, size: 1152, align: 8, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1391}
