; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22agent\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/AdRoll/hologram/agent\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/AdRoll/hologram/agent\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/AdRoll/hologram/log\22"
module asm "\09.ascii \22 \5C\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./config.go", directory: "/home/wangcong/go_path/src/github.com/AdRoll/hologram/cmd/hologram-agent")
!3 = !{}
!4 = !{!5, !17, !20, !24, !26, !29}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "main.dialAddress", linkageName: "main.dialAddress", scope: !1, file: !7, line: 32, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "main.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !10, line: 1, size: 128, align: 8, elements: !11)
!10 = !DIFile(filename: "<built-in>", directory: "")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !10, line: 1, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !10, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !10, line: 1, type: !19, isLocal: false, isDefinition: true)
!19 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "main.debugMode", linkageName: "main.debugMode", scope: !1, file: !7, line: 33, type: !22, isLocal: true, isDefinition: true)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "main.configFile", linkageName: "main.configFile", scope: !1, file: !7, line: 34, type: !8, isLocal: true, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "main.httpPort", linkageName: "main.httpPort", scope: !1, file: !7, line: 35, type: !28, isLocal: true, isDefinition: true)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "main.config", linkageName: "main.config", scope: !1, file: !7, line: 36, type: !31, isLocal: true, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !32, line: 20, size: 192, align: 8, elements: !33)
!32 = !DIFile(filename: "config.go", directory: ".")
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !32, line: 21, baseType: !9, size: 128, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "AccountAliases", file: !32, line: 22, baseType: !36, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !10, line: 1, size: 384, align: 8, elements: !38)
!38 = !{!39, !40, !41, !42, !44, !45, !48, !49, !51}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !10, line: 1, baseType: !16, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 72)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !10, line: 1, baseType: !43, size: 16, align: 16, offset: 80)
!43 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !10, line: 1, baseType: !19, size: 32, align: 32, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !10, line: 1, baseType: !46, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIBasicType(name: "void")
!48 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !10, line: 1, baseType: !46, size: 64, align: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !10, line: 1, baseType: !50, size: 64, align: 64, offset: 256)
!50 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !10, line: 1, baseType: !46, size: 64, align: 64, offset: 320)
!52 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !32, line: 15, type: !53, isLocal: false, isDefinition: true, scopeLine: 15, isOptimized: false, unit: !1, retainedNodes: !3)
!53 = !DISubroutineType(types: !54)
!54 = !{!47}
!55 = !DILocation(line: 1, column: 1, scope: !56)
!56 = !DILexicalBlockFile(scope: !52, file: !10, discriminator: 0)
!57 = !DILocation(line: 32, column: 21, scope: !58)
!58 = !DILexicalBlockFile(scope: !52, file: !7, discriminator: 0)
!59 = !DILocation(line: 32, column: 2, scope: !58)
!60 = !DILocation(line: 33, column: 21, scope: !58)
!61 = !DILocation(line: 33, column: 2, scope: !58)
!62 = !DILocation(line: 34, column: 21, scope: !58)
!63 = !DILocation(line: 34, column: 2, scope: !58)
!64 = !DILocation(line: 35, column: 21, scope: !58)
!65 = !DILocation(line: 35, column: 2, scope: !58)
!66 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !7, line: 39, type: !53, isLocal: false, isDefinition: true, scopeLine: 39, isOptimized: false, unit: !1, retainedNodes: !3)
!67 = !DILocation(line: 40, column: 7, scope: !68)
!68 = distinct !DILexicalBlock(scope: !66, file: !7, line: 39, column: 1)
!69 = !DILocation(line: 145, column: 1, scope: !66)
!70 = !DILocation(line: 42, column: 6, scope: !68)
!71 = !DILocation(line: 42, column: 5, scope: !68)
!72 = !DILocation(line: 42, column: 2, scope: !68)
!73 = !DILocation(line: 43, column: 7, scope: !68)
!74 = !DILocation(line: 48, column: 46, scope: !68)
!75 = !DILocation(line: 48, column: 45, scope: !68)
!76 = !DILocation(line: 44, column: 7, scope: !68)
!77 = !DILocation(line: 48, column: 6, scope: !68)
!78 = !DILocation(line: 49, column: 42, scope: !68)
!79 = !DILocation(line: 49, column: 41, scope: !68)
!80 = !DILocation(line: 49, column: 32, scope: !68)
!81 = !DILocalVariable(name: "err", scope: !68, file: !7, line: 49, type: !82)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !10, line: 1, size: 128, align: 8, elements: !83)
!83 = !{!84, !140}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 1, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !87, size: 128, align: 8, elements: !88)
!87 = !DIFile(filename: "", directory: "")
!88 = !{!89, !136}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !87, line: 1, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !10, line: 1, size: 576, align: 8, elements: !92)
!92 = !{!93, !94, !95, !96, !97, !98, !99, !107, !115, !116, !117, !135}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !10, line: 1, baseType: !50, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !10, line: 1, baseType: !50, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !10, line: 1, baseType: !19, size: 32, align: 32, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 160)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 168)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 176)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !10, line: 1, baseType: !100, size: 64, align: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 1, size: 64, align: 8, elements: !102)
!102 = !{!103}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 1, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!50, !46, !50}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !10, line: 1, baseType: !108, size: 64, align: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 1, size: 64, align: 8, elements: !110)
!110 = !{!111}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 1, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!23, !46, !46}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !10, line: 1, baseType: !13, size: 64, align: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !10, line: 1, baseType: !8, size: 64, align: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !10, line: 1, baseType: !118, size: 64, align: 64, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !10, line: 1, size: 320, align: 8, elements: !120)
!120 = !{!121, !122, !123}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !10, line: 1, baseType: !8, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !10, line: 1, baseType: !8, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !10, line: 1, baseType: !124, size: 192, align: 64, offset: 128)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !87, size: 192, align: 8, elements: !125)
!125 = !{!126, !133, !134}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !87, line: 1, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !10, line: 1, size: 320, align: 8, elements: !129)
!129 = !{!121, !122, !130, !131, !132}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !10, line: 1, baseType: !46, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !10, line: 1, baseType: !46, size: 64, align: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !10, line: 1, baseType: !46, size: 64, align: 64, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !87, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !87, line: 1, baseType: !16, size: 64, align: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !10, line: 1, baseType: !46, size: 64, align: 64, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !87, line: 1, baseType: !137, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!9, !46}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !46, size: 64, align: 64, offset: 64)
!141 = !DILocation(line: 49, column: 2, scope: !66)
!142 = !DILocation(line: 50, column: 9, scope: !68)
!143 = !DILocation(line: 51, column: 55, scope: !68)
!144 = !DILocation(line: 55, column: 25, scope: !68)
!145 = !DILocation(line: 51, column: 7, scope: !68)
!146 = !DILocation(line: 52, column: 6, scope: !68)
!147 = !DILocalVariable(name: "configParseErr", scope: !68, file: !7, line: 55, type: !82)
!148 = !DILocation(line: 55, column: 2, scope: !66)
!149 = !DILocation(line: 56, column: 20, scope: !68)
!150 = !DILocation(line: 57, column: 64, scope: !68)
!151 = !DILocation(line: 63, column: 6, scope: !68)
!152 = !DILocation(line: 63, column: 5, scope: !68)
!153 = !DILocation(line: 57, column: 7, scope: !68)
!154 = !DILocation(line: 58, column: 6, scope: !68)
!155 = !DILocation(line: 63, column: 18, scope: !68)
!156 = !DILocation(line: 64, column: 7, scope: !68)
!157 = !DILocation(line: 69, column: 6, scope: !68)
!158 = !DILocation(line: 65, column: 18, scope: !68)
!159 = !DILocation(line: 65, column: 17, scope: !68)
!160 = !DILocation(line: 65, column: 15, scope: !68)
!161 = !DILocation(line: 73, column: 13, scope: !68)
!162 = !DILocation(line: 74, column: 10, scope: !68)
!163 = !DILocation(line: 74, column: 9, scope: !68)
!164 = !DILocation(line: 72, column: 40, scope: !68)
!165 = !DILocation(line: 72, column: 45, scope: !68)
!166 = !DILocation(line: 72, column: 23, scope: !68)
!167 = !DILocalVariable(name: "listener", scope: !68, file: !7, line: 72, type: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "TCPListener", file: !7, line: 22, size: 64, align: 8, elements: !170)
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "fd", file: !7, line: 22, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: ".net.netFD", file: !7, line: 22, size: 960, align: 8, elements: !174)
!174 = !{!175, !206, !207, !208, !209, !210, !221}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !7, line: 22, baseType: !176, size: 384, align: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !7, line: 21, size: 384, align: 8, elements: !177)
!177 = !{!178, !185, !186, !190, !201, !202, !203, !204, !205}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !7, line: 21, baseType: !179, size: 128, align: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !7, line: 21, size: 128, align: 8, elements: !180)
!180 = !{!181, !183, !184}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 21, baseType: !182, size: 64, align: 64)
!182 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !7, line: 21, baseType: !19, size: 32, align: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !7, line: 21, baseType: !19, size: 32, align: 32, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !7, line: 21, baseType: !16, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !7, line: 21, baseType: !187, size: 64, align: 64, offset: 192)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !7, line: 21, size: 64, align: 8, elements: !188)
!188 = !{!189}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !7, line: 21, baseType: !50, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !7, line: 21, baseType: !191, size: 64, align: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !87, size: 192, align: 8, elements: !193)
!193 = !{!194, !133, !134}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !87, line: 1, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !7, line: 21, size: 128, align: 8, elements: !197)
!197 = !{!198, !199}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !7, line: 21, baseType: !13, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !7, line: 21, baseType: !200, size: 64, align: 64, offset: 64)
!200 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !7, line: 21, baseType: !19, size: 32, align: 32, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !7, line: 21, baseType: !23, size: 8, align: 8, offset: 352)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !7, line: 21, baseType: !23, size: 8, align: 8, offset: 360)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !7, line: 21, baseType: !23, size: 8, align: 8, offset: 368)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !7, line: 21, baseType: !23, size: 8, align: 8, offset: 376)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "family", file: !7, line: 22, baseType: !16, size: 64, align: 64, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sotype", file: !7, line: 22, baseType: !16, size: 64, align: 64, offset: 448)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "isConnected", file: !7, line: 22, baseType: !23, size: 8, align: 8, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "net", file: !7, line: 22, baseType: !9, size: 128, align: 64, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "laddr", file: !7, line: 22, baseType: !211, size: 128, align: 64, offset: 704)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "Addr", file: !7, line: 22, size: 128, align: 8, elements: !212)
!212 = !{!213, !220}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 22, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)string}", file: !87, size: 192, align: 8, elements: !216)
!216 = !{!217, !218, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !87, line: 22, baseType: !90, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Network", file: !87, line: 22, baseType: !137, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !87, line: 22, baseType: !137, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !46, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "raddr", file: !7, line: 22, baseType: !211, size: 128, align: 64, offset: 832)
!222 = !DILocation(line: 72, column: 2, scope: !66)
!223 = !DILocation(line: 76, column: 9, scope: !68)
!224 = !DILocation(line: 77, column: 66, scope: !68)
!225 = !DILocation(line: 81, column: 24, scope: !68)
!226 = !DILocation(line: 77, column: 7, scope: !68)
!227 = !DILocation(line: 78, column: 6, scope: !68)
!228 = !DILocalVariable(name: "credsManager", scope: !68, file: !7, line: 81, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: ".github.com/AdRoll/hologram/agent.credentialsExpirationManager", file: !7, line: 27, size: 448, align: 8, elements: !231)
!231 = !{!232, !276, !277, !278}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "creds", file: !7, line: 27, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "Credentials", file: !7, line: 27, size: 256, align: 8, elements: !235)
!235 = !{!236, !238, !239, !274, !275}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_", file: !7, line: 27, baseType: !237, align: 8)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !10, line: 1, align: 8, elements: !3)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "AccessKeyId", file: !7, line: 27, baseType: !8, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "Expiration", file: !7, line: 27, baseType: !240, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 21, size: 192, align: 8, elements: !242)
!242 = !{!243, !244, !246}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 21, baseType: !182, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 21, baseType: !245, size: 64, align: 64, offset: 64)
!245 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 21, baseType: !247, size: 64, align: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 21, size: 704, align: 8, elements: !249)
!249 = !{!250, !251, !260, !271, !272, !273}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 21, baseType: !9, size: 128, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 21, baseType: !252, size: 192, align: 64, offset: 128)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !87, size: 192, align: 8, elements: !253)
!253 = !{!254, !133, !134}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !87, line: 1, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 21, size: 256, align: 8, elements: !257)
!257 = !{!250, !258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 21, baseType: !16, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 21, baseType: !23, size: 8, align: 8, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 21, baseType: !261, size: 192, align: 64, offset: 320)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !87, size: 192, align: 8, elements: !262)
!262 = !{!263, !133, !134}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !87, line: 1, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 21, size: 128, align: 8, elements: !266)
!266 = !{!267, !268, !269, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 21, baseType: !245, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 21, baseType: !14, size: 8, align: 8, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 21, baseType: !23, size: 8, align: 8, offset: 72)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 21, baseType: !23, size: 8, align: 8, offset: 80)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 21, baseType: !245, size: 64, align: 64, offset: 512)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 21, baseType: !245, size: 64, align: 64, offset: 576)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 21, baseType: !255, size: 64, align: 64, offset: 640)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "SecretAccessKey", file: !7, line: 27, baseType: !8, size: 64, align: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "SessionToken", file: !7, line: 27, baseType: !8, size: 64, align: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "user", file: !7, line: 27, baseType: !9, size: 128, align: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "role", file: !7, line: 27, baseType: !9, size: 128, align: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "client", file: !7, line: 27, baseType: !279, size: 128, align: 64, offset: 320)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "Client", file: !7, line: 27, size: 128, align: 8, elements: !280)
!280 = !{!281, !220}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 27, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)error,*func(*void)error}", file: !87, size: 192, align: 8, elements: !284)
!284 = !{!285, !286, !290}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !87, line: 27, baseType: !90, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "AssumeRole", file: !87, line: 27, baseType: !287, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!82, !46, !9}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserCredentials", file: !87, line: 27, baseType: !291, size: 64, align: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!82, !46}
!294 = !DILocation(line: 81, column: 2, scope: !66)
!295 = !DILocation(line: 83, column: 49, scope: !68)
!296 = !DILocation(line: 83, column: 20, scope: !68)
!297 = !DILocalVariable(name: "mds", scope: !68, file: !7, line: 83, type: !298)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "MetadataService", file: !7, line: 27, size: 128, align: 8, elements: !299)
!299 = !{!300, !220}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 27, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void)error,*func(*void)error}", file: !87, size: 256, align: 8, elements: !303)
!303 = !{!285, !304, !308, !309}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Port", file: !87, line: 27, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!16, !46}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Start", file: !87, line: 27, baseType: !291, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Stop", file: !87, line: 27, baseType: !291, size: 64, align: 64, offset: 192)
!310 = !DILocation(line: 83, column: 2, scope: !66)
!311 = !DILocation(line: 84, column: 9, scope: !68)
!312 = !DILocation(line: 85, column: 58, scope: !68)
!313 = !DILocation(line: 88, column: 5, scope: !68)
!314 = !DILocation(line: 85, column: 7, scope: !68)
!315 = !DILocation(line: 86, column: 6, scope: !68)
!316 = !DILocation(line: 92, column: 17, scope: !68)
!317 = !DILocation(line: 93, column: 18, scope: !68)
!318 = !DILocation(line: 0, scope: !68)
!319 = !DILocalVariable(name: "client", scope: !68, file: !7, line: 91, type: !279)
!320 = !DILocation(line: 91, column: 6, scope: !66)
!321 = !DILocation(line: 98, column: 23, scope: !68)
!322 = !DILocation(line: 95, column: 18, scope: !68)
!323 = !DILocation(line: 93, column: 10, scope: !68)
!324 = !DILocation(line: 95, column: 10, scope: !68)
!325 = !DILocalVariable(name: "agentServer", scope: !68, file: !7, line: 98, type: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: ".github.com/AdRoll/hologram/agent.cliHandler", file: !7, line: 27, size: 256, align: 8, elements: !328)
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "client", file: !7, line: 27, baseType: !279, size: 128, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "address", file: !7, line: 27, baseType: !9, size: 128, align: 64, offset: 128)
!331 = !DILocation(line: 98, column: 2, scope: !66)
!332 = !DILocation(line: 99, column: 23, scope: !333)
!333 = distinct !DILexicalBlock(scope: !68, file: !7, line: 99, column: 2)
!334 = !DILocalVariable(name: "err", scope: !333, file: !7, line: 99, type: !82)
!335 = !DILocation(line: 99, column: 5, scope: !68)
!336 = !DILocation(line: 99, column: 37, scope: !333)
!337 = !DILocation(line: 100, column: 52, scope: !333)
!338 = !DILocation(line: 104, column: 2, scope: !68)
!339 = !DILocation(line: 100, column: 7, scope: !333)
!340 = !DILocation(line: 101, column: 6, scope: !333)
!341 = !DILocation(line: 110, column: 2, scope: !68)
!342 = !DILocalVariable(name: "terminate", scope: !68, file: !7, line: 110, type: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!345 = !DILocation(line: 110, column: 2, scope: !66)
!346 = !DILocation(line: 110, column: 15, scope: !68)
!347 = !DILocation(line: 111, column: 9, scope: !68)
!348 = !DILocation(line: 111, column: 16, scope: !68)
!349 = !DILocation(line: 112, column: 2, scope: !68)
!350 = !DILocalVariable(name: "done", scope: !68, file: !7, line: 112, type: !343)
!351 = !DILocation(line: 112, column: 2, scope: !66)
!352 = !DILocation(line: 112, column: 10, scope: !68)
!353 = !DILocation(line: 115, column: 2, scope: !68)
!354 = !DILocalVariable(name: "debugEnable", scope: !68, file: !7, line: 115, type: !343)
!355 = !DILocation(line: 115, column: 2, scope: !66)
!356 = !DILocation(line: 115, column: 17, scope: !68)
!357 = !DILocation(line: 116, column: 2, scope: !68)
!358 = !DILocalVariable(name: "debugDisable", scope: !68, file: !7, line: 116, type: !343)
!359 = !DILocation(line: 116, column: 2, scope: !66)
!360 = !DILocation(line: 116, column: 18, scope: !68)
!361 = !DILocation(line: 117, column: 9, scope: !68)
!362 = !DILocation(line: 117, column: 16, scope: !68)
!363 = !DILocation(line: 118, column: 9, scope: !68)
!364 = !DILocation(line: 118, column: 16, scope: !68)
!365 = !DILocation(line: 120, column: 6, scope: !68)
!366 = !DILocation(line: 123, column: 5, scope: !68)
!367 = !DILocation(line: 123, column: 2, scope: !68)
!368 = !DILocation(line: 130, column: 5, scope: !68)
!369 = !DILocation(line: 130, column: 2, scope: !68)
!370 = !DILocation(line: 143, column: 4, scope: !68)
!371 = !DILocation(line: 143, column: 2, scope: !68)
!372 = !DILocation(line: 144, column: 6, scope: !68)
!373 = distinct !DISubprogram(name: "main.main..thunk0", scope: null, file: !7, line: 104, type: !374, isLocal: true, isDefinition: true, scopeLine: 104, isOptimized: false, unit: !1, retainedNodes: !3)
!374 = !DISubroutineType(types: !375)
!375 = !{!47, !344}
!376 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !373, file: !7, line: 104, type: !344)
!377 = !DILocation(line: 104, column: 2, scope: !373)
!378 = !DILocation(line: 105, column: 7, scope: !379, inlinedAt: !380)
!379 = distinct !DISubprogram(name: "main.main..func1", scope: null, file: !7, line: 104, type: !53, isLocal: true, isDefinition: true, scopeLine: 104, isOptimized: false, unit: !1, retainedNodes: !3)
!380 = distinct !DILocation(line: 104, column: 2, scope: !373)
!381 = !DILocation(line: 106, column: 6, scope: !379, inlinedAt: !380)
!382 = distinct !DISubprogram(name: "main.main..func2", scope: null, file: !7, line: 123, type: !53, isLocal: true, isDefinition: true, scopeLine: 123, isOptimized: false, unit: !1, retainedNodes: !3)
!383 = !DILocation(line: 124, column: 10, scope: !384)
!384 = distinct !DILexicalBlock(scope: !382, file: !7, line: 123, column: 5)
!385 = !DILocation(line: 124, column: 8, scope: !384)
!386 = !DILocalVariable(name: "s", scope: !384, file: !7, line: 124, type: !387)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "Signal", file: !7, line: 23, size: 128, align: 8, elements: !388)
!388 = !{!389, !220}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 23, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)string}", file: !87, size: 192, align: 8, elements: !392)
!392 = !{!393, !394, !398}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !87, line: 23, baseType: !90, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Signal", file: !87, line: 23, baseType: !395, size: 64, align: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!47, !46}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !87, line: 23, baseType: !137, size: 64, align: 64, offset: 128)
!399 = !DILocation(line: 124, column: 3, scope: !382)
!400 = !DILocation(line: 125, column: 59, scope: !384)
!401 = !DILocation(line: 125, column: 7, scope: !384)
!402 = !DILocation(line: 126, column: 3, scope: !384)
!403 = !DILocation(line: 126, column: 8, scope: !384)
!404 = distinct !DISubprogram(name: "main.main..thunk1", scope: null, file: !7, line: 123, type: !405, isLocal: true, isDefinition: true, scopeLine: 123, isOptimized: false, unit: !1, retainedNodes: !3)
!405 = !DISubroutineType(types: !406)
!406 = !{!47, !407}
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*__go_descriptor}", file: !87, size: 64, align: 8, elements: !409)
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !87, line: 123, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 23, size: 64, align: 8, elements: !413)
!413 = !{!414}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 23, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!416 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !404, file: !7, line: 123, type: !407)
!417 = !DILocation(line: 123, column: 2, scope: !404)
!418 = distinct !DISubprogram(name: "main.main..func3", scope: null, file: !7, line: 130, type: !53, isLocal: true, isDefinition: true, scopeLine: 130, isOptimized: false, unit: !1, retainedNodes: !3)
!419 = !DILocation(line: 132, column: 4, scope: !418)
!420 = !DILocation(line: 133, column: 11, scope: !418)
!421 = !DILocation(line: 133, column: 4, scope: !418)
!422 = !DILocation(line: 136, column: 11, scope: !418)
!423 = !DILocation(line: 136, column: 4, scope: !418)
!424 = !DILocation(line: 134, column: 9, scope: !418)
!425 = !DILocation(line: 135, column: 9, scope: !418)
!426 = !DILocation(line: 137, column: 9, scope: !418)
!427 = !DILocation(line: 138, column: 9, scope: !418)
!428 = distinct !DISubprogram(name: "main.main..thunk2", scope: null, file: !7, line: 130, type: !405, isLocal: true, isDefinition: true, scopeLine: 130, isOptimized: false, unit: !1, retainedNodes: !3)
!429 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !428, file: !7, line: 130, type: !407)
!430 = !DILocation(line: 130, column: 2, scope: !428)
!431 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", scope: null, file: !10, line: 1, type: !105, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!432 = !DILocalVariable(name: "key", arg: 1, scope: !431, file: !10, line: 1, type: !46)
!433 = !DILocation(line: 1, column: 1, scope: !431)
!434 = !DILocalVariable(name: "seed", arg: 2, scope: !431, file: !10, line: 1, type: !50)
!435 = !DILocalVariable(name: "$ret34", scope: !431, file: !10, line: 1, type: !50)
!436 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", scope: null, file: !10, line: 1, type: !113, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!437 = !DILocalVariable(name: "key1", arg: 1, scope: !436, file: !10, line: 1, type: !46)
!438 = !DILocation(line: 1, column: 1, scope: !436)
!439 = !DILocalVariable(name: "key2", arg: 2, scope: !436, file: !10, line: 1, type: !46)
!440 = !DILocalVariable(name: "$ret35", scope: !436, file: !10, line: 1, type: !23)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "main"
