; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22tls\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/tls\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/tls\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"

!22 = !DILocation(line: 1, column: 1, scope: !16)
!23 = !DILocalVariable(name: "seed", arg: 2, scope: !16, file: !7, line: 1, type: !19)
!24 = !DILocalVariable(name: "$ret4", scope: !16, file: !7, line: 1, type: !19)
!25 = distinct !DISubprogram(name: "main.main.LDAP..eq", linkageName: "main.main.LDAP..eq", scope: null, file: !7, line: 1, type: !26, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !20, !20}
!28 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!29 = !DILocalVariable(name: "key1", arg: 1, scope: !25, file: !7, line: 1, type: !20)
!30 = !DILocation(line: 1, column: 1, scope: !25)
!31 = !DILocalVariable(name: "key2", arg: 2, scope: !25, file: !7, line: 1, type: !20)
!32 = !DILocalVariable(name: "$ret5", scope: !25, file: !7, line: 1, type: !28)
!33 = distinct !DISubprogram(name: "main.struct.4DN.0string.4json.x3a.x22dn.x22.5.2Password.0string.4json.x3a.x22password.x22.5.5..hash", linkageName: "main.struct.4DN.0string.4json.x3a.x22dn.x22.5.2Password.0string.4json.x3a.x22password.x22.5.5..hash", scope: null, file: !7, line: 1, type: !17, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!34 = !DILocalVariable(name: "key", arg: 1, scope: !33, file: !7, line: 1, type: !20)
!35 = !DILocation(line: 1, column: 1, scope: !33)
!36 = !DILocalVariable(name: "seed", arg: 2, scope: !33, file: !7, line: 1, type: !19)
!37 = !DILocalVariable(name: "$ret44", scope: !33, file: !7, line: 1, type: !19)
!38 = distinct !DISubprogram(name: "main.struct.4DN.0string.4json.x3a.x22dn.x22.5.2Password.0string.4json.x3a.x22password.x22.5.5..eq", linkageName: "main.struct.4DN.0string.4json.x3a.x22dn.x22.5.2Password.0string.4json.x3a.x22password.x22.5.5..eq", scope: null, file: !7, line: 1, type: !26, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!39 = !DILocalVariable(name: "key1", arg: 1, scope: !38, file: !7, line: 1, type: !20)
!40 = !DILocation(line: 1, column: 1, scope: !38)
!41 = !DILocalVariable(name: "key2", arg: 2, scope: !38, file: !7, line: 1, type: !20)
!42 = !DILocalVariable(name: "$ret45", scope: !38, file: !7, line: 1, type: !28)
!43 = distinct !DISubprogram(name: "main.struct.4Account.0string.4json.x3a.x22account.x22.5.2DefaultRole.0string.4json.x3a.x22defaultrole.x22.5.5..hash", linkageName: "main.struct.4Account.0string.4json.x3a.x22account.x22.5.2DefaultRole.0string.4json.x3a.x22defaultrole.x22.5.5..hash", scope: null, file: !7, line: 1, type: !17, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!44 = !DILocalVariable(name: "key", arg: 1, scope: !43, file: !7, line: 1, type: !20)
!45 = !DILocation(line: 1, column: 1, scope: !43)
!46 = !DILocalVariable(name: "seed", arg: 2, scope: !43, file: !7, line: 1, type: !19)
!47 = !DILocalVariable(name: "$ret6", scope: !43, file: !7, line: 1, type: !19)
!48 = distinct !DISubprogram(name: "main.struct.4Account.0string.4json.x3a.x22account.x22.5.2DefaultRole.0string.4json.x3a.x22defaultrole.x22.5.5..eq", linkageName: "main.struct.4Account.0string.4json.x3a.x22account.x22.5.2DefaultRole.0string.4json.x3a.x22defaultrole.x22.5.5..eq", scope: null, file: !7, line: 1, type: !26, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!49 = !DILocalVariable(name: "key1", arg: 1, scope: !48, file: !7, line: 1, type: !20)
!50 = !DILocation(line: 1, column: 1, scope: !48)
!51 = !DILocalVariable(name: "key2", arg: 2, scope: !48, file: !7, line: 1, type: !20)
!52 = !DILocalVariable(name: "$ret7", scope: !48, file: !7, line: 1, type: !28)
!53 = distinct !DISubprogram(name: "main.ConnectLDAP", linkageName: "main.ConnectLDAP", scope: null, file: !54, line: 39, type: !55, isLocal: false, isDefinition: true, scopeLine: 39, isOptimized: false, unit: !1, retainedNodes: !3)
!54 = !DIFile(filename: "main.go", directory: ".")
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !248}
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Conn,error}", file: !58, size: 192, align: 8, elements: !59)
!58 = !DIFile(filename: "", directory: "")
!59 = !{!60, !247}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !58, line: 39, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !54, line: 35, size: 768, align: 8, elements: !63)
!63 = !{!64, !204, !205, !207, !210, !224, !225, !226, !236, !237}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "conn", file: !54, line: 35, baseType: !65, size: 128, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !54, line: 19, size: 128, align: 8, elements: !66)
!66 = !{!67, !150}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !54, line: 19, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)Addr,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void)Addr,*func(*void,Time)error,*func(*void,Time)error,*func(*void,Time)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !58, size: 576, align: 8, elements: !70)
!70 = !{!71, !122, !138, !151, !162, !163, !201, !202, !203}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !58, line: 19, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !74)
!74 = !{!75, !76, !77, !78, !80, !81, !82, !88, !94, !96, !103, !121}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !19, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !19, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !79, size: 8, align: 8, offset: 160)
!79 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !79, size: 8, align: 8, offset: 168)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !79, size: 8, align: 8, offset: 176)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !83, size: 64, align: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !85)
!85 = !{!86}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !89, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !91)
!91 = !{!92}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !95, size: 64, align: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !97, size: 64, align: 64, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !95, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !102, size: 64, align: 64, offset: 64)
!102 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !104, size: 64, align: 64, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !106)
!106 = !{!107, !108, !109}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !97, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !97, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !110, size: 192, align: 64, offset: 128)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !58, size: 192, align: 8, elements: !111)
!111 = !{!112, !119, !120}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !115)
!115 = !{!107, !108, !116, !117, !118}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !20, size: 64, align: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !20, size: 64, align: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !20, size: 64, align: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !58, line: 1, baseType: !102, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !58, line: 1, baseType: !102, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !20, size: 64, align: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !58, line: 19, baseType: !123, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!126, !20}
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !127)
!127 = !{!128, !137}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !58, size: 128, align: 8, elements: !131)
!131 = !{!132, !133}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !58, line: 1, baseType: !72, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !58, line: 1, baseType: !134, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!98, !20}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !20, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "LocalAddr", file: !58, line: 19, baseType: !139, size: 64, align: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!142, !20}
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Addr", file: !54, line: 19, size: 128, align: 8, elements: !143)
!143 = !{!144, !150}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !54, line: 19, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)string}", file: !58, size: 192, align: 8, elements: !147)
!147 = !{!71, !148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Network", file: !58, line: 19, baseType: !134, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !58, line: 19, baseType: !134, size: 64, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !54, line: 1, baseType: !20, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !58, line: 19, baseType: !152, size: 64, align: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!155, !20, !159}
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !58, size: 192, align: 8, elements: !156)
!156 = !{!157, !158}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !58, line: 19, baseType: !102, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !58, line: 19, baseType: !126, size: 128, align: 64, offset: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !58, size: 192, align: 8, elements: !160)
!160 = !{!161, !119, !120}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !95, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !58, line: 19, baseType: !139, size: 64, align: 64, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "SetDeadline", file: !58, line: 19, baseType: !164, size: 64, align: 64, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!126, !20, !167}
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !54, line: 19, size: 192, align: 8, elements: !168)
!168 = !{!169, !171, !173}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !54, line: 19, baseType: !170, size: 64, align: 64)
!170 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !54, line: 19, baseType: !172, size: 64, align: 64, offset: 64)
!172 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !54, line: 19, baseType: !174, size: 64, align: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !54, line: 19, size: 704, align: 8, elements: !176)
!176 = !{!177, !178, !187, !198, !199, !200}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !54, line: 19, baseType: !98, size: 128, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !54, line: 19, baseType: !179, size: 192, align: 64, offset: 128)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !58, size: 192, align: 8, elements: !180)
!180 = !{!181, !119, !120}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !54, line: 19, size: 256, align: 8, elements: !184)
!184 = !{!177, !185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !54, line: 19, baseType: !102, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !54, line: 19, baseType: !28, size: 8, align: 8, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !54, line: 19, baseType: !188, size: 192, align: 64, offset: 320)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !58, size: 192, align: 8, elements: !189)
!189 = !{!190, !119, !120}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !54, line: 19, size: 128, align: 8, elements: !193)
!193 = !{!194, !195, !196, !197}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !54, line: 19, baseType: !172, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !54, line: 19, baseType: !79, size: 8, align: 8, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !54, line: 19, baseType: !28, size: 8, align: 8, offset: 72)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !54, line: 19, baseType: !28, size: 8, align: 8, offset: 80)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !54, line: 19, baseType: !172, size: 64, align: 64, offset: 512)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !54, line: 19, baseType: !172, size: 64, align: 64, offset: 576)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !54, line: 19, baseType: !182, size: 64, align: 64, offset: 640)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "SetReadDeadline", file: !58, line: 19, baseType: !164, size: 64, align: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "SetWriteDeadline", file: !58, line: 19, baseType: !164, size: 64, align: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !58, line: 19, baseType: !152, size: 64, align: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "isTLS", file: !54, line: 35, baseType: !28, size: 8, align: 8, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Debug", file: !54, line: 35, baseType: !206, size: 8, align: 8, offset: 136)
!206 = !DIBasicType(name: ".github.com/AdRoll/hologram/vendor/github.com/nmcclain/ldap.debugging", size: 8, encoding: DW_ATE_unsigned)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "chanConfirm", file: !54, line: 35, baseType: !208, size: 64, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !7, line: 1, align: 8, elements: !3)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "chanResults", file: !54, line: 35, baseType: !211, size: 64, align: 64, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !213)
!213 = !{!214, !215, !216, !217, !219, !220, !221, !222, !223}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !102, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !79, size: 8, align: 8, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !79, size: 8, align: 8, offset: 72)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !218, size: 16, align: 16, offset: 80)
!218 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !20, size: 64, align: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !20, size: 64, align: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !19, size: 64, align: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !20, size: 64, align: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "chanMessage", file: !54, line: 35, baseType: !208, size: 64, align: 64, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "chanMessageID", file: !54, line: 35, baseType: !208, size: 64, align: 64, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "wgSender", file: !54, line: 35, baseType: !227, size: 128, align: 32, offset: 448)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "WaitGroup", file: !54, line: 35, size: 128, align: 8, elements: !228)
!228 = !{!229, !231, !235}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "noCopy", file: !54, line: 35, baseType: !230, align: 8)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: ".sync.noCopy", file: !54, line: 19, align: 8, elements: !3)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "state1", file: !54, line: 35, baseType: !232, size: 96, align: 8)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 96, align: 1, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 12)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !54, line: 35, baseType: !8, size: 32, align: 32, offset: 96)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "chanDone", file: !54, line: 35, baseType: !208, size: 64, align: 64, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "once", file: !54, line: 35, baseType: !238, size: 96, align: 32, offset: 640)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once", file: !54, line: 19, size: 96, align: 8, elements: !239)
!239 = !{!240, !246}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !54, line: 19, baseType: !241, size: 64, align: 32)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !54, line: 19, size: 64, align: 8, elements: !242)
!242 = !{!243, !245}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !54, line: 19, baseType: !244, size: 32, align: 32)
!244 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !54, line: 19, baseType: !8, size: 32, align: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "done", file: !54, line: 19, baseType: !8, size: 32, align: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !58, line: 39, baseType: !126, size: 128, align: 64, offset: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "LDAP", file: !10, line: 17, size: 1088, align: 8, elements: !249)
!249 = !{!250, !255, !256, !257, !258, !259, !260, !261, !262}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Bind", file: !10, line: 18, baseType: !251, size: 256, align: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,string}", file: !58, size: 256, align: 8, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "DN", file: !58, line: 19, baseType: !98, size: 128, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Password", file: !58, line: 20, baseType: !98, size: 128, align: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "UserAttr", file: !10, line: 22, baseType: !98, size: 128, align: 64, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "BaseDN", file: !10, line: 23, baseType: !98, size: 128, align: 64, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !10, line: 24, baseType: !98, size: 128, align: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "InsecureLDAP", file: !10, line: 25, baseType: !28, size: 8, align: 8, offset: 640)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "EnableLDAPRoles", file: !10, line: 26, baseType: !28, size: 8, align: 8, offset: 648)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "RoleAttribute", file: !10, line: 27, baseType: !98, size: 128, align: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultRoleAttr", file: !10, line: 28, baseType: !98, size: 128, align: 64, offset: 832)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "GroupClassAttr", file: !10, line: 29, baseType: !98, size: 128, align: 64, offset: 960)
!263 = !DILocalVariable(name: "conf", arg: 1, scope: !53, file: !54, line: 39, type: !248)
!264 = !DILocation(line: 39, column: 18, scope: !53)
!265 = !DILocalVariable(name: "$ret0", scope: !53, file: !54, line: 39, type: !61)
!266 = !DILocation(line: 39, column: 30, scope: !53)
!267 = !DILocalVariable(name: "ldapServer", scope: !268, file: !54, line: 40, type: !61)
!268 = distinct !DILexicalBlock(scope: !53, file: !54, line: 39, column: 1)
!269 = !DILocation(line: 40, column: 6, scope: !53)
!270 = !DILocation(line: 44, column: 9, scope: !268)
!271 = !DILocation(line: 44, column: 2, scope: !268)
!272 = !DILocation(line: 45, column: 69, scope: !268)
!273 = !DILocation(line: 45, column: 7, scope: !268)
!274 = !DILocation(line: 46, column: 26, scope: !268)
!275 = !DILocalVariable(name: "err", scope: !268, file: !54, line: 41, type: !126)
!276 = !DILocation(line: 41, column: 6, scope: !53)
!277 = !DILocation(line: 0, scope: !268)
!278 = !DILocation(line: 0, scope: !279)
!279 = distinct !DILexicalBlock(scope: !268, file: !54, line: 47, column: 4)
!280 = !DILocation(line: 55, column: 9, scope: !268)
!281 = !DILocation(line: 48, column: 16, scope: !279)
!282 = !DILocation(line: 48, column: 21, scope: !279)
!283 = !DILocalVariable(name: "tlsConfig", scope: !279, file: !54, line: 48, type: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !54, line: 19, size: 2944, align: 8, elements: !286)
!286 = !{!287, !295, !303, !470, !471, !508, !521, !532, !548, !555, !556, !557, !559, !560, !561, !562, !563, !564, !568, !596, !597, !598, !599, !600, !602, !610, !611, !619}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Rand", file: !54, line: 19, baseType: !288, size: 128, align: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !54, line: 19, size: 128, align: 8, elements: !289)
!289 = !{!290, !150}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !54, line: 19, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !58, size: 128, align: 8, elements: !293)
!293 = !{!71, !294}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !58, line: 19, baseType: !152, size: 64, align: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Time", file: !54, line: 19, baseType: !296, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !54, line: 19, size: 64, align: 8, elements: !298)
!298 = !{!299}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !54, line: 19, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!167}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Certificates", file: !54, line: 19, baseType: !304, size: 192, align: 64, offset: 192)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,int,int}", file: !58, size: 192, align: 8, elements: !305)
!305 = !{!306, !119, !120}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !54, line: 19, size: 768, align: 8, elements: !309)
!309 = !{!310, !315, !319, !320, !321}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Certificate", file: !54, line: 19, baseType: !311, size: 192, align: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !58, size: 192, align: 8, elements: !312)
!312 = !{!313, !119, !120}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "PrivateKey", file: !54, line: 19, baseType: !316, size: 128, align: 64, offset: 192)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !54, line: 19, size: 128, align: 8, elements: !317)
!317 = !{!318, !150}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !54, line: 1, baseType: !72, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPStaple", file: !54, line: 19, baseType: !159, size: 192, align: 64, offset: 320)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !54, line: 19, baseType: !311, size: 192, align: 64, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Leaf", file: !54, line: 19, baseType: !322, size: 64, align: 64, offset: 704)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !54, line: 19, size: 10624, align: 8, elements: !324)
!324 = !{!325, !326, !327, !328, !329, !330, !331, !333, !335, !337, !338, !351, !380, !381, !382, !383, !385, !395, !396, !401, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !426, !449, !450, !451, !452, !463, !464, !465, !466, !467, !468, !469}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !54, line: 19, baseType: !159, size: 192, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !54, line: 19, baseType: !159, size: 192, align: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !54, line: 19, baseType: !159, size: 192, align: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !54, line: 19, baseType: !159, size: 192, align: 64, offset: 576)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !54, line: 19, baseType: !159, size: 192, align: 64, offset: 768)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !54, line: 19, baseType: !159, size: 192, align: 64, offset: 960)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !54, line: 19, baseType: !332, size: 64, align: 64, offset: 1152)
!332 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !54, line: 19, baseType: !334, size: 64, align: 64, offset: 1216)
!334 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !54, line: 19, baseType: !336, size: 128, align: 64, offset: 1280)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "Token", file: !54, line: 20, size: 128, align: 8, elements: !317)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !54, line: 19, baseType: !102, size: 64, align: 64, offset: 1408)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !54, line: 19, baseType: !339, size: 64, align: 64, offset: 1472)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !54, line: 19, size: 256, align: 8, elements: !341)
!341 = !{!342, !343}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !54, line: 19, baseType: !28, size: 8, align: 8)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !54, line: 19, baseType: !344, size: 192, align: 64, offset: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !54, line: 19, size: 192, align: 8, elements: !345)
!345 = !{!346, !349, !350}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !54, line: 1, baseType: !102, size: 64, align: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !54, line: 1, baseType: !102, size: 64, align: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !54, line: 19, baseType: !352, size: 1984, align: 64, offset: 1536)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !54, line: 19, size: 1984, align: 8, elements: !353)
!353 = !{!354, !358, !359, !360, !361, !362, !363, !364, !365, !366, !379}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !54, line: 19, baseType: !355, size: 192, align: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !58, size: 192, align: 8, elements: !356)
!356 = !{!357, !119, !120}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !97, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !54, line: 19, baseType: !355, size: 192, align: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !54, line: 19, baseType: !355, size: 192, align: 64, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !54, line: 19, baseType: !355, size: 192, align: 64, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !54, line: 19, baseType: !355, size: 192, align: 64, offset: 768)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !54, line: 19, baseType: !355, size: 192, align: 64, offset: 960)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !54, line: 19, baseType: !355, size: 192, align: 64, offset: 1152)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !54, line: 19, baseType: !98, size: 128, align: 64, offset: 1344)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !54, line: 19, baseType: !98, size: 128, align: 64, offset: 1472)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !54, line: 19, baseType: !367, size: 192, align: 64, offset: 1600)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !58, size: 192, align: 8, elements: !368)
!368 = !{!369, !119, !120}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !54, line: 19, size: 320, align: 8, elements: !372)
!372 = !{!373, !378}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !54, line: 19, baseType: !374, size: 192, align: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !54, line: 19, size: 192, align: 8, elements: !375)
!375 = !{!376, !349, !350}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !54, line: 19, baseType: !336, size: 128, align: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !54, line: 19, baseType: !367, size: 192, align: 64, offset: 1792)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !54, line: 19, baseType: !352, size: 1984, align: 64, offset: 3520)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !54, line: 19, baseType: !167, size: 192, align: 64, offset: 5504)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !54, line: 19, baseType: !167, size: 192, align: 64, offset: 5696)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !54, line: 19, baseType: !384, size: 64, align: 64, offset: 5888)
!384 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !54, line: 19, baseType: !386, size: 192, align: 64, offset: 5952)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !58, size: 192, align: 8, elements: !387)
!387 = !{!388, !119, !120}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !54, line: 19, size: 448, align: 8, elements: !391)
!391 = !{!392, !393, !394}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !54, line: 19, baseType: !374, size: 192, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !54, line: 19, baseType: !28, size: 8, align: 8, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !54, line: 19, baseType: !159, size: 192, align: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !54, line: 19, baseType: !386, size: 192, align: 64, offset: 6144)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !54, line: 19, baseType: !397, size: 192, align: 64, offset: 6336)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !58, size: 192, align: 8, elements: !398)
!398 = !{!399, !119, !120}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !54, line: 19, baseType: !402, size: 192, align: 64, offset: 6528)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !58, size: 192, align: 8, elements: !403)
!403 = !{!404, !119, !120}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !54, line: 19, baseType: !397, size: 192, align: 64, offset: 6720)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !54, line: 19, baseType: !28, size: 8, align: 8, offset: 6912)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !54, line: 19, baseType: !28, size: 8, align: 8, offset: 6920)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !54, line: 19, baseType: !102, size: 64, align: 64, offset: 6976)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !54, line: 19, baseType: !28, size: 8, align: 8, offset: 7040)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !54, line: 19, baseType: !159, size: 192, align: 64, offset: 7104)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !54, line: 19, baseType: !159, size: 192, align: 64, offset: 7296)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !54, line: 19, baseType: !355, size: 192, align: 64, offset: 7488)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !54, line: 19, baseType: !355, size: 192, align: 64, offset: 7680)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !54, line: 19, baseType: !355, size: 192, align: 64, offset: 7872)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !54, line: 19, baseType: !355, size: 192, align: 64, offset: 8064)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !54, line: 19, baseType: !419, size: 192, align: 64, offset: 8256)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !58, size: 192, align: 8, elements: !420)
!420 = !{!421, !119, !120}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !54, line: 19, size: 192, align: 8, elements: !424)
!424 = !{!425, !349, !350}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !95, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !54, line: 19, baseType: !427, size: 192, align: 64, offset: 8448)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !58, size: 192, align: 8, elements: !428)
!428 = !{!429, !119, !120}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !54, line: 19, size: 1024, align: 8, elements: !433)
!433 = !{!434, !435, !436, !443, !444, !445, !446, !447, !448}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !54, line: 19, baseType: !98, size: 128, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !54, line: 19, baseType: !98, size: 128, align: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !54, line: 19, baseType: !437, size: 64, align: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !54, line: 19, size: 320, align: 8, elements: !439)
!439 = !{!440, !441, !442}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !54, line: 19, baseType: !98, size: 128, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !54, line: 19, baseType: !98, size: 128, align: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !54, line: 19, baseType: !28, size: 8, align: 8, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !54, line: 19, baseType: !98, size: 128, align: 64, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !54, line: 19, baseType: !98, size: 128, align: 64, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !54, line: 19, baseType: !98, size: 128, align: 64, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !54, line: 19, baseType: !28, size: 8, align: 8, offset: 704)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !54, line: 19, baseType: !98, size: 128, align: 64, offset: 768)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !54, line: 19, baseType: !98, size: 128, align: 64, offset: 896)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !54, line: 19, baseType: !28, size: 8, align: 8, offset: 8640)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !54, line: 19, baseType: !355, size: 192, align: 64, offset: 8704)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !54, line: 19, baseType: !355, size: 192, align: 64, offset: 8896)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !54, line: 19, baseType: !453, size: 192, align: 64, offset: 9088)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !58, size: 192, align: 8, elements: !454)
!454 = !{!455, !119, !120}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !456, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !54, line: 19, size: 384, align: 8, elements: !459)
!459 = !{!460, !461}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !54, line: 19, baseType: !423, size: 192, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !54, line: 19, baseType: !462, size: 192, align: 64, offset: 192)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !54, line: 19, size: 192, align: 8, elements: !424)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !54, line: 19, baseType: !453, size: 192, align: 64, offset: 9280)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !54, line: 19, baseType: !355, size: 192, align: 64, offset: 9472)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !54, line: 19, baseType: !355, size: 192, align: 64, offset: 9664)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !54, line: 19, baseType: !355, size: 192, align: 64, offset: 9856)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !54, line: 19, baseType: !355, size: 192, align: 64, offset: 10048)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !54, line: 19, baseType: !355, size: 192, align: 64, offset: 10240)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !54, line: 19, baseType: !397, size: 192, align: 64, offset: 10432)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "NameToCertificate", file: !54, line: 19, baseType: !211, size: 64, align: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "GetCertificate", file: !54, line: 19, baseType: !472, size: 64, align: 64, offset: 448)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !54, line: 19, size: 64, align: 8, elements: !474)
!474 = !{!475}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !54, line: 19, baseType: !476, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!479, !483}
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,error}", file: !58, size: 192, align: 8, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !58, line: 19, baseType: !307, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !58, line: 19, baseType: !126, size: 128, align: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientHelloInfo", file: !54, line: 19, size: 1408, align: 8, elements: !485)
!485 = !{!486, !491, !492, !498, !499, !505, !506, !507}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuites", file: !54, line: 19, baseType: !487, size: 192, align: 64)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint16,int,int}", file: !58, size: 192, align: 8, elements: !488)
!488 = !{!489, !119, !120}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !54, line: 19, baseType: !98, size: 128, align: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedCurves", file: !54, line: 19, baseType: !493, size: 192, align: 64, offset: 320)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*CurveID,int,int}", file: !58, size: 192, align: 8, elements: !494)
!494 = !{!495, !119, !120}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !496, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIBasicType(name: "CurveID", size: 16, encoding: DW_ATE_unsigned)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedPoints", file: !54, line: 19, baseType: !159, size: 192, align: 64, offset: 512)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureSchemes", file: !54, line: 19, baseType: !500, size: 192, align: 64, offset: 704)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*SignatureScheme,int,int}", file: !58, size: 192, align: 8, elements: !501)
!501 = !{!502, !119, !120}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !503, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIBasicType(name: "SignatureScheme", size: 16, encoding: DW_ATE_unsigned)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedProtos", file: !54, line: 19, baseType: !355, size: 192, align: 64, offset: 896)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedVersions", file: !54, line: 19, baseType: !487, size: 192, align: 64, offset: 1088)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Conn", file: !54, line: 19, baseType: !65, size: 128, align: 64, offset: 1280)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "GetClientCertificate", file: !54, line: 19, baseType: !509, size: 64, align: 64, offset: 512)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !54, line: 19, size: 64, align: 8, elements: !511)
!511 = !{!512}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !54, line: 19, baseType: !513, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!479, !516}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertificateRequestInfo", file: !54, line: 19, size: 384, align: 8, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptableCAs", file: !54, line: 19, baseType: !311, size: 192, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureSchemes", file: !54, line: 19, baseType: !500, size: 192, align: 64, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "GetConfigForClient", file: !54, line: 19, baseType: !522, size: 64, align: 64, offset: 576)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !54, line: 19, size: 64, align: 8, elements: !524)
!524 = !{!525}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !54, line: 19, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!529, !483}
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Config,error}", file: !58, size: 192, align: 8, elements: !530)
!530 = !{!531, !482}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !58, line: 19, baseType: !20, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "VerifyPeerCertificate", file: !54, line: 19, baseType: !533, size: 64, align: 64, offset: 640)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !54, line: 19, size: 64, align: 8, elements: !535)
!535 = !{!536}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !54, line: 19, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!126, !311, !540}
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !58, size: 192, align: 8, elements: !541)
!541 = !{!542, !119, !120}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !543, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !58, size: 192, align: 8, elements: !545)
!545 = !{!546, !119, !120}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !547, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "RootCAs", file: !54, line: 19, baseType: !549, size: 64, align: 64, offset: 704)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertPool", file: !54, line: 19, size: 320, align: 8, elements: !551)
!551 = !{!552, !553, !554}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "bySubjectKeyId", file: !54, line: 19, baseType: !211, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "byName", file: !54, line: 19, baseType: !211, size: 64, align: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "certs", file: !54, line: 19, baseType: !544, size: 192, align: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "NextProtos", file: !54, line: 19, baseType: !355, size: 192, align: 64, offset: 768)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !54, line: 19, baseType: !98, size: 128, align: 64, offset: 960)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAuth", file: !54, line: 19, baseType: !558, size: 64, align: 64, offset: 1088)
!558 = !DIBasicType(name: "ClientAuthType", size: 64, encoding: DW_ATE_signed)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ClientCAs", file: !54, line: 19, baseType: !549, size: 64, align: 64, offset: 1152)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "InsecureSkipVerify", file: !54, line: 19, baseType: !28, size: 8, align: 8, offset: 1216)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuites", file: !54, line: 19, baseType: !487, size: 192, align: 64, offset: 1280)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "PreferServerCipherSuites", file: !54, line: 19, baseType: !28, size: 8, align: 8, offset: 1472)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "SessionTicketsDisabled", file: !54, line: 19, baseType: !28, size: 8, align: 8, offset: 1480)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "SessionTicketKey", file: !54, line: 19, baseType: !565, size: 256, align: 8, offset: 1488)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 256, align: 1, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ClientSessionCache", file: !54, line: 19, baseType: !569, size: 128, align: 64, offset: 1792)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientSessionCache", file: !54, line: 19, size: 128, align: 8, elements: !570)
!570 = !{!571, !150}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !54, line: 19, baseType: !572, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)struct{*ClientSessionState,bool},*func(*void,string,*ClientSessionState)void}", file: !58, size: 192, align: 8, elements: !574)
!574 = !{!71, !575, !592}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !58, line: 19, baseType: !576, size: 64, align: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!579, !20, !98}
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ClientSessionState,bool}", file: !58, size: 128, align: 8, elements: !580)
!580 = !{!581, !591}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "session", file: !58, line: 19, baseType: !582, size: 64, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientSessionState", file: !54, line: 19, size: 832, align: 8, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "sessionTicket", file: !54, line: 19, baseType: !159, size: 192, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "vers", file: !54, line: 19, baseType: !218, size: 16, align: 16, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "cipherSuite", file: !54, line: 19, baseType: !218, size: 16, align: 16, offset: 208)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "masterSecret", file: !54, line: 19, baseType: !159, size: 192, align: 64, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "serverCertificates", file: !54, line: 19, baseType: !544, size: 192, align: 64, offset: 448)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "verifiedChains", file: !54, line: 19, baseType: !540, size: 192, align: 64, offset: 640)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !58, line: 19, baseType: !28, size: 8, align: 8, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Put", file: !58, line: 19, baseType: !593, size: 64, align: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!13, !20, !98, !582}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "MinVersion", file: !54, line: 19, baseType: !218, size: 16, align: 16, offset: 1920)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "MaxVersion", file: !54, line: 19, baseType: !218, size: 16, align: 16, offset: 1936)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "CurvePreferences", file: !54, line: 19, baseType: !493, size: 192, align: 64, offset: 1984)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "DynamicRecordSizingDisabled", file: !54, line: 19, baseType: !28, size: 8, align: 8, offset: 2176)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Renegotiation", file: !54, line: 19, baseType: !601, size: 64, align: 64, offset: 2240)
!601 = !DIBasicType(name: "RenegotiationSupport", size: 64, encoding: DW_ATE_signed)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "KeyLogWriter", file: !54, line: 19, baseType: !603, size: 128, align: 64, offset: 2304)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !54, line: 19, size: 128, align: 8, elements: !604)
!604 = !{!605, !150}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !54, line: 19, baseType: !606, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !58, size: 128, align: 8, elements: !608)
!608 = !{!71, !609}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !58, line: 19, baseType: !152, size: 64, align: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "serverInitOnce", file: !54, line: 19, baseType: !238, size: 96, align: 32, offset: 2432)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !54, line: 19, baseType: !612, size: 192, align: 32, offset: 2528)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !54, line: 19, size: 192, align: 8, elements: !613)
!613 = !{!614, !615, !616, !617, !618}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !54, line: 19, baseType: !241, size: 64, align: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !54, line: 19, baseType: !8, size: 32, align: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !54, line: 19, baseType: !8, size: 32, align: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !54, line: 19, baseType: !244, size: 32, align: 32, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !54, line: 19, baseType: !244, size: 32, align: 32, offset: 160)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "sessionTicketKeys", file: !54, line: 19, baseType: !620, size: 192, align: 64, offset: 2752)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.crypto/tls.ticketKey,int,int}", file: !58, size: 192, align: 8, elements: !621)
!621 = !{!622, !119, !120}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !623, size: 64, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: ".crypto/tls.ticketKey", file: !54, line: 19, size: 384, align: 8, elements: !625)
!625 = !{!626, !630, !631}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "keyName", file: !54, line: 19, baseType: !627, size: 128, align: 8)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 128, align: 1, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 16)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "aesKey", file: !54, line: 19, baseType: !627, size: 128, align: 8, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "hmacKey", file: !54, line: 19, baseType: !627, size: 128, align: 8, offset: 256)
!632 = !DILocation(line: 48, column: 3, scope: !268)
!633 = !DILocation(line: 51, column: 53, scope: !279)
!634 = !DILocation(line: 51, column: 7, scope: !279)
!635 = !DILocation(line: 52, column: 26, scope: !279)
!636 = !DILocation(line: 59, column: 50, scope: !268)
!637 = !DILocation(line: 59, column: 21, scope: !268)
!638 = !DILocation(line: 59, column: 66, scope: !268)
!639 = !DILocation(line: 56, column: 53, scope: !268)
!640 = !DILocation(line: 56, column: 19, scope: !268)
!641 = !DILocalVariable(name: "$ret1", scope: !53, file: !54, line: 39, type: !126)
!642 = !DILocation(line: 39, column: 42, scope: !53)
!643 = !DILocation(line: 56, column: 3, scope: !268)
!644 = !DILocation(line: 63, column: 2, scope: !268)
!645 = !DILocation(line: 60, column: 56, scope: !268)
!646 = !DILocation(line: 60, column: 19, scope: !268)
!647 = !DILocation(line: 60, column: 3, scope: !268)
!648 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !54, line: 66, type: !11, isLocal: false, isDefinition: true, scopeLine: 66, isOptimized: false, unit: !1, retainedNodes: !3)
!649 = !DILocation(line: 69, column: 27, scope: !650)
!650 = distinct !DILexicalBlock(scope: !648, file: !54, line: 66, column: 1)
!651 = !DILocalVariable(name: "listenAddress", scope: !650, file: !54, line: 69, type: !97)
!652 = !DILocation(line: 69, column: 3, scope: !648)
!653 = !DILocation(line: 70, column: 27, scope: !650)
!654 = !DILocalVariable(name: "ldapAddress", scope: !650, file: !54, line: 70, type: !97)
!655 = !DILocation(line: 70, column: 3, scope: !648)
!656 = !DILocation(line: 71, column: 27, scope: !650)
!657 = !DILocalVariable(name: "ldapBindDN", scope: !650, file: !54, line: 71, type: !97)
!658 = !DILocation(line: 71, column: 3, scope: !648)
!659 = !DILocation(line: 72, column: 27, scope: !650)
!660 = !DILocalVariable(name: "ldapInsecure", scope: !650, file: !54, line: 72, type: !661)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!662 = !DILocation(line: 72, column: 3, scope: !648)
!663 = !DILocation(line: 73, column: 27, scope: !650)
!664 = !DILocalVariable(name: "ldapBindPassword", scope: !650, file: !54, line: 73, type: !97)
!665 = !DILocation(line: 73, column: 3, scope: !648)
!666 = !DILocation(line: 74, column: 27, scope: !650)
!667 = !DILocalVariable(name: "statsdHost", scope: !650, file: !54, line: 74, type: !97)
!668 = !DILocation(line: 74, column: 3, scope: !648)
!669 = !DILocation(line: 75, column: 27, scope: !650)
!670 = !DILocalVariable(name: "iamAccount", scope: !650, file: !54, line: 75, type: !97)
!671 = !DILocation(line: 75, column: 3, scope: !648)
!672 = !DILocation(line: 76, column: 27, scope: !650)
!673 = !DILocalVariable(name: "enableLDAPRoles", scope: !650, file: !54, line: 76, type: !661)
!674 = !DILocation(line: 76, column: 3, scope: !648)
!675 = !DILocation(line: 77, column: 27, scope: !650)
!676 = !DILocalVariable(name: "roleAttribute", scope: !650, file: !54, line: 77, type: !97)
!677 = !DILocation(line: 77, column: 3, scope: !648)
!678 = !DILocation(line: 78, column: 27, scope: !650)
!679 = !DILocalVariable(name: "defaultRoleAttr", scope: !650, file: !54, line: 78, type: !97)
!680 = !DILocation(line: 78, column: 3, scope: !648)
!681 = !DILocation(line: 79, column: 27, scope: !650)
!682 = !DILocalVariable(name: "groupClassAttr", scope: !650, file: !54, line: 79, type: !97)
!683 = !DILocation(line: 79, column: 3, scope: !648)
!684 = !DILocation(line: 80, column: 27, scope: !650)
!685 = !DILocalVariable(name: "defaultRole", scope: !650, file: !54, line: 80, type: !97)
!686 = !DILocation(line: 80, column: 3, scope: !648)
!687 = !DILocation(line: 81, column: 27, scope: !650)
!688 = !DILocalVariable(name: "configFile", scope: !650, file: !54, line: 81, type: !97)
!689 = !DILocation(line: 81, column: 3, scope: !648)
!690 = !DILocation(line: 82, column: 27, scope: !650)
!691 = !DILocalVariable(name: "cacheTimeout", scope: !650, file: !54, line: 82, type: !377)
!692 = !DILocation(line: 82, column: 3, scope: !648)
!693 = !DILocation(line: 83, column: 27, scope: !650)
!694 = !DILocalVariable(name: "debugMode", scope: !650, file: !54, line: 83, type: !661)
!695 = !DILocation(line: 83, column: 3, scope: !648)
!696 = !DILocation(line: 84, column: 3, scope: !650)
!697 = !DILocalVariable(name: "config", scope: !650, file: !54, line: 84, type: !698)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !10, line: 32, size: 1728, align: 8, elements: !700)
!700 = !{!701, !702, !707, !708, !709, !710}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "LDAP", file: !10, line: 33, baseType: !248, size: 1088, align: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "AWS", file: !10, line: 34, baseType: !703, size: 256, align: 64, offset: 1088)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,string}", file: !58, size: 256, align: 8, elements: !704)
!704 = !{!705, !706}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Account", file: !58, line: 35, baseType: !98, size: 128, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultRole", file: !58, line: 36, baseType: !98, size: 128, align: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Stats", file: !10, line: 38, baseType: !98, size: 128, align: 64, offset: 1344)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "Listen", file: !10, line: 39, baseType: !98, size: 128, align: 64, offset: 1472)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "CacheTimeout", file: !10, line: 40, baseType: !102, size: 64, align: 64, offset: 1600)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "AccountAliases", file: !10, line: 41, baseType: !211, size: 64, align: 64, offset: 1664)
!711 = !DILocation(line: 84, column: 3, scope: !648)
!712 = !DILocation(line: 87, column: 7, scope: !650)
!713 = !DILocation(line: 90, column: 5, scope: !650)
!714 = !DILocation(line: 90, column: 2, scope: !650)
!715 = !DILocation(line: 91, column: 7, scope: !650)
!716 = !DILocation(line: 92, column: 7, scope: !650)
!717 = !DILocation(line: 96, column: 45, scope: !650)
!718 = !DILocation(line: 96, column: 6, scope: !650)
!719 = !DILocation(line: 97, column: 38, scope: !650)
!720 = !DILocalVariable(name: "configErr", scope: !650, file: !54, line: 97, type: !126)
!721 = !DILocation(line: 97, column: 2, scope: !648)
!722 = !DILocation(line: 98, column: 15, scope: !650)
!723 = !DILocation(line: 99, column: 77, scope: !650)
!724 = !DILocation(line: 99, column: 7, scope: !650)
!725 = !DILocation(line: 100, column: 6, scope: !650)
!726 = !DILocation(line: 103, column: 51, scope: !650)
!727 = !DILocalVariable(name: "configContents", scope: !650, file: !54, line: 97, type: !159)
!728 = !DILocation(line: 103, column: 25, scope: !650)
!729 = !DILocalVariable(name: "configParseErr", scope: !650, file: !54, line: 103, type: !126)
!730 = !DILocation(line: 103, column: 2, scope: !648)
!731 = !DILocation(line: 104, column: 20, scope: !650)
!732 = !DILocation(line: 105, column: 64, scope: !650)
!733 = !DILocation(line: 105, column: 7, scope: !650)
!734 = !DILocation(line: 106, column: 6, scope: !650)
!735 = !DILocation(line: 110, column: 5, scope: !650)
!736 = !DILocation(line: 110, column: 18, scope: !650)
!737 = !DILocation(line: 111, column: 14, scope: !650)
!738 = !DILocation(line: 111, column: 20, scope: !650)
!739 = !DILocation(line: 114, column: 5, scope: !650)
!740 = !DILocation(line: 114, column: 2, scope: !650)
!741 = !DILocation(line: 115, column: 14, scope: !650)
!742 = !DILocation(line: 115, column: 28, scope: !650)
!743 = !DILocation(line: 118, column: 5, scope: !650)
!744 = !DILocation(line: 118, column: 17, scope: !650)
!745 = !DILocation(line: 122, column: 5, scope: !650)
!746 = !DILocation(line: 119, column: 23, scope: !650)
!747 = !DILocation(line: 122, column: 23, scope: !650)
!748 = !DILocation(line: 123, column: 19, scope: !650)
!749 = !DILocation(line: 123, column: 29, scope: !650)
!750 = !DILocation(line: 126, column: 5, scope: !650)
!751 = !DILocation(line: 126, column: 17, scope: !650)
!752 = !DILocation(line: 127, column: 9, scope: !650)
!753 = !DILocation(line: 127, column: 16, scope: !650)
!754 = !DILocation(line: 130, column: 5, scope: !650)
!755 = !DILocation(line: 130, column: 17, scope: !650)
!756 = !DILocation(line: 131, column: 9, scope: !650)
!757 = !DILocation(line: 131, column: 22, scope: !650)
!758 = !DILocation(line: 134, column: 5, scope: !650)
!759 = !DILocation(line: 134, column: 20, scope: !650)
!760 = !DILocation(line: 135, column: 9, scope: !650)
!761 = !DILocation(line: 135, column: 17, scope: !650)
!762 = !DILocation(line: 138, column: 5, scope: !650)
!763 = !DILocation(line: 138, column: 18, scope: !650)
!764 = !DILocation(line: 139, column: 13, scope: !650)
!765 = !DILocation(line: 139, column: 26, scope: !650)
!766 = !DILocation(line: 142, column: 5, scope: !650)
!767 = !DILocation(line: 142, column: 2, scope: !650)
!768 = !DILocation(line: 143, column: 14, scope: !650)
!769 = !DILocation(line: 143, column: 31, scope: !650)
!770 = !DILocation(line: 146, column: 5, scope: !650)
!771 = !DILocation(line: 146, column: 22, scope: !650)
!772 = !DILocation(line: 147, column: 14, scope: !650)
!773 = !DILocation(line: 147, column: 31, scope: !650)
!774 = !DILocation(line: 150, column: 5, scope: !650)
!775 = !DILocation(line: 150, column: 20, scope: !650)
!776 = !DILocation(line: 151, column: 14, scope: !650)
!777 = !DILocation(line: 151, column: 29, scope: !650)
!778 = !DILocation(line: 154, column: 5, scope: !650)
!779 = !DILocation(line: 154, column: 21, scope: !650)
!780 = !DILocation(line: 0, scope: !650)
!781 = !DILocation(line: 160, column: 5, scope: !650)
!782 = !DILocation(line: 156, column: 39, scope: !650)
!783 = !DILocation(line: 155, column: 30, scope: !650)
!784 = !DILocation(line: 157, column: 30, scope: !650)
!785 = !DILocation(line: 160, column: 19, scope: !650)
!786 = !DILocation(line: 167, column: 16, scope: !650)
!787 = !DILocation(line: 167, column: 26, scope: !650)
!788 = !DILocation(line: 161, column: 9, scope: !650)
!789 = !DILocation(line: 161, column: 23, scope: !650)
!790 = !DILocation(line: 168, column: 24, scope: !650)
!791 = !DILocation(line: 171, column: 11, scope: !650)
!792 = !DILocation(line: 171, column: 18, scope: !650)
!793 = !DILocation(line: 172, column: 7, scope: !650)
!794 = !DILocation(line: 173, column: 15, scope: !650)
!795 = !DILocation(line: 173, column: 9, scope: !650)
!796 = !DILocation(line: 185, column: 39, scope: !650)
!797 = !DILocation(line: 185, column: 35, scope: !650)
!798 = !DILocation(line: 185, column: 23, scope: !650)
!799 = !DILocalVariable(name: "stsConnection", scope: !650, file: !54, line: 185, type: !800)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "STS", file: !54, line: 30, size: 64, align: 8, elements: !802)
!802 = !{!803}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "Client", file: !54, line: 30, baseType: !804, size: 64, align: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "Client", file: !54, line: 30, size: 4864, align: 8, elements: !806)
!806 = !{!807, !1177, !1178, !1179}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "Retryer", file: !54, line: 30, baseType: !808, size: 128, align: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "Retryer", file: !54, line: 30, size: 128, align: 8, elements: !809)
!809 = !{!810, !150}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !54, line: 30, baseType: !811, size: 64, align: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,*Request)Duration,*func(*void,*Request)bool}", file: !58, size: 256, align: 8, elements: !813)
!813 = !{!814, !815, !819, !1173}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !58, line: 30, baseType: !72, size: 64, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "MaxRetries", file: !58, line: 30, baseType: !816, size: 64, align: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!102, !20}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "RetryRules", file: !58, line: 30, baseType: !820, size: 64, align: 64, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!823, !20, !824}
!823 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !54, line: 30, size: 6656, align: 8, elements: !826)
!826 = !{!827, !1067, !1077, !1120, !1121, !1122, !1123, !1137, !1138, !1139, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "Config", file: !54, line: 30, baseType: !828, size: 1280, align: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !54, line: 30, size: 1280, align: 8, elements: !829)
!829 = !{!830, !831, !863, !864, !865, !866, !1031, !1034, !1049, !1050, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "CredentialsChainVerboseErrors", file: !54, line: 30, baseType: !661, size: 64, align: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "Credentials", file: !54, line: 30, baseType: !832, size: 64, align: 64, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "Credentials", file: !54, line: 30, size: 768, align: 8, elements: !834)
!834 = !{!835, !842, !843, !844}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "creds", file: !54, line: 30, baseType: !836, size: 512, align: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !54, line: 30, size: 512, align: 8, elements: !837)
!837 = !{!838, !839, !840, !841}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "AccessKeyID", file: !54, line: 30, baseType: !98, size: 128, align: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "SecretAccessKey", file: !54, line: 30, baseType: !98, size: 128, align: 64, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "SessionToken", file: !54, line: 30, baseType: !98, size: 128, align: 64, offset: 256)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ProviderName", file: !54, line: 30, baseType: !98, size: 128, align: 64, offset: 384)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "forceRefresh", file: !54, line: 30, baseType: !28, size: 8, align: 8, offset: 512)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !54, line: 30, baseType: !241, size: 64, align: 32, offset: 544)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "provider", file: !54, line: 30, baseType: !845, size: 128, align: 64, offset: 640)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "Provider", file: !54, line: 30, size: 128, align: 8, elements: !846)
!846 = !{!847, !150}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !54, line: 30, baseType: !848, size: 64, align: 64)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)bool,*func(*void)struct{Value,error}}", file: !58, size: 192, align: 8, elements: !850)
!850 = !{!814, !851, !855}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "IsExpired", file: !58, line: 30, baseType: !852, size: 64, align: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!28, !20}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "Retrieve", file: !58, line: 30, baseType: !856, size: 64, align: 64, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!859, !20}
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Value,error}", file: !58, size: 640, align: 8, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !58, line: 30, baseType: !836, size: 512, align: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !58, line: 30, baseType: !126, size: 128, align: 64, offset: 512)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "Endpoint", file: !54, line: 30, baseType: !97, size: 64, align: 64, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "Region", file: !54, line: 30, baseType: !97, size: 64, align: 64, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "DisableSSL", file: !54, line: 30, baseType: !661, size: 64, align: 64, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "HTTPClient", file: !54, line: 30, baseType: !867, size: 64, align: 64, offset: 320)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "Client", file: !54, line: 30, size: 384, align: 8, elements: !869)
!869 = !{!870, !985, !997, !1030}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "Transport", file: !54, line: 30, baseType: !871, size: 128, align: 64)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "RoundTripper", file: !54, line: 30, size: 128, align: 8, elements: !872)
!872 = !{!873, !150}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !54, line: 30, baseType: !874, size: 64, align: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*Request)struct{*Response,error}}", file: !58, size: 128, align: 8, elements: !876)
!876 = !{!814, !877}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "RoundTrip", file: !58, line: 30, baseType: !878, size: 64, align: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{!881, !20, !909}
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Response,error}", file: !58, size: 192, align: 8, elements: !882)
!882 = !{!883, !984}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !58, line: 30, baseType: !884, size: 64, align: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !54, line: 30, size: 1152, align: 8, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892, !893, !903, !904, !905, !906, !907, !908, !983}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !54, line: 30, baseType: !98, size: 128, align: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "StatusCode", file: !54, line: 30, baseType: !102, size: 64, align: 64, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "Proto", file: !54, line: 30, baseType: !98, size: 128, align: 64, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMajor", file: !54, line: 30, baseType: !102, size: 64, align: 64, offset: 320)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMinor", file: !54, line: 30, baseType: !102, size: 64, align: 64, offset: 384)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !54, line: 30, baseType: !211, size: 64, align: 64, offset: 448)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !54, line: 30, baseType: !894, size: 128, align: 64, offset: 512)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !54, line: 23, size: 128, align: 8, elements: !895)
!895 = !{!896, !150}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !54, line: 23, baseType: !897, size: 64, align: 64)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !58, size: 192, align: 8, elements: !899)
!899 = !{!900, !901, !902}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !58, line: 23, baseType: !72, size: 64, align: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !58, line: 23, baseType: !123, size: 64, align: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !58, line: 23, baseType: !152, size: 64, align: 64, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !54, line: 30, baseType: !172, size: 64, align: 64, offset: 640)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !54, line: 30, baseType: !355, size: 192, align: 64, offset: 704)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !54, line: 30, baseType: !28, size: 8, align: 8, offset: 896)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "Uncompressed", file: !54, line: 30, baseType: !28, size: 8, align: 8, offset: 904)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !54, line: 30, baseType: !211, size: 64, align: 64, offset: 960)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "Request", file: !54, line: 30, baseType: !909, size: 64, align: 64, offset: 1024)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !54, line: 30, size: 1984, align: 8, elements: !911)
!911 = !{!912, !913, !889, !890, !891, !892, !893, !914, !926, !927, !928, !929, !930, !931, !932, !938, !939, !940, !941, !957, !958, !959}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !54, line: 30, baseType: !98, size: 128, align: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !54, line: 30, baseType: !431, size: 64, align: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !54, line: 30, baseType: !915, size: 64, align: 64, offset: 640)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !54, line: 30, size: 64, align: 8, elements: !917)
!917 = !{!918}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !54, line: 30, baseType: !919, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!922}
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !58, size: 256, align: 8, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !58, line: 30, baseType: !894, size: 128, align: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !58, line: 30, baseType: !126, size: 128, align: 64, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !54, line: 30, baseType: !172, size: 64, align: 64, offset: 704)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !54, line: 30, baseType: !355, size: 192, align: 64, offset: 768)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !54, line: 30, baseType: !28, size: 8, align: 8, offset: 960)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !54, line: 30, baseType: !98, size: 128, align: 64, offset: 1024)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "Form", file: !54, line: 30, baseType: !211, size: 64, align: 64, offset: 1152)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "PostForm", file: !54, line: 30, baseType: !211, size: 64, align: 64, offset: 1216)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "MultipartForm", file: !54, line: 30, baseType: !933, size: 64, align: 64, offset: 1280)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", file: !54, line: 30, size: 128, align: 8, elements: !935)
!935 = !{!936, !937}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !54, line: 30, baseType: !211, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !54, line: 30, baseType: !211, size: 64, align: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !54, line: 30, baseType: !211, size: 64, align: 64, offset: 1344)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !54, line: 30, baseType: !98, size: 128, align: 64, offset: 1408)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "RequestURI", file: !54, line: 30, baseType: !98, size: 128, align: 64, offset: 1536)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !54, line: 30, baseType: !942, size: 64, align: 64, offset: 1664)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionState", file: !54, line: 19, size: 1344, align: 8, elements: !944)
!944 = !{!945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !54, line: 19, baseType: !218, size: 16, align: 16)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "HandshakeComplete", file: !54, line: 19, baseType: !28, size: 8, align: 8, offset: 16)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "DidResume", file: !54, line: 19, baseType: !28, size: 8, align: 8, offset: 24)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuite", file: !54, line: 19, baseType: !218, size: 16, align: 16, offset: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocol", file: !54, line: 19, baseType: !98, size: 128, align: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocolIsMutual", file: !54, line: 19, baseType: !28, size: 8, align: 8, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !54, line: 19, baseType: !98, size: 128, align: 64, offset: 256)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "PeerCertificates", file: !54, line: 19, baseType: !544, size: 192, align: 64, offset: 384)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "VerifiedChains", file: !54, line: 19, baseType: !540, size: 192, align: 64, offset: 576)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !54, line: 19, baseType: !311, size: 192, align: 64, offset: 768)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPResponse", file: !54, line: 19, baseType: !159, size: 192, align: 64, offset: 960)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "TLSUnique", file: !54, line: 19, baseType: !159, size: 192, align: 64, offset: 1152)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", file: !54, line: 30, baseType: !208, size: 64, align: 64, offset: 1728)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !54, line: 30, baseType: !20, size: 64, align: 64, offset: 1792)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !54, line: 30, baseType: !960, size: 128, align: 64, offset: 1856)
!960 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !54, line: 19, size: 128, align: 8, elements: !961)
!961 = !{!962, !150}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !54, line: 19, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,Token)Token}", file: !58, size: 320, align: 8, elements: !965)
!965 = !{!71, !966, !974, !978, !979}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !58, line: 19, baseType: !967, size: 64, align: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!970, !20}
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !58, size: 256, align: 8, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !58, line: 19, baseType: !167, size: 192, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !58, line: 19, baseType: !28, size: 8, align: 8, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !58, line: 19, baseType: !975, size: 64, align: 64, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!208, !20}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !58, line: 19, baseType: !123, size: 64, align: 64, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !58, line: 19, baseType: !980, size: 64, align: 64, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!336, !20, !336}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !54, line: 30, baseType: !942, size: 64, align: 64, offset: 1088)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !58, line: 30, baseType: !126, size: 128, align: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "CheckRedirect", file: !54, line: 30, baseType: !986, size: 64, align: 64, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !54, line: 30, size: 64, align: 8, elements: !988)
!988 = !{!989}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !54, line: 30, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!126, !909, !993}
!993 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Request,int,int}", file: !58, size: 192, align: 8, elements: !994)
!994 = !{!995, !119, !120}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "Jar", file: !54, line: 30, baseType: !998, size: 128, align: 64, offset: 192)
!998 = !DICompositeType(tag: DW_TAG_structure_type, name: "CookieJar", file: !54, line: 30, size: 128, align: 8, elements: !999)
!999 = !{!1000, !150}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !54, line: 30, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*URL)struct{**Cookie,int,int},*func(*void,*URL,struct{**Cookie,int,int})void}", file: !58, size: 192, align: 8, elements: !1003)
!1003 = !{!814, !1004, !1026}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "Cookies", file: !58, line: 30, baseType: !1005, size: 64, align: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!1008, !20, !431}
!1008 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Cookie,int,int}", file: !58, size: 192, align: 8, elements: !1009)
!1009 = !{!1010, !119, !120}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cookie", file: !54, line: 30, size: 1280, align: 8, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !54, line: 30, baseType: !98, size: 128, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !54, line: 30, baseType: !98, size: 128, align: 64, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !54, line: 30, baseType: !98, size: 128, align: 64, offset: 256)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "Domain", file: !54, line: 30, baseType: !98, size: 128, align: 64, offset: 384)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "Expires", file: !54, line: 30, baseType: !167, size: 192, align: 64, offset: 512)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "RawExpires", file: !54, line: 30, baseType: !98, size: 128, align: 64, offset: 704)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "MaxAge", file: !54, line: 30, baseType: !102, size: 64, align: 64, offset: 832)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "Secure", file: !54, line: 30, baseType: !28, size: 8, align: 8, offset: 896)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "HttpOnly", file: !54, line: 30, baseType: !28, size: 8, align: 8, offset: 904)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !54, line: 30, baseType: !98, size: 128, align: 64, offset: 960)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "Unparsed", file: !54, line: 30, baseType: !355, size: 192, align: 64, offset: 1088)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "SetCookies", file: !58, line: 30, baseType: !1027, size: 64, align: 64, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!13, !20, !431, !1008}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "Timeout", file: !54, line: 30, baseType: !823, size: 64, align: 64, offset: 320)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "LogLevel", file: !54, line: 30, baseType: !1032, size: 64, align: 64, offset: 384)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DIBasicType(name: "LogLevelType", size: 64, encoding: DW_ATE_unsigned)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "Logger", file: !54, line: 30, baseType: !1035, size: 128, align: 64, offset: 448)
!1035 = !DICompositeType(tag: DW_TAG_structure_type, name: "Logger", file: !54, line: 30, size: 128, align: 8, elements: !1036)
!1036 = !{!1037, !150}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !54, line: 30, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*Token,int,int})void}", file: !58, size: 128, align: 8, elements: !1040)
!1040 = !{!814, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "Log", file: !58, line: 30, baseType: !1042, size: 64, align: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!13, !20, !1045}
!1045 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Token,int,int}", file: !58, size: 192, align: 8, elements: !1046)
!1046 = !{!1047, !119, !120}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !58, line: 1, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "MaxRetries", file: !54, line: 30, baseType: !377, size: 64, align: 64, offset: 576)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "Retryer", file: !54, line: 30, baseType: !1051, size: 128, align: 64, offset: 640)
!1051 = !DICompositeType(tag: DW_TAG_structure_type, name: "RequestRetryer", file: !54, line: 30, size: 128, align: 8, elements: !317)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "DisableParamValidation", file: !54, line: 30, baseType: !661, size: 64, align: 64, offset: 768)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "DisableComputeChecksums", file: !54, line: 30, baseType: !661, size: 64, align: 64, offset: 832)
