; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22tls\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/tls\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/tls\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22x509\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/x509\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/x509\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./main.go", directory: "/home/wangcong/go_path/src/github.com/AdRoll/hologram/cmd/hologram-ping")
!3 = !{}
!4 = !{!5, !17, !20}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "main.host", linkageName: "main.host", scope: !1, file: !7, line: 27, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "main.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !10, line: 1, size: 128, align: 8, elements: !11)
!10 = !DIFile(filename: "<built-in>", directory: "")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !10, line: 1, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !10, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !10, line: 1, type: !19, isLocal: false, isDefinition: true)
!19 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "main.port", linkageName: "main.port", scope: !1, file: !7, line: 28, type: !22, isLocal: true, isDefinition: true)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!23 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !7, line: 16, type: !24, isLocal: false, isDefinition: true, scopeLine: 16, isOptimized: false, unit: !1, retainedNodes: !3)
!24 = !DISubroutineType(types: !25)
!25 = !{!26}
!26 = !DIBasicType(name: "void")
!27 = !DILocation(line: 1, column: 1, scope: !28)
!28 = !DILexicalBlockFile(scope: !23, file: !10, discriminator: 0)
!29 = !DILocation(line: 27, column: 17, scope: !30)
!30 = !DILexicalBlockFile(scope: !23, file: !7, discriminator: 0)
!31 = !DILocation(line: 27, column: 5, scope: !30)
!32 = !DILocation(line: 28, column: 17, scope: !30)
!33 = !DILocation(line: 28, column: 5, scope: !30)
!34 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !7, line: 30, type: !24, isLocal: false, isDefinition: true, scopeLine: 30, isOptimized: false, unit: !1, retainedNodes: !3)
!35 = !DILocation(line: 31, column: 7, scope: !36)
!36 = distinct !DILexicalBlock(scope: !34, file: !7, line: 30, column: 1)
!37 = !DILocation(line: 32, column: 38, scope: !36)
!38 = !DILocation(line: 32, column: 37, scope: !36)
!39 = !DILocation(line: 32, column: 45, scope: !36)
!40 = !DILocation(line: 32, column: 44, scope: !36)
!41 = !DILocation(line: 32, column: 20, scope: !36)
!42 = !DILocalVariable(name: "connString", scope: !36, file: !7, line: 32, type: !9)
!43 = !DILocation(line: 32, column: 2, scope: !34)
!44 = !DILocation(line: 34, column: 15, scope: !36)
!45 = !DILocalVariable(name: "pool", scope: !36, file: !7, line: 34, type: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertPool", file: !7, line: 19, size: 320, align: 8, elements: !48)
!48 = !{!49, !65, !66}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "bySubjectKeyId", file: !7, line: 19, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !10, line: 1, size: 384, align: 8, elements: !52)
!52 = !{!53, !54, !55, !56, !58, !59, !61, !62, !64}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !10, line: 1, baseType: !16, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 72)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !10, line: 1, baseType: !57, size: 16, align: 16, offset: 80)
!57 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !10, line: 1, baseType: !19, size: 32, align: 32, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !10, line: 1, baseType: !60, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !10, line: 1, baseType: !60, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !10, line: 1, baseType: !63, size: 64, align: 64, offset: 256)
!63 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !10, line: 1, baseType: !60, size: 64, align: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "byName", file: !7, line: 19, baseType: !50, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "certs", file: !7, line: 19, baseType: !67, size: 192, align: 64, offset: 128)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !68, size: 192, align: 8, elements: !69)
!68 = !DIFile(filename: "", directory: "")
!69 = !{!70, !79, !80}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !7, line: 19, size: 10624, align: 8, elements: !74)
!74 = !{!75, !81, !82, !83, !84, !85, !86, !88, !90, !140, !141, !154, !182, !183, !218, !219, !221, !231, !232, !237, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !262, !285, !286, !287, !288, !299, !300, !301, !302, !303, !304, !305}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !7, line: 19, baseType: !76, size: 192, align: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !68, size: 192, align: 8, elements: !77)
!77 = !{!78, !79, !80}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !13, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !68, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !68, line: 1, baseType: !16, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !7, line: 19, baseType: !76, size: 192, align: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !7, line: 19, baseType: !76, size: 192, align: 64, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !7, line: 19, baseType: !76, size: 192, align: 64, offset: 576)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !7, line: 19, baseType: !76, size: 192, align: 64, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !7, line: 19, baseType: !76, size: 192, align: 64, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !7, line: 19, baseType: !87, size: 64, align: 64, offset: 1152)
!87 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !7, line: 19, baseType: !89, size: 64, align: 64, offset: 1216)
!89 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !7, line: 19, baseType: !91, size: 128, align: 64, offset: 1280)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecrypterOpts", file: !7, line: 20, size: 128, align: 8, elements: !92)
!92 = !{!93, !139}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !7, line: 1, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !10, line: 1, size: 576, align: 8, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !111, !120, !121, !122, !138}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !10, line: 1, baseType: !63, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !10, line: 1, baseType: !63, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !10, line: 1, baseType: !19, size: 32, align: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 160)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 168)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 176)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !10, line: 1, baseType: !104, size: 64, align: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 1, size: 64, align: 8, elements: !106)
!106 = !{!107}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 1, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!63, !60, !63}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !10, line: 1, baseType: !112, size: 64, align: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 1, size: 64, align: 8, elements: !114)
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 1, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !60, !60}
!119 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !10, line: 1, baseType: !13, size: 64, align: 64, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !10, line: 1, baseType: !8, size: 64, align: 64, offset: 384)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !10, line: 1, baseType: !123, size: 64, align: 64, offset: 448)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !10, line: 1, size: 320, align: 8, elements: !125)
!125 = !{!126, !127, !128}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !10, line: 1, baseType: !8, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !10, line: 1, baseType: !8, size: 64, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !10, line: 1, baseType: !129, size: 192, align: 64, offset: 128)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !68, size: 192, align: 8, elements: !130)
!130 = !{!131, !79, !80}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !10, line: 1, size: 320, align: 8, elements: !134)
!134 = !{!126, !127, !135, !136, !137}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !10, line: 1, baseType: !60, size: 64, align: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !10, line: 1, baseType: !60, size: 64, align: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !10, line: 1, baseType: !60, size: 64, align: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !10, line: 1, baseType: !60, size: 64, align: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !60, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !7, line: 19, baseType: !16, size: 64, align: 64, offset: 1408)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !7, line: 19, baseType: !142, size: 64, align: 64, offset: 1472)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !7, line: 19, size: 256, align: 8, elements: !144)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !7, line: 19, baseType: !119, size: 8, align: 8)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !7, line: 19, baseType: !147, size: 192, align: 64, offset: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !7, line: 19, size: 192, align: 8, elements: !148)
!148 = !{!149, !152, !153}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !7, line: 1, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !7, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !7, line: 1, baseType: !16, size: 64, align: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !7, line: 19, baseType: !155, size: 1984, align: 64, offset: 1536)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !7, line: 19, size: 1984, align: 8, elements: !156)
!156 = !{!157, !161, !162, !163, !164, !165, !166, !167, !168, !169, !181}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !7, line: 19, baseType: !158, size: 192, align: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !68, size: 192, align: 8, elements: !159)
!159 = !{!160, !79, !80}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !8, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !7, line: 19, baseType: !158, size: 192, align: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !7, line: 19, baseType: !158, size: 192, align: 64, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !7, line: 19, baseType: !158, size: 192, align: 64, offset: 576)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !7, line: 19, baseType: !158, size: 192, align: 64, offset: 768)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !7, line: 19, baseType: !158, size: 192, align: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !7, line: 19, baseType: !158, size: 192, align: 64, offset: 1152)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !7, line: 19, baseType: !9, size: 128, align: 64, offset: 1344)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !7, line: 19, baseType: !9, size: 128, align: 64, offset: 1472)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !7, line: 19, baseType: !170, size: 192, align: 64, offset: 1600)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !68, size: 192, align: 8, elements: !171)
!171 = !{!172, !79, !80}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !7, line: 19, size: 320, align: 8, elements: !175)
!175 = !{!176, !180}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !7, line: 19, baseType: !177, size: 192, align: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !7, line: 19, size: 192, align: 8, elements: !178)
!178 = !{!179, !152, !153}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !7, line: 1, baseType: !22, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 19, baseType: !91, size: 128, align: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !7, line: 19, baseType: !170, size: 192, align: 64, offset: 1792)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !7, line: 19, baseType: !155, size: 1984, align: 64, offset: 3520)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !7, line: 19, baseType: !184, size: 192, align: 64, offset: 5504)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 19, size: 192, align: 8, elements: !185)
!185 = !{!186, !188, !190}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 19, baseType: !187, size: 64, align: 64)
!187 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 19, baseType: !189, size: 64, align: 64, offset: 64)
!189 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 19, baseType: !191, size: 64, align: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 19, size: 704, align: 8, elements: !193)
!193 = !{!194, !195, !204, !215, !216, !217}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 19, baseType: !9, size: 128, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 19, baseType: !196, size: 192, align: 64, offset: 128)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !68, size: 192, align: 8, elements: !197)
!197 = !{!198, !79, !80}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 19, size: 256, align: 8, elements: !201)
!201 = !{!194, !202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 19, baseType: !16, size: 64, align: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 19, baseType: !205, size: 192, align: 64, offset: 320)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !68, size: 192, align: 8, elements: !206)
!206 = !{!207, !79, !80}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 19, size: 128, align: 8, elements: !210)
!210 = !{!211, !212, !213, !214}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 19, baseType: !189, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 19, baseType: !14, size: 8, align: 8, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 72)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 80)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 19, baseType: !189, size: 64, align: 64, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 19, baseType: !189, size: 64, align: 64, offset: 576)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 19, baseType: !199, size: 64, align: 64, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !7, line: 19, baseType: !184, size: 192, align: 64, offset: 5696)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !7, line: 19, baseType: !220, size: 64, align: 64, offset: 5888)
!220 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !7, line: 19, baseType: !222, size: 192, align: 64, offset: 5952)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !68, size: 192, align: 8, elements: !223)
!223 = !{!224, !79, !80}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !7, line: 19, size: 448, align: 8, elements: !227)
!227 = !{!228, !229, !230}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !7, line: 19, baseType: !177, size: 192, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 19, baseType: !76, size: 192, align: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !7, line: 19, baseType: !222, size: 192, align: 64, offset: 6144)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !7, line: 19, baseType: !233, size: 192, align: 64, offset: 6336)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !68, size: 192, align: 8, elements: !234)
!234 = !{!235, !79, !80}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !7, line: 19, baseType: !238, size: 192, align: 64, offset: 6528)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !68, size: 192, align: 8, elements: !239)
!239 = !{!240, !79, !80}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !7, line: 19, baseType: !233, size: 192, align: 64, offset: 6720)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 6912)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 6920)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !7, line: 19, baseType: !16, size: 64, align: 64, offset: 6976)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 7040)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !7, line: 19, baseType: !76, size: 192, align: 64, offset: 7104)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !7, line: 19, baseType: !76, size: 192, align: 64, offset: 7296)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !7, line: 19, baseType: !158, size: 192, align: 64, offset: 7488)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !7, line: 19, baseType: !158, size: 192, align: 64, offset: 7680)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !7, line: 19, baseType: !158, size: 192, align: 64, offset: 7872)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !7, line: 19, baseType: !158, size: 192, align: 64, offset: 8064)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !7, line: 19, baseType: !255, size: 192, align: 64, offset: 8256)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !68, size: 192, align: 8, elements: !256)
!256 = !{!257, !79, !80}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !7, line: 19, size: 192, align: 8, elements: !260)
!260 = !{!261, !152, !153}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !7, line: 1, baseType: !13, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !7, line: 19, baseType: !263, size: 192, align: 64, offset: 8448)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !68, size: 192, align: 8, elements: !264)
!264 = !{!265, !79, !80}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !7, line: 19, size: 1024, align: 8, elements: !269)
!269 = !{!270, !271, !272, !279, !280, !281, !282, !283, !284}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !7, line: 19, baseType: !9, size: 128, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !7, line: 19, baseType: !9, size: 128, align: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !7, line: 19, baseType: !273, size: 64, align: 64, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !7, line: 19, size: 320, align: 8, elements: !275)
!275 = !{!276, !277, !278}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !7, line: 19, baseType: !9, size: 128, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !7, line: 19, baseType: !9, size: 128, align: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !7, line: 19, baseType: !9, size: 128, align: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !7, line: 19, baseType: !9, size: 128, align: 64, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !7, line: 19, baseType: !9, size: 128, align: 64, offset: 576)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !7, line: 19, baseType: !9, size: 128, align: 64, offset: 768)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !7, line: 19, baseType: !9, size: 128, align: 64, offset: 896)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 8640)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !7, line: 19, baseType: !158, size: 192, align: 64, offset: 8704)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !7, line: 19, baseType: !158, size: 192, align: 64, offset: 8896)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !7, line: 19, baseType: !289, size: 192, align: 64, offset: 9088)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !68, size: 192, align: 8, elements: !290)
!290 = !{!291, !79, !80}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !7, line: 19, size: 384, align: 8, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !7, line: 19, baseType: !259, size: 192, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !7, line: 19, baseType: !298, size: 192, align: 64, offset: 192)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !7, line: 19, size: 192, align: 8, elements: !260)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !7, line: 19, baseType: !289, size: 192, align: 64, offset: 9280)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !7, line: 19, baseType: !158, size: 192, align: 64, offset: 9472)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !7, line: 19, baseType: !158, size: 192, align: 64, offset: 9664)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !7, line: 19, baseType: !158, size: 192, align: 64, offset: 9856)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !7, line: 19, baseType: !158, size: 192, align: 64, offset: 10048)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !7, line: 19, baseType: !158, size: 192, align: 64, offset: 10240)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !7, line: 19, baseType: !233, size: 192, align: 64, offset: 10432)
!306 = !DILocation(line: 34, column: 2, scope: !34)
!307 = !DILocation(line: 36, column: 13, scope: !36)
!308 = !DILocation(line: 36, column: 18, scope: !36)
!309 = !DILocalVariable(name: "tlsConf", scope: !36, file: !7, line: 36, type: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !7, line: 19, size: 2944, align: 8, elements: !312)
!312 = !{!313, !341, !349, !366, !367, !435, !448, !459, !471, !472, !473, !474, !476, !477, !478, !479, !480, !481, !485, !513, !514, !515, !516, !517, !519, !527, !537, !545}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Rand", file: !7, line: 19, baseType: !314, size: 128, align: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !7, line: 19, size: 128, align: 8, elements: !315)
!315 = !{!316, !139}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 19, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !68, size: 128, align: 8, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !68, line: 19, baseType: !94, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !68, line: 19, baseType: !322, size: 64, align: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!325, !60, !76}
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !68, size: 192, align: 8, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !68, line: 19, baseType: !16, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !68, line: 19, baseType: !329, size: 128, align: 64, offset: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !10, line: 1, size: 128, align: 8, elements: !330)
!330 = !{!331, !340}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 1, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !68, size: 128, align: 8, elements: !334)
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !68, line: 1, baseType: !94, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !68, line: 1, baseType: !337, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!9, !60}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !60, size: 64, align: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Time", file: !7, line: 19, baseType: !342, size: 64, align: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 19, size: 64, align: 8, elements: !344)
!344 = !{!345}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 19, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!184}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Certificates", file: !7, line: 19, baseType: !350, size: 192, align: 64, offset: 192)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,int,int}", file: !68, size: 192, align: 8, elements: !351)
!351 = !{!352, !79, !80}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !7, line: 19, size: 768, align: 8, elements: !355)
!355 = !{!356, !361, !363, !364, !365}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Certificate", file: !7, line: 19, baseType: !357, size: 192, align: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !68, size: 192, align: 8, elements: !358)
!358 = !{!359, !79, !80}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "PrivateKey", file: !7, line: 19, baseType: !362, size: 128, align: 64, offset: 192)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !7, line: 19, size: 128, align: 8, elements: !92)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPStaple", file: !7, line: 19, baseType: !76, size: 192, align: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !7, line: 19, baseType: !357, size: 192, align: 64, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Leaf", file: !7, line: 19, baseType: !72, size: 64, align: 64, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "NameToCertificate", file: !7, line: 19, baseType: !50, size: 64, align: 64, offset: 384)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "GetCertificate", file: !7, line: 19, baseType: !368, size: 64, align: 64, offset: 448)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 19, size: 64, align: 8, elements: !370)
!370 = !{!371}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 19, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!375, !379}
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,error}", file: !68, size: 192, align: 8, elements: !376)
!376 = !{!377, !378}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !68, line: 19, baseType: !353, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !68, line: 19, baseType: !329, size: 128, align: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientHelloInfo", file: !7, line: 19, size: 1408, align: 8, elements: !381)
!381 = !{!382, !387, !388, !394, !395, !401, !402, !403}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuites", file: !7, line: 19, baseType: !383, size: 192, align: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint16,int,int}", file: !68, size: 192, align: 8, elements: !384)
!384 = !{!385, !79, !80}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !7, line: 19, baseType: !9, size: 128, align: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedCurves", file: !7, line: 19, baseType: !389, size: 192, align: 64, offset: 320)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*CurveID,int,int}", file: !68, size: 192, align: 8, elements: !390)
!390 = !{!391, !79, !80}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIBasicType(name: "CurveID", size: 16, encoding: DW_ATE_unsigned)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedPoints", file: !7, line: 19, baseType: !76, size: 192, align: 64, offset: 512)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureSchemes", file: !7, line: 19, baseType: !396, size: 192, align: 64, offset: 704)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*SignatureScheme,int,int}", file: !68, size: 192, align: 8, elements: !397)
!397 = !{!398, !79, !80}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIBasicType(name: "SignatureScheme", size: 16, encoding: DW_ATE_unsigned)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedProtos", file: !7, line: 19, baseType: !158, size: 192, align: 64, offset: 896)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedVersions", file: !7, line: 19, baseType: !383, size: 192, align: 64, offset: 1088)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Conn", file: !7, line: 19, baseType: !404, size: 128, align: 64, offset: 1280)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !7, line: 19, size: 128, align: 8, elements: !405)
!405 = !{!406, !139}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 19, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)Addr,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void)Addr,*func(*void,Time)error,*func(*void,Time)error,*func(*void,Time)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !68, size: 576, align: 8, elements: !409)
!409 = !{!320, !410, !414, !426, !427, !428, !432, !433, !434}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !68, line: 19, baseType: !411, size: 64, align: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!329, !60}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "LocalAddr", file: !68, line: 19, baseType: !415, size: 64, align: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!418, !60}
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "Addr", file: !7, line: 19, size: 128, align: 8, elements: !419)
!419 = !{!420, !139}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 19, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)string}", file: !68, size: 192, align: 8, elements: !423)
!423 = !{!320, !424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Network", file: !68, line: 19, baseType: !337, size: 64, align: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !68, line: 19, baseType: !337, size: 64, align: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !68, line: 19, baseType: !322, size: 64, align: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !68, line: 19, baseType: !415, size: 64, align: 64, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "SetDeadline", file: !68, line: 19, baseType: !429, size: 64, align: 64, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!329, !60, !184}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "SetReadDeadline", file: !68, line: 19, baseType: !429, size: 64, align: 64, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "SetWriteDeadline", file: !68, line: 19, baseType: !429, size: 64, align: 64, offset: 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !68, line: 19, baseType: !322, size: 64, align: 64, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "GetClientCertificate", file: !7, line: 19, baseType: !436, size: 64, align: 64, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 19, size: 64, align: 8, elements: !438)
!438 = !{!439}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 19, baseType: !440, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!375, !443}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertificateRequestInfo", file: !7, line: 19, size: 384, align: 8, elements: !445)
!445 = !{!446, !447}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptableCAs", file: !7, line: 19, baseType: !357, size: 192, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureSchemes", file: !7, line: 19, baseType: !396, size: 192, align: 64, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "GetConfigForClient", file: !7, line: 19, baseType: !449, size: 64, align: 64, offset: 576)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 19, size: 64, align: 8, elements: !451)
!451 = !{!452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 19, baseType: !453, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!456, !379}
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Config,error}", file: !68, size: 192, align: 8, elements: !457)
!457 = !{!458, !378}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !68, line: 19, baseType: !60, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "VerifyPeerCertificate", file: !7, line: 19, baseType: !460, size: 64, align: 64, offset: 640)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 19, size: 64, align: 8, elements: !462)
!462 = !{!463}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 19, baseType: !464, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!329, !357, !467}
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !68, size: 192, align: 8, elements: !468)
!468 = !{!469, !79, !80}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "RootCAs", file: !7, line: 19, baseType: !46, size: 64, align: 64, offset: 704)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "NextProtos", file: !7, line: 19, baseType: !158, size: 192, align: 64, offset: 768)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !7, line: 19, baseType: !9, size: 128, align: 64, offset: 960)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAuth", file: !7, line: 19, baseType: !475, size: 64, align: 64, offset: 1088)
!475 = !DIBasicType(name: "ClientAuthType", size: 64, encoding: DW_ATE_signed)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ClientCAs", file: !7, line: 19, baseType: !46, size: 64, align: 64, offset: 1152)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "InsecureSkipVerify", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 1216)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuites", file: !7, line: 19, baseType: !383, size: 192, align: 64, offset: 1280)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "PreferServerCipherSuites", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 1472)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "SessionTicketsDisabled", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 1480)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "SessionTicketKey", file: !7, line: 19, baseType: !482, size: 256, align: 8, offset: 1488)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, align: 1, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ClientSessionCache", file: !7, line: 19, baseType: !486, size: 128, align: 64, offset: 1792)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientSessionCache", file: !7, line: 19, size: 128, align: 8, elements: !487)
!487 = !{!488, !139}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 19, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)struct{*ClientSessionState,bool},*func(*void,string,*ClientSessionState)void}", file: !68, size: 192, align: 8, elements: !491)
!491 = !{!320, !492, !509}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !68, line: 19, baseType: !493, size: 64, align: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!496, !60, !9}
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ClientSessionState,bool}", file: !68, size: 128, align: 8, elements: !497)
!497 = !{!498, !508}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "session", file: !68, line: 19, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientSessionState", file: !7, line: 19, size: 832, align: 8, elements: !501)
!501 = !{!502, !503, !504, !505, !506, !507}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "sessionTicket", file: !7, line: 19, baseType: !76, size: 192, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "vers", file: !7, line: 19, baseType: !57, size: 16, align: 16, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "cipherSuite", file: !7, line: 19, baseType: !57, size: 16, align: 16, offset: 208)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "masterSecret", file: !7, line: 19, baseType: !76, size: 192, align: 64, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "serverCertificates", file: !7, line: 19, baseType: !67, size: 192, align: 64, offset: 448)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "verifiedChains", file: !7, line: 19, baseType: !467, size: 192, align: 64, offset: 640)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !68, line: 19, baseType: !119, size: 8, align: 8, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Put", file: !68, line: 19, baseType: !510, size: 64, align: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!26, !60, !9, !499}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "MinVersion", file: !7, line: 19, baseType: !57, size: 16, align: 16, offset: 1920)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "MaxVersion", file: !7, line: 19, baseType: !57, size: 16, align: 16, offset: 1936)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "CurvePreferences", file: !7, line: 19, baseType: !389, size: 192, align: 64, offset: 1984)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "DynamicRecordSizingDisabled", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 2176)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "Renegotiation", file: !7, line: 19, baseType: !518, size: 64, align: 64, offset: 2240)
!518 = !DIBasicType(name: "RenegotiationSupport", size: 64, encoding: DW_ATE_signed)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "KeyLogWriter", file: !7, line: 19, baseType: !520, size: 128, align: 64, offset: 2304)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !7, line: 19, size: 128, align: 8, elements: !521)
!521 = !{!522, !139}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 19, baseType: !523, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !68, size: 128, align: 8, elements: !525)
!525 = !{!320, !526}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !68, line: 19, baseType: !322, size: 64, align: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "serverInitOnce", file: !7, line: 19, baseType: !528, size: 96, align: 32, offset: 2432)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once", file: !7, line: 19, size: 96, align: 8, elements: !529)
!529 = !{!530, !536}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !7, line: 19, baseType: !531, size: 64, align: 32)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 19, size: 64, align: 8, elements: !532)
!532 = !{!533, !535}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 19, baseType: !534, size: 32, align: 32)
!534 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 19, baseType: !19, size: 32, align: 32, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "done", file: !7, line: 19, baseType: !19, size: 32, align: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !7, line: 19, baseType: !538, size: 192, align: 32, offset: 2528)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !7, line: 19, size: 192, align: 8, elements: !539)
!539 = !{!540, !541, !542, !543, !544}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !7, line: 19, baseType: !531, size: 64, align: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !7, line: 19, baseType: !19, size: 32, align: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !7, line: 19, baseType: !19, size: 32, align: 32, offset: 96)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !7, line: 19, baseType: !534, size: 32, align: 32, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !7, line: 19, baseType: !534, size: 32, align: 32, offset: 160)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "sessionTicketKeys", file: !7, line: 19, baseType: !546, size: 192, align: 64, offset: 2752)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.crypto/tls.ticketKey,int,int}", file: !68, size: 192, align: 8, elements: !547)
!547 = !{!548, !79, !80}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !68, line: 1, baseType: !549, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: ".crypto/tls.ticketKey", file: !7, line: 19, size: 384, align: 8, elements: !551)
!551 = !{!552, !556, !557}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "keyName", file: !7, line: 19, baseType: !553, size: 128, align: 8)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 128, align: 1, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 16)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "aesKey", file: !7, line: 19, baseType: !553, size: 128, align: 8, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "hmacKey", file: !7, line: 19, baseType: !553, size: 128, align: 8, offset: 256)
!558 = !DILocation(line: 36, column: 2, scope: !34)
!559 = !DILocation(line: 43, column: 19, scope: !36)
!560 = !DILocalVariable(name: "err", scope: !36, file: !7, line: 43, type: !329)
!561 = !DILocation(line: 43, column: 2, scope: !34)
!562 = !DILocation(line: 44, column: 9, scope: !36)
!563 = !DILocalVariable(name: "conn", scope: !36, file: !7, line: 43, type: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !7, line: 19, size: 6720, align: 8, elements: !566)
!566 = !{!567, !568, !569, !570, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !619, !620, !621, !622, !663, !664, !665, !666, !676, !677, !678, !679, !680, !681, !682}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "conn", file: !7, line: 19, baseType: !404, size: 128, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "isClient", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "handshakeMutex", file: !7, line: 19, baseType: !531, size: 64, align: 32, offset: 160)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "handshakeCond", file: !7, line: 19, baseType: !571, size: 64, align: 64, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cond", file: !7, line: 19, size: 448, align: 8, elements: !573)
!573 = !{!574, !576, !588, !596}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "noCopy", file: !7, line: 19, baseType: !575, align: 8)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: ".sync.noCopy", file: !7, line: 19, align: 8, elements: !3)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "L", file: !7, line: 19, baseType: !577, size: 128, align: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "Locker", file: !7, line: 19, size: 128, align: 8, elements: !578)
!578 = !{!579, !139}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 19, baseType: !580, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void}", file: !68, size: 192, align: 8, elements: !582)
!582 = !{!320, !583, !587}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", file: !68, line: 19, baseType: !584, size: 64, align: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!26, !60}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "Unlock", file: !68, line: 19, baseType: !584, size: 64, align: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "notify", file: !7, line: 19, baseType: !589, size: 256, align: 64, offset: 128)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: ".sync.notifyList", file: !7, line: 19, size: 256, align: 8, elements: !590)
!590 = !{!591, !592, !593, !594, !595}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "wait", file: !7, line: 19, baseType: !19, size: 32, align: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "notify", file: !7, line: 19, baseType: !19, size: 32, align: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !7, line: 19, baseType: !63, size: 64, align: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !7, line: 19, baseType: !60, size: 64, align: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !7, line: 19, baseType: !60, size: 64, align: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "checker", file: !7, line: 19, baseType: !597, size: 64, align: 64, offset: 384)
!597 = !DIBasicType(name: ".sync.copyChecker", size: 64, encoding: DW_ATE_unsigned)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "handshakeErr", file: !7, line: 19, baseType: !329, size: 128, align: 64, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "vers", file: !7, line: 19, baseType: !57, size: 16, align: 16, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "haveVers", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 464)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "config", file: !7, line: 19, baseType: !310, size: 64, align: 64, offset: 512)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "handshakeComplete", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 576)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "handshakes", file: !7, line: 19, baseType: !16, size: 64, align: 64, offset: 640)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "didResume", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 704)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cipherSuite", file: !7, line: 19, baseType: !57, size: 16, align: 16, offset: 720)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ocspResponse", file: !7, line: 19, baseType: !76, size: 192, align: 64, offset: 768)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "scts", file: !7, line: 19, baseType: !357, size: 192, align: 64, offset: 960)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "peerCertificates", file: !7, line: 19, baseType: !67, size: 192, align: 64, offset: 1152)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "verifiedChains", file: !7, line: 19, baseType: !467, size: 192, align: 64, offset: 1344)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "serverName", file: !7, line: 19, baseType: !9, size: 128, align: 64, offset: 1536)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "secureRenegotiation", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 1664)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "clientFinishedIsFirst", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 1672)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "closeNotifyErr", file: !7, line: 19, baseType: !329, size: 128, align: 64, offset: 1728)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "closeNotifySent", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 1856)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "clientFinished", file: !7, line: 19, baseType: !616, size: 96, align: 8, offset: 1864)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 96, align: 1, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 12)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "serverFinished", file: !7, line: 19, baseType: !616, size: 96, align: 8, offset: 1960)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "clientProtocol", file: !7, line: 19, baseType: !9, size: 128, align: 64, offset: 2112)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "clientProtocolFallback", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 2240)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "in", file: !7, line: 19, baseType: !623, size: 1408, align: 64, offset: 2304)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: ".crypto/tls.halfConn", file: !7, line: 19, size: 1408, align: 8, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !644, !648, !655, !659, !660, !661, !662}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Mutex", file: !7, line: 19, baseType: !531, size: 64, align: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !7, line: 19, baseType: !329, size: 128, align: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "version", file: !7, line: 19, baseType: !57, size: 16, align: 16, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", file: !7, line: 19, baseType: !91, size: 128, align: 64, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "mac", file: !7, line: 19, baseType: !630, size: 128, align: 64, offset: 384)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: ".crypto/tls.macFunction", file: !7, line: 19, size: 128, align: 8, elements: !631)
!631 = !{!632, !139}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 19, baseType: !633, size: 64, align: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int},struct{*uint8,int,int},struct{*uint8,int,int},struct{*uint8,int,int},struct{*uint8,int,int})struct{*uint8,int,int},*func(*void)int}", file: !68, size: 192, align: 8, elements: !635)
!635 = !{!320, !636, !640}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "MAC", file: !68, line: 19, baseType: !637, size: 64, align: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!76, !60, !76, !76, !76, !76, !76}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !68, line: 19, baseType: !641, size: 64, align: 64, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!16, !60}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !7, line: 19, baseType: !645, size: 64, align: 8, offset: 512)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 64, align: 1, elements: !646)
!646 = !{!647}
!647 = !DISubrange(count: 8)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "bfree", file: !7, line: 19, baseType: !649, size: 64, align: 64, offset: 576)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: ".crypto/tls.block", file: !7, line: 19, size: 320, align: 8, elements: !651)
!651 = !{!652, !653, !654}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "data", file: !7, line: 19, baseType: !76, size: 192, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "off", file: !7, line: 19, baseType: !16, size: 64, align: 64, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !7, line: 19, baseType: !60, size: 64, align: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "additionalData", file: !7, line: 19, baseType: !656, size: 104, align: 8, offset: 640)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 104, align: 1, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 13)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "nextCipher", file: !7, line: 19, baseType: !91, size: 128, align: 64, offset: 768)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "nextMac", file: !7, line: 19, baseType: !630, size: 128, align: 64, offset: 896)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "inDigestBuf", file: !7, line: 19, baseType: !76, size: 192, align: 64, offset: 1024)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "outDigestBuf", file: !7, line: 19, baseType: !76, size: 192, align: 64, offset: 1216)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "out", file: !7, line: 19, baseType: !623, size: 1408, align: 64, offset: 3712)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rawInput", file: !7, line: 19, baseType: !649, size: 64, align: 64, offset: 5120)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "input", file: !7, line: 19, baseType: !649, size: 64, align: 64, offset: 5184)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "hand", file: !7, line: 19, baseType: !667, size: 832, align: 64, offset: 5248)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", file: !7, line: 19, size: 832, align: 8, elements: !668)
!668 = !{!669, !653, !670, !674}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 19, baseType: !76, size: 192, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "bootstrap", file: !7, line: 19, baseType: !671, size: 512, align: 8, offset: 256)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, align: 1, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "lastRead", file: !7, line: 19, baseType: !675, size: 8, align: 8, offset: 768)
!675 = !DIBasicType(name: ".bytes.readOp", size: 8, encoding: DW_ATE_signed)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "buffering", file: !7, line: 19, baseType: !119, size: 8, align: 8, offset: 6080)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "sendBuf", file: !7, line: 19, baseType: !76, size: 192, align: 64, offset: 6144)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "bytesSent", file: !7, line: 19, baseType: !189, size: 64, align: 64, offset: 6336)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "packetsSent", file: !7, line: 19, baseType: !189, size: 64, align: 64, offset: 6400)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "warnCount", file: !7, line: 19, baseType: !16, size: 64, align: 64, offset: 6464)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "activeCall", file: !7, line: 19, baseType: !534, size: 32, align: 32, offset: 6528)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", file: !7, line: 19, baseType: !553, size: 128, align: 8, offset: 6560)
!683 = !DILocation(line: 48, column: 6, scope: !36)
!684 = !DILocation(line: 49, column: 53, scope: !36)
!685 = !DILocation(line: 49, column: 29, scope: !36)
!686 = !DILocation(line: 49, column: 39, scope: !36)
!687 = !DILocation(line: 49, column: 17, scope: !36)
!688 = !DILocation(line: 50, column: 28, scope: !36)
!689 = !DILocation(line: 52, column: 9, scope: !36)
!690 = !DILocation(line: 45, column: 9, scope: !36)
!691 = !DILocation(line: 45, column: 3, scope: !36)
!692 = !DILocalVariable(name: "response", scope: !36, file: !7, line: 50, type: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !7, line: 24, size: 768, align: 8, elements: !695)
!695 = !{!696, !697, !700, !708, !745, !769, !778, !790, !791, !792}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !7, line: 24, baseType: !8, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Source", file: !7, line: 24, baseType: !698, size: 64, align: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIBasicType(name: "Message_Source", size: 32, encoding: DW_ATE_signed)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Ping", file: !7, line: 24, baseType: !701, size: 64, align: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ping", file: !7, line: 24, size: 256, align: 8, elements: !703)
!703 = !{!704, !707}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !7, line: 24, baseType: !705, size: 64, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIBasicType(name: "Ping_RequestResponse", size: 32, encoding: DW_ATE_signed)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 24, baseType: !76, size: 192, align: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ServerRequest", file: !7, line: 24, baseType: !709, size: 64, align: 64, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServerRequest", file: !7, line: 24, size: 512, align: 8, elements: !711)
!711 = !{!712, !719, !726, !731, !736, !744}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "AssumeRole", file: !7, line: 24, baseType: !713, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "AssumeRole", file: !7, line: 24, size: 320, align: 8, elements: !715)
!715 = !{!716, !717, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !7, line: 24, baseType: !8, size: 64, align: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Role", file: !7, line: 24, baseType: !8, size: 64, align: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 24, baseType: !76, size: 192, align: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ChallengeResponse", file: !7, line: 24, baseType: !720, size: 64, align: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHChallengeResponse", file: !7, line: 24, size: 448, align: 8, elements: !722)
!722 = !{!723, !724, !725}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !7, line: 24, baseType: !76, size: 192, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Format", file: !7, line: 24, baseType: !8, size: 64, align: 64, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 24, baseType: !76, size: 192, align: 64, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "TokenResponse", file: !7, line: 24, baseType: !727, size: 64, align: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "MFATokenResponse", file: !7, line: 24, size: 256, align: 8, elements: !729)
!729 = !{!730, !707}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "TokenValue", file: !7, line: 24, baseType: !8, size: 64, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserCredentials", file: !7, line: 24, baseType: !732, size: 64, align: 64, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "GetUserCredentials", file: !7, line: 24, size: 192, align: 8, elements: !734)
!734 = !{!735}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 24, baseType: !76, size: 192, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "AddSSHkey", file: !7, line: 24, baseType: !737, size: 64, align: 64, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "AddSSHKey", file: !7, line: 24, size: 384, align: 8, elements: !739)
!739 = !{!740, !741, !742, !743}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Username", file: !7, line: 24, baseType: !8, size: 64, align: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Passwordhash", file: !7, line: 24, baseType: !8, size: 64, align: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Sshkeybytes", file: !7, line: 24, baseType: !8, size: 64, align: 64, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 24, baseType: !76, size: 192, align: 64, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 24, baseType: !76, size: 192, align: 64, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ServerResponse", file: !7, line: 24, baseType: !746, size: 64, align: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServerResponse", file: !7, line: 24, size: 448, align: 8, elements: !748)
!748 = !{!749, !754, !757, !766, !725}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Challenge", file: !7, line: 24, baseType: !750, size: 64, align: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHChallenge", file: !7, line: 24, size: 384, align: 8, elements: !752)
!752 = !{!753, !743}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Challenge", file: !7, line: 24, baseType: !76, size: 192, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "VerificationFailure", file: !7, line: 24, baseType: !755, size: 64, align: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHVerificationFailure", file: !7, line: 24, size: 192, align: 8, elements: !734)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Credentials", file: !7, line: 24, baseType: !758, size: 64, align: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "STSCredentials", file: !7, line: 24, size: 448, align: 8, elements: !760)
!760 = !{!761, !762, !763, !764, !725}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "AccessKeyId", file: !7, line: 24, baseType: !8, size: 64, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "SecretAccessKey", file: !7, line: 24, baseType: !8, size: 64, align: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "AccessToken", file: !7, line: 24, baseType: !8, size: 64, align: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Expiration", file: !7, line: 24, baseType: !765, size: 64, align: 64, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "TokenRequest", file: !7, line: 24, baseType: !767, size: 64, align: 64, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "MFATokenRequest", file: !7, line: 24, size: 192, align: 8, elements: !734)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "AgentRequest", file: !7, line: 24, baseType: !770, size: 64, align: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "AgentRequest", file: !7, line: 24, size: 576, align: 8, elements: !772)
!772 = !{!773, !774, !775, !776, !777}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "SshAgentSock", file: !7, line: 24, baseType: !8, size: 64, align: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "AssumeRole", file: !7, line: 24, baseType: !713, size: 64, align: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserCredentials", file: !7, line: 24, baseType: !732, size: 64, align: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "SshKeyFile", file: !7, line: 24, baseType: !76, size: 192, align: 64, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 24, baseType: !76, size: 192, align: 64, offset: 384)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "AgentResponse", file: !7, line: 24, baseType: !779, size: 64, align: 64, offset: 384)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "AgentResponse", file: !7, line: 24, size: 320, align: 8, elements: !781)
!781 = !{!782, !785, !718}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "Success", file: !7, line: 24, baseType: !783, size: 64, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: "Success", file: !7, line: 24, size: 192, align: 8, elements: !734)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "Failure", file: !7, line: 24, baseType: !786, size: 64, align: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "Failure", file: !7, line: 24, size: 256, align: 8, elements: !788)
!788 = !{!789, !707}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorMessage", file: !7, line: 24, baseType: !8, size: 64, align: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "Success", file: !7, line: 24, baseType: !783, size: 64, align: 64, offset: 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Failure", file: !7, line: 24, baseType: !786, size: 64, align: 64, offset: 512)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 24, baseType: !76, size: 192, align: 64, offset: 576)
!793 = !DILocation(line: 50, column: 2, scope: !34)
!794 = !DILocation(line: 56, column: 13, scope: !36)
!795 = !DILocation(line: 56, column: 24, scope: !36)
!796 = !DILocation(line: 53, column: 9, scope: !36)
!797 = !DILocation(line: 53, column: 3, scope: !36)
!798 = !DILocation(line: 57, column: 7, scope: !36)
!799 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", scope: null, file: !10, line: 1, type: !109, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!800 = !DILocalVariable(name: "key", arg: 1, scope: !799, file: !10, line: 1, type: !60)
!801 = !DILocation(line: 1, column: 1, scope: !799)
!802 = !DILocalVariable(name: "seed", arg: 2, scope: !799, file: !10, line: 1, type: !63)
!803 = !DILocalVariable(name: "$ret14", scope: !799, file: !10, line: 1, type: !63)
!804 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", scope: null, file: !10, line: 1, type: !117, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!805 = !DILocalVariable(name: "key1", arg: 1, scope: !804, file: !10, line: 1, type: !60)
!806 = !DILocation(line: 1, column: 1, scope: !804)
!807 = !DILocalVariable(name: "key2", arg: 2, scope: !804, file: !10, line: 1, type: !60)
!808 = !DILocalVariable(name: "$ret15", scope: !804, file: !10, line: 1, type: !119)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "main"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "main"
	.ascii ";\n"
	.ascii "import "
	.ascii "tls"
	.ascii " "
	.ascii "crypto/tls"
	.ascii " \""
	.ascii "crypto/tls"
	.ascii "\";\n"
	.ascii "import "
	.ascii "x509"
	.ascii " "
	.ascii "crypto/x509"
	.ascii " \""
	.ascii "crypto/x509"
	.ascii "\";\n"
	.ascii "import "
	.ascii "flag"
	.ascii " "
	.ascii "flag"
	.ascii " \""
	.ascii "flag"
	.ascii "\";\n"
	.ascii "import "
	.ascii "fmt"
	.ascii " "
	.ascii "fmt"
	.ascii " \""
	.ascii "fmt"
	.ascii "\";\n"
	.ascii "import "
	.ascii "protocol"
	.ascii " "
	.ascii "github.com/AdRoll/hologram/protocol"
	.ascii " \""
	.ascii "github.com/AdRoll/hologram/protocol"
	.ascii "\";\n"
	.ascii "import "
	.ascii "runtime"
	.ascii " "
	.ascii "runtime"
	.ascii " \""
	.ascii "runtime"
	.ascii "\";\n"
	.ascii "init"
	.ascii " "
	.ascii "bufio"
	.ascii " "
	.ascii "bufio..import"
	.ascii " "
	.ascii "bytes"
	.ascii " "
	.ascii "bytes..import"
	.ascii " "
	.ascii "context"
	.ascii " "
	.ascii "context..import"
	.ascii " "
	.ascii "crypto"
	.ascii " "
	.ascii "crypto..import"
	.ascii " "
	.ascii "cipher"
	.ascii " "
	.ascii "crypto_cipher..import"
	.ascii " "
	.ascii "des"
	.ascii " "
	.ascii "crypto_des..import"
	.ascii " "
	.ascii "dsa"
	.ascii " "
	.ascii "crypto_dsa..import"
	.ascii " "
	.ascii "ecdsa"
	.ascii " "
	.ascii "crypto_ecdsa..import"
	.ascii " "
	.ascii "elliptic"
	.ascii " "
	.ascii "crypto_elliptic..import"
	.ascii " "
	.ascii "md5"
	.ascii " "
	.ascii "crypto_md5..import"
	.ascii " "
	.ascii "rand"
	.ascii " "
	.ascii "crypto_rand..import"
	.ascii " "
	.ascii "rsa"
	.ascii " "
	.ascii "crypto_rsa..import"
	.ascii " "
	.ascii "sha1"
	.ascii " "
	.ascii "crypto_sha1..import"
	.ascii " "
	.ascii "sha256"
	.ascii " "
	.ascii "crypto_sha256..import"
	.ascii " "
	.ascii "sha512"
	.ascii " "
	.ascii "crypto_sha512..import"
	.ascii " "
	.ascii "tls"
	.ascii " "
	.ascii "crypto_tls..import"
	.ascii " "
	.ascii "x509"
	.ascii " "
	.ascii "crypto_x509..import"
	.ascii " "
	.ascii "pkix"
	.ascii " "
	.ascii "crypto_x509_pkix..import"
	.ascii " "
	.ascii "asn1"
	.ascii " "
	.ascii "encoding_asn1..import"
	.ascii " "
	.ascii "base64"
	.ascii " "
