; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22ioutil\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22io/ioutil\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22io/ioutil\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22net\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22net\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22net\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3)
!2 = !DIFile(filename: "./main.go", directory: "/home/wangcong/go_path/src/github.com/AdRoll/hologram/cmd/hologram-boot")
!3 = !{}
!4 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !5, line: 16, type: !6, isLocal: false, isDefinition: true, scopeLine: 16, isOptimized: false, unit: !1, retainedNodes: !3)
!5 = !DIFile(filename: "main.go", directory: ".")
!6 = !DISubroutineType(types: !7)
!7 = !{!8}
!8 = !DIBasicType(name: "void")
!9 = !DILocation(line: 1, column: 1, scope: !10)
!10 = !DILexicalBlockFile(scope: !4, file: !11, discriminator: 0)
!11 = !DIFile(filename: "<built-in>", directory: "")
!12 = distinct !DISubprogram(name: "main.main.Config..hash", linkageName: "main.main.Config..hash", scope: null, file: !11, line: 1, type: !13, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !16, !15}
!15 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!17 = !DILocalVariable(name: "key", arg: 1, scope: !12, file: !11, line: 1, type: !16)
!18 = !DILocation(line: 1, column: 1, scope: !12)
!19 = !DILocalVariable(name: "seed", arg: 2, scope: !12, file: !11, line: 1, type: !15)
!20 = !DILocalVariable(name: "$ret0", scope: !12, file: !11, line: 1, type: !15)
!21 = distinct !DISubprogram(name: "main.main.Config..eq", linkageName: "main.main.Config..eq", scope: null, file: !11, line: 1, type: !22, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!22 = !DISubroutineType(types: !23)
!23 = !{!24, !16, !16}
!24 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!25 = !DILocalVariable(name: "key1", arg: 1, scope: !21, file: !11, line: 1, type: !16)
!26 = !DILocation(line: 1, column: 1, scope: !21)
!27 = !DILocalVariable(name: "key2", arg: 2, scope: !21, file: !11, line: 1, type: !16)
!28 = !DILocalVariable(name: "$ret1", scope: !21, file: !11, line: 1, type: !24)
!29 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !5, line: 33, type: !6, isLocal: false, isDefinition: true, scopeLine: 33, isOptimized: false, unit: !1, retainedNodes: !3)
!30 = !DILocation(line: 34, column: 6, scope: !31)
!31 = distinct !DILexicalBlock(scope: !29, file: !5, line: 33, column: 1)
!32 = !DILocalVariable(name: "config", scope: !31, file: !5, line: 34, type: !33)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !5, line: 29, size: 128, align: 8, elements: !35)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !5, line: 30, baseType: !37, size: 128, align: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !11, line: 1, size: 128, align: 8, elements: !38)
!38 = !{!39, !42}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !11, line: 1, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !11, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!43 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!44 = !DILocation(line: 34, column: 6, scope: !29)
!45 = !DILocation(line: 35, column: 26, scope: !31)
!46 = !DILocalVariable(name: "err", scope: !31, file: !5, line: 35, type: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !11, line: 1, size: 128, align: 8, elements: !48)
!48 = !{!49, !103}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 1, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !52, size: 128, align: 8, elements: !53)
!52 = !DIFile(filename: "", directory: "")
!53 = !{!54, !99}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !52, line: 1, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !11, line: 1, size: 576, align: 8, elements: !57)
!57 = !{!58, !59, !60, !62, !63, !64, !65, !71, !77, !78, !80, !98}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !11, line: 1, baseType: !15, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !11, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !11, line: 1, baseType: !61, size: 32, align: 32, offset: 128)
!61 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !11, line: 1, baseType: !41, size: 8, align: 8, offset: 160)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !11, line: 1, baseType: !41, size: 8, align: 8, offset: 168)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !11, line: 1, baseType: !41, size: 8, align: 8, offset: 176)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !11, line: 1, baseType: !66, size: 64, align: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !11, line: 1, size: 64, align: 8, elements: !68)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !11, line: 1, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !11, line: 1, baseType: !72, size: 64, align: 64, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !11, line: 1, size: 64, align: 8, elements: !74)
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !11, line: 1, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !11, line: 1, baseType: !40, size: 64, align: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !11, line: 1, baseType: !79, size: 64, align: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !11, line: 1, baseType: !81, size: 64, align: 64, offset: 448)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !11, line: 1, size: 320, align: 8, elements: !83)
!83 = !{!84, !85, !86}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !11, line: 1, baseType: !79, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !11, line: 1, baseType: !79, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !11, line: 1, baseType: !87, size: 192, align: 64, offset: 128)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !52, size: 192, align: 8, elements: !88)
!88 = !{!89, !96, !97}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !52, line: 1, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !11, line: 1, size: 320, align: 8, elements: !92)
!92 = !{!84, !85, !93, !94, !95}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !11, line: 1, baseType: !16, size: 64, align: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !11, line: 1, baseType: !16, size: 64, align: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !11, line: 1, baseType: !16, size: 64, align: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !52, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !52, line: 1, baseType: !43, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !11, line: 1, baseType: !16, size: 64, align: 64, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !52, line: 1, baseType: !100, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!37, !16}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !11, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!104 = !DILocation(line: 35, column: 2, scope: !29)
!105 = !DILocation(line: 36, column: 9, scope: !31)
!106 = !DILocation(line: 40, column: 33, scope: !31)
!107 = !DILocalVariable(name: "contents", scope: !31, file: !5, line: 35, type: !108)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !52, size: 192, align: 8, elements: !109)
!109 = !{!110, !96, !97}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !52, line: 1, baseType: !40, size: 64, align: 64)
!111 = !DILocation(line: 40, column: 13, scope: !31)
!112 = !DILocation(line: 41, column: 9, scope: !31)
!113 = !DILocation(line: 37, column: 13, scope: !31)
!114 = !DILocation(line: 37, column: 7, scope: !31)
!115 = !DILocalVariable(name: "sleepTime", scope: !31, file: !5, line: 45, type: !116)
!116 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!117 = !DILocation(line: 45, column: 6, scope: !29)
!118 = !DILocation(line: 47, column: 8, scope: !119)
!119 = distinct !DILexicalBlock(scope: !31, file: !5, line: 46, column: 6)
!120 = !DILocation(line: 48, column: 17, scope: !119)
!121 = !DILocalVariable(name: "err", scope: !119, file: !5, line: 48, type: !47)
!122 = !DILocation(line: 48, column: 3, scope: !31)
!123 = !DILocation(line: 49, column: 10, scope: !119)
!124 = !DILocation(line: 42, column: 13, scope: !31)
!125 = !DILocation(line: 42, column: 7, scope: !31)
!126 = !DILocation(line: 51, column: 72, scope: !119)
!127 = !DILocation(line: 51, column: 8, scope: !119)
!128 = !DILocation(line: 55, column: 7, scope: !119)
!129 = !DILocation(line: 56, column: 15, scope: !119)
!130 = !DILocalVariable(name: "cmd", scope: !119, file: !5, line: 56, type: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cmd", file: !5, line: 23, size: 2624, align: 8, elements: !133)
!133 = !{!134, !135, !139, !140, !141, !158, !166, !167, !221, !267, !287, !321, !386, !387, !388, !389, !402, !403, !415, !416}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !5, line: 23, baseType: !37, size: 128, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Args", file: !5, line: 23, baseType: !136, size: 192, align: 64, offset: 128)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !52, size: 192, align: 8, elements: !137)
!137 = !{!138, !96, !97}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !52, line: 1, baseType: !79, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Env", file: !5, line: 23, baseType: !136, size: 192, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Dir", file: !5, line: 23, baseType: !37, size: 128, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Stdin", file: !5, line: 23, baseType: !142, size: 128, align: 64, offset: 640)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !5, line: 19, size: 128, align: 8, elements: !143)
!143 = !{!144, !157}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 19, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !52, size: 128, align: 8, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !52, line: 19, baseType: !55, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !52, line: 19, baseType: !150, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!153, !16, !108}
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !52, size: 192, align: 8, elements: !154)
!154 = !{!155, !156}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !52, line: 19, baseType: !43, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !52, line: 19, baseType: !47, size: 128, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !5, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Stdout", file: !5, line: 23, baseType: !159, size: 128, align: 64, offset: 768)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !5, line: 19, size: 128, align: 8, elements: !160)
!160 = !{!161, !157}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 19, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !52, size: 128, align: 8, elements: !164)
!164 = !{!148, !165}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !52, line: 19, baseType: !150, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Stderr", file: !5, line: 23, baseType: !159, size: 128, align: 64, offset: 896)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraFiles", file: !5, line: 23, baseType: !168, size: 192, align: 64, offset: 1024)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**File,int,int}", file: !52, size: 192, align: 8, elements: !169)
!169 = !{!170, !96, !97}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !52, line: 1, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !5, line: 20, size: 64, align: 8, elements: !174)
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !5, line: 20, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !5, line: 20, size: 640, align: 8, elements: !178)
!178 = !{!179, !210, !211, !219, !220}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !5, line: 20, baseType: !180, size: 384, align: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !5, line: 20, size: 384, align: 8, elements: !181)
!181 = !{!182, !189, !190, !194, !205, !206, !207, !208, !209}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !5, line: 20, baseType: !183, size: 128, align: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !5, line: 20, size: 128, align: 8, elements: !184)
!184 = !{!185, !187, !188}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !5, line: 20, baseType: !186, size: 64, align: 64)
!186 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !5, line: 20, baseType: !61, size: 32, align: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !5, line: 20, baseType: !61, size: 32, align: 32, offset: 96)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !5, line: 20, baseType: !43, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !5, line: 20, baseType: !191, size: 64, align: 64, offset: 192)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !5, line: 20, size: 64, align: 8, elements: !192)
!192 = !{!193}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !5, line: 20, baseType: !15, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !5, line: 20, baseType: !195, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !52, size: 192, align: 8, elements: !197)
!197 = !{!198, !96, !97}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !52, line: 1, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !5, line: 20, size: 128, align: 8, elements: !201)
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !5, line: 20, baseType: !40, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !5, line: 20, baseType: !204, size: 64, align: 64, offset: 64)
!204 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !5, line: 20, baseType: !61, size: 32, align: 32, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !5, line: 20, baseType: !24, size: 8, align: 8, offset: 352)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !5, line: 20, baseType: !24, size: 8, align: 8, offset: 360)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !5, line: 20, baseType: !24, size: 8, align: 8, offset: 368)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !5, line: 20, baseType: !24, size: 8, align: 8, offset: 376)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !5, line: 20, baseType: !37, size: 128, align: 64, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !5, line: 20, baseType: !212, size: 64, align: 64, offset: 512)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !5, line: 20, size: 256, align: 8, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !5, line: 20, baseType: !108, size: 192, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !5, line: 20, baseType: !217, size: 64, align: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !5, line: 20, align: 8, elements: !3)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !5, line: 20, baseType: !24, size: 8, align: 8, offset: 576)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !5, line: 20, baseType: !24, size: 8, align: 8, offset: 584)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "SysProcAttr", file: !5, line: 23, baseType: !222, size: 64, align: 64, offset: 1216)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "SysProcAttr", file: !5, line: 23, size: 1280, align: 8, elements: !224)
!224 = !{!225, !226, !238, !239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250, !260, !261, !262}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Chroot", file: !5, line: 23, baseType: !37, size: 128, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Credential", file: !5, line: 23, baseType: !227, size: 64, align: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "Credential", file: !5, line: 23, size: 320, align: 8, elements: !229)
!229 = !{!230, !231, !232, !237}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Uid", file: !5, line: 23, baseType: !61, size: 32, align: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Gid", file: !5, line: 23, baseType: !61, size: 32, align: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Groups", file: !5, line: 23, baseType: !233, size: 192, align: 64, offset: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint32,int,int}", file: !52, size: 192, align: 8, elements: !234)
!234 = !{!235, !96, !97}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !52, line: 1, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "NoSetGroups", file: !5, line: 23, baseType: !24, size: 8, align: 8, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Ptrace", file: !5, line: 23, baseType: !24, size: 8, align: 8, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "Setsid", file: !5, line: 23, baseType: !24, size: 8, align: 8, offset: 200)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Setpgid", file: !5, line: 23, baseType: !24, size: 8, align: 8, offset: 208)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Setctty", file: !5, line: 23, baseType: !24, size: 8, align: 8, offset: 216)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Noctty", file: !5, line: 23, baseType: !24, size: 8, align: 8, offset: 224)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Ctty", file: !5, line: 23, baseType: !43, size: 64, align: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Foreground", file: !5, line: 23, baseType: !24, size: 8, align: 8, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Pgid", file: !5, line: 23, baseType: !43, size: 64, align: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Pdeathsig", file: !5, line: 23, baseType: !247, size: 64, align: 64, offset: 448)
!247 = !DIBasicType(name: "Signal", size: 64, encoding: DW_ATE_signed)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Cloneflags", file: !5, line: 23, baseType: !15, size: 64, align: 64, offset: 512)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Unshareflags", file: !5, line: 23, baseType: !15, size: 64, align: 64, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "UidMappings", file: !5, line: 23, baseType: !251, size: 192, align: 64, offset: 640)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*SysProcIDMap,int,int}", file: !52, size: 192, align: 8, elements: !252)
!252 = !{!253, !96, !97}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !52, line: 1, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "SysProcIDMap", file: !5, line: 23, size: 192, align: 8, elements: !256)
!256 = !{!257, !258, !259}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ContainerID", file: !5, line: 23, baseType: !43, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "HostID", file: !5, line: 23, baseType: !43, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !5, line: 23, baseType: !43, size: 64, align: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "GidMappings", file: !5, line: 23, baseType: !251, size: 192, align: 64, offset: 832)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "GidMappingsEnableSetgroups", file: !5, line: 23, baseType: !24, size: 8, align: 8, offset: 1024)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "AmbientCaps", file: !5, line: 23, baseType: !263, size: 192, align: 64, offset: 1088)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !52, size: 192, align: 8, elements: !264)
!264 = !{!265, !96, !97}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !52, line: 1, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Process", file: !5, line: 23, baseType: !268, size: 64, align: 64, offset: 1280)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "Process", file: !5, line: 23, size: 384, align: 8, elements: !270)
!270 = !{!271, !272, !273, !274}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Pid", file: !5, line: 23, baseType: !43, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "handle", file: !5, line: 23, baseType: !15, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "isdone", file: !5, line: 23, baseType: !61, size: 32, align: 32, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "sigMu", file: !5, line: 23, baseType: !275, size: 192, align: 32, offset: 160)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !5, line: 23, size: 192, align: 8, elements: !276)
!276 = !{!277, !283, !284, !285, !286}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !5, line: 23, baseType: !278, size: 64, align: 32)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !5, line: 21, size: 64, align: 8, elements: !279)
!279 = !{!280, !282}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !5, line: 21, baseType: !281, size: 32, align: 32)
!281 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !5, line: 21, baseType: !61, size: 32, align: 32, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !5, line: 23, baseType: !61, size: 32, align: 32, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !5, line: 23, baseType: !61, size: 32, align: 32, offset: 96)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !5, line: 23, baseType: !281, size: 32, align: 32, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !5, line: 23, baseType: !281, size: 32, align: 32, offset: 160)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessState", file: !5, line: 23, baseType: !288, size: 64, align: 64, offset: 1344)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProcessState", file: !5, line: 23, size: 192, align: 8, elements: !290)
!290 = !{!291, !292, !294}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pid", file: !5, line: 23, baseType: !43, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !5, line: 23, baseType: !293, size: 32, align: 32, offset: 64)
!293 = !DIBasicType(name: "WaitStatus", size: 32, encoding: DW_ATE_unsigned)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "rusage", file: !5, line: 23, baseType: !295, size: 64, align: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rusage", file: !5, line: 23, size: 1152, align: 8, elements: !297)
!297 = !{!298, !305, !306, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Utime", file: !5, line: 23, baseType: !299, size: 128, align: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timeval", file: !5, line: 23, size: 128, align: 8, elements: !300)
!300 = !{!301, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Sec", file: !5, line: 23, baseType: !302, size: 64, align: 64)
!302 = !DIBasicType(name: "Timeval_sec_t", size: 64, encoding: DW_ATE_signed)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Usec", file: !5, line: 23, baseType: !304, size: 64, align: 64, offset: 64)
!304 = !DIBasicType(name: "Timeval_usec_t", size: 64, encoding: DW_ATE_signed)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Stime", file: !5, line: 23, baseType: !299, size: 128, align: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Maxrss", file: !5, line: 23, baseType: !307, size: 64, align: 64, offset: 256)
!307 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Ixrss", file: !5, line: 23, baseType: !307, size: 64, align: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Idrss", file: !5, line: 23, baseType: !307, size: 64, align: 64, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Isrss", file: !5, line: 23, baseType: !307, size: 64, align: 64, offset: 448)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Minflt", file: !5, line: 23, baseType: !307, size: 64, align: 64, offset: 512)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Majflt", file: !5, line: 23, baseType: !307, size: 64, align: 64, offset: 576)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Nswap", file: !5, line: 23, baseType: !307, size: 64, align: 64, offset: 640)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Inblock", file: !5, line: 23, baseType: !307, size: 64, align: 64, offset: 704)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Oublock", file: !5, line: 23, baseType: !307, size: 64, align: 64, offset: 768)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Msgsnd", file: !5, line: 23, baseType: !307, size: 64, align: 64, offset: 832)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Msgrcv", file: !5, line: 23, baseType: !307, size: 64, align: 64, offset: 896)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Nsignals", file: !5, line: 23, baseType: !307, size: 64, align: 64, offset: 960)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Nvcsw", file: !5, line: 23, baseType: !307, size: 64, align: 64, offset: 1024)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Nivcsw", file: !5, line: 23, baseType: !307, size: 64, align: 64, offset: 1088)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !5, line: 23, baseType: !322, size: 128, align: 64, offset: 1408)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !5, line: 22, size: 128, align: 8, elements: !323)
!323 = !{!324, !157}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 22, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,Token)Token}", file: !52, size: 320, align: 8, elements: !327)
!327 = !{!328, !329, !369, !375, !379}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !52, line: 22, baseType: !55, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !52, line: 22, baseType: !330, size: 64, align: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!333, !16}
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !52, size: 256, align: 8, elements: !334)
!334 = !{!335, !368}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !52, line: 22, baseType: !336, size: 192, align: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !5, line: 20, size: 192, align: 8, elements: !337)
!337 = !{!338, !339, !340}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !5, line: 20, baseType: !186, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !5, line: 20, baseType: !307, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !5, line: 20, baseType: !341, size: 64, align: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !5, line: 20, size: 704, align: 8, elements: !343)
!343 = !{!344, !345, !354, !365, !366, !367}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !5, line: 20, baseType: !37, size: 128, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !5, line: 20, baseType: !346, size: 192, align: 64, offset: 128)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !52, size: 192, align: 8, elements: !347)
!347 = !{!348, !96, !97}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !52, line: 1, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !5, line: 20, size: 256, align: 8, elements: !351)
!351 = !{!344, !352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !5, line: 20, baseType: !43, size: 64, align: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !5, line: 20, baseType: !24, size: 8, align: 8, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !5, line: 20, baseType: !355, size: 192, align: 64, offset: 320)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !52, size: 192, align: 8, elements: !356)
!356 = !{!357, !96, !97}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !52, line: 1, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !5, line: 20, size: 128, align: 8, elements: !360)
!360 = !{!361, !362, !363, !364}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !5, line: 20, baseType: !307, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !5, line: 20, baseType: !41, size: 8, align: 8, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !5, line: 20, baseType: !24, size: 8, align: 8, offset: 72)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !5, line: 20, baseType: !24, size: 8, align: 8, offset: 80)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !5, line: 20, baseType: !307, size: 64, align: 64, offset: 512)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !5, line: 20, baseType: !307, size: 64, align: 64, offset: 576)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !5, line: 20, baseType: !349, size: 64, align: 64, offset: 640)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !52, line: 22, baseType: !24, size: 8, align: 8, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !52, line: 22, baseType: !370, size: 64, align: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!373, !16}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !11, line: 1, align: 8, elements: !3)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !52, line: 22, baseType: !376, size: 64, align: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!47, !16}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !52, line: 22, baseType: !380, size: 64, align: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!383, !16, !383}
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "Token", file: !5, line: 19, size: 128, align: 8, elements: !384)
!384 = !{!385, !157}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !5, line: 1, baseType: !55, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "lookPathErr", file: !5, line: 23, baseType: !47, size: 128, align: 64, offset: 1536)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "finished", file: !5, line: 23, baseType: !24, size: 8, align: 8, offset: 1664)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "childFiles", file: !5, line: 23, baseType: !168, size: 192, align: 64, offset: 1728)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "closeAfterStart", file: !5, line: 23, baseType: !390, size: 192, align: 64, offset: 1920)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Closer,int,int}", file: !52, size: 192, align: 8, elements: !391)
!391 = !{!392, !96, !97}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !52, line: 1, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "Closer", file: !5, line: 20, size: 128, align: 8, elements: !395)
!395 = !{!396, !157}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 20, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error}", file: !52, size: 128, align: 8, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !52, line: 20, baseType: !55, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !52, line: 20, baseType: !376, size: 64, align: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "closeAfterWait", file: !5, line: 23, baseType: !390, size: 192, align: 64, offset: 2112)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "goroutine", file: !5, line: 23, baseType: !404, size: 192, align: 64, offset: 2304)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**__go_descriptor,int,int}", file: !52, size: 192, align: 8, elements: !405)
!405 = !{!406, !96, !97}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !52, line: 1, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 22, size: 64, align: 8, elements: !410)
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 22, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!47}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "errch", file: !5, line: 23, baseType: !373, size: 64, align: 64, offset: 2496)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "waitDone", file: !5, line: 23, baseType: !373, size: 64, align: 64, offset: 2560)
!417 = !DILocation(line: 56, column: 3, scope: !31)
!418 = !DILocation(line: 57, column: 12, scope: !119)
!419 = !DILocation(line: 58, column: 10, scope: !119)
!420 = !DILocation(line: 59, column: 8, scope: !119)
!421 = !DILocation(line: 59, column: 49, scope: !119)
!422 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", scope: null, file: !11, line: 1, type: !13, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!423 = !DILocalVariable(name: "key", arg: 1, scope: !422, file: !11, line: 1, type: !16)
!424 = !DILocation(line: 1, column: 1, scope: !422)
!425 = !DILocalVariable(name: "seed", arg: 2, scope: !422, file: !11, line: 1, type: !15)
!426 = !DILocalVariable(name: "$ret16", scope: !422, file: !11, line: 1, type: !15)
!427 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", scope: null, file: !11, line: 1, type: !22, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!428 = !DILocalVariable(name: "key1", arg: 1, scope: !427, file: !11, line: 1, type: !16)
!429 = !DILocation(line: 1, column: 1, scope: !427)
!430 = !DILocalVariable(name: "key2", arg: 2, scope: !427, file: !11, line: 1, type: !16)
!431 = !DILocalVariable(name: "$ret17", scope: !427, file: !11, line: 1, type: !24)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "main"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "main"
	.ascii ";\n"
	.ascii "import "
	.ascii "json"
	.ascii " "
	.ascii "encoding/json"
	.ascii " \""
	.ascii "encoding/json"
	.ascii "\";\n"
	.ascii "import "
	.ascii "ioutil"
	.ascii " "
	.ascii "io/ioutil"
	.ascii " \""
	.ascii "io/ioutil"
	.ascii "\";\n"
	.ascii "import "
	.ascii "log"
	.ascii " "
	.ascii "log"
	.ascii " \""
	.ascii "log"
	.ascii "\";\n"
	.ascii "import "
	.ascii "net"
	.ascii " "
	.ascii "net"
	.ascii " \""
	.ascii "net"
	.ascii "\";\n"
	.ascii "import "
	.ascii "exec"
	.ascii " "
	.ascii "os/exec"
	.ascii " \""
	.ascii "os/exec"
	.ascii "\";\n"
	.ascii "import "
	.ascii "runtime"
	.ascii " "
	.ascii "runtime"
	.ascii " \""
	.ascii "runtime"
	.ascii "\";\n"
	.ascii "import "
	.ascii "time"
	.ascii " "
	.ascii "time"
	.ascii " \""
	.ascii "time"
	.ascii "\";\n"
	.ascii "init"
	.ascii " "
	.ascii "bytes"
	.ascii " "
	.ascii "bytes..import"
	.ascii " "
	.ascii "context"
	.ascii " "
	.ascii "context..import"
	.ascii " "
	.ascii "base64"
	.ascii " "
	.ascii "encoding_base64..import"
	.ascii " "
	.ascii "binary"
	.ascii " "
	.ascii "encoding_binary..import"
	.ascii " "
	.ascii "json"
	.ascii " "
	.ascii "encoding_json..import"
	.ascii " "
	.ascii "fmt"
	.ascii " "
	.ascii "fmt..import"
	.ascii " "
	.ascii "poll"
	.ascii " "
	.ascii "internal_poll..import"
	.ascii " "
	.ascii "testlog"
	.ascii " "
	.ascii "internal_testlog..import"
	.ascii " "
	.ascii "io"
	.ascii " "
	.ascii "io..import"
	.ascii " "
	.ascii "ioutil"
	.ascii " "
	.ascii "io_ioutil..import"
	.ascii " "
	.ascii "log"
	.ascii " "
	.ascii "log..import"
	.ascii " "
	.ascii "rand"
	.ascii " "
	.ascii "math_rand..import"
	.ascii " "
	.ascii "net"
	.ascii " "
	.ascii "net..import"
	.ascii " "
	.ascii "os"
	.ascii " "
	.ascii "os..import"
	.ascii " "
	.ascii "exec"
	.ascii " "
	.ascii "os_exec..import"
	.ascii " "
	.ascii "filepath"
	.ascii " "
	.ascii "path_filepath..import"
	.ascii " "
	.ascii "reflect"
	.ascii " "
	.ascii "reflect..import"
	.ascii " "
	.ascii "runtime"
	.ascii " "
	.ascii "runtime..import"
	.ascii " "
	.ascii "sys"
	.ascii " "
	.ascii "runtime_internal_sys..import"
	.ascii " "
	.ascii "strconv"
	.ascii " "
	.ascii "strconv..import"
	.ascii " "
