; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/AdRoll/hologram/log\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/AdRoll/hologram/log\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22protocol\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/AdRoll/hologram/protocol\22"
module asm "\09.ascii \22 \5C\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./main.go", directory: "/home/wangcong/go_path/src/github.com/AdRoll/hologram/cmd/hologram")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !10, line: 30, type: !11, isLocal: false, isDefinition: true, scopeLine: 30, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DIFile(filename: "main.go", directory: ".")
!11 = !DISubroutineType(types: !12)
!12 = !{!13}
!13 = !DIBasicType(name: "void")
!14 = !DILocation(line: 31, column: 7, scope: !15)
!15 = distinct !DILexicalBlock(scope: !9, file: !10, line: 30, column: 1)
!16 = !DILocation(line: 33, column: 15, scope: !15)
!17 = !DILocalVariable(name: "args", scope: !15, file: !10, line: 33, type: !18)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !19, size: 192, align: 8, elements: !20)
!19 = !DIFile(filename: "", directory: "")
!20 = !{!21, !30, !31}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !19, line: 1, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !24)
!24 = !{!25, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !29, size: 64, align: 64, offset: 64)
!29 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !19, line: 1, baseType: !29, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !19, line: 1, baseType: !29, size: 64, align: 64, offset: 128)
!32 = !DILocation(line: 33, column: 2, scope: !9)
!33 = !DILocalVariable(name: "err", scope: !15, file: !10, line: 35, type: !34)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !35)
!35 = !{!36, !92}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !19, size: 128, align: 8, elements: !39)
!39 = !{!40, !88}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !19, line: 1, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !43)
!43 = !{!44, !46, !47, !48, !49, !50, !51, !60, !69, !70, !71, !87}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !45, size: 64, align: 64)
!45 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !45, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !27, size: 8, align: 8, offset: 160)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !27, size: 8, align: 8, offset: 168)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !27, size: 8, align: 8, offset: 176)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !52, size: 64, align: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !54)
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!45, !59, !45}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !61, size: 64, align: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !63)
!63 = !{!64}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !59, !59}
!68 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !26, size: 64, align: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !22, size: 64, align: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !72, size: 64, align: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !74)
!74 = !{!75, !76, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !22, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !78, size: 192, align: 64, offset: 128)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !19, size: 192, align: 8, elements: !79)
!79 = !{!80, !30, !31}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !19, line: 1, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !83)
!83 = !{!75, !76, !84, !85, !86}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !59, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !59, size: 64, align: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !59, size: 64, align: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !59, size: 64, align: 64, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !19, line: 1, baseType: !89, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!23, !59}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!93 = !DILocation(line: 35, column: 6, scope: !9)
!94 = !DILocation(line: 37, column: 15, scope: !15)
!95 = !DILocation(line: 38, column: 7, scope: !15)
!96 = !DILocation(line: 39, column: 6, scope: !15)
!97 = !DILocation(line: 42, column: 13, scope: !15)
!98 = !DILocation(line: 43, column: 2, scope: !15)
!99 = !DILocation(line: 44, column: 16, scope: !15)
!100 = !DILocation(line: 50, column: 2, scope: !15)
!101 = !DILocation(line: 45, column: 8, scope: !15)
!102 = !DILocation(line: 46, column: 7, scope: !15)
!103 = !DILocation(line: 48, column: 17, scope: !15)
!104 = !DILocation(line: 48, column: 9, scope: !15)
!105 = !DILocation(line: 64, column: 10, scope: !106, inlinedAt: !109)
!106 = distinct !DISubprogram(name: "main.use", scope: null, file: !10, line: 64, type: !107, isLocal: true, isDefinition: true, scopeLine: 64, isOptimized: false, unit: !1, retainedNodes: !3)
!107 = !DISubroutineType(types: !108)
!108 = !{!34, !23}
!109 = distinct !DILocation(line: 48, column: 9, scope: !15)
!110 = !DILocalVariable(name: "param", arg: 1, scope: !106, file: !10, line: 64, type: !23)
!111 = !DILocalVariable(name: "role", scope: !106, file: !10, line: 64, type: !22)
!112 = !DILocation(line: 66, column: 15, scope: !113, inlinedAt: !109)
!113 = distinct !DILexicalBlock(scope: !106, file: !10, line: 64, column: 1)
!114 = !DILocation(line: 66, column: 25, scope: !113, inlinedAt: !109)
!115 = !DILocation(line: 65, column: 27, scope: !113, inlinedAt: !109)
!116 = !DILocation(line: 65, column: 37, scope: !113, inlinedAt: !109)
!117 = !DILocation(line: 65, column: 19, scope: !113, inlinedAt: !109)
!118 = !DILocalVariable(name: "response", scope: !113, file: !10, line: 65, type: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "AgentResponse", file: !10, line: 25, size: 320, align: 8, elements: !121)
!121 = !{!122, !130, !136}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Success", file: !10, line: 25, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "Success", file: !10, line: 25, size: 192, align: 8, elements: !125)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !10, line: 25, baseType: !127, size: 192, align: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !19, size: 192, align: 8, elements: !128)
!128 = !{!129, !30, !31}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !19, line: 1, baseType: !26, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Failure", file: !10, line: 25, baseType: !131, size: 64, align: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "Failure", file: !10, line: 25, size: 256, align: 8, elements: !133)
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorMessage", file: !10, line: 25, baseType: !22, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !10, line: 25, baseType: !127, size: 192, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !10, line: 25, baseType: !127, size: 192, align: 64, offset: 128)
!137 = !DILocation(line: 65, column: 2, scope: !106, inlinedAt: !109)
!138 = !DILocalVariable(name: "err", scope: !113, file: !10, line: 65, type: !34)
!139 = !DILocation(line: 70, column: 9, scope: !113, inlinedAt: !109)
!140 = !DILocation(line: 71, column: 3, scope: !113, inlinedAt: !109)
!141 = !DILocalVariable(name: "$ret0", scope: !106, file: !10, line: 64, type: !34)
!142 = !DILocation(line: 64, column: 23, scope: !106, inlinedAt: !109)
!143 = !DILocation(line: 74, column: 13, scope: !113, inlinedAt: !109)
!144 = !DILocation(line: 74, column: 27, scope: !113, inlinedAt: !109)
!145 = !DILocation(line: 75, column: 29, scope: !113, inlinedAt: !109)
!146 = !DILocation(line: 75, column: 42, scope: !113, inlinedAt: !109)
!147 = !DILocation(line: 75, column: 14, scope: !113, inlinedAt: !109)
!148 = !DILocation(line: 75, column: 3, scope: !113, inlinedAt: !109)
!149 = !DILocation(line: 78, column: 13, scope: !113, inlinedAt: !109)
!150 = !DILocation(line: 78, column: 27, scope: !113, inlinedAt: !109)
!151 = !DILocation(line: 79, column: 17, scope: !152, inlinedAt: !109)
!152 = distinct !DILexicalBlock(scope: !113, file: !10, line: 78, column: 34)
!153 = !DILocalVariable(name: "output", scope: !152, file: !10, line: 79, type: !23)
!154 = !DILocation(line: 79, column: 3, scope: !113, inlinedAt: !109)
!155 = !DILocation(line: 80, column: 7, scope: !152, inlinedAt: !109)
!156 = !DILocation(line: 81, column: 3, scope: !152, inlinedAt: !109)
!157 = !DILocation(line: 84, column: 13, scope: !113, inlinedAt: !109)
!158 = !DILocation(line: 84, column: 2, scope: !113, inlinedAt: !109)
!159 = !DILocation(line: 0, scope: !15)
!160 = !DILocation(line: 58, column: 9, scope: !15)
!161 = !DILocation(line: 89, column: 23, scope: !162, inlinedAt: !166)
!162 = distinct !DILexicalBlock(scope: !163, file: !10, line: 87, column: 1)
!163 = distinct !DISubprogram(name: "main.me", scope: null, file: !10, line: 87, type: !164, isLocal: true, isDefinition: true, scopeLine: 87, isOptimized: false, unit: !1, retainedNodes: !3)
!164 = !DISubroutineType(types: !165)
!165 = !{!34}
!166 = distinct !DILocation(line: 51, column: 9, scope: !15)
!167 = !DILocation(line: 88, column: 27, scope: !162, inlinedAt: !166)
!168 = !DILocation(line: 88, column: 37, scope: !162, inlinedAt: !166)
!169 = !DILocation(line: 88, column: 19, scope: !162, inlinedAt: !166)
!170 = !DILocalVariable(name: "response", scope: !162, file: !10, line: 88, type: !119)
!171 = !DILocation(line: 88, column: 2, scope: !163, inlinedAt: !166)
!172 = !DILocalVariable(name: "err", scope: !162, file: !10, line: 88, type: !34)
!173 = !DILocation(line: 92, column: 9, scope: !162, inlinedAt: !166)
!174 = !DILocation(line: 93, column: 3, scope: !162, inlinedAt: !166)
!175 = !DILocalVariable(name: "$ret1", scope: !163, file: !10, line: 87, type: !34)
!176 = !DILocation(line: 87, column: 11, scope: !163, inlinedAt: !166)
!177 = !DILocation(line: 96, column: 13, scope: !162, inlinedAt: !166)
!178 = !DILocation(line: 96, column: 27, scope: !162, inlinedAt: !166)
!179 = !DILocation(line: 97, column: 54, scope: !162, inlinedAt: !166)
!180 = !DILocation(line: 97, column: 67, scope: !162, inlinedAt: !166)
!181 = !DILocation(line: 97, column: 14, scope: !162, inlinedAt: !166)
!182 = !DILocation(line: 97, column: 3, scope: !162, inlinedAt: !166)
!183 = !DILocation(line: 100, column: 13, scope: !162, inlinedAt: !166)
!184 = !DILocation(line: 100, column: 27, scope: !162, inlinedAt: !166)
!185 = !DILocation(line: 101, column: 7, scope: !162, inlinedAt: !166)
!186 = !DILocation(line: 102, column: 3, scope: !162, inlinedAt: !166)
!187 = !DILocation(line: 105, column: 13, scope: !162, inlinedAt: !166)
!188 = !DILocation(line: 105, column: 2, scope: !162, inlinedAt: !166)
!189 = !DILocation(line: 54, column: 7, scope: !15)
!190 = !DILocation(line: 55, column: 6, scope: !15)
!191 = !DILocation(line: 59, column: 17, scope: !15)
!192 = !DILocation(line: 59, column: 7, scope: !15)
!193 = !DILocation(line: 60, column: 6, scope: !15)
!194 = distinct !DISubprogram(name: "main.request", scope: null, file: !10, line: 108, type: !195, isLocal: true, isDefinition: true, scopeLine: 108, isOptimized: false, unit: !1, retainedNodes: !3)
!195 = !DISubroutineType(types: !196)
!196 = !{!197, !201}
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AgentResponse,error}", file: !19, size: 192, align: 8, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !19, line: 108, baseType: !119, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !19, line: 108, baseType: !34, size: 128, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "AgentRequest", file: !10, line: 25, size: 576, align: 8, elements: !203)
!203 = !{!204, !205, !211, !214, !215}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "SshAgentSock", file: !10, line: 25, baseType: !22, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "AssumeRole", file: !10, line: 25, baseType: !206, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "AssumeRole", file: !10, line: 25, size: 320, align: 8, elements: !208)
!208 = !{!209, !210, !136}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !10, line: 25, baseType: !22, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Role", file: !10, line: 25, baseType: !22, size: 64, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserCredentials", file: !10, line: 25, baseType: !212, size: 64, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "GetUserCredentials", file: !10, line: 25, size: 192, align: 8, elements: !125)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "SshKeyFile", file: !10, line: 25, baseType: !127, size: 192, align: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !10, line: 25, baseType: !127, size: 192, align: 64, offset: 384)
!216 = !DILocalVariable(name: "req", arg: 1, scope: !194, file: !10, line: 108, type: !201)
!217 = !DILocation(line: 108, column: 14, scope: !194)
!218 = !DILocalVariable(name: "$ret2", scope: !194, file: !10, line: 108, type: !119)
!219 = !DILocation(line: 108, column: 43, scope: !194)
!220 = !DILocation(line: 109, column: 23, scope: !221)
!221 = distinct !DILexicalBlock(scope: !194, file: !10, line: 108, column: 1)
!222 = !DILocalVariable(name: "client", scope: !221, file: !10, line: 109, type: !223)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageReadWriteCloser", file: !10, line: 25, size: 128, align: 8, elements: !224)
!224 = !{!225, !317}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 25, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)struct{*Message,error},*func(*void,*Message)error}", file: !19, size: 256, align: 8, elements: !228)
!228 = !{!229, !230, !234, !313}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !19, line: 25, baseType: !41, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !19, line: 25, baseType: !231, size: 64, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!34, !59}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !19, line: 25, baseType: !235, size: 64, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!238, !59}
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Message,error}", file: !19, size: 192, align: 8, elements: !239)
!239 = !{!240, !312}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !19, line: 25, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !10, line: 25, size: 768, align: 8, elements: !243)
!243 = !{!244, !245, !248, !255, !282, !307, !308, !309, !310, !311}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !10, line: 25, baseType: !22, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Source", file: !10, line: 25, baseType: !246, size: 64, align: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIBasicType(name: "Message_Source", size: 32, encoding: DW_ATE_signed)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Ping", file: !10, line: 25, baseType: !249, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ping", file: !10, line: 25, size: 256, align: 8, elements: !251)
!251 = !{!252, !135}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !10, line: 25, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIBasicType(name: "Ping_RequestResponse", size: 32, encoding: DW_ATE_signed)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ServerRequest", file: !10, line: 25, baseType: !256, size: 64, align: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServerRequest", file: !10, line: 25, size: 512, align: 8, elements: !258)
!258 = !{!259, !260, !267, !272, !273, !281}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "AssumeRole", file: !10, line: 25, baseType: !206, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ChallengeResponse", file: !10, line: 25, baseType: !261, size: 64, align: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHChallengeResponse", file: !10, line: 25, size: 448, align: 8, elements: !263)
!263 = !{!264, !265, !266}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !10, line: 25, baseType: !127, size: 192, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Format", file: !10, line: 25, baseType: !22, size: 64, align: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !10, line: 25, baseType: !127, size: 192, align: 64, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "TokenResponse", file: !10, line: 25, baseType: !268, size: 64, align: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "MFATokenResponse", file: !10, line: 25, size: 256, align: 8, elements: !270)
!270 = !{!271, !135}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "TokenValue", file: !10, line: 25, baseType: !22, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserCredentials", file: !10, line: 25, baseType: !212, size: 64, align: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "AddSSHkey", file: !10, line: 25, baseType: !274, size: 64, align: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "AddSSHKey", file: !10, line: 25, size: 384, align: 8, elements: !276)
!276 = !{!277, !278, !279, !280}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "Username", file: !10, line: 25, baseType: !22, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Passwordhash", file: !10, line: 25, baseType: !22, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Sshkeybytes", file: !10, line: 25, baseType: !22, size: 64, align: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !10, line: 25, baseType: !127, size: 192, align: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !10, line: 25, baseType: !127, size: 192, align: 64, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ServerResponse", file: !10, line: 25, baseType: !283, size: 64, align: 64, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServerResponse", file: !10, line: 25, size: 448, align: 8, elements: !285)
!285 = !{!286, !291, !294, !304, !266}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Challenge", file: !10, line: 25, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHChallenge", file: !10, line: 25, size: 384, align: 8, elements: !289)
!289 = !{!290, !280}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Challenge", file: !10, line: 25, baseType: !127, size: 192, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "VerificationFailure", file: !10, line: 25, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHVerificationFailure", file: !10, line: 25, size: 192, align: 8, elements: !125)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Credentials", file: !10, line: 25, baseType: !295, size: 64, align: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "STSCredentials", file: !10, line: 25, size: 448, align: 8, elements: !297)
!297 = !{!298, !299, !300, !301, !266}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "AccessKeyId", file: !10, line: 25, baseType: !22, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "SecretAccessKey", file: !10, line: 25, baseType: !22, size: 64, align: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "AccessToken", file: !10, line: 25, baseType: !22, size: 64, align: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Expiration", file: !10, line: 25, baseType: !302, size: 64, align: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "TokenRequest", file: !10, line: 25, baseType: !305, size: 64, align: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "MFATokenRequest", file: !10, line: 25, size: 192, align: 8, elements: !125)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "AgentRequest", file: !10, line: 25, baseType: !201, size: 64, align: 64, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "AgentResponse", file: !10, line: 25, baseType: !119, size: 64, align: 64, offset: 384)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Success", file: !10, line: 25, baseType: !123, size: 64, align: 64, offset: 448)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Failure", file: !10, line: 25, baseType: !131, size: 64, align: 64, offset: 512)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !10, line: 25, baseType: !127, size: 192, align: 64, offset: 576)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !19, line: 25, baseType: !34, size: 128, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !19, line: 25, baseType: !314, size: 64, align: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!34, !59, !241}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!318 = !DILocation(line: 109, column: 2, scope: !194)
!319 = !DILocalVariable(name: "err", scope: !221, file: !10, line: 109, type: !34)
!320 = !DILocation(line: 110, column: 9, scope: !221)
!321 = !DILocation(line: 111, column: 108, scope: !221)
!322 = !DILocation(line: 111, column: 19, scope: !221)
!323 = !DILocalVariable(name: "$ret3", scope: !194, file: !10, line: 108, type: !34)
!324 = !DILocation(line: 108, column: 68, scope: !194)
!325 = !DILocation(line: 111, column: 3, scope: !221)
!326 = !DILocation(line: 117, column: 2, scope: !221)
!327 = !DILocation(line: 117, column: 21, scope: !221)
!328 = !DILocalVariable(name: "sshAgentSock", scope: !221, file: !10, line: 117, type: !22)
!329 = !DILocation(line: 117, column: 2, scope: !194)
!330 = !DILocation(line: 118, column: 5, scope: !221)
!331 = !DILocation(line: 118, column: 19, scope: !221)
!332 = !DILocation(line: 122, column: 32, scope: !333)
!333 = distinct !DILexicalBlock(scope: !221, file: !10, line: 122, column: 2)
!334 = !DILocalVariable(name: "homeErr", scope: !333, file: !10, line: 122, type: !34)
!335 = !DILocation(line: 122, column: 5, scope: !221)
!336 = !DILocation(line: 122, column: 58, scope: !333)
!337 = !DILocation(line: 123, column: 22, scope: !338)
!338 = distinct !DILexicalBlock(scope: !333, file: !10, line: 122, column: 65)
!339 = !DILocalVariable(name: "sshFilename", scope: !338, file: !10, line: 123, type: !23)
!340 = !DILocation(line: 123, column: 3, scope: !333)
!341 = !DILocation(line: 124, column: 40, scope: !342)
!342 = distinct !DILexicalBlock(scope: !338, file: !10, line: 124, column: 3)
!343 = !DILocalVariable(name: "keyReadErr", scope: !342, file: !10, line: 124, type: !34)
!344 = !DILocation(line: 124, column: 6, scope: !338)
!345 = !DILocation(line: 124, column: 74, scope: !342)
!346 = !DILocation(line: 136, column: 9, scope: !221)
!347 = !DILocation(line: 136, column: 19, scope: !221)
!348 = !DILocalVariable(name: "msg", scope: !221, file: !10, line: 136, type: !241)
!349 = !DILocation(line: 136, column: 2, scope: !194)
!350 = !DILocation(line: 140, column: 14, scope: !221)
!351 = !DILocation(line: 141, column: 9, scope: !221)
!352 = !DILocation(line: 127, column: 8, scope: !353)
!353 = distinct !DILexicalBlock(scope: !342, file: !10, line: 126, column: 5)
!354 = !DILocation(line: 129, column: 23, scope: !353)
!355 = !DILocalVariable(name: "sshFilename", scope: !353, file: !10, line: 129, type: !23)
!356 = !DILocation(line: 129, column: 4, scope: !342)
!357 = !DILocation(line: 130, column: 41, scope: !358)
!358 = distinct !DILexicalBlock(scope: !353, file: !10, line: 130, column: 4)
!359 = !DILocalVariable(name: "keyReadErr", scope: !358, file: !10, line: 130, type: !34)
!360 = !DILocation(line: 130, column: 7, scope: !353)
!361 = !DILocation(line: 130, column: 75, scope: !358)
!362 = !DILocation(line: 125, column: 7, scope: !342)
!363 = !DILocation(line: 125, column: 19, scope: !342)
!364 = !DILocation(line: 131, column: 8, scope: !358)
!365 = !DILocation(line: 131, column: 20, scope: !358)
!366 = !DILocation(line: 142, column: 3, scope: !221)
!367 = !DILocation(line: 145, column: 25, scope: !221)
!368 = !DILocalVariable(name: "response", scope: !221, file: !10, line: 145, type: !241)
!369 = !DILocation(line: 145, column: 2, scope: !194)
!370 = !DILocation(line: 147, column: 13, scope: !221)
!371 = !DILocation(line: 147, column: 33, scope: !221)
!372 = !DILocation(line: 148, column: 19, scope: !221)
!373 = !DILocation(line: 148, column: 3, scope: !221)
!374 = !DILocation(line: 151, column: 17, scope: !221)
!375 = !DILocation(line: 151, column: 2, scope: !221)
