; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22md5\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/md5\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/md5\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22base64\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./main.go", directory: "/home/wangcong/go_path/src/github.com/AdRoll/hologram/cmd/hologram-authorize")
!3 = !{}
!4 = !{!5, !24}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "encoding_base64.StdEncoding", linkageName: "encoding_base64.StdEncoding", scope: !1, file: !7, line: 20, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "main.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "Encoding", file: !7, line: 20, size: 2624, align: 8, elements: !10)
!10 = !{!11, !16, !20, !22}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "encode", file: !7, line: 20, baseType: !12, size: 512, align: 8)
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 512, align: 1, elements: !14)
!13 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!14 = !{!15}
!15 = !DISubrange(count: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "decodeMap", file: !7, line: 20, baseType: !17, size: 2048, align: 8, offset: 512)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 2048, align: 1, elements: !18)
!18 = !{!19}
!19 = !DISubrange(count: 256)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "padChar", file: !7, line: 20, baseType: !21, size: 32, align: 32, offset: 2560)
!21 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "strict", file: !7, line: 20, baseType: !23, size: 8, align: 8, offset: 2592)
!23 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !26, line: 1, type: !27, isLocal: false, isDefinition: true)
!26 = !DIFile(filename: "<built-in>", directory: "")
!27 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!28 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !7, line: 16, type: !29, isLocal: false, isDefinition: true, scopeLine: 16, isOptimized: false, unit: !1, retainedNodes: !3)
!29 = !DISubroutineType(types: !30)
!30 = !{!31}
!31 = !DIBasicType(name: "void")
!32 = !DILocation(line: 1, column: 1, scope: !33)
!33 = !DILexicalBlockFile(scope: !28, file: !26, discriminator: 0)
!34 = distinct !DISubprogram(name: "main.main.Config..hash", linkageName: "main.main.Config..hash", scope: null, file: !26, line: 1, type: !35, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !38, !37}
!37 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!39 = !DILocalVariable(name: "key", arg: 1, scope: !34, file: !26, line: 1, type: !38)
!40 = !DILocation(line: 1, column: 1, scope: !34)
!41 = !DILocalVariable(name: "seed", arg: 2, scope: !34, file: !26, line: 1, type: !37)
!42 = !DILocalVariable(name: "$ret6", scope: !34, file: !26, line: 1, type: !37)
!43 = distinct !DISubprogram(name: "main.main.Config..eq", linkageName: "main.main.Config..eq", scope: null, file: !26, line: 1, type: !44, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!44 = !DISubroutineType(types: !45)
!45 = !{!23, !38, !38}
!46 = !DILocalVariable(name: "key1", arg: 1, scope: !43, file: !26, line: 1, type: !38)
!47 = !DILocation(line: 1, column: 1, scope: !43)
!48 = !DILocalVariable(name: "key2", arg: 2, scope: !43, file: !26, line: 1, type: !38)
!49 = !DILocalVariable(name: "$ret7", scope: !43, file: !26, line: 1, type: !23)
!50 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !7, line: 103, type: !29, isLocal: false, isDefinition: true, scopeLine: 103, isOptimized: false, unit: !1, retainedNodes: !3)
!51 = !DILocalVariable(name: "configPath", scope: !52, file: !7, line: 104, type: !53)
!52 = distinct !DILexicalBlock(scope: !50, file: !7, line: 103, column: 1)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !26, line: 1, size: 128, align: 8, elements: !54)
!54 = !{!55, !57}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !26, line: 1, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !26, line: 1, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!59 = !DILocation(line: 104, column: 2, scope: !50)
!60 = !DILocation(line: 91, column: 17, scope: !61, inlinedAt: !127)
!61 = distinct !DISubprogram(name: "main.loadConfig", scope: null, file: !7, line: 91, type: !62, isLocal: true, isDefinition: true, scopeLine: 91, isOptimized: false, unit: !1, retainedNodes: !3)
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !53}
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Config,error}", file: !65, size: 256, align: 8, elements: !66)
!65 = !DIFile(filename: "", directory: "")
!66 = !{!67, !71}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !65, line: 91, baseType: !68, size: 128, align: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !7, line: 36, size: 128, align: 8, elements: !69)
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !7, line: 37, baseType: !53, size: 128, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !65, line: 91, baseType: !72, size: 128, align: 64, offset: 128)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !26, line: 1, size: 128, align: 8, elements: !73)
!73 = !{!74, !126}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !26, line: 1, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !65, size: 128, align: 8, elements: !77)
!77 = !{!78, !122}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !65, line: 1, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !26, line: 1, size: 576, align: 8, elements: !81)
!81 = !{!82, !83, !84, !85, !86, !87, !88, !94, !100, !101, !103, !121}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !26, line: 1, baseType: !37, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !26, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !26, line: 1, baseType: !27, size: 32, align: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !26, line: 1, baseType: !13, size: 8, align: 8, offset: 160)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !26, line: 1, baseType: !13, size: 8, align: 8, offset: 168)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !26, line: 1, baseType: !13, size: 8, align: 8, offset: 176)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !26, line: 1, baseType: !89, size: 64, align: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !26, line: 1, size: 64, align: 8, elements: !91)
!91 = !{!92}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !26, line: 1, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !26, line: 1, baseType: !95, size: 64, align: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !26, line: 1, size: 64, align: 8, elements: !97)
!97 = !{!98}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !26, line: 1, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !26, line: 1, baseType: !56, size: 64, align: 64, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !26, line: 1, baseType: !102, size: 64, align: 64, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !26, line: 1, baseType: !104, size: 64, align: 64, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !26, line: 1, size: 320, align: 8, elements: !106)
!106 = !{!107, !108, !109}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !26, line: 1, baseType: !102, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !26, line: 1, baseType: !102, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !26, line: 1, baseType: !110, size: 192, align: 64, offset: 128)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !65, size: 192, align: 8, elements: !111)
!111 = !{!112, !119, !120}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !65, line: 1, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !26, line: 1, size: 320, align: 8, elements: !115)
!115 = !{!107, !108, !116, !117, !118}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !26, line: 1, baseType: !38, size: 64, align: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !26, line: 1, baseType: !38, size: 64, align: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !26, line: 1, baseType: !38, size: 64, align: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !65, line: 1, baseType: !58, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !65, line: 1, baseType: !58, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !26, line: 1, baseType: !38, size: 64, align: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !65, line: 1, baseType: !123, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!53, !38}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !26, line: 1, baseType: !38, size: 64, align: 64, offset: 64)
!127 = distinct !DILocation(line: 105, column: 17, scope: !52)
!128 = !DILocalVariable(name: "configPath", arg: 1, scope: !61, file: !7, line: 91, type: !53)
!129 = !DILocation(line: 93, column: 30, scope: !130, inlinedAt: !127)
!130 = distinct !DILexicalBlock(scope: !61, file: !7, line: 91, column: 1)
!131 = !DILocation(line: 94, column: 6, scope: !130, inlinedAt: !127)
!132 = !DILocalVariable(name: "config", scope: !130, file: !7, line: 94, type: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!134 = !DILocation(line: 94, column: 6, scope: !61, inlinedAt: !127)
!135 = !DILocation(line: 96, column: 33, scope: !130, inlinedAt: !127)
!136 = !DILocalVariable(name: "configContents", scope: !130, file: !7, line: 93, type: !137)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !65, size: 192, align: 8, elements: !138)
!138 = !{!139, !119, !120}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !65, line: 1, baseType: !56, size: 64, align: 64)
!140 = !DILocation(line: 93, column: 2, scope: !61, inlinedAt: !127)
!141 = !DILocation(line: 96, column: 7, scope: !130, inlinedAt: !127)
!142 = !DILocation(line: 97, column: 17, scope: !130, inlinedAt: !127)
!143 = !DILocalVariable(name: "$ret5", scope: !61, file: !7, line: 91, type: !72)
!144 = !DILocation(line: 91, column: 45, scope: !61, inlinedAt: !127)
!145 = !DILocation(line: 100, column: 2, scope: !130, inlinedAt: !127)
!146 = !DILocalVariable(name: "config", scope: !52, file: !7, line: 105, type: !68)
!147 = !DILocation(line: 105, column: 2, scope: !50)
!148 = !DILocalVariable(name: "err", scope: !52, file: !7, line: 105, type: !72)
!149 = !DILocation(line: 98, column: 22, scope: !130, inlinedAt: !127)
!150 = !DILocation(line: 98, column: 3, scope: !130, inlinedAt: !127)
!151 = !DILocation(line: 106, column: 9, scope: !52)
!152 = !DILocation(line: 111, column: 19, scope: !52)
!153 = !DILocalVariable(name: "c", scope: !52, file: !7, line: 111, type: !154)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageReadWriteCloser", file: !7, line: 28, size: 128, align: 8, elements: !155)
!155 = !{!156, !278}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 28, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)struct{*Message,error},*func(*void,*Message)error}", file: !65, size: 256, align: 8, elements: !159)
!159 = !{!160, !161, !165, !274}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !65, line: 28, baseType: !79, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !65, line: 28, baseType: !162, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!72, !38}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !65, line: 28, baseType: !166, size: 64, align: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!169, !38}
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Message,error}", file: !65, size: 192, align: 8, elements: !170)
!170 = !{!171, !273}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !65, line: 28, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !7, line: 28, size: 768, align: 8, elements: !174)
!174 = !{!175, !176, !179, !187, !224, !249, !258, !270, !271, !272}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !7, line: 28, baseType: !102, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Source", file: !7, line: 28, baseType: !177, size: 64, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIBasicType(name: "Message_Source", size: 32, encoding: DW_ATE_signed)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Ping", file: !7, line: 28, baseType: !180, size: 64, align: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ping", file: !7, line: 28, size: 256, align: 8, elements: !182)
!182 = !{!183, !186}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !7, line: 28, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIBasicType(name: "Ping_RequestResponse", size: 32, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 28, baseType: !137, size: 192, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ServerRequest", file: !7, line: 28, baseType: !188, size: 64, align: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServerRequest", file: !7, line: 28, size: 512, align: 8, elements: !190)
!190 = !{!191, !198, !205, !210, !215, !223}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "AssumeRole", file: !7, line: 28, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "AssumeRole", file: !7, line: 28, size: 320, align: 8, elements: !194)
!194 = !{!195, !196, !197}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !7, line: 28, baseType: !102, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Role", file: !7, line: 28, baseType: !102, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 28, baseType: !137, size: 192, align: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ChallengeResponse", file: !7, line: 28, baseType: !199, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHChallengeResponse", file: !7, line: 28, size: 448, align: 8, elements: !201)
!201 = !{!202, !203, !204}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !7, line: 28, baseType: !137, size: 192, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Format", file: !7, line: 28, baseType: !102, size: 64, align: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 28, baseType: !137, size: 192, align: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "TokenResponse", file: !7, line: 28, baseType: !206, size: 64, align: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "MFATokenResponse", file: !7, line: 28, size: 256, align: 8, elements: !208)
!208 = !{!209, !186}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "TokenValue", file: !7, line: 28, baseType: !102, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserCredentials", file: !7, line: 28, baseType: !211, size: 64, align: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "GetUserCredentials", file: !7, line: 28, size: 192, align: 8, elements: !213)
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 28, baseType: !137, size: 192, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "AddSSHkey", file: !7, line: 28, baseType: !216, size: 64, align: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "AddSSHKey", file: !7, line: 28, size: 384, align: 8, elements: !218)
!218 = !{!219, !220, !221, !222}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Username", file: !7, line: 28, baseType: !102, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Passwordhash", file: !7, line: 28, baseType: !102, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Sshkeybytes", file: !7, line: 28, baseType: !102, size: 64, align: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 28, baseType: !137, size: 192, align: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 28, baseType: !137, size: 192, align: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ServerResponse", file: !7, line: 28, baseType: !225, size: 64, align: 64, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServerResponse", file: !7, line: 28, size: 448, align: 8, elements: !227)
!227 = !{!228, !233, !236, !246, !204}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Challenge", file: !7, line: 28, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHChallenge", file: !7, line: 28, size: 384, align: 8, elements: !231)
!231 = !{!232, !222}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Challenge", file: !7, line: 28, baseType: !137, size: 192, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "VerificationFailure", file: !7, line: 28, baseType: !234, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHVerificationFailure", file: !7, line: 28, size: 192, align: 8, elements: !213)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Credentials", file: !7, line: 28, baseType: !237, size: 64, align: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "STSCredentials", file: !7, line: 28, size: 448, align: 8, elements: !239)
!239 = !{!240, !241, !242, !243, !204}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "AccessKeyId", file: !7, line: 28, baseType: !102, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "SecretAccessKey", file: !7, line: 28, baseType: !102, size: 64, align: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "AccessToken", file: !7, line: 28, baseType: !102, size: 64, align: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Expiration", file: !7, line: 28, baseType: !244, size: 64, align: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "TokenRequest", file: !7, line: 28, baseType: !247, size: 64, align: 64, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "MFATokenRequest", file: !7, line: 28, size: 192, align: 8, elements: !213)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "AgentRequest", file: !7, line: 28, baseType: !250, size: 64, align: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "AgentRequest", file: !7, line: 28, size: 576, align: 8, elements: !252)
!252 = !{!253, !254, !255, !256, !257}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "SshAgentSock", file: !7, line: 28, baseType: !102, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "AssumeRole", file: !7, line: 28, baseType: !192, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserCredentials", file: !7, line: 28, baseType: !211, size: 64, align: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "SshKeyFile", file: !7, line: 28, baseType: !137, size: 192, align: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 28, baseType: !137, size: 192, align: 64, offset: 384)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "AgentResponse", file: !7, line: 28, baseType: !259, size: 64, align: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "AgentResponse", file: !7, line: 28, size: 320, align: 8, elements: !261)
!261 = !{!262, !265, !197}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Success", file: !7, line: 28, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "Success", file: !7, line: 28, size: 192, align: 8, elements: !213)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Failure", file: !7, line: 28, baseType: !266, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "Failure", file: !7, line: 28, size: 256, align: 8, elements: !268)
!268 = !{!269, !186}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorMessage", file: !7, line: 28, baseType: !102, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Success", file: !7, line: 28, baseType: !263, size: 64, align: 64, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Failure", file: !7, line: 28, baseType: !266, size: 64, align: 64, offset: 512)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 28, baseType: !137, size: 192, align: 64, offset: 576)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !65, line: 28, baseType: !72, size: 128, align: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !65, line: 28, baseType: !275, size: 64, align: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!72, !38, !172}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !38, size: 64, align: 64, offset: 64)
!279 = !DILocation(line: 111, column: 2, scope: !50)
!280 = !DILocation(line: 113, column: 9, scope: !52)
!281 = !DILocation(line: 107, column: 62, scope: !52)
!282 = !DILocation(line: 107, column: 7, scope: !52)
!283 = !DILocation(line: 108, column: 6, scope: !52)
!284 = !DILocation(line: 120, column: 3, scope: !52)
!285 = !DILocalVariable(name: "user", scope: !52, file: !7, line: 120, type: !102)
!286 = !DILocation(line: 120, column: 3, scope: !50)
!287 = !DILocation(line: 121, column: 3, scope: !52)
!288 = !DILocalVariable(name: "password", scope: !52, file: !7, line: 121, type: !102)
!289 = !DILocation(line: 121, column: 3, scope: !50)
!290 = !DILocation(line: 123, column: 3, scope: !52)
!291 = !DILocation(line: 42, column: 20, scope: !292, inlinedAt: !296)
!292 = distinct !DILexicalBlock(scope: !293, file: !7, line: 40, column: 1)
!293 = distinct !DISubprogram(name: "main.getAgentSSHKey", scope: null, file: !7, line: 40, type: !294, isLocal: true, isDefinition: true, scopeLine: 40, isOptimized: false, unit: !1, retainedNodes: !3)
!294 = !DISubroutineType(types: !295)
!295 = !{!53}
!296 = distinct !DILocation(line: 126, column: 11, scope: !52)
!297 = !DILocalVariable(name: "sshAuthSock", scope: !292, file: !7, line: 42, type: !53)
!298 = !DILocation(line: 42, column: 2, scope: !293, inlinedAt: !296)
!299 = !DILocation(line: 43, column: 16, scope: !292, inlinedAt: !296)
!300 = !DILocalVariable(name: "d", scope: !292, file: !7, line: 43, type: !301)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !7, line: 24, size: 128, align: 8, elements: !302)
!302 = !{!303, !278}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 24, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)Addr,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void)Addr,*func(*void,Time)error,*func(*void,Time)error,*func(*void,Time)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !65, size: 576, align: 8, elements: !306)
!306 = !{!307, !308, !309, !321, !329, !330, !367, !368, !369}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !65, line: 24, baseType: !79, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !65, line: 24, baseType: !162, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "LocalAddr", file: !65, line: 24, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!313, !38}
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "Addr", file: !7, line: 24, size: 128, align: 8, elements: !314)
!314 = !{!315, !278}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 24, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)string}", file: !65, size: 192, align: 8, elements: !318)
!318 = !{!307, !319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Network", file: !65, line: 24, baseType: !123, size: 64, align: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !65, line: 24, baseType: !123, size: 64, align: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !65, line: 24, baseType: !322, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!325, !38, !137}
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !65, size: 192, align: 8, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !65, line: 24, baseType: !58, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !65, line: 24, baseType: !72, size: 128, align: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !65, line: 24, baseType: !310, size: 64, align: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "SetDeadline", file: !65, line: 24, baseType: !331, size: 64, align: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!72, !38, !334}
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 23, size: 192, align: 8, elements: !335)
!335 = !{!336, !338, !339}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 23, baseType: !337, size: 64, align: 64)
!337 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 23, baseType: !245, size: 64, align: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 23, baseType: !340, size: 64, align: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 23, size: 704, align: 8, elements: !342)
!342 = !{!343, !344, !353, !364, !365, !366}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 23, baseType: !53, size: 128, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 23, baseType: !345, size: 192, align: 64, offset: 128)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !65, size: 192, align: 8, elements: !346)
!346 = !{!347, !119, !120}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !65, line: 1, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 23, size: 256, align: 8, elements: !350)
!350 = !{!343, !351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 23, baseType: !58, size: 64, align: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 23, baseType: !23, size: 8, align: 8, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 23, baseType: !354, size: 192, align: 64, offset: 320)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !65, size: 192, align: 8, elements: !355)
!355 = !{!356, !119, !120}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !65, line: 1, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 23, size: 128, align: 8, elements: !359)
!359 = !{!360, !361, !362, !363}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 23, baseType: !245, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 23, baseType: !13, size: 8, align: 8, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 23, baseType: !23, size: 8, align: 8, offset: 72)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 23, baseType: !23, size: 8, align: 8, offset: 80)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 23, baseType: !245, size: 64, align: 64, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 23, baseType: !245, size: 64, align: 64, offset: 576)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 23, baseType: !348, size: 64, align: 64, offset: 640)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "SetReadDeadline", file: !65, line: 24, baseType: !331, size: 64, align: 64, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "SetWriteDeadline", file: !65, line: 24, baseType: !331, size: 64, align: 64, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !65, line: 24, baseType: !322, size: 64, align: 64, offset: 512)
!370 = !DILocation(line: 43, column: 2, scope: !293, inlinedAt: !296)
!371 = !DILocalVariable(name: "err", scope: !292, file: !7, line: 43, type: !72)
!372 = !DILocation(line: 44, column: 9, scope: !292, inlinedAt: !296)
!373 = !DILocalVariable(name: "$ret0", scope: !293, file: !7, line: 40, type: !53)
!374 = !DILocation(line: 40, column: 23, scope: !293, inlinedAt: !296)
!375 = !DILocation(line: 45, column: 3, scope: !292, inlinedAt: !296)
!376 = !DILocation(line: 48, column: 27, scope: !292, inlinedAt: !296)
!377 = !DILocation(line: 48, column: 17, scope: !292, inlinedAt: !296)
!378 = !DILocalVariable(name: "agent", scope: !292, file: !7, line: 48, type: !379)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "Agent", file: !7, line: 33, size: 128, align: 8, elements: !380)
!380 = !{!381, !278}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 33, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,AddedKey)error,*func(*void)struct{struct{**Key,int,int},error},*func(*void,struct{*uint8,int,int})error,*func(*void,PublicKey)error,*func(*void)error,*func(*void,PublicKey,struct{*uint8,int,int})struct{*Signature,error},*func(*void)struct{struct{*Signer,int,int},error},*func(*void,struct{*uint8,int,int})error}", file: !65, size: 576, align: 8, elements: !384)
!384 = !{!385, !386, !456, !474, !478, !482, !483, !491, !531}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !65, line: 33, baseType: !79, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Add", file: !65, line: 33, baseType: !387, size: 64, align: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!72, !38, !390}
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "AddedKey", file: !7, line: 33, size: 384, align: 8, elements: !391)
!391 = !{!392, !396, !453, !454, !455}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "PrivateKey", file: !7, line: 33, baseType: !393, size: 128, align: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "Token", file: !7, line: 21, size: 128, align: 8, elements: !394)
!394 = !{!395, !278}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !7, line: 1, baseType: !79, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Certificate", file: !7, line: 33, baseType: !397, size: 64, align: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !7, line: 32, size: 1408, align: 8, elements: !399)
!399 = !{!400, !401, !423, !424, !425, !426, !430, !431, !432, !450, !451, !452}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Nonce", file: !7, line: 32, baseType: !137, size: 192, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Key", file: !7, line: 32, baseType: !402, size: 128, align: 64, offset: 192)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "PublicKey", file: !7, line: 32, size: 128, align: 8, elements: !403)
!403 = !{!404, !278}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 32, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{*uint8,int,int},*func(*void)string,*func(*void,struct{*uint8,int,int},*Signature)error}", file: !65, size: 256, align: 8, elements: !407)
!407 = !{!408, !409, !413, !414}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !65, line: 32, baseType: !79, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Marshal", file: !65, line: 32, baseType: !410, size: 64, align: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!137, !38}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !65, line: 32, baseType: !123, size: 64, align: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Verify", file: !65, line: 32, baseType: !415, size: 64, align: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!72, !38, !137, !418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "Signature", file: !7, line: 32, size: 320, align: 8, elements: !420)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Format", file: !7, line: 32, baseType: !53, size: 128, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Blob", file: !7, line: 32, baseType: !137, size: 192, align: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Serial", file: !7, line: 32, baseType: !337, size: 64, align: 64, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "CertType", file: !7, line: 32, baseType: !27, size: 32, align: 32, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "KeyId", file: !7, line: 32, baseType: !53, size: 128, align: 64, offset: 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ValidPrincipals", file: !7, line: 32, baseType: !427, size: 192, align: 64, offset: 576)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !65, size: 192, align: 8, elements: !428)
!428 = !{!429, !119, !120}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !65, line: 1, baseType: !102, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ValidAfter", file: !7, line: 32, baseType: !337, size: 64, align: 64, offset: 768)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ValidBefore", file: !7, line: 32, baseType: !337, size: 64, align: 64, offset: 832)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Permissions", file: !7, line: 32, baseType: !433, size: 128, align: 64, offset: 896)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "Permissions", file: !7, line: 32, size: 128, align: 8, elements: !434)
!434 = !{!435, !449}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "CriticalOptions", file: !7, line: 32, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !26, line: 1, size: 384, align: 8, elements: !438)
!438 = !{!439, !440, !441, !442, !444, !445, !446, !447, !448}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !26, line: 1, baseType: !58, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !26, line: 1, baseType: !13, size: 8, align: 8, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !26, line: 1, baseType: !13, size: 8, align: 8, offset: 72)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !26, line: 1, baseType: !443, size: 16, align: 16, offset: 80)
!443 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !26, line: 1, baseType: !27, size: 32, align: 32, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !26, line: 1, baseType: !38, size: 64, align: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !26, line: 1, baseType: !38, size: 64, align: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !26, line: 1, baseType: !37, size: 64, align: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !26, line: 1, baseType: !38, size: 64, align: 64, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !7, line: 32, baseType: !436, size: 64, align: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", file: !7, line: 32, baseType: !137, size: 192, align: 64, offset: 1024)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureKey", file: !7, line: 32, baseType: !402, size: 128, align: 64, offset: 1216)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !7, line: 32, baseType: !418, size: 64, align: 64, offset: 1344)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Comment", file: !7, line: 33, baseType: !53, size: 128, align: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "LifetimeSecs", file: !7, line: 33, baseType: !27, size: 32, align: 32, offset: 320)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ConfirmBeforeUse", file: !7, line: 33, baseType: !23, size: 8, align: 8, offset: 352)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "List", file: !65, line: 33, baseType: !457, size: 64, align: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!460, !38}
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{**Key,int,int},error}", file: !65, size: 320, align: 8, elements: !461)
!461 = !{!462, !473}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !65, line: 33, baseType: !463, size: 192, align: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Key,int,int}", file: !65, size: 192, align: 8, elements: !464)
!464 = !{!465, !119, !120}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !65, line: 1, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !7, line: 33, size: 448, align: 8, elements: !469)
!469 = !{!470, !471, !472}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Format", file: !7, line: 33, baseType: !53, size: 128, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Blob", file: !7, line: 33, baseType: !137, size: 192, align: 64, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "Comment", file: !7, line: 33, baseType: !53, size: 128, align: 64, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !65, line: 33, baseType: !72, size: 128, align: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", file: !65, line: 33, baseType: !475, size: 64, align: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!72, !38, !137}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Remove", file: !65, line: 33, baseType: !479, size: 64, align: 64, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!72, !38, !402}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "RemoveAll", file: !65, line: 33, baseType: !162, size: 64, align: 64, offset: 320)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "Sign", file: !65, line: 33, baseType: !484, size: 64, align: 64, offset: 384)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!487, !38, !402, !137}
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Signature,error}", file: !65, size: 192, align: 8, elements: !488)
!488 = !{!489, !490}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !65, line: 32, baseType: !418, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !65, line: 32, baseType: !72, size: 128, align: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Signers", file: !65, line: 33, baseType: !492, size: 64, align: 64, offset: 448)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!495, !38}
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*Signer,int,int},error}", file: !65, size: 320, align: 8, elements: !496)
!496 = !{!497, !473}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !65, line: 33, baseType: !498, size: 192, align: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Signer,int,int}", file: !65, size: 192, align: 8, elements: !499)
!499 = !{!500, !119, !120}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !65, line: 1, baseType: !501, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "Signer", file: !7, line: 32, size: 128, align: 8, elements: !503)
!503 = !{!504, !278}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 32, baseType: !505, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)PublicKey,*func(*void,Reader,struct{*uint8,int,int})struct{*Signature,error}}", file: !65, size: 192, align: 8, elements: !507)
!507 = !{!408, !508, !512}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !65, line: 32, baseType: !509, size: 64, align: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!402, !38}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "Sign", file: !65, line: 32, baseType: !513, size: 64, align: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!487, !38, !516, !137}
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !7, line: 20, size: 128, align: 8, elements: !517)
!517 = !{!518, !278}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 20, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !65, size: 128, align: 8, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !65, line: 20, baseType: !79, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !65, line: 20, baseType: !524, size: 64, align: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!527, !38, !137}
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !65, size: 192, align: 8, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !65, line: 20, baseType: !58, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !65, line: 20, baseType: !72, size: 128, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Unlock", file: !65, line: 33, baseType: !475, size: 64, align: 64, offset: 512)
!532 = !DILocation(line: 48, column: 2, scope: !293, inlinedAt: !296)
!533 = !DILocation(line: 50, column: 18, scope: !292, inlinedAt: !296)
!534 = !DILocalVariable(name: "keys", scope: !292, file: !7, line: 50, type: !463)
!535 = !DILocation(line: 50, column: 2, scope: !293, inlinedAt: !296)
!536 = !DILocation(line: 51, column: 15, scope: !292, inlinedAt: !296)
!537 = !DILocation(line: 54, column: 47, scope: !292, inlinedAt: !296)
!538 = !DILocation(line: 54, column: 50, scope: !292, inlinedAt: !296)
!539 = !DILocation(line: 54, column: 16, scope: !292, inlinedAt: !296)
!540 = !DILocation(line: 54, column: 27, scope: !292, inlinedAt: !296)
!541 = !DILocation(line: 54, column: 2, scope: !292, inlinedAt: !296)
!542 = !DILocation(line: 126, column: 11, scope: !52)
!543 = !DILocation(line: 126, column: 9, scope: !52)
!544 = !DILocation(line: 114, column: 60, scope: !52)
!545 = !DILocation(line: 114, column: 7, scope: !52)
!546 = !DILocation(line: 115, column: 6, scope: !52)
!547 = !DILocalVariable(name: "sshKey", scope: !52, file: !7, line: 123, type: !102)
!548 = !DILocation(line: 123, column: 3, scope: !50)
!549 = !DILocation(line: 127, column: 12, scope: !52)
!550 = !DILocation(line: 72, column: 29, scope: !551, inlinedAt: !553)
!551 = distinct !DILexicalBlock(scope: !552, file: !7, line: 71, column: 1)
!552 = distinct !DISubprogram(name: "main.getUserHomeDirSSHKey", scope: null, file: !7, line: 71, type: !294, isLocal: true, isDefinition: true, scopeLine: 71, isOptimized: false, unit: !1, retainedNodes: !3)
!553 = distinct !DILocation(line: 128, column: 12, scope: !52)
!554 = !DILocalVariable(name: "sshDir", scope: !551, file: !7, line: 72, type: !53)
!555 = !DILocation(line: 72, column: 2, scope: !552, inlinedAt: !553)
!556 = !DILocalVariable(name: "homeErr", scope: !551, file: !7, line: 72, type: !72)
!557 = !DILocation(line: 73, column: 13, scope: !551, inlinedAt: !553)
!558 = !DILocalVariable(name: "$ret3", scope: !552, file: !7, line: 71, type: !53)
!559 = !DILocation(line: 71, column: 29, scope: !552, inlinedAt: !553)
!560 = !DILocation(line: 74, column: 3, scope: !551, inlinedAt: !553)
!561 = !DILocalVariable(name: "file", scope: !562, file: !7, line: 79, type: !53)
!562 = distinct !DILexicalBlock(scope: !551, file: !7, line: 79, column: 2)
!563 = !DILocation(line: 79, column: 6, scope: !551, inlinedAt: !553)
!564 = !DILocation(line: 57, column: 17, scope: !565, inlinedAt: !572)
!565 = distinct !DISubprogram(name: "main.loadPubKey", scope: null, file: !7, line: 57, type: !566, isLocal: true, isDefinition: true, scopeLine: 57, isOptimized: false, unit: !1, retainedNodes: !3)
!566 = !DISubroutineType(types: !567)
!567 = !{!568, !53, !53}
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !65, size: 256, align: 8, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !65, line: 57, baseType: !53, size: 128, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !65, line: 57, baseType: !72, size: 128, align: 64, offset: 128)
!572 = distinct !DILocation(line: 80, column: 15, scope: !573, inlinedAt: !553)
!573 = distinct !DILexicalBlock(scope: !562, file: !7, line: 79, column: 33)
!574 = !DILocalVariable(name: "file", arg: 1, scope: !565, file: !7, line: 57, type: !53)
!575 = !DILocalVariable(name: "path", arg: 2, scope: !565, file: !7, line: 57, type: !53)
!576 = !DILocation(line: 57, column: 30, scope: !565, inlinedAt: !572)
!577 = !DILocation(line: 58, column: 23, scope: !578, inlinedAt: !572)
!578 = distinct !DILexicalBlock(scope: !565, file: !7, line: 57, column: 1)
!579 = !DILocalVariable(name: "filePath", scope: !578, file: !7, line: 58, type: !53)
!580 = !DILocation(line: 58, column: 2, scope: !565, inlinedAt: !572)
!581 = !DILocation(line: 60, column: 29, scope: !578, inlinedAt: !572)
!582 = !DILocalVariable(name: "err", scope: !578, file: !7, line: 60, type: !72)
!583 = !DILocation(line: 60, column: 2, scope: !565, inlinedAt: !572)
!584 = !DILocation(line: 61, column: 9, scope: !578, inlinedAt: !572)
!585 = !DILocalVariable(name: "$ret1", scope: !565, file: !7, line: 57, type: !53)
!586 = !DILocation(line: 57, column: 44, scope: !565, inlinedAt: !572)
!587 = !DILocalVariable(name: "$ret2", scope: !565, file: !7, line: 57, type: !72)
!588 = !DILocation(line: 57, column: 52, scope: !565, inlinedAt: !572)
!589 = !DILocation(line: 62, column: 3, scope: !578, inlinedAt: !572)
!590 = !DILocalVariable(name: "sshKeyBytes", scope: !578, file: !7, line: 60, type: !137)
!591 = !DILocation(line: 64, column: 25, scope: !578, inlinedAt: !572)
!592 = !DILocation(line: 65, column: 9, scope: !578, inlinedAt: !572)
!593 = !DILocation(line: 66, column: 3, scope: !578, inlinedAt: !572)
!594 = !DILocalVariable(name: "k", scope: !578, file: !7, line: 64, type: !402)
!595 = !DILocation(line: 64, column: 2, scope: !565, inlinedAt: !572)
!596 = !DILocation(line: 68, column: 44, scope: !578, inlinedAt: !572)
!597 = !DILocation(line: 68, column: 16, scope: !578, inlinedAt: !572)
!598 = !DILocation(line: 68, column: 27, scope: !578, inlinedAt: !572)
!599 = !DILocation(line: 68, column: 2, scope: !578, inlinedAt: !572)
!600 = !DILocalVariable(name: "err", scope: !573, file: !7, line: 80, type: !72)
!601 = !DILocation(line: 80, column: 3, scope: !562, inlinedAt: !553)
!602 = !DILocation(line: 85, column: 3, scope: !573, inlinedAt: !553)
!603 = !DILocation(line: 128, column: 12, scope: !52)
!604 = !DILocation(line: 128, column: 10, scope: !52)
!605 = !DILocation(line: 131, column: 12, scope: !52)
!606 = !DILocation(line: 132, column: 7, scope: !52)
!607 = !DILocation(line: 133, column: 6, scope: !52)
!608 = !DILocation(line: 138, column: 12, scope: !52)
!609 = !DILocation(line: 138, column: 7, scope: !52)
!610 = !DILocation(line: 139, column: 10, scope: !52)
!611 = !DILocation(line: 140, column: 7, scope: !52)
!612 = !DILocation(line: 141, column: 7, scope: !52)
!613 = !DILocation(line: 143, column: 16, scope: !52)
!614 = !DILocation(line: 143, column: 11, scope: !52)
!615 = !DILocation(line: 144, column: 14, scope: !52)
!616 = !DILocation(line: 145, column: 7, scope: !52)
!617 = !DILocation(line: 146, column: 31, scope: !52)
!618 = !DILocalVariable(name: "passwordBytes", scope: !52, file: !7, line: 122, type: !137)
!619 = !DILocation(line: 122, column: 3, scope: !50)
!620 = !DILocation(line: 147, column: 10, scope: !52)
!621 = !DILocation(line: 155, column: 16, scope: !52)
!622 = !DILocalVariable(name: "hasher", scope: !52, file: !7, line: 155, type: !623)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "Hash", file: !7, line: 19, size: 128, align: 8, elements: !624)
!624 = !{!625, !278}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 19, baseType: !626, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void)void,*func(*void)int,*func(*void,struct{*uint8,int,int})struct{*uint8,int,int},*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !65, size: 384, align: 8, elements: !628)
!628 = !{!629, !630, !634, !638, !639, !643}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !65, line: 19, baseType: !79, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "BlockSize", file: !65, line: 19, baseType: !631, size: 64, align: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!58, !38}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", file: !65, line: 19, baseType: !635, size: 64, align: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!31, !38}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !65, line: 19, baseType: !631, size: 64, align: 64, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Sum", file: !65, line: 19, baseType: !640, size: 64, align: 64, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!137, !38, !137}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !65, line: 19, baseType: !644, size: 64, align: 64, offset: 320)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!647, !38, !137}
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !65, size: 192, align: 8, elements: !648)
!648 = !{!649, !650}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !65, line: 19, baseType: !58, size: 64, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !65, line: 19, baseType: !72, size: 128, align: 64, offset: 64)
!651 = !DILocation(line: 155, column: 2, scope: !50)
!652 = !DILocation(line: 156, column: 8, scope: !52)
!653 = !DILocation(line: 156, column: 21, scope: !52)
!654 = !DILocation(line: 159, column: 76, scope: !52)
!655 = !DILocation(line: 159, column: 43, scope: !52)
!656 = !DILocation(line: 159, column: 54, scope: !52)
!657 = !DILocation(line: 159, column: 17, scope: !52)
!658 = !DILocation(line: 159, column: 11, scope: !52)
!659 = !DILocation(line: 151, column: 34, scope: !52)
!660 = !DILocation(line: 148, column: 66, scope: !52)
!661 = !DILocation(line: 148, column: 8, scope: !52)
!662 = !DILocation(line: 149, column: 7, scope: !52)
!663 = !DILocation(line: 151, column: 14, scope: !52)
!664 = !DILocation(line: 151, column: 12, scope: !52)
!665 = !DILocation(line: 163, column: 15, scope: !52)
!666 = !DILocation(line: 163, column: 25, scope: !52)
!667 = !DILocation(line: 162, column: 18, scope: !52)
!668 = !DILocation(line: 162, column: 28, scope: !52)
!669 = !DILocation(line: 161, column: 17, scope: !52)
!670 = !DILocation(line: 161, column: 27, scope: !52)
!671 = !DILocalVariable(name: "testMessage", scope: !52, file: !7, line: 161, type: !172)
!672 = !DILocation(line: 161, column: 2, scope: !50)
!673 = !DILocation(line: 171, column: 3, scope: !52)
!674 = !DILocation(line: 173, column: 20, scope: !52)
!675 = !DILocalVariable(name: "response", scope: !52, file: !7, line: 173, type: !172)
!676 = !DILocation(line: 173, column: 2, scope: !50)
!677 = !DILocation(line: 174, column: 9, scope: !52)
!678 = !DILocation(line: 177, column: 20, scope: !52)
!679 = !DILocation(line: 175, column: 63, scope: !52)
!680 = !DILocation(line: 175, column: 7, scope: !52)
!681 = !DILocation(line: 176, column: 6, scope: !52)
!682 = !DILocation(line: 177, column: 27, scope: !52)
!683 = !DILocation(line: 181, column: 7, scope: !52)
!684 = !DILocation(line: 178, column: 7, scope: !52)
!685 = !DILocation(line: 179, column: 6, scope: !52)
!686 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", scope: null, file: !26, line: 1, type: !35, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!687 = !DILocalVariable(name: "key", arg: 1, scope: !686, file: !26, line: 1, type: !38)
!688 = !DILocation(line: 1, column: 1, scope: !686)
!689 = !DILocalVariable(name: "seed", arg: 2, scope: !686, file: !26, line: 1, type: !37)
!690 = !DILocalVariable(name: "$ret22", scope: !686, file: !26, line: 1, type: !37)
!691 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", scope: null, file: !26, line: 1, type: !44, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!692 = !DILocalVariable(name: "key1", arg: 1, scope: !691, file: !26, line: 1, type: !38)
!693 = !DILocation(line: 1, column: 1, scope: !691)
!694 = !DILocalVariable(name: "key2", arg: 2, scope: !691, file: !26, line: 1, type: !38)
!695 = !DILocalVariable(name: "$ret23", scope: !691, file: !26, line: 1, type: !23)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "main"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "main"
	.ascii ";\n"
	.ascii "import "
	.ascii "md5"
	.ascii " "
	.ascii "crypto/md5"
	.ascii " \""
	.ascii "crypto/md5"
	.ascii "\";\n"
	.ascii "import "
	.ascii "base64"
	.ascii " "
	.ascii "encoding/base64"
	.ascii " \""
	.ascii "encoding/base64"
	.ascii "\";\n"
	.ascii "import "
	.ascii "json"
	.ascii " "
	.ascii "encoding/json"
	.ascii " \""
	.ascii "encoding/json"
	.ascii "\";\n"
	.ascii "import "
	.ascii "fmt"
	.ascii " "
	.ascii "fmt"
	.ascii " \""
	.ascii "fmt"
	.ascii "\";\n"
	.ascii "import "
