; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22rgbterm\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/AdRoll/hologram/vendor/github.com/aybabtme/rgbterm\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/aybabtme/rgbterm\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22syslog\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22log/syslog\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22log/syslog\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./log.go", directory: "/home/wangcong/go_path/src/github.com/AdRoll/hologram/log")
!3 = !{}
!4 = !{!5, !94, !96}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.internalLog", linkageName: "command_line_arguments.internalLog", scope: !1, file: !7, line: 41, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "log.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.logMux", file: !10, line: 26, size: 256, align: 8, elements: !11)
!10 = !DIFile(filename: "mux.go", directory: ".")
!11 = !{!12, !93}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "sinks", file: !10, line: 27, baseType: !13, size: 192, align: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Sink,int,int}", file: !14, size: 192, align: 8, elements: !15)
!14 = !DIFile(filename: "", directory: "")
!15 = !{!16, !82, !83}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "Sink", file: !7, line: 58, size: 128, align: 8, elements: !19)
!19 = !{!20, !92}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 58, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)void,*func(*void,string)void,*func(*void,string)void,*func(*void,string)void}", file: !14, size: 320, align: 8, elements: !23)
!23 = !{!24, !85, !89, !90, !91}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 58, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !27, line: 1, size: 576, align: 8, elements: !28)
!27 = !DIFile(filename: "<built-in>", directory: "")
!28 = !{!29, !31, !32, !34, !36, !37, !38, !48, !57, !59, !66, !84}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !27, line: 1, baseType: !30, size: 64, align: 64)
!30 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !27, line: 1, baseType: !30, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !27, line: 1, baseType: !33, size: 32, align: 32, offset: 128)
!33 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !27, line: 1, baseType: !35, size: 8, align: 8, offset: 160)
!35 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !27, line: 1, baseType: !35, size: 8, align: 8, offset: 168)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !27, line: 1, baseType: !35, size: 8, align: 8, offset: 176)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !27, line: 1, baseType: !39, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !27, line: 1, size: 64, align: 8, elements: !41)
!41 = !{!42}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !27, line: 1, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!30, !46, !30}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIBasicType(name: "void")
!48 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !27, line: 1, baseType: !49, size: 64, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !27, line: 1, size: 64, align: 8, elements: !51)
!51 = !{!52}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !27, line: 1, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !46, !46}
!56 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !27, line: 1, baseType: !58, size: 64, align: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !27, line: 1, baseType: !60, size: 64, align: 64, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !27, line: 1, size: 128, align: 8, elements: !62)
!62 = !{!63, !64}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !27, line: 1, baseType: !58, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !27, line: 1, baseType: !65, size: 64, align: 64, offset: 64)
!65 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !27, line: 1, baseType: !67, size: 64, align: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !27, line: 1, size: 320, align: 8, elements: !69)
!69 = !{!70, !71, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !27, line: 1, baseType: !60, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !27, line: 1, baseType: !60, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !27, line: 1, baseType: !73, size: 192, align: 64, offset: 128)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !14, size: 192, align: 8, elements: !74)
!74 = !{!75, !82, !83}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !27, line: 1, size: 320, align: 8, elements: !78)
!78 = !{!70, !71, !79, !80, !81}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !27, line: 1, baseType: !46, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !27, line: 1, baseType: !46, size: 64, align: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !27, line: 1, baseType: !46, size: 64, align: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !14, line: 1, baseType: !65, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !14, line: 1, baseType: !65, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !27, line: 1, baseType: !46, size: 64, align: 64, offset: 512)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Debug", file: !14, line: 58, baseType: !86, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!47, !46, !61}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !14, line: 58, baseType: !86, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Info", file: !14, line: 58, baseType: !86, size: 64, align: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Warning", file: !14, line: 58, baseType: !86, size: 64, align: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !46, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "debugMode", file: !10, line: 28, baseType: !56, size: 8, align: 8, offset: 192)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "command_line_arguments.debugMode", linkageName: "command_line_arguments.debugMode", scope: !1, file: !7, line: 42, type: !56, isLocal: true, isDefinition: true)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !27, line: 1, type: !33, isLocal: false, isDefinition: true)
!98 = distinct !DISubprogram(name: "log.command_line_arguments..init0", linkageName: "command_line_arguments.command_line_arguments..init0", scope: null, file: !7, line: 48, type: !99, isLocal: false, isDefinition: true, scopeLine: 48, isOptimized: false, unit: !1, retainedNodes: !3)
!99 = !DISubroutineType(types: !100)
!100 = !{!47}
!101 = !DILocation(line: 49, column: 16, scope: !98)
!102 = !DILocation(line: 49, column: 14, scope: !98)
!103 = !DILocation(line: 50, column: 18, scope: !98)
!104 = !DILocation(line: 50, column: 2, scope: !98)
!105 = !DILocation(line: 50, column: 13, scope: !98)
!106 = !DILocalVariable(name: "$ret2", scope: !107, file: !108, line: 32, type: !111)
!107 = distinct !DISubprogram(name: "log.NewColourisedTerminalSink", linkageName: "command_line_arguments.NewColourisedTerminalSink", scope: null, file: !108, line: 32, type: !109, isLocal: false, isDefinition: true, scopeLine: 32, isOptimized: false, unit: !1, retainedNodes: !3)
!108 = !DIFile(filename: "terminal.go", directory: ".")
!109 = !DISubroutineType(types: !110)
!110 = !{!111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.terminalSink", file: !108, line: 27, align: 8, elements: !3)
!113 = !DILocation(line: 32, column: 34, scope: !107, inlinedAt: !114)
!114 = distinct !DILocation(line: 51, column: 18, scope: !98)
!115 = !DILocation(line: 33, column: 9, scope: !107, inlinedAt: !114)
!116 = !DILocation(line: 51, column: 2, scope: !98)
!117 = !DILocation(line: 51, column: 18, scope: !98)
!118 = !DILocation(line: 51, column: 13, scope: !98)
!119 = distinct !DISubprogram(name: "log.NewMux", linkageName: "command_line_arguments.NewMux", scope: null, file: !10, line: 31, type: !120, isLocal: false, isDefinition: true, scopeLine: 31, isOptimized: false, unit: !1, retainedNodes: !3)
!120 = !DISubroutineType(types: !121)
!121 = !{!8}
!122 = !DILocalVariable(name: "$ret0", scope: !119, file: !10, line: 31, type: !8)
!123 = !DILocation(line: 31, column: 15, scope: !119)
!124 = !DILocation(line: 32, column: 9, scope: !119)
!125 = !DILocation(line: 32, column: 2, scope: !119)
!126 = distinct !DISubprogram(name: "log.NewSyslogSink", linkageName: "command_line_arguments.NewSyslogSink", scope: null, file: !127, line: 31, type: !128, isLocal: false, isDefinition: true, scopeLine: 31, isOptimized: false, unit: !1, retainedNodes: !3)
!127 = !DIFile(filename: "syslog.go", directory: ".")
!128 = !DISubroutineType(types: !129)
!129 = !{!130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.syslogSink", file: !127, line: 24, size: 64, align: 8, elements: !132)
!132 = !{!133}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "writer", file: !127, line: 25, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !127, line: 18, size: 768, align: 8, elements: !136)
!136 = !{!137, !139, !140, !141, !142, !143, !149}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "priority", file: !127, line: 18, baseType: !138, size: 64, align: 64)
!138 = !DIBasicType(name: "Priority", size: 64, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tag", file: !127, line: 18, baseType: !61, size: 128, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", file: !127, line: 18, baseType: !61, size: 128, align: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "network", file: !127, line: 18, baseType: !61, size: 128, align: 64, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "raddr", file: !127, line: 18, baseType: !61, size: 128, align: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !127, line: 18, baseType: !144, size: 64, align: 32, offset: 576)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !127, line: 18, size: 64, align: 8, elements: !145)
!145 = !{!146, !148}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !127, line: 18, baseType: !147, size: 32, align: 32)
!147 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !127, line: 18, baseType: !33, size: 32, align: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "conn", file: !127, line: 18, baseType: !150, size: 128, align: 64, offset: 640)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: ".log/syslog.serverConn", file: !127, line: 18, size: 128, align: 8, elements: !151)
!151 = !{!152, !177}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !127, line: 18, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,Priority,string,string,string,string)error}", file: !14, size: 192, align: 8, elements: !155)
!155 = !{!156, !157, !173}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 18, baseType: !25, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "close", file: !14, line: 18, baseType: !158, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!161, !46}
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !27, line: 1, size: 128, align: 8, elements: !162)
!162 = !{!163, !172}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !27, line: 1, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !14, size: 128, align: 8, elements: !166)
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 1, baseType: !25, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !14, line: 1, baseType: !169, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!61, !46}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !27, line: 1, baseType: !46, size: 64, align: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "writeString", file: !14, line: 18, baseType: !174, size: 64, align: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!161, !46, !138, !61, !61, !61, !61}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !127, line: 1, baseType: !46, size: 64, align: 64, offset: 64)
!178 = !DILocalVariable(name: "$ret1", scope: !126, file: !127, line: 31, type: !130)
!179 = !DILocation(line: 31, column: 22, scope: !126)
!180 = !DILocation(line: 32, column: 8, scope: !181)
!181 = distinct !DILexicalBlock(scope: !126, file: !127, line: 31, column: 1)
!182 = !DILocalVariable(name: "rs", scope: !181, file: !127, line: 32, type: !130)
!183 = !DILocation(line: 32, column: 2, scope: !126)
!184 = !DILocation(line: 33, column: 24, scope: !181)
!185 = !DILocation(line: 33, column: 4, scope: !181)
!186 = !DILocation(line: 33, column: 15, scope: !181)
!187 = !DILocation(line: 35, column: 2, scope: !181)
!188 = distinct !DISubprogram(name: "log.Debug..1command_line_arguments.syslogSink", linkageName: "command_line_arguments.syslogSink.Debug", scope: null, file: !127, line: 42, type: !189, isLocal: false, isDefinition: true, scopeLine: 42, isOptimized: false, unit: !1, retainedNodes: !3)
!189 = !DISubroutineType(types: !190)
!190 = !{!47, !130, !130, !61}
!191 = !DILocalVariable(name: "ss", arg: 1, scope: !188, file: !127, line: 42, type: !130)
!192 = !DILocation(line: 42, column: 1, scope: !188)
!193 = !DILocalVariable(name: "message", arg: 2, scope: !188, file: !127, line: 42, type: !61)
!194 = !DILocation(line: 42, column: 29, scope: !188)
!195 = !DILocation(line: 43, column: 4, scope: !188)
!196 = !DILocation(line: 43, column: 11, scope: !188)
!197 = distinct !DISubprogram(name: "log.Error..1command_line_arguments.syslogSink", linkageName: "command_line_arguments.syslogSink.Error", scope: null, file: !127, line: 50, type: !189, isLocal: false, isDefinition: true, scopeLine: 50, isOptimized: false, unit: !1, retainedNodes: !3)
!198 = !DILocalVariable(name: "ss", arg: 1, scope: !197, file: !127, line: 50, type: !130)
!199 = !DILocation(line: 50, column: 1, scope: !197)
!200 = !DILocalVariable(name: "message", arg: 2, scope: !197, file: !127, line: 50, type: !61)
!201 = !DILocation(line: 50, column: 29, scope: !197)
!202 = !DILocation(line: 51, column: 4, scope: !197)
!203 = !DILocation(line: 51, column: 11, scope: !197)
!204 = distinct !DISubprogram(name: "log.Info..1command_line_arguments.syslogSink", linkageName: "command_line_arguments.syslogSink.Info", scope: null, file: !127, line: 38, type: !189, isLocal: false, isDefinition: true, scopeLine: 38, isOptimized: false, unit: !1, retainedNodes: !3)
!205 = !DILocalVariable(name: "ss", arg: 1, scope: !204, file: !127, line: 38, type: !130)
!206 = !DILocation(line: 38, column: 1, scope: !204)
!207 = !DILocalVariable(name: "message", arg: 2, scope: !204, file: !127, line: 38, type: !61)
!208 = !DILocation(line: 38, column: 28, scope: !204)
!209 = !DILocation(line: 39, column: 4, scope: !204)
!210 = !DILocation(line: 39, column: 11, scope: !204)
!211 = distinct !DISubprogram(name: "log.Warning..1command_line_arguments.syslogSink", linkageName: "command_line_arguments.syslogSink.Warning", scope: null, file: !127, line: 46, type: !189, isLocal: false, isDefinition: true, scopeLine: 46, isOptimized: false, unit: !1, retainedNodes: !3)
!212 = !DILocalVariable(name: "ss", arg: 1, scope: !211, file: !127, line: 46, type: !130)
!213 = !DILocation(line: 46, column: 1, scope: !211)
!214 = !DILocalVariable(name: "message", arg: 2, scope: !211, file: !127, line: 46, type: !61)
!215 = !DILocation(line: 46, column: 31, scope: !211)
!216 = !DILocation(line: 47, column: 4, scope: !211)
!217 = !DILocation(line: 47, column: 11, scope: !211)
!218 = distinct !DISubprogram(name: "log.Add..1command_line_arguments.logMux", linkageName: "command_line_arguments.logMux.Add", scope: null, file: !10, line: 40, type: !219, isLocal: false, isDefinition: true, scopeLine: 40, isOptimized: false, unit: !1, retainedNodes: !3)
!219 = !DISubroutineType(types: !220)
!220 = !{!47, !8, !8, !18}
!221 = !DILocalVariable(name: "m", arg: 1, scope: !218, file: !10, line: 40, type: !8)
!222 = !DILocation(line: 40, column: 1, scope: !218)
!223 = !DILocation(line: 41, column: 3, scope: !218)
!224 = !DILocation(line: 41, column: 12, scope: !218)
!225 = !DILocation(line: 41, column: 10, scope: !218)
!226 = !DILocation(line: 32, column: 34, scope: !107)
!227 = !DILocation(line: 33, column: 9, scope: !107)
!228 = !DILocation(line: 33, column: 2, scope: !107)
!229 = distinct !DISubprogram(name: "log.Debug..1command_line_arguments.terminalSink", linkageName: "command_line_arguments.terminalSink.Debug", scope: null, file: !108, line: 42, type: !230, isLocal: false, isDefinition: true, scopeLine: 42, isOptimized: false, unit: !1, retainedNodes: !3)
!230 = !DISubroutineType(types: !231)
!231 = !{!47, !111, !111, !61}
!232 = !DILocalVariable(name: "ss", arg: 1, scope: !229, file: !108, line: 42, type: !111)
!233 = !DILocation(line: 42, column: 1, scope: !229)
!234 = !DILocalVariable(name: "message", arg: 2, scope: !229, file: !108, line: 42, type: !61)
!235 = !DILocation(line: 42, column: 31, scope: !229)
!236 = !DILocation(line: 43, column: 22, scope: !237)
!237 = distinct !DILexicalBlock(scope: !229, file: !108, line: 42, column: 1)
!238 = !DILocation(line: 43, column: 27, scope: !237)
!239 = !DILocalVariable(name: "messageTime", scope: !237, file: !108, line: 43, type: !61)
!240 = !DILocation(line: 43, column: 2, scope: !229)
!241 = !DILocation(line: 44, column: 24, scope: !237)
!242 = !DILocalVariable(name: "leveledMessage", scope: !237, file: !108, line: 44, type: !61)
!243 = !DILocation(line: 44, column: 2, scope: !229)
!244 = !DILocation(line: 45, column: 29, scope: !237)
!245 = !DILocalVariable(name: "colouredMessage", scope: !237, file: !108, line: 45, type: !61)
!246 = !DILocation(line: 45, column: 2, scope: !229)
!247 = !DILocation(line: 46, column: 6, scope: !237)
!248 = distinct !DISubprogram(name: "log.Error..1command_line_arguments.terminalSink", linkageName: "command_line_arguments.terminalSink.Error", scope: null, file: !108, line: 56, type: !230, isLocal: false, isDefinition: true, scopeLine: 56, isOptimized: false, unit: !1, retainedNodes: !3)
!249 = !DILocalVariable(name: "ss", arg: 1, scope: !248, file: !108, line: 56, type: !111)
!250 = !DILocation(line: 56, column: 1, scope: !248)
!251 = !DILocalVariable(name: "message", arg: 2, scope: !248, file: !108, line: 56, type: !61)
!252 = !DILocation(line: 56, column: 31, scope: !248)
!253 = !DILocation(line: 57, column: 22, scope: !254)
!254 = distinct !DILexicalBlock(scope: !248, file: !108, line: 56, column: 1)
!255 = !DILocation(line: 57, column: 27, scope: !254)
!256 = !DILocalVariable(name: "messageTime", scope: !254, file: !108, line: 57, type: !61)
!257 = !DILocation(line: 57, column: 2, scope: !248)
!258 = !DILocation(line: 58, column: 24, scope: !254)
!259 = !DILocalVariable(name: "leveledMessage", scope: !254, file: !108, line: 58, type: !61)
!260 = !DILocation(line: 58, column: 2, scope: !248)
!261 = !DILocation(line: 59, column: 29, scope: !254)
!262 = !DILocalVariable(name: "colouredMessage", scope: !254, file: !108, line: 59, type: !61)
!263 = !DILocation(line: 59, column: 2, scope: !248)
!264 = !DILocation(line: 60, column: 6, scope: !254)
!265 = distinct !DISubprogram(name: "log.Info..1command_line_arguments.terminalSink", linkageName: "command_line_arguments.terminalSink.Info", scope: null, file: !108, line: 36, type: !230, isLocal: false, isDefinition: true, scopeLine: 36, isOptimized: false, unit: !1, retainedNodes: !3)
!266 = !DILocalVariable(name: "ss", arg: 1, scope: !265, file: !108, line: 36, type: !111)
!267 = !DILocation(line: 36, column: 1, scope: !265)
!268 = !DILocalVariable(name: "message", arg: 2, scope: !265, file: !108, line: 36, type: !61)
!269 = !DILocation(line: 36, column: 30, scope: !265)
!270 = !DILocation(line: 37, column: 22, scope: !271)
!271 = distinct !DILexicalBlock(scope: !265, file: !108, line: 36, column: 1)
!272 = !DILocation(line: 37, column: 27, scope: !271)
!273 = !DILocalVariable(name: "messageTime", scope: !271, file: !108, line: 37, type: !61)
!274 = !DILocation(line: 37, column: 2, scope: !265)
!275 = !DILocation(line: 38, column: 24, scope: !271)
!276 = !DILocalVariable(name: "leveledMessage", scope: !271, file: !108, line: 38, type: !61)
!277 = !DILocation(line: 38, column: 2, scope: !265)
!278 = !DILocation(line: 39, column: 6, scope: !271)
!279 = distinct !DISubprogram(name: "log.Warning..1command_line_arguments.terminalSink", linkageName: "command_line_arguments.terminalSink.Warning", scope: null, file: !108, line: 49, type: !230, isLocal: false, isDefinition: true, scopeLine: 49, isOptimized: false, unit: !1, retainedNodes: !3)
!280 = !DILocalVariable(name: "ss", arg: 1, scope: !279, file: !108, line: 49, type: !111)
!281 = !DILocation(line: 49, column: 1, scope: !279)
!282 = !DILocalVariable(name: "message", arg: 2, scope: !279, file: !108, line: 49, type: !61)
!283 = !DILocation(line: 49, column: 33, scope: !279)
!284 = !DILocation(line: 50, column: 22, scope: !285)
!285 = distinct !DILexicalBlock(scope: !279, file: !108, line: 49, column: 1)
!286 = !DILocation(line: 50, column: 27, scope: !285)
!287 = !DILocalVariable(name: "messageTime", scope: !285, file: !108, line: 50, type: !61)
!288 = !DILocation(line: 50, column: 2, scope: !279)
!289 = !DILocation(line: 51, column: 24, scope: !285)
!290 = !DILocalVariable(name: "leveledMessage", scope: !285, file: !108, line: 51, type: !61)
!291 = !DILocation(line: 51, column: 2, scope: !279)
!292 = !DILocation(line: 52, column: 29, scope: !285)
!293 = !DILocalVariable(name: "colouredMessage", scope: !285, file: !108, line: 52, type: !61)
!294 = !DILocation(line: 52, column: 2, scope: !279)
!295 = !DILocation(line: 53, column: 6, scope: !285)
!296 = distinct !DISubprogram(name: "log.Info", linkageName: "command_line_arguments.Info", scope: null, file: !7, line: 70, type: !297, isLocal: false, isDefinition: true, scopeLine: 70, isOptimized: false, unit: !1, retainedNodes: !3)
!297 = !DISubroutineType(types: !298)
!298 = !{!47, !61, !299}
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*void},int,int}", file: !14, size: 192, align: 8, elements: !300)
!300 = !{!301, !82, !83}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !302, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !14, size: 128, align: 8, elements: !304)
!304 = !{!167, !305}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !14, line: 1, baseType: !46, size: 64, align: 64, offset: 64)
!306 = !DILocalVariable(name: "v", arg: 2, scope: !296, file: !7, line: 70, type: !299)
!307 = !DILocation(line: 70, column: 27, scope: !296)
!308 = !DILocalVariable(name: "message", arg: 1, scope: !296, file: !7, line: 70, type: !61)
!309 = !DILocation(line: 70, column: 11, scope: !296)
!310 = !DILocation(line: 73, column: 5, scope: !311)
!311 = distinct !DILexicalBlock(scope: !296, file: !7, line: 70, column: 1)
!312 = !DILocation(line: 73, column: 2, scope: !311)
!313 = !DILocation(line: 74, column: 25, scope: !314)
!314 = distinct !DILexicalBlock(scope: !311, file: !7, line: 73, column: 15)
!315 = !DILocalVariable(name: "sink$0", scope: !314, file: !7, line: 74, type: !30)
!316 = !DILocation(line: 74, column: 3, scope: !311)
!317 = !DILocalVariable(name: "l", scope: !314, file: !7, line: 74, type: !65)
!318 = !DILocalVariable(name: "sink$1", scope: !314, file: !7, line: 74, type: !56)
!319 = !DILocation(line: 75, column: 21, scope: !314)
!320 = !DILocalVariable(name: "fileMessage", scope: !311, file: !7, line: 72, type: !61)
!321 = !DILocation(line: 72, column: 6, scope: !296)
!322 = !DILocation(line: 0, scope: !311)
!323 = !DILocation(line: 79, column: 2, scope: !311)
!324 = !DILocation(line: 79, column: 13, scope: !311)
!325 = distinct !DISubprogram(name: "log.Info..1command_line_arguments.logMux", linkageName: "command_line_arguments.logMux.Info", scope: null, file: !10, line: 47, type: !326, isLocal: false, isDefinition: true, scopeLine: 47, isOptimized: false, unit: !1, retainedNodes: !3)
!326 = !DISubroutineType(types: !327)
!327 = !{!47, !8, !8, !61, !299}
!328 = !DILocalVariable(name: "v", arg: 3, scope: !325, file: !10, line: 47, type: !299)
!329 = !DILocation(line: 47, column: 39, scope: !325)
!330 = !DILocalVariable(name: "m", arg: 1, scope: !325, file: !10, line: 47, type: !8)
!331 = !DILocation(line: 47, column: 1, scope: !325)
!332 = !DILocalVariable(name: "message", arg: 2, scope: !325, file: !10, line: 47, type: !61)
!333 = !DILocation(line: 47, column: 23, scope: !325)
!334 = !DILocation(line: 48, column: 23, scope: !335)
!335 = distinct !DILexicalBlock(scope: !325, file: !10, line: 47, column: 1)
!336 = !DILocalVariable(name: "actualMessage", scope: !335, file: !10, line: 48, type: !61)
!337 = !DILocation(line: 48, column: 2, scope: !325)
!338 = !DILocation(line: 49, column: 24, scope: !339)
!339 = distinct !DILexicalBlock(scope: !335, file: !10, line: 49, column: 2)
!340 = !DILocation(line: 49, column: 2, scope: !339)
!341 = !DILocalVariable(name: "sink", scope: !339, file: !10, line: 49, type: !18)
!342 = !DILocation(line: 49, column: 6, scope: !335)
!343 = !DILocation(line: 50, column: 7, scope: !339)
!344 = distinct !DISubprogram(name: "log.Warning", linkageName: "command_line_arguments.Warning", scope: null, file: !7, line: 82, type: !297, isLocal: false, isDefinition: true, scopeLine: 82, isOptimized: false, unit: !1, retainedNodes: !3)
!345 = !DILocalVariable(name: "v", arg: 2, scope: !344, file: !7, line: 82, type: !299)
!346 = !DILocation(line: 82, column: 30, scope: !344)
!347 = !DILocalVariable(name: "message", arg: 1, scope: !344, file: !7, line: 82, type: !61)
!348 = !DILocation(line: 82, column: 14, scope: !344)
!349 = !DILocation(line: 85, column: 5, scope: !350)
!350 = distinct !DILexicalBlock(scope: !344, file: !7, line: 82, column: 1)
!351 = !DILocation(line: 85, column: 2, scope: !350)
!352 = !DILocation(line: 86, column: 25, scope: !353)
!353 = distinct !DILexicalBlock(scope: !350, file: !7, line: 85, column: 15)
!354 = !DILocalVariable(name: "sink$2", scope: !353, file: !7, line: 86, type: !30)
!355 = !DILocation(line: 86, column: 3, scope: !350)
!356 = !DILocalVariable(name: "l", scope: !353, file: !7, line: 86, type: !65)
!357 = !DILocalVariable(name: "sink$3", scope: !353, file: !7, line: 86, type: !56)
!358 = !DILocation(line: 87, column: 21, scope: !353)
