; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22protocol\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22binary\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/binary\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/binary\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22proto\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/AdRoll/hologram/vendor/github.com/golang/protobuf/proto\22"
module asm "\09.ascii \22 \5C\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./handlers.go", directory: "/home/wangcong/go_path/src/github.com/AdRoll/hologram/protocol")
!3 = !{}
!4 = !{!5, !109, !111, !121, !136, !138, !140, !142, !145}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments._.0", linkageName: "command_line_arguments._.0", scope: !1, file: !7, line: 50, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "hologram.pb.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 46, size: 64, align: 8, elements: !10)
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 46, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !95}
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !16, size: 320, align: 8, elements: !17)
!16 = !DIFile(filename: "", directory: "")
!17 = !{!18, !27}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 46, baseType: !19, size: 192, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !16, size: 192, align: 8, elements: !20)
!20 = !{!21, !24, !26}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !16, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !16, line: 1, baseType: !25, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 46, baseType: !28, size: 128, align: 64, offset: 192)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !29, line: 1, size: 128, align: 8, elements: !30)
!29 = !DIFile(filename: "<built-in>", directory: "")
!30 = !{!31, !94}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !29, line: 1, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !16, size: 128, align: 8, elements: !34)
!34 = !{!35, !90}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 1, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !29, line: 1, size: 576, align: 8, elements: !38)
!38 = !{!39, !41, !42, !44, !45, !46, !47, !57, !66, !67, !73, !89}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !29, line: 1, baseType: !40, size: 64, align: 64)
!40 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !29, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !29, line: 1, baseType: !43, size: 32, align: 32, offset: 128)
!43 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 168)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 176)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !29, line: 1, baseType: !48, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !29, line: 1, size: 64, align: 8, elements: !50)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !29, line: 1, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!40, !55, !40}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIBasicType(name: "void")
!57 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !29, line: 1, baseType: !58, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !29, line: 1, size: 64, align: 8, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !29, line: 1, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !55, !55}
!65 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !29, line: 1, baseType: !22, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !29, line: 1, baseType: !68, size: 64, align: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !29, line: 1, size: 128, align: 8, elements: !70)
!70 = !{!71, !72}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !29, line: 1, baseType: !22, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !29, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !29, line: 1, baseType: !74, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !29, line: 1, size: 320, align: 8, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !29, line: 1, baseType: !68, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !29, line: 1, baseType: !68, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !29, line: 1, baseType: !80, size: 192, align: 64, offset: 128)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !16, size: 192, align: 8, elements: !81)
!81 = !{!82, !24, !26}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !16, line: 1, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !29, line: 1, size: 320, align: 8, elements: !85)
!85 = !{!77, !78, !86, !87, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !16, line: 1, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!69, !55}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !7, line: 46, size: 128, align: 8, elements: !96)
!96 = !{!97, !108}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 46, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void,*func(*void)string}", file: !16, size: 256, align: 8, elements: !100)
!100 = !{!101, !102, !106, !107}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 46, baseType: !36, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMessage", file: !16, line: 46, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!56, !55}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", file: !16, line: 46, baseType: !103, size: 64, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !16, line: 46, baseType: !91, size: 64, align: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !29, line: 1, type: !43, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "command_line_arguments._.1", linkageName: "command_line_arguments._.1", scope: !1, file: !7, line: 51, type: !113, isLocal: false, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 47, size: 64, align: 8, elements: !115)
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 47, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!120, !25}
!120 = !DIBasicType(name: "float64", size: 64, encoding: DW_ATE_float)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "command_line_arguments.Message_Source_name", linkageName: "command_line_arguments.Message_Source_name", scope: !1, file: !7, line: 62, type: !123, isLocal: false, isDefinition: true)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !29, line: 1, size: 384, align: 8, elements: !125)
!125 = !{!126, !127, !128, !129, !131, !132, !133, !134, !135}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !29, line: 1, baseType: !25, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !29, line: 1, baseType: !23, size: 8, align: 8, offset: 72)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !29, line: 1, baseType: !130, size: 16, align: 16, offset: 80)
!130 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !29, line: 1, baseType: !43, size: 32, align: 32, offset: 96)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !29, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !29, line: 1, baseType: !55, size: 64, align: 64, offset: 320)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "command_line_arguments.Message_Source_value", linkageName: "command_line_arguments.Message_Source_value", scope: !1, file: !7, line: 68, type: !123, isLocal: false, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "command_line_arguments.Ping_RequestResponse_name", linkageName: "command_line_arguments.Ping_RequestResponse_name", scope: !1, file: !7, line: 99, type: !123, isLocal: false, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "command_line_arguments.Ping_RequestResponse_value", linkageName: "command_line_arguments.Ping_RequestResponse_value", scope: !1, file: !7, line: 103, type: !123, isLocal: false, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "command_line_arguments.ErrCorruptedMessage", linkageName: "command_line_arguments.ErrCorruptedMessage", scope: !1, file: !144, line: 31, type: !28, isLocal: false, isDefinition: true)
!144 = !DIFile(filename: "wire.go", directory: ".")
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "encoding_binary.LittleEndian", linkageName: "encoding_binary.LittleEndian", scope: !1, file: !144, line: 20, type: !147, isLocal: false, isDefinition: true)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: ".encoding/binary.littleEndian", file: !144, line: 20, align: 8, elements: !3)
!148 = distinct !DISubprogram(name: "protocol.GetRole..1command_line_arguments.AssumeRole", linkageName: "command_line_arguments.AssumeRole.GetRole", scope: null, file: !7, line: 291, type: !149, isLocal: false, isDefinition: true, scopeLine: 291, isOptimized: false, unit: !1, retainedNodes: !3)
!149 = !DISubroutineType(types: !150)
!150 = !{!69, !151, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "AssumeRole", file: !7, line: 274, size: 320, align: 8, elements: !153)
!153 = !{!154, !155, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !7, line: 275, baseType: !68, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Role", file: !7, line: 276, baseType: !68, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 277, baseType: !19, size: 192, align: 64, offset: 128)
!157 = !DILocalVariable(name: "m", arg: 1, scope: !148, file: !7, line: 291, type: !151)
!158 = !DILocation(line: 291, column: 1, scope: !148)
!159 = !DILocation(line: 292, column: 7, scope: !148)
!160 = !DILocation(line: 292, column: 18, scope: !148)
!161 = !DILocation(line: 292, column: 24, scope: !148)
!162 = !DILocalVariable(name: "$ret31", scope: !148, file: !7, line: 291, type: !69)
!163 = !DILocation(line: 291, column: 32, scope: !148)
!164 = !DILocation(line: 295, column: 2, scope: !148)
!165 = !DILocation(line: 293, column: 3, scope: !148)
!166 = distinct !DISubprogram(name: "protocol.GetUser..1command_line_arguments.AssumeRole", linkageName: "command_line_arguments.AssumeRole.GetUser", scope: null, file: !7, line: 284, type: !149, isLocal: false, isDefinition: true, scopeLine: 284, isOptimized: false, unit: !1, retainedNodes: !3)
!167 = !DILocalVariable(name: "m", arg: 1, scope: !166, file: !7, line: 284, type: !151)
!168 = !DILocation(line: 284, column: 1, scope: !166)
!169 = !DILocation(line: 285, column: 7, scope: !166)
!170 = !DILocation(line: 285, column: 18, scope: !166)
!171 = !DILocation(line: 285, column: 24, scope: !166)
!172 = !DILocalVariable(name: "$ret30", scope: !166, file: !7, line: 284, type: !69)
!173 = !DILocation(line: 284, column: 32, scope: !166)
!174 = !DILocation(line: 288, column: 2, scope: !166)
!175 = !DILocation(line: 286, column: 3, scope: !166)
!176 = distinct !DISubprogram(name: "protocol.Reset..1command_line_arguments.AssumeRole", linkageName: "command_line_arguments.AssumeRole.Reset", scope: null, file: !7, line: 280, type: !177, isLocal: false, isDefinition: true, scopeLine: 280, isOptimized: false, unit: !1, retainedNodes: !3)
!177 = !DISubroutineType(types: !178)
!178 = !{!56, !151, !151}
!179 = !DILocalVariable(name: "m", arg: 1, scope: !176, file: !7, line: 280, type: !151)
!180 = !DILocation(line: 280, column: 1, scope: !176)
!181 = !DILocation(line: 280, column: 43, scope: !176)
!182 = distinct !DISubprogram(name: "protocol.String..1command_line_arguments.AssumeRole", linkageName: "command_line_arguments.AssumeRole.String", scope: null, file: !7, line: 281, type: !149, isLocal: false, isDefinition: true, scopeLine: 281, isOptimized: false, unit: !1, retainedNodes: !3)
!183 = !DILocalVariable(name: "m", arg: 1, scope: !182, file: !7, line: 281, type: !151)
!184 = !DILocation(line: 281, column: 1, scope: !182)
!185 = !DILocation(line: 281, column: 71, scope: !182)
!186 = !DILocation(line: 281, column: 53, scope: !182)
!187 = !DILocation(line: 281, column: 40, scope: !182)
!188 = distinct !DISubprogram(name: "protocol.GetAssumeRole..1command_line_arguments.AgentRequest", linkageName: "command_line_arguments.AgentRequest.GetAssumeRole", scope: null, file: !7, line: 511, type: !189, isLocal: false, isDefinition: true, scopeLine: 511, isOptimized: false, unit: !1, retainedNodes: !3)
!189 = !DISubroutineType(types: !190)
!190 = !{!151, !191, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "AgentRequest", file: !7, line: 490, size: 576, align: 8, elements: !193)
!193 = !{!194, !195, !196, !201, !202}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "SshAgentSock", file: !7, line: 491, baseType: !68, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "AssumeRole", file: !7, line: 492, baseType: !151, size: 64, align: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserCredentials", file: !7, line: 493, baseType: !197, size: 64, align: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "GetUserCredentials", file: !7, line: 298, size: 192, align: 8, elements: !199)
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 299, baseType: !19, size: 192, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "SshKeyFile", file: !7, line: 496, baseType: !19, size: 192, align: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 497, baseType: !19, size: 192, align: 64, offset: 384)
!203 = !DILocalVariable(name: "m", arg: 1, scope: !188, file: !7, line: 511, type: !191)
!204 = !DILocation(line: 511, column: 1, scope: !188)
!205 = !DILocalVariable(name: "$ret58", scope: !188, file: !7, line: 511, type: !151)
!206 = !DILocation(line: 511, column: 40, scope: !188)
!207 = !DILocation(line: 512, column: 7, scope: !188)
!208 = !DILocation(line: 515, column: 2, scope: !188)
!209 = !DILocation(line: 513, column: 11, scope: !188)
!210 = !DILocation(line: 513, column: 3, scope: !188)
!211 = distinct !DISubprogram(name: "protocol.Reset..1command_line_arguments.GetUserCredentials", linkageName: "command_line_arguments.GetUserCredentials.Reset", scope: null, file: !7, line: 302, type: !212, isLocal: false, isDefinition: true, scopeLine: 302, isOptimized: false, unit: !1, retainedNodes: !3)
!212 = !DISubroutineType(types: !213)
!213 = !{!56, !197, !197}
!214 = !DILocalVariable(name: "m", arg: 1, scope: !211, file: !7, line: 302, type: !197)
!215 = !DILocation(line: 302, column: 1, scope: !211)
!216 = !DILocation(line: 302, column: 51, scope: !211)
!217 = distinct !DISubprogram(name: "protocol.String..1command_line_arguments.GetUserCredentials", linkageName: "command_line_arguments.GetUserCredentials.String", scope: null, file: !7, line: 303, type: !218, isLocal: false, isDefinition: true, scopeLine: 303, isOptimized: false, unit: !1, retainedNodes: !3)
!218 = !DISubroutineType(types: !219)
!219 = !{!69, !197, !197}
!220 = !DILocalVariable(name: "m", arg: 1, scope: !217, file: !7, line: 303, type: !197)
!221 = !DILocation(line: 303, column: 1, scope: !217)
!222 = !DILocation(line: 303, column: 79, scope: !217)
!223 = !DILocation(line: 303, column: 61, scope: !217)
!224 = !DILocation(line: 303, column: 48, scope: !217)
!225 = distinct !DISubprogram(name: "protocol.GetGetUserCredentials..1command_line_arguments.AgentRequest", linkageName: "command_line_arguments.AgentRequest.GetGetUserCredentials", scope: null, file: !7, line: 518, type: !226, isLocal: false, isDefinition: true, scopeLine: 518, isOptimized: false, unit: !1, retainedNodes: !3)
!226 = !DISubroutineType(types: !227)
!227 = !{!197, !191, !191}
!228 = !DILocalVariable(name: "m", arg: 1, scope: !225, file: !7, line: 518, type: !191)
!229 = !DILocation(line: 518, column: 1, scope: !225)
!230 = !DILocalVariable(name: "$ret59", scope: !225, file: !7, line: 518, type: !197)
!231 = !DILocation(line: 518, column: 48, scope: !225)
!232 = !DILocation(line: 519, column: 7, scope: !225)
!233 = !DILocation(line: 522, column: 2, scope: !225)
!234 = !DILocation(line: 520, column: 11, scope: !225)
!235 = !DILocation(line: 520, column: 3, scope: !225)
!236 = distinct !DISubprogram(name: "protocol.GetSshAgentSock..1command_line_arguments.AgentRequest", linkageName: "command_line_arguments.AgentRequest.GetSshAgentSock", scope: null, file: !7, line: 504, type: !237, isLocal: false, isDefinition: true, scopeLine: 504, isOptimized: false, unit: !1, retainedNodes: !3)
!237 = !DISubroutineType(types: !238)
!238 = !{!69, !191, !191}
!239 = !DILocalVariable(name: "m", arg: 1, scope: !236, file: !7, line: 504, type: !191)
!240 = !DILocation(line: 504, column: 1, scope: !236)
!241 = !DILocation(line: 505, column: 7, scope: !236)
!242 = !DILocation(line: 505, column: 18, scope: !236)
!243 = !DILocation(line: 505, column: 32, scope: !236)
!244 = !DILocalVariable(name: "$ret57", scope: !236, file: !7, line: 504, type: !69)
!245 = !DILocation(line: 504, column: 42, scope: !236)
!246 = !DILocation(line: 508, column: 2, scope: !236)
!247 = !DILocation(line: 506, column: 3, scope: !236)
!248 = distinct !DISubprogram(name: "protocol.GetSshKeyFile..1command_line_arguments.AgentRequest", linkageName: "command_line_arguments.AgentRequest.GetSshKeyFile", scope: null, file: !7, line: 525, type: !249, isLocal: false, isDefinition: true, scopeLine: 525, isOptimized: false, unit: !1, retainedNodes: !3)
!249 = !DISubroutineType(types: !250)
!250 = !{!19, !191, !191}
!251 = !DILocalVariable(name: "m", arg: 1, scope: !248, file: !7, line: 525, type: !191)
!252 = !DILocation(line: 525, column: 1, scope: !248)
!253 = !DILocation(line: 526, column: 7, scope: !248)
!254 = !DILocation(line: 529, column: 2, scope: !248)
!255 = !DILocation(line: 527, column: 11, scope: !248)
!256 = !DILocation(line: 527, column: 3, scope: !248)
!257 = distinct !DISubprogram(name: "protocol.Reset..1command_line_arguments.AgentRequest", linkageName: "command_line_arguments.AgentRequest.Reset", scope: null, file: !7, line: 500, type: !258, isLocal: false, isDefinition: true, scopeLine: 500, isOptimized: false, unit: !1, retainedNodes: !3)
!258 = !DISubroutineType(types: !259)
!259 = !{!56, !191, !191}
!260 = !DILocalVariable(name: "m", arg: 1, scope: !257, file: !7, line: 500, type: !191)
!261 = !DILocation(line: 500, column: 1, scope: !257)
!262 = !DILocation(line: 500, column: 45, scope: !257)
!263 = distinct !DISubprogram(name: "protocol.String..1command_line_arguments.AgentRequest", linkageName: "command_line_arguments.AgentRequest.String", scope: null, file: !7, line: 501, type: !237, isLocal: false, isDefinition: true, scopeLine: 501, isOptimized: false, unit: !1, retainedNodes: !3)
!264 = !DILocalVariable(name: "m", arg: 1, scope: !263, file: !7, line: 501, type: !191)
!265 = !DILocation(line: 501, column: 1, scope: !263)
!266 = !DILocation(line: 501, column: 73, scope: !263)
!267 = !DILocation(line: 501, column: 55, scope: !263)
!268 = !DILocation(line: 501, column: 42, scope: !263)
!269 = distinct !DISubprogram(name: "protocol.GetAgentRequest..1command_line_arguments.Message", linkageName: "command_line_arguments.Message.GetAgentRequest", scope: null, file: !7, line: 180, type: !270, isLocal: false, isDefinition: true, scopeLine: 180, isOptimized: false, unit: !1, retainedNodes: !3)
!270 = !DISubroutineType(types: !271)
!271 = !{!191, !272, !272}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !7, line: 125, size: 768, align: 8, elements: !274)
!274 = !{!275, !276, !279, !287, !315, !347, !348, !364, !365, !366}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !7, line: 126, baseType: !68, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Source", file: !7, line: 128, baseType: !277, size: 64, align: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIBasicType(name: "Message_Source", size: 32, encoding: DW_ATE_signed)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Ping", file: !7, line: 129, baseType: !280, size: 64, align: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ping", file: !7, line: 208, size: 256, align: 8, elements: !282)
!282 = !{!283, !286}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !7, line: 209, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIBasicType(name: "Ping_RequestResponse", size: 32, encoding: DW_ATE_signed)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 210, baseType: !19, size: 192, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ServerRequest", file: !7, line: 130, baseType: !288, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServerRequest", file: !7, line: 226, size: 512, align: 8, elements: !290)
!290 = !{!291, !292, !299, !305, !306, !314}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "AssumeRole", file: !7, line: 227, baseType: !151, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ChallengeResponse", file: !7, line: 228, baseType: !293, size: 64, align: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHChallengeResponse", file: !7, line: 338, size: 448, align: 8, elements: !295)
!295 = !{!296, !297, !298}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !7, line: 339, baseType: !19, size: 192, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Format", file: !7, line: 340, baseType: !68, size: 64, align: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 341, baseType: !19, size: 192, align: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "TokenResponse", file: !7, line: 229, baseType: !300, size: 64, align: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "MFATokenResponse", file: !7, line: 362, size: 256, align: 8, elements: !302)
!302 = !{!303, !304}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "TokenValue", file: !7, line: 363, baseType: !68, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 364, baseType: !19, size: 192, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserCredentials", file: !7, line: 230, baseType: !197, size: 64, align: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "AddSSHkey", file: !7, line: 231, baseType: !307, size: 64, align: 64, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "AddSSHKey", file: !7, line: 306, size: 384, align: 8, elements: !309)
!309 = !{!310, !311, !312, !313}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Username", file: !7, line: 307, baseType: !68, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Passwordhash", file: !7, line: 308, baseType: !68, size: 64, align: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Sshkeybytes", file: !7, line: 309, baseType: !68, size: 64, align: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 310, baseType: !19, size: 192, align: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 232, baseType: !19, size: 192, align: 64, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ServerResponse", file: !7, line: 131, baseType: !316, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServerResponse", file: !7, line: 378, size: 448, align: 8, elements: !318)
!318 = !{!319, !325, !330, !341, !346}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Challenge", file: !7, line: 379, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHChallenge", file: !7, line: 418, size: 384, align: 8, elements: !322)
!322 = !{!323, !324}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Challenge", file: !7, line: 419, baseType: !19, size: 192, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 420, baseType: !19, size: 192, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "VerificationFailure", file: !7, line: 380, baseType: !326, size: 64, align: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHVerificationFailure", file: !7, line: 434, size: 192, align: 8, elements: !328)
!328 = !{!329}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 435, baseType: !19, size: 192, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Credentials", file: !7, line: 381, baseType: !331, size: 64, align: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "STSCredentials", file: !7, line: 442, size: 448, align: 8, elements: !333)
!333 = !{!334, !335, !336, !337, !340}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "AccessKeyId", file: !7, line: 443, baseType: !68, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "SecretAccessKey", file: !7, line: 444, baseType: !68, size: 64, align: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "AccessToken", file: !7, line: 445, baseType: !68, size: 64, align: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Expiration", file: !7, line: 446, baseType: !338, size: 64, align: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 447, baseType: !19, size: 192, align: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "TokenRequest", file: !7, line: 382, baseType: !342, size: 64, align: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "MFATokenRequest", file: !7, line: 482, size: 192, align: 8, elements: !344)
!344 = !{!345}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 483, baseType: !19, size: 192, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 383, baseType: !19, size: 192, align: 64, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "AgentRequest", file: !7, line: 132, baseType: !191, size: 64, align: 64, offset: 320)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "AgentResponse", file: !7, line: 133, baseType: !349, size: 64, align: 64, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "AgentResponse", file: !7, line: 532, size: 320, align: 8, elements: !351)
!351 = !{!352, !357, !363}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Success", file: !7, line: 533, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "Success", file: !7, line: 556, size: 192, align: 8, elements: !355)
!355 = !{!356}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 557, baseType: !19, size: 192, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Failure", file: !7, line: 534, baseType: !358, size: 64, align: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "Failure", file: !7, line: 564, size: 256, align: 8, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorMessage", file: !7, line: 565, baseType: !68, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 566, baseType: !19, size: 192, align: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 535, baseType: !19, size: 192, align: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "Success", file: !7, line: 134, baseType: !353, size: 64, align: 64, offset: 448)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Failure", file: !7, line: 135, baseType: !358, size: 64, align: 64, offset: 512)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !7, line: 136, baseType: !19, size: 192, align: 64, offset: 576)
!367 = !DILocalVariable(name: "m", arg: 1, scope: !269, file: !7, line: 180, type: !272)
!368 = !DILocation(line: 180, column: 1, scope: !269)
!369 = !DILocalVariable(name: "$ret17", scope: !269, file: !7, line: 180, type: !191)
!370 = !DILocation(line: 180, column: 37, scope: !269)
!371 = !DILocation(line: 181, column: 7, scope: !269)
!372 = !DILocation(line: 184, column: 2, scope: !269)
!373 = !DILocation(line: 182, column: 11, scope: !269)
!374 = !DILocation(line: 182, column: 3, scope: !269)
!375 = distinct !DISubprogram(name: "protocol.GetErrorMessage..1command_line_arguments.Failure", linkageName: "command_line_arguments.Failure.GetErrorMessage", scope: null, file: !7, line: 573, type: !376, isLocal: false, isDefinition: true, scopeLine: 573, isOptimized: false, unit: !1, retainedNodes: !3)
!376 = !DISubroutineType(types: !377)
!377 = !{!69, !358, !358}
!378 = !DILocalVariable(name: "m", arg: 1, scope: !375, file: !7, line: 573, type: !358)
!379 = !DILocation(line: 573, column: 1, scope: !375)
!380 = !DILocation(line: 574, column: 7, scope: !375)
!381 = !DILocation(line: 574, column: 18, scope: !375)
!382 = !DILocation(line: 574, column: 32, scope: !375)
!383 = !DILocalVariable(name: "$ret66", scope: !375, file: !7, line: 573, type: !69)
!384 = !DILocation(line: 573, column: 37, scope: !375)
!385 = !DILocation(line: 577, column: 2, scope: !375)
!386 = !DILocation(line: 575, column: 3, scope: !375)
!387 = distinct !DISubprogram(name: "protocol.Reset..1command_line_arguments.Failure", linkageName: "command_line_arguments.Failure.Reset", scope: null, file: !7, line: 569, type: !388, isLocal: false, isDefinition: true, scopeLine: 569, isOptimized: false, unit: !1, retainedNodes: !3)
!388 = !DISubroutineType(types: !389)
!389 = !{!56, !358, !358}
!390 = !DILocalVariable(name: "m", arg: 1, scope: !387, file: !7, line: 569, type: !358)
!391 = !DILocation(line: 569, column: 1, scope: !387)
!392 = !DILocation(line: 569, column: 40, scope: !387)
!393 = distinct !DISubprogram(name: "protocol.String..1command_line_arguments.Failure", linkageName: "command_line_arguments.Failure.String", scope: null, file: !7, line: 570, type: !376, isLocal: false, isDefinition: true, scopeLine: 570, isOptimized: false, unit: !1, retainedNodes: !3)
!394 = !DILocalVariable(name: "m", arg: 1, scope: !393, file: !7, line: 570, type: !358)
!395 = !DILocation(line: 570, column: 1, scope: !393)
!396 = !DILocation(line: 570, column: 68, scope: !393)
!397 = !DILocation(line: 570, column: 50, scope: !393)
!398 = !DILocation(line: 570, column: 37, scope: !393)
!399 = distinct !DISubprogram(name: "protocol.GetFailure..1command_line_arguments.AgentResponse", linkageName: "command_line_arguments.AgentResponse.GetFailure", scope: null, file: !7, line: 549, type: !400, isLocal: false, isDefinition: true, scopeLine: 549, isOptimized: false, unit: !1, retainedNodes: !3)
!400 = !DISubroutineType(types: !401)
!401 = !{!358, !349, !349}
!402 = !DILocalVariable(name: "m", arg: 1, scope: !399, file: !7, line: 549, type: !349)
!403 = !DILocation(line: 549, column: 1, scope: !399)
!404 = !DILocalVariable(name: "$ret63", scope: !399, file: !7, line: 549, type: !358)
!405 = !DILocation(line: 549, column: 38, scope: !399)
!406 = !DILocation(line: 550, column: 7, scope: !399)
!407 = !DILocation(line: 553, column: 2, scope: !399)
!408 = !DILocation(line: 551, column: 11, scope: !399)
!409 = !DILocation(line: 551, column: 3, scope: !399)
!410 = distinct !DISubprogram(name: "protocol.Reset..1command_line_arguments.Success", linkageName: "command_line_arguments.Success.Reset", scope: null, file: !7, line: 560, type: !411, isLocal: false, isDefinition: true, scopeLine: 560, isOptimized: false, unit: !1, retainedNodes: !3)
!411 = !DISubroutineType(types: !412)
!412 = !{!56, !353, !353}
!413 = !DILocalVariable(name: "m", arg: 1, scope: !410, file: !7, line: 560, type: !353)
!414 = !DILocation(line: 560, column: 1, scope: !410)
!415 = !DILocation(line: 560, column: 40, scope: !410)
!416 = distinct !DISubprogram(name: "protocol.String..1command_line_arguments.Success", linkageName: "command_line_arguments.Success.String", scope: null, file: !7, line: 561, type: !417, isLocal: false, isDefinition: true, scopeLine: 561, isOptimized: false, unit: !1, retainedNodes: !3)
!417 = !DISubroutineType(types: !418)
!418 = !{!69, !353, !353}
!419 = !DILocalVariable(name: "m", arg: 1, scope: !416, file: !7, line: 561, type: !353)
!420 = !DILocation(line: 561, column: 1, scope: !416)
!421 = !DILocation(line: 561, column: 68, scope: !416)
!422 = !DILocation(line: 561, column: 50, scope: !416)
!423 = !DILocation(line: 561, column: 37, scope: !416)
!424 = distinct !DISubprogram(name: "protocol.GetSuccess..1command_line_arguments.AgentResponse", linkageName: "command_line_arguments.AgentResponse.GetSuccess", scope: null, file: !7, line: 542, type: !425, isLocal: false, isDefinition: true, scopeLine: 542, isOptimized: false, unit: !1, retainedNodes: !3)
!425 = !DISubroutineType(types: !426)
!426 = !{!353, !349, !349}
!427 = !DILocalVariable(name: "m", arg: 1, scope: !424, file: !7, line: 542, type: !349)
!428 = !DILocation(line: 542, column: 1, scope: !424)
!429 = !DILocalVariable(name: "$ret62", scope: !424, file: !7, line: 542, type: !353)
!430 = !DILocation(line: 542, column: 38, scope: !424)
!431 = !DILocation(line: 543, column: 7, scope: !424)
!432 = !DILocation(line: 546, column: 2, scope: !424)
!433 = !DILocation(line: 544, column: 11, scope: !424)
!434 = !DILocation(line: 544, column: 3, scope: !424)
!435 = distinct !DISubprogram(name: "protocol.Reset..1command_line_arguments.AgentResponse", linkageName: "command_line_arguments.AgentResponse.Reset", scope: null, file: !7, line: 538, type: !436, isLocal: false, isDefinition: true, scopeLine: 538, isOptimized: false, unit: !1, retainedNodes: !3)
!436 = !DISubroutineType(types: !437)
!437 = !{!56, !349, !349}
!438 = !DILocalVariable(name: "m", arg: 1, scope: !435, file: !7, line: 538, type: !349)
!439 = !DILocation(line: 538, column: 1, scope: !435)
!440 = !DILocation(line: 538, column: 46, scope: !435)
!441 = distinct !DISubprogram(name: "protocol.String..1command_line_arguments.AgentResponse", linkageName: "command_line_arguments.AgentResponse.String", scope: null, file: !7, line: 539, type: !442, isLocal: false, isDefinition: true, scopeLine: 539, isOptimized: false, unit: !1, retainedNodes: !3)
!442 = !DISubroutineType(types: !443)
!443 = !{!69, !349, !349}
!444 = !DILocalVariable(name: "m", arg: 1, scope: !441, file: !7, line: 539, type: !349)
!445 = !DILocation(line: 539, column: 1, scope: !441)
!446 = !DILocation(line: 539, column: 74, scope: !441)
!447 = !DILocation(line: 539, column: 56, scope: !441)
!448 = !DILocation(line: 539, column: 43, scope: !441)
!449 = distinct !DISubprogram(name: "protocol.GetAgentResponse..1command_line_arguments.Message", linkageName: "command_line_arguments.Message.GetAgentResponse", scope: null, file: !7, line: 187, type: !450, isLocal: false, isDefinition: true, scopeLine: 187, isOptimized: false, unit: !1, retainedNodes: !3)
!450 = !DISubroutineType(types: !451)
!451 = !{!349, !272, !272}
!452 = !DILocalVariable(name: "m", arg: 1, scope: !449, file: !7, line: 187, type: !272)
!453 = !DILocation(line: 187, column: 1, scope: !449)
!454 = !DILocalVariable(name: "$ret18", scope: !449, file: !7, line: 187, type: !349)
!455 = !DILocation(line: 187, column: 38, scope: !449)
!456 = !DILocation(line: 188, column: 7, scope: !449)
!457 = !DILocation(line: 191, column: 2, scope: !449)
!458 = !DILocation(line: 189, column: 11, scope: !449)
!459 = !DILocation(line: 189, column: 3, scope: !449)
!460 = distinct !DISubprogram(name: "protocol.GetError..1command_line_arguments.Message", linkageName: "command_line_arguments.Message.GetError", scope: null, file: !7, line: 145, type: !461, isLocal: false, isDefinition: true, scopeLine: 145, isOptimized: false, unit: !1, retainedNodes: !3)
!461 = !DISubroutineType(types: !462)
!462 = !{!69, !272, !272}
!463 = !DILocalVariable(name: "m", arg: 1, scope: !460, file: !7, line: 145, type: !272)
!464 = !DILocation(line: 145, column: 1, scope: !460)
!465 = !DILocation(line: 146, column: 7, scope: !460)
!466 = !DILocation(line: 146, column: 18, scope: !460)
!467 = !DILocation(line: 146, column: 25, scope: !460)
!468 = !DILocalVariable(name: "$ret12", scope: !460, file: !7, line: 145, type: !69)
!469 = !DILocation(line: 145, column: 30, scope: !460)
!470 = !DILocation(line: 149, column: 2, scope: !460)
!471 = !DILocation(line: 147, column: 3, scope: !460)
!472 = distinct !DISubprogram(name: "protocol.GetFailure..1command_line_arguments.Message", linkageName: "command_line_arguments.Message.GetFailure", scope: null, file: !7, line: 201, type: !473, isLocal: false, isDefinition: true, scopeLine: 201, isOptimized: false, unit: !1, retainedNodes: !3)
!473 = !DISubroutineType(types: !474)
!474 = !{!358, !272, !272}
!475 = !DILocalVariable(name: "m", arg: 1, scope: !472, file: !7, line: 201, type: !272)
!476 = !DILocation(line: 201, column: 1, scope: !472)
!477 = !DILocalVariable(name: "$ret20", scope: !472, file: !7, line: 201, type: !358)
!478 = !DILocation(line: 201, column: 32, scope: !472)
!479 = !DILocation(line: 202, column: 7, scope: !472)
!480 = !DILocation(line: 205, column: 2, scope: !472)
!481 = !DILocation(line: 203, column: 11, scope: !472)
!482 = !DILocation(line: 203, column: 3, scope: !472)
!483 = distinct !DISubprogram(name: "protocol.Enum.command_line_arguments.Ping_RequestResponse", linkageName: "command_line_arguments.Ping_RequestResponse.Enum", scope: null, file: !7, line: 108, type: !484, isLocal: false, isDefinition: true, scopeLine: 108, isOptimized: false, unit: !1, retainedNodes: !3)
!484 = !DISubroutineType(types: !485)
!485 = !{!284, !284, !284}
!486 = !DILocalVariable(name: "pointer", arg: 1, scope: !483, file: !7, line: 108, type: !284)
!487 = !DILocation(line: 108, column: 1, scope: !483)
!488 = !DILocalVariable(name: "x", scope: !483, file: !7, line: 108, type: !285)
!489 = !DILocalVariable(name: "$ret8", scope: !483, file: !7, line: 108, type: !284)
!490 = !DILocation(line: 108, column: 38, scope: !483)
!491 = !DILocation(line: 109, column: 7, scope: !492)
!492 = distinct !DILexicalBlock(scope: !483, file: !7, line: 108, column: 1)
!493 = !DILocalVariable(name: "p", scope: !492, file: !7, line: 109, type: !284)
!494 = !DILocation(line: 109, column: 2, scope: !483)
!495 = !DILocation(line: 110, column: 2, scope: !492)
!496 = !DILocation(line: 110, column: 5, scope: !492)
!497 = !DILocation(line: 111, column: 2, scope: !492)
!498 = distinct !DISubprogram(name: "protocol.String.command_line_arguments.Ping_RequestResponse", linkageName: "command_line_arguments.Ping_RequestResponse.String", scope: null, file: !7, line: 113, type: !499, isLocal: false, isDefinition: true, scopeLine: 113, isOptimized: false, unit: !1, retainedNodes: !3)
!499 = !DISubroutineType(types: !500)
!500 = !{!69, !284, !284}
!501 = !DILocalVariable(name: "pointer", arg: 1, scope: !498, file: !7, line: 113, type: !284)
!502 = !DILocation(line: 113, column: 1, scope: !498)
!503 = !DILocalVariable(name: "x", scope: !498, file: !7, line: 113, type: !285)
!504 = !DILocation(line: 114, column: 24, scope: !498)
!505 = !DILocation(line: 114, column: 15, scope: !498)
!506 = !DILocation(line: 114, column: 2, scope: !498)
!507 = distinct !DISubprogram(name: "protocol.UnmarshalJSON..1command_line_arguments.Ping_RequestResponse", linkageName: "command_line_arguments.Ping_RequestResponse.UnmarshalJSON", scope: null, file: !7, line: 116, type: !508, isLocal: false, isDefinition: true, scopeLine: 116, isOptimized: false, unit: !1, retainedNodes: !3)
!508 = !DISubroutineType(types: !509)
!509 = !{!28, !284, !284, !19}
!510 = !DILocalVariable(name: "data", arg: 2, scope: !507, file: !7, line: 116, type: !19)
!511 = !DILocation(line: 116, column: 46, scope: !507)
!512 = !DILocalVariable(name: "x", arg: 1, scope: !507, file: !7, line: 116, type: !284)
!513 = !DILocation(line: 116, column: 1, scope: !507)
!514 = !DILocation(line: 117, column: 40, scope: !515)
!515 = distinct !DILexicalBlock(scope: !507, file: !7, line: 116, column: 1)
!516 = !DILocation(line: 117, column: 22, scope: !515)
!517 = !DILocalVariable(name: "value", scope: !515, file: !7, line: 117, type: !518)
!518 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!519 = !DILocation(line: 117, column: 2, scope: !507)
!520 = !DILocalVariable(name: "err", scope: !515, file: !7, line: 117, type: !28)
!521 = !DILocation(line: 118, column: 9, scope: !515)
!522 = !DILocation(line: 119, column: 3, scope: !515)
!523 = !DILocalVariable(name: "$ret10", scope: !507, file: !7, line: 116, type: !28)
!524 = !DILocation(line: 116, column: 59, scope: !507)
!525 = !DILocation(line: 121, column: 2, scope: !515)
!526 = !DILocation(line: 121, column: 5, scope: !515)
!527 = !DILocation(line: 122, column: 2, scope: !515)
!528 = distinct !DISubprogram(name: "protocol.GetType..1command_line_arguments.Ping", linkageName: "command_line_arguments.Ping.GetType", scope: null, file: !7, line: 219, type: !529, isLocal: false, isDefinition: true, scopeLine: 219, isOptimized: false, unit: !1, retainedNodes: !3)
!529 = !DISubroutineType(types: !530)
!530 = !{!285, !280, !280}
!531 = !DILocalVariable(name: "m", arg: 1, scope: !528, file: !7, line: 219, type: !280)
!532 = !DILocation(line: 219, column: 1, scope: !528)
!533 = !DILocalVariable(name: "$ret22", scope: !528, file: !7, line: 219, type: !285)
!534 = !DILocation(line: 219, column: 26, scope: !528)
!535 = !DILocation(line: 220, column: 7, scope: !528)
!536 = !DILocation(line: 220, column: 18, scope: !528)
!537 = !DILocation(line: 220, column: 24, scope: !528)
!538 = !DILocation(line: 223, column: 2, scope: !528)
!539 = !DILocation(line: 221, column: 10, scope: !528)
!540 = !DILocation(line: 221, column: 3, scope: !528)
!541 = distinct !DISubprogram(name: "protocol.Reset..1command_line_arguments.Ping", linkageName: "command_line_arguments.Ping.Reset", scope: null, file: !7, line: 213, type: !542, isLocal: false, isDefinition: true, scopeLine: 213, isOptimized: false, unit: !1, retainedNodes: !3)
!542 = !DISubroutineType(types: !543)
!543 = !{!56, !280, !280}
!544 = !DILocalVariable(name: "m", arg: 1, scope: !541, file: !7, line: 213, type: !280)
!545 = !DILocation(line: 213, column: 1, scope: !541)
!546 = !DILocation(line: 213, column: 37, scope: !541)
!547 = distinct !DISubprogram(name: "protocol.String..1command_line_arguments.Ping", linkageName: "command_line_arguments.Ping.String", scope: null, file: !7, line: 214, type: !548, isLocal: false, isDefinition: true, scopeLine: 214, isOptimized: false, unit: !1, retainedNodes: !3)
!548 = !DISubroutineType(types: !549)
!549 = !{!69, !280, !280}
!550 = !DILocalVariable(name: "m", arg: 1, scope: !547, file: !7, line: 214, type: !280)
!551 = !DILocation(line: 214, column: 1, scope: !547)
!552 = !DILocation(line: 214, column: 65, scope: !547)
!553 = !DILocation(line: 214, column: 47, scope: !547)
!554 = !DILocation(line: 214, column: 34, scope: !547)
!555 = distinct !DISubprogram(name: "protocol.GetPing..1command_line_arguments.Message", linkageName: "command_line_arguments.Message.GetPing", scope: null, file: !7, line: 159, type: !556, isLocal: false, isDefinition: true, scopeLine: 159, isOptimized: false, unit: !1, retainedNodes: !3)
!556 = !DISubroutineType(types: !557)
!557 = !{!280, !272, !272}
!558 = !DILocalVariable(name: "m", arg: 1, scope: !555, file: !7, line: 159, type: !272)
!559 = !DILocation(line: 159, column: 1, scope: !555)
!560 = !DILocalVariable(name: "$ret14", scope: !555, file: !7, line: 159, type: !280)
!561 = !DILocation(line: 159, column: 29, scope: !555)
!562 = !DILocation(line: 160, column: 7, scope: !555)
!563 = !DILocation(line: 163, column: 2, scope: !555)
!564 = !DILocation(line: 161, column: 11, scope: !555)
!565 = !DILocation(line: 161, column: 3, scope: !555)
!566 = distinct !DISubprogram(name: "protocol.GetPasswordhash..1command_line_arguments.AddSSHKey", linkageName: "command_line_arguments.AddSSHKey.GetPasswordhash", scope: null, file: !7, line: 324, type: !567, isLocal: false, isDefinition: true, scopeLine: 324, isOptimized: false, unit: !1, retainedNodes: !3)
!567 = !DISubroutineType(types: !568)
!568 = !{!69, !307, !307}
!569 = !DILocalVariable(name: "m", arg: 1, scope: !566, file: !7, line: 324, type: !307)
!570 = !DILocation(line: 324, column: 1, scope: !566)
!571 = !DILocation(line: 325, column: 7, scope: !566)
!572 = !DILocation(line: 325, column: 18, scope: !566)
!573 = !DILocation(line: 325, column: 32, scope: !566)
!574 = !DILocalVariable(name: "$ret35", scope: !566, file: !7, line: 324, type: !69)
!575 = !DILocation(line: 324, column: 39, scope: !566)
!576 = !DILocation(line: 328, column: 2, scope: !566)
!577 = !DILocation(line: 326, column: 3, scope: !566)
!578 = distinct !DISubprogram(name: "protocol.GetSshkeybytes..1command_line_arguments.AddSSHKey", linkageName: "command_line_arguments.AddSSHKey.GetSshkeybytes", scope: null, file: !7, line: 331, type: !567, isLocal: false, isDefinition: true, scopeLine: 331, isOptimized: false, unit: !1, retainedNodes: !3)
!579 = !DILocalVariable(name: "m", arg: 1, scope: !578, file: !7, line: 331, type: !307)
!580 = !DILocation(line: 331, column: 1, scope: !578)
!581 = !DILocation(line: 332, column: 7, scope: !578)
!582 = !DILocation(line: 332, column: 18, scope: !578)
!583 = !DILocation(line: 332, column: 31, scope: !578)
!584 = !DILocalVariable(name: "$ret36", scope: !578, file: !7, line: 331, type: !69)
!585 = !DILocation(line: 331, column: 38, scope: !578)
!586 = !DILocation(line: 335, column: 2, scope: !578)
!587 = !DILocation(line: 333, column: 3, scope: !578)
!588 = distinct !DISubprogram(name: "protocol.GetUsername..1command_line_arguments.AddSSHKey", linkageName: "command_line_arguments.AddSSHKey.GetUsername", scope: null, file: !7, line: 317, type: !567, isLocal: false, isDefinition: true, scopeLine: 317, isOptimized: false, unit: !1, retainedNodes: !3)
!589 = !DILocalVariable(name: "m", arg: 1, scope: !588, file: !7, line: 317, type: !307)
!590 = !DILocation(line: 317, column: 1, scope: !588)
!591 = !DILocation(line: 318, column: 7, scope: !588)
!592 = !DILocation(line: 318, column: 18, scope: !588)
!593 = !DILocation(line: 318, column: 28, scope: !588)
!594 = !DILocalVariable(name: "$ret34", scope: !588, file: !7, line: 317, type: !69)
!595 = !DILocation(line: 317, column: 35, scope: !588)
!596 = !DILocation(line: 321, column: 2, scope: !588)
!597 = !DILocation(line: 319, column: 3, scope: !588)
!598 = distinct !DISubprogram(name: "protocol.Reset..1command_line_arguments.AddSSHKey", linkageName: "command_line_arguments.AddSSHKey.Reset", scope: null, file: !7, line: 313, type: !599, isLocal: false, isDefinition: true, scopeLine: 313, isOptimized: false, unit: !1, retainedNodes: !3)
!599 = !DISubroutineType(types: !600)
!600 = !{!56, !307, !307}
!601 = !DILocalVariable(name: "m", arg: 1, scope: !598, file: !7, line: 313, type: !307)
!602 = !DILocation(line: 313, column: 1, scope: !598)
!603 = !DILocation(line: 313, column: 42, scope: !598)
!604 = distinct !DISubprogram(name: "protocol.String..1command_line_arguments.AddSSHKey", linkageName: "command_line_arguments.AddSSHKey.String", scope: null, file: !7, line: 314, type: !567, isLocal: false, isDefinition: true, scopeLine: 314, isOptimized: false, unit: !1, retainedNodes: !3)
!605 = !DILocalVariable(name: "m", arg: 1, scope: !604, file: !7, line: 314, type: !307)
!606 = !DILocation(line: 314, column: 1, scope: !604)
!607 = !DILocation(line: 314, column: 70, scope: !604)
!608 = !DILocation(line: 314, column: 52, scope: !604)
!609 = !DILocation(line: 314, column: 39, scope: !604)
!610 = distinct !DISubprogram(name: "protocol.GetAddSSHkey..1command_line_arguments.ServerRequest", linkageName: "command_line_arguments.ServerRequest.GetAddSSHkey", scope: null, file: !7, line: 267, type: !611, isLocal: false, isDefinition: true, scopeLine: 267, isOptimized: false, unit: !1, retainedNodes: !3)
!611 = !DISubroutineType(types: !612)
!612 = !{!307, !288, !288}
!613 = !DILocalVariable(name: "m", arg: 1, scope: !610, file: !7, line: 267, type: !288)
!614 = !DILocation(line: 267, column: 1, scope: !610)
!615 = !DILocalVariable(name: "$ret28", scope: !610, file: !7, line: 267, type: !307)
!616 = !DILocation(line: 267, column: 40, scope: !610)
!617 = !DILocation(line: 268, column: 7, scope: !610)
!618 = !DILocation(line: 271, column: 2, scope: !610)
!619 = !DILocation(line: 269, column: 11, scope: !610)
!620 = !DILocation(line: 269, column: 3, scope: !610)
!621 = distinct !DISubprogram(name: "protocol.GetAssumeRole..1command_line_arguments.ServerRequest", linkageName: "command_line_arguments.ServerRequest.GetAssumeRole", scope: null, file: !7, line: 239, type: !622, isLocal: false, isDefinition: true, scopeLine: 239, isOptimized: false, unit: !1, retainedNodes: !3)
!622 = !DISubroutineType(types: !623)
!623 = !{!151, !288, !288}
!624 = !DILocalVariable(name: "m", arg: 1, scope: !621, file: !7, line: 239, type: !288)
!625 = !DILocation(line: 239, column: 1, scope: !621)
!626 = !DILocalVariable(name: "$ret24", scope: !621, file: !7, line: 239, type: !151)
!627 = !DILocation(line: 239, column: 41, scope: !621)
!628 = !DILocation(line: 240, column: 7, scope: !621)
!629 = !DILocation(line: 243, column: 2, scope: !621)
!630 = !DILocation(line: 241, column: 11, scope: !621)
!631 = !DILocation(line: 241, column: 3, scope: !621)
!632 = distinct !DISubprogram(name: "protocol.GetFormat..1command_line_arguments.SSHChallengeResponse", linkageName: "command_line_arguments.SSHChallengeResponse.GetFormat", scope: null, file: !7, line: 355, type: !633, isLocal: false, isDefinition: true, scopeLine: 355, isOptimized: false, unit: !1, retainedNodes: !3)
!633 = !DISubroutineType(types: !634)
!634 = !{!69, !293, !293}
!635 = !DILocalVariable(name: "m", arg: 1, scope: !632, file: !7, line: 355, type: !293)
!636 = !DILocation(line: 355, column: 1, scope: !632)
!637 = !DILocation(line: 356, column: 7, scope: !632)
!638 = !DILocation(line: 356, column: 18, scope: !632)
!639 = !DILocation(line: 356, column: 26, scope: !632)
!640 = !DILocalVariable(name: "$ret39", scope: !632, file: !7, line: 355, type: !69)
!641 = !DILocation(line: 355, column: 44, scope: !632)
!642 = !DILocation(line: 359, column: 2, scope: !632)
!643 = !DILocation(line: 357, column: 3, scope: !632)
!644 = distinct !DISubprogram(name: "protocol.GetSignature..1command_line_arguments.SSHChallengeResponse", linkageName: "command_line_arguments.SSHChallengeResponse.GetSignature", scope: null, file: !7, line: 348, type: !645, isLocal: false, isDefinition: true, scopeLine: 348, isOptimized: false, unit: !1, retainedNodes: !3)
!645 = !DISubroutineType(types: !646)
!646 = !{!19, !293, !293}
!647 = !DILocalVariable(name: "m", arg: 1, scope: !644, file: !7, line: 348, type: !293)
!648 = !DILocation(line: 348, column: 1, scope: !644)
!649 = !DILocation(line: 349, column: 7, scope: !644)
!650 = !DILocation(line: 352, column: 2, scope: !644)
!651 = !DILocation(line: 350, column: 3, scope: !644)
!652 = distinct !DISubprogram(name: "protocol.Reset..1command_line_arguments.SSHChallengeResponse", linkageName: "command_line_arguments.SSHChallengeResponse.Reset", scope: null, file: !7, line: 344, type: !653, isLocal: false, isDefinition: true, scopeLine: 344, isOptimized: false, unit: !1, retainedNodes: !3)
!653 = !DISubroutineType(types: !654)
!654 = !{!56, !293, !293}
!655 = !DILocalVariable(name: "m", arg: 1, scope: !652, file: !7, line: 344, type: !293)
!656 = !DILocation(line: 344, column: 1, scope: !652)
!657 = !DILocation(line: 344, column: 53, scope: !652)
!658 = distinct !DISubprogram(name: "protocol.String..1command_line_arguments.SSHChallengeResponse", linkageName: "command_line_arguments.SSHChallengeResponse.String", scope: null, file: !7, line: 345, type: !633, isLocal: false, isDefinition: true, scopeLine: 345, isOptimized: false, unit: !1, retainedNodes: !3)
!659 = !DILocalVariable(name: "m", arg: 1, scope: !658, file: !7, line: 345, type: !293)
!660 = !DILocation(line: 345, column: 1, scope: !658)
!661 = !DILocation(line: 345, column: 81, scope: !658)
!662 = !DILocation(line: 345, column: 63, scope: !658)
!663 = !DILocation(line: 345, column: 50, scope: !658)
!664 = distinct !DISubprogram(name: "protocol.GetChallengeResponse..1command_line_arguments.ServerRequest", linkageName: "command_line_arguments.ServerRequest.GetChallengeResponse", scope: null, file: !7, line: 246, type: !665, isLocal: false, isDefinition: true, scopeLine: 246, isOptimized: false, unit: !1, retainedNodes: !3)
!665 = !DISubroutineType(types: !666)
!666 = !{!293, !288, !288}
!667 = !DILocalVariable(name: "m", arg: 1, scope: !664, file: !7, line: 246, type: !288)
!668 = !DILocation(line: 246, column: 1, scope: !664)
!669 = !DILocalVariable(name: "$ret25", scope: !664, file: !7, line: 246, type: !293)
!670 = !DILocation(line: 246, column: 48, scope: !664)
!671 = !DILocation(line: 247, column: 7, scope: !664)
!672 = !DILocation(line: 250, column: 2, scope: !664)
!673 = !DILocation(line: 248, column: 11, scope: !664)
!674 = !DILocation(line: 248, column: 3, scope: !664)
!675 = distinct !DISubprogram(name: "protocol.GetGetUserCredentials..1command_line_arguments.ServerRequest", linkageName: "command_line_arguments.ServerRequest.GetGetUserCredentials", scope: null, file: !7, line: 260, type: !676, isLocal: false, isDefinition: true, scopeLine: 260, isOptimized: false, unit: !1, retainedNodes: !3)
!676 = !DISubroutineType(types: !677)
!677 = !{!197, !288, !288}
!678 = !DILocalVariable(name: "m", arg: 1, scope: !675, file: !7, line: 260, type: !288)
!679 = !DILocation(line: 260, column: 1, scope: !675)
!680 = !DILocalVariable(name: "$ret27", scope: !675, file: !7, line: 260, type: !197)
!681 = !DILocation(line: 260, column: 49, scope: !675)
!682 = !DILocation(line: 261, column: 7, scope: !675)
!683 = !DILocation(line: 264, column: 2, scope: !675)
!684 = !DILocation(line: 262, column: 11, scope: !675)
!685 = !DILocation(line: 262, column: 3, scope: !675)
!686 = distinct !DISubprogram(name: "protocol.GetTokenValue..1command_line_arguments.MFATokenResponse", linkageName: "command_line_arguments.MFATokenResponse.GetTokenValue", scope: null, file: !7, line: 371, type: !687, isLocal: false, isDefinition: true, scopeLine: 371, isOptimized: false, unit: !1, retainedNodes: !3)
!687 = !DISubroutineType(types: !688)
!688 = !{!69, !300, !300}
!689 = !DILocalVariable(name: "m", arg: 1, scope: !686, file: !7, line: 371, type: !300)
!690 = !DILocation(line: 371, column: 1, scope: !686)
!691 = !DILocation(line: 372, column: 7, scope: !686)
!692 = !DILocation(line: 372, column: 18, scope: !686)
!693 = !DILocation(line: 372, column: 30, scope: !686)
!694 = !DILocalVariable(name: "$ret41", scope: !686, file: !7, line: 371, type: !69)
!695 = !DILocation(line: 371, column: 44, scope: !686)
!696 = !DILocation(line: 375, column: 2, scope: !686)
!697 = !DILocation(line: 373, column: 3, scope: !686)
!698 = distinct !DISubprogram(name: "protocol.Reset..1command_line_arguments.MFATokenResponse", linkageName: "command_line_arguments.MFATokenResponse.Reset", scope: null, file: !7, line: 367, type: !699, isLocal: false, isDefinition: true, scopeLine: 367, isOptimized: false, unit: !1, retainedNodes: !3)
!699 = !DISubroutineType(types: !700)
!700 = !{!56, !300, !300}
!701 = !DILocalVariable(name: "m", arg: 1, scope: !698, file: !7, line: 367, type: !300)
!702 = !DILocation(line: 367, column: 1, scope: !698)
!703 = !DILocation(line: 367, column: 49, scope: !698)
!704 = distinct !DISubprogram(name: "protocol.String..1command_line_arguments.MFATokenResponse", linkageName: "command_line_arguments.MFATokenResponse.String", scope: null, file: !7, line: 368, type: !687, isLocal: false, isDefinition: true, scopeLine: 368, isOptimized: false, unit: !1, retainedNodes: !3)
!705 = !DILocalVariable(name: "m", arg: 1, scope: !704, file: !7, line: 368, type: !300)
!706 = !DILocation(line: 368, column: 1, scope: !704)
!707 = !DILocation(line: 368, column: 77, scope: !704)
!708 = !DILocation(line: 368, column: 59, scope: !704)
!709 = !DILocation(line: 368, column: 46, scope: !704)
!710 = distinct !DISubprogram(name: "protocol.GetTokenResponse..1command_line_arguments.ServerRequest", linkageName: "command_line_arguments.ServerRequest.GetTokenResponse", scope: null, file: !7, line: 253, type: !711, isLocal: false, isDefinition: true, scopeLine: 253, isOptimized: false, unit: !1, retainedNodes: !3)
!711 = !DISubroutineType(types: !712)
!712 = !{!300, !288, !288}
!713 = !DILocalVariable(name: "m", arg: 1, scope: !710, file: !7, line: 253, type: !288)
!714 = !DILocation(line: 253, column: 1, scope: !710)
!715 = !DILocalVariable(name: "$ret26", scope: !710, file: !7, line: 253, type: !300)
!716 = !DILocation(line: 253, column: 44, scope: !710)
!717 = !DILocation(line: 254, column: 7, scope: !710)
!718 = !DILocation(line: 257, column: 2, scope: !710)
!719 = !DILocation(line: 255, column: 11, scope: !710)
!720 = !DILocation(line: 255, column: 3, scope: !710)
!721 = distinct !DISubprogram(name: "protocol.Reset..1command_line_arguments.ServerRequest", linkageName: "command_line_arguments.ServerRequest.Reset", scope: null, file: !7, line: 235, type: !722, isLocal: false, isDefinition: true, scopeLine: 235, isOptimized: false, unit: !1, retainedNodes: !3)
!722 = !DISubroutineType(types: !723)
!723 = !{!56, !288, !288}
!724 = !DILocalVariable(name: "m", arg: 1, scope: !721, file: !7, line: 235, type: !288)
!725 = !DILocation(line: 235, column: 1, scope: !721)
!726 = !DILocation(line: 235, column: 46, scope: !721)
!727 = distinct !DISubprogram(name: "protocol.String..1command_line_arguments.ServerRequest", linkageName: "command_line_arguments.ServerRequest.String", scope: null, file: !7, line: 236, type: !728, isLocal: false, isDefinition: true, scopeLine: 236, isOptimized: false, unit: !1, retainedNodes: !3)
!728 = !DISubroutineType(types: !729)
!729 = !{!69, !288, !288}
!730 = !DILocalVariable(name: "m", arg: 1, scope: !727, file: !7, line: 236, type: !288)
!731 = !DILocation(line: 236, column: 1, scope: !727)
!732 = !DILocation(line: 236, column: 74, scope: !727)
!733 = !DILocation(line: 236, column: 56, scope: !727)
!734 = !DILocation(line: 236, column: 43, scope: !727)
!735 = distinct !DISubprogram(name: "protocol.GetServerRequest..1command_line_arguments.Message", linkageName: "command_line_arguments.Message.GetServerRequest", scope: null, file: !7, line: 166, type: !736, isLocal: false, isDefinition: true, scopeLine: 166, isOptimized: false, unit: !1, retainedNodes: !3)
!736 = !DISubroutineType(types: !737)
!737 = !{!288, !272, !272}
!738 = !DILocalVariable(name: "m", arg: 1, scope: !735, file: !7, line: 166, type: !272)
!739 = !DILocation(line: 166, column: 1, scope: !735)
!740 = !DILocalVariable(name: "$ret15", scope: !735, file: !7, line: 166, type: !288)
!741 = !DILocation(line: 166, column: 38, scope: !735)
!742 = !DILocation(line: 167, column: 7, scope: !735)
!743 = !DILocation(line: 170, column: 2, scope: !735)
!744 = !DILocation(line: 168, column: 11, scope: !735)
!745 = !DILocation(line: 168, column: 3, scope: !735)
!746 = distinct !DISubprogram(name: "protocol.GetChallenge..1command_line_arguments.SSHChallenge", linkageName: "command_line_arguments.SSHChallenge.GetChallenge", scope: null, file: !7, line: 427, type: !747, isLocal: false, isDefinition: true, scopeLine: 427, isOptimized: false, unit: !1, retainedNodes: !3)
!747 = !DISubroutineType(types: !748)
!748 = !{!19, !320, !320}
!749 = !DILocalVariable(name: "m", arg: 1, scope: !746, file: !7, line: 427, type: !320)
!750 = !DILocation(line: 427, column: 1, scope: !746)
!751 = !DILocation(line: 428, column: 7, scope: !746)
!752 = !DILocation(line: 431, column: 2, scope: !746)
!753 = !DILocation(line: 429, column: 3, scope: !746)
!754 = distinct !DISubprogram(name: "protocol.Reset..1command_line_arguments.SSHChallenge", linkageName: "command_line_arguments.SSHChallenge.Reset", scope: null, file: !7, line: 423, type: !755, isLocal: false, isDefinition: true, scopeLine: 423, isOptimized: false, unit: !1, retainedNodes: !3)
!755 = !DISubroutineType(types: !756)
!756 = !{!56, !320, !320}
!757 = !DILocalVariable(name: "m", arg: 1, scope: !754, file: !7, line: 423, type: !320)
!758 = !DILocation(line: 423, column: 1, scope: !754)
!759 = !DILocation(line: 423, column: 45, scope: !754)
!760 = distinct !DISubprogram(name: "protocol.String..1command_line_arguments.SSHChallenge", linkageName: "command_line_arguments.SSHChallenge.String", scope: null, file: !7, line: 424, type: !761, isLocal: false, isDefinition: true, scopeLine: 424, isOptimized: false, unit: !1, retainedNodes: !3)
!761 = !DISubroutineType(types: !762)
!762 = !{!69, !320, !320}
!763 = !DILocalVariable(name: "m", arg: 1, scope: !760, file: !7, line: 424, type: !320)
!764 = !DILocation(line: 424, column: 1, scope: !760)
!765 = !DILocation(line: 424, column: 73, scope: !760)
!766 = !DILocation(line: 424, column: 55, scope: !760)
!767 = !DILocation(line: 424, column: 42, scope: !760)
!768 = distinct !DISubprogram(name: "protocol.GetChallenge..1command_line_arguments.ServerResponse", linkageName: "command_line_arguments.ServerResponse.GetChallenge", scope: null, file: !7, line: 390, type: !769, isLocal: false, isDefinition: true, scopeLine: 390, isOptimized: false, unit: !1, retainedNodes: !3)
!769 = !DISubroutineType(types: !770)
!770 = !{!320, !316, !316}
!771 = !DILocalVariable(name: "m", arg: 1, scope: !768, file: !7, line: 390, type: !316)
!772 = !DILocation(line: 390, column: 1, scope: !768)
!773 = !DILocalVariable(name: "$ret43", scope: !768, file: !7, line: 390, type: !320)
!774 = !DILocation(line: 390, column: 41, scope: !768)
!775 = !DILocation(line: 391, column: 7, scope: !768)
!776 = !DILocation(line: 394, column: 2, scope: !768)
!777 = !DILocation(line: 392, column: 11, scope: !768)
!778 = !DILocation(line: 392, column: 3, scope: !768)
!779 = distinct !DISubprogram(name: "protocol.GetAccessKeyId..1command_line_arguments.STSCredentials", linkageName: "command_line_arguments.STSCredentials.GetAccessKeyId", scope: null, file: !7, line: 454, type: !780, isLocal: false, isDefinition: true, scopeLine: 454, isOptimized: false, unit: !1, retainedNodes: !3)
!780 = !DISubroutineType(types: !781)
!781 = !{!69, !331, !331}
!782 = !DILocalVariable(name: "m", arg: 1, scope: !779, file: !7, line: 454, type: !331)
!783 = !DILocation(line: 454, column: 1, scope: !779)
!784 = !DILocation(line: 455, column: 7, scope: !779)
!785 = !DILocation(line: 455, column: 18, scope: !779)
!786 = !DILocation(line: 455, column: 31, scope: !779)
!787 = !DILocalVariable(name: "$ret51", scope: !779, file: !7, line: 454, type: !69)
!788 = !DILocation(line: 454, column: 43, scope: !779)
!789 = !DILocation(line: 458, column: 2, scope: !779)
!790 = !DILocation(line: 456, column: 3, scope: !779)
!791 = distinct !DISubprogram(name: "protocol.GetAccessToken..1command_line_arguments.STSCredentials", linkageName: "command_line_arguments.STSCredentials.GetAccessToken", scope: null, file: !7, line: 468, type: !780, isLocal: false, isDefinition: true, scopeLine: 468, isOptimized: false, unit: !1, retainedNodes: !3)
!792 = !DILocalVariable(name: "m", arg: 1, scope: !791, file: !7, line: 468, type: !331)
!793 = !DILocation(line: 468, column: 1, scope: !791)
!794 = !DILocation(line: 469, column: 7, scope: !791)
!795 = !DILocation(line: 469, column: 18, scope: !791)
!796 = !DILocation(line: 469, column: 31, scope: !791)
!797 = !DILocalVariable(name: "$ret53", scope: !791, file: !7, line: 468, type: !69)
!798 = !DILocation(line: 468, column: 43, scope: !791)
!799 = !DILocation(line: 472, column: 2, scope: !791)
!800 = !DILocation(line: 470, column: 3, scope: !791)
!801 = distinct !DISubprogram(name: "protocol.GetExpiration..1command_line_arguments.STSCredentials", linkageName: "command_line_arguments.STSCredentials.GetExpiration", scope: null, file: !7, line: 475, type: !802, isLocal: false, isDefinition: true, scopeLine: 475, isOptimized: false, unit: !1, retainedNodes: !3)
!802 = !DISubroutineType(types: !803)
!803 = !{!339, !331, !331}
!804 = !DILocalVariable(name: "m", arg: 1, scope: !801, file: !7, line: 475, type: !331)
!805 = !DILocation(line: 475, column: 1, scope: !801)
!806 = !DILocalVariable(name: "$ret54", scope: !801, file: !7, line: 475, type: !339)
!807 = !DILocation(line: 475, column: 42, scope: !801)
!808 = !DILocation(line: 476, column: 7, scope: !801)
!809 = !DILocation(line: 476, column: 18, scope: !801)
!810 = !DILocation(line: 476, column: 30, scope: !801)
!811 = !DILocation(line: 479, column: 2, scope: !801)
!812 = !DILocation(line: 477, column: 10, scope: !801)
!813 = !DILocation(line: 477, column: 3, scope: !801)
!814 = distinct !DISubprogram(name: "protocol.GetSecretAccessKey..1command_line_arguments.STSCredentials", linkageName: "command_line_arguments.STSCredentials.GetSecretAccessKey", scope: null, file: !7, line: 461, type: !780, isLocal: false, isDefinition: true, scopeLine: 461, isOptimized: false, unit: !1, retainedNodes: !3)
!815 = !DILocalVariable(name: "m", arg: 1, scope: !814, file: !7, line: 461, type: !331)
!816 = !DILocation(line: 461, column: 1, scope: !814)
!817 = !DILocation(line: 462, column: 7, scope: !814)
!818 = !DILocation(line: 462, column: 18, scope: !814)
!819 = !DILocation(line: 462, column: 35, scope: !814)
!820 = !DILocalVariable(name: "$ret52", scope: !814, file: !7, line: 461, type: !69)
!821 = !DILocation(line: 461, column: 47, scope: !814)
!822 = !DILocation(line: 465, column: 2, scope: !814)
!823 = !DILocation(line: 463, column: 3, scope: !814)
!824 = distinct !DISubprogram(name: "protocol.Reset..1command_line_arguments.STSCredentials", linkageName: "command_line_arguments.STSCredentials.Reset", scope: null, file: !7, line: 450, type: !825, isLocal: false, isDefinition: true, scopeLine: 450, isOptimized: false, unit: !1, retainedNodes: !3)
!825 = !DISubroutineType(types: !826)
!826 = !{!56, !331, !331}
!827 = !DILocalVariable(name: "m", arg: 1, scope: !824, file: !7, line: 450, type: !331)
!828 = !DILocation(line: 450, column: 1, scope: !824)
!829 = !DILocation(line: 450, column: 47, scope: !824)
!830 = distinct !DISubprogram(name: "protocol.String..1command_line_arguments.STSCredentials", linkageName: "command_line_arguments.STSCredentials.String", scope: null, file: !7, line: 451, type: !780, isLocal: false, isDefinition: true, scopeLine: 451, isOptimized: false, unit: !1, retainedNodes: !3)
!831 = !DILocalVariable(name: "m", arg: 1, scope: !830, file: !7, line: 451, type: !331)
!832 = !DILocation(line: 451, column: 1, scope: !830)
!833 = !DILocation(line: 451, column: 75, scope: !830)
!834 = !DILocation(line: 451, column: 57, scope: !830)
!835 = !DILocation(line: 451, column: 44, scope: !830)
!836 = distinct !DISubprogram(name: "protocol.GetCredentials..1command_line_arguments.ServerResponse", linkageName: "command_line_arguments.ServerResponse.GetCredentials", scope: null, file: !7, line: 404, type: !837, isLocal: false, isDefinition: true, scopeLine: 404, isOptimized: false, unit: !1, retainedNodes: !3)
!837 = !DISubroutineType(types: !838)
!838 = !{!331, !316, !316}
!839 = !DILocalVariable(name: "m", arg: 1, scope: !836, file: !7, line: 404, type: !316)
!840 = !DILocation(line: 404, column: 1, scope: !836)
!841 = !DILocalVariable(name: "$ret45", scope: !836, file: !7, line: 404, type: !331)
!842 = !DILocation(line: 404, column: 43, scope: !836)
!843 = !DILocation(line: 405, column: 7, scope: !836)
!844 = !DILocation(line: 408, column: 2, scope: !836)
!845 = !DILocation(line: 406, column: 11, scope: !836)
!846 = !DILocation(line: 406, column: 3, scope: !836)
!847 = distinct !DISubprogram(name: "protocol.Reset..1command_line_arguments.MFATokenRequest", linkageName: "command_line_arguments.MFATokenRequest.Reset", scope: null, file: !7, line: 486, type: !848, isLocal: false, isDefinition: true, scopeLine: 486, isOptimized: false, unit: !1, retainedNodes: !3)
!848 = !DISubroutineType(types: !849)
!849 = !{!56, !342, !342}
!850 = !DILocalVariable(name: "m", arg: 1, scope: !847, file: !7, line: 486, type: !342)
!851 = !DILocation(line: 486, column: 1, scope: !847)
!852 = !DILocation(line: 486, column: 48, scope: !847)
!853 = distinct !DISubprogram(name: "protocol.String..1command_line_arguments.MFATokenRequest", linkageName: "command_line_arguments.MFATokenRequest.String", scope: null, file: !7, line: 487, type: !854, isLocal: false, isDefinition: true, scopeLine: 487, isOptimized: false, unit: !1, retainedNodes: !3)
!854 = !DISubroutineType(types: !855)
!855 = !{!69, !342, !342}
!856 = !DILocalVariable(name: "m", arg: 1, scope: !853, file: !7, line: 487, type: !342)
!857 = !DILocation(line: 487, column: 1, scope: !853)
!858 = !DILocation(line: 487, column: 76, scope: !853)
!859 = !DILocation(line: 487, column: 58, scope: !853)
!860 = !DILocation(line: 487, column: 45, scope: !853)
!861 = distinct !DISubprogram(name: "protocol.GetTokenRequest..1command_line_arguments.ServerResponse", linkageName: "command_line_arguments.ServerResponse.GetTokenRequest", scope: null, file: !7, line: 411, type: !862, isLocal: false, isDefinition: true, scopeLine: 411, isOptimized: false, unit: !1, retainedNodes: !3)
!862 = !DISubroutineType(types: !863)
!863 = !{!342, !316, !316}
!864 = !DILocalVariable(name: "m", arg: 1, scope: !861, file: !7, line: 411, type: !316)
!865 = !DILocation(line: 411, column: 1, scope: !861)
!866 = !DILocalVariable(name: "$ret46", scope: !861, file: !7, line: 411, type: !342)
!867 = !DILocation(line: 411, column: 44, scope: !861)
!868 = !DILocation(line: 412, column: 7, scope: !861)
!869 = !DILocation(line: 415, column: 2, scope: !861)
!870 = !DILocation(line: 413, column: 11, scope: !861)
!871 = !DILocation(line: 413, column: 3, scope: !861)
!872 = distinct !DISubprogram(name: "protocol.Reset..1command_line_arguments.SSHVerificationFailure", linkageName: "command_line_arguments.SSHVerificationFailure.Reset", scope: null, file: !7, line: 438, type: !873, isLocal: false, isDefinition: true, scopeLine: 438, isOptimized: false, unit: !1, retainedNodes: !3)
!873 = !DISubroutineType(types: !874)
!874 = !{!56, !326, !326}
!875 = !DILocalVariable(name: "m", arg: 1, scope: !872, file: !7, line: 438, type: !326)
!876 = !DILocation(line: 438, column: 1, scope: !872)
!877 = !DILocation(line: 438, column: 55, scope: !872)
!878 = distinct !DISubprogram(name: "protocol.String..1command_line_arguments.SSHVerificationFailure", linkageName: "command_line_arguments.SSHVerificationFailure.String", scope: null, file: !7, line: 439, type: !879, isLocal: false, isDefinition: true, scopeLine: 439, isOptimized: false, unit: !1, retainedNodes: !3)
!879 = !DISubroutineType(types: !880)
!880 = !{!69, !326, !326}
!881 = !DILocalVariable(name: "m", arg: 1, scope: !878, file: !7, line: 439, type: !326)
!882 = !DILocation(line: 439, column: 1, scope: !878)
!883 = !DILocation(line: 439, column: 83, scope: !878)
!884 = !DILocation(line: 439, column: 65, scope: !878)
!885 = !DILocation(line: 439, column: 52, scope: !878)
!886 = distinct !DISubprogram(name: "protocol.GetVerificationFailure..1command_line_arguments.ServerResponse", linkageName: "command_line_arguments.ServerResponse.GetVerificationFailure", scope: null, file: !7, line: 397, type: !887, isLocal: false, isDefinition: true, scopeLine: 397, isOptimized: false, unit: !1, retainedNodes: !3)
!887 = !DISubroutineType(types: !888)
!888 = !{!326, !316, !316}
!889 = !DILocalVariable(name: "m", arg: 1, scope: !886, file: !7, line: 397, type: !316)
!890 = !DILocation(line: 397, column: 1, scope: !886)
!891 = !DILocalVariable(name: "$ret44", scope: !886, file: !7, line: 397, type: !326)
!892 = !DILocation(line: 397, column: 51, scope: !886)
!893 = !DILocation(line: 398, column: 7, scope: !886)
!894 = !DILocation(line: 401, column: 2, scope: !886)
!895 = !DILocation(line: 399, column: 11, scope: !886)
!896 = !DILocation(line: 399, column: 3, scope: !886)
!897 = distinct !DISubprogram(name: "protocol.Reset..1command_line_arguments.ServerResponse", linkageName: "command_line_arguments.ServerResponse.Reset", scope: null, file: !7, line: 386, type: !898, isLocal: false, isDefinition: true, scopeLine: 386, isOptimized: false, unit: !1, retainedNodes: !3)
!898 = !DISubroutineType(types: !899)
!899 = !{!56, !316, !316}
!900 = !DILocalVariable(name: "m", arg: 1, scope: !897, file: !7, line: 386, type: !316)
!901 = !DILocation(line: 386, column: 1, scope: !897)
!902 = !DILocation(line: 386, column: 47, scope: !897)
!903 = distinct !DISubprogram(name: "protocol.String..1command_line_arguments.ServerResponse", linkageName: "command_line_arguments.ServerResponse.String", scope: null, file: !7, line: 387, type: !904, isLocal: false, isDefinition: true, scopeLine: 387, isOptimized: false, unit: !1, retainedNodes: !3)
!904 = !DISubroutineType(types: !905)
!905 = !{!69, !316, !316}
!906 = !DILocalVariable(name: "m", arg: 1, scope: !903, file: !7, line: 387, type: !316)
!907 = !DILocation(line: 387, column: 1, scope: !903)
!908 = !DILocation(line: 387, column: 75, scope: !903)
!909 = !DILocation(line: 387, column: 57, scope: !903)
!910 = !DILocation(line: 387, column: 44, scope: !903)
!911 = distinct !DISubprogram(name: "protocol.GetServerResponse..1command_line_arguments.Message", linkageName: "command_line_arguments.Message.GetServerResponse", scope: null, file: !7, line: 173, type: !912, isLocal: false, isDefinition: true, scopeLine: 173, isOptimized: false, unit: !1, retainedNodes: !3)
!912 = !DISubroutineType(types: !913)
!913 = !{!316, !272, !272}
!914 = !DILocalVariable(name: "m", arg: 1, scope: !911, file: !7, line: 173, type: !272)
!915 = !DILocation(line: 173, column: 1, scope: !911)
!916 = !DILocalVariable(name: "$ret16", scope: !911, file: !7, line: 173, type: !316)
!917 = !DILocation(line: 173, column: 39, scope: !911)
!918 = !DILocation(line: 174, column: 7, scope: !911)
!919 = !DILocation(line: 177, column: 2, scope: !911)
!920 = !DILocation(line: 175, column: 11, scope: !911)
!921 = !DILocation(line: 175, column: 3, scope: !911)
!922 = distinct !DISubprogram(name: "protocol.Enum.command_line_arguments.Message_Source", linkageName: "command_line_arguments.Message_Source.Enum", scope: null, file: !7, line: 75, type: !923, isLocal: false, isDefinition: true, scopeLine: 75, isOptimized: false, unit: !1, retainedNodes: !3)
!923 = !DISubroutineType(types: !924)
!924 = !{!277, !277, !277}
!925 = !DILocalVariable(name: "pointer", arg: 1, scope: !922, file: !7, line: 75, type: !277)
!926 = !DILocation(line: 75, column: 1, scope: !922)
!927 = !DILocalVariable(name: "x", scope: !922, file: !7, line: 75, type: !278)
!928 = !DILocalVariable(name: "$ret5", scope: !922, file: !7, line: 75, type: !277)
!929 = !DILocation(line: 75, column: 32, scope: !922)
!930 = !DILocation(line: 76, column: 7, scope: !931)
!931 = distinct !DILexicalBlock(scope: !922, file: !7, line: 75, column: 1)
!932 = !DILocalVariable(name: "p", scope: !931, file: !7, line: 76, type: !277)
!933 = !DILocation(line: 76, column: 2, scope: !922)
!934 = !DILocation(line: 77, column: 2, scope: !931)
!935 = !DILocation(line: 77, column: 5, scope: !931)
!936 = !DILocation(line: 78, column: 2, scope: !931)
!937 = distinct !DISubprogram(name: "protocol.String.command_line_arguments.Message_Source", linkageName: "command_line_arguments.Message_Source.String", scope: null, file: !7, line: 80, type: !938, isLocal: false, isDefinition: true, scopeLine: 80, isOptimized: false, unit: !1, retainedNodes: !3)
!938 = !DISubroutineType(types: !939)
!939 = !{!69, !277, !277}
!940 = !DILocalVariable(name: "pointer", arg: 1, scope: !937, file: !7, line: 80, type: !277)
!941 = !DILocation(line: 80, column: 1, scope: !937)
!942 = !DILocalVariable(name: "x", scope: !937, file: !7, line: 80, type: !278)
!943 = !DILocation(line: 81, column: 24, scope: !937)
!944 = !DILocation(line: 81, column: 15, scope: !937)
!945 = !DILocation(line: 81, column: 2, scope: !937)
!946 = distinct !DISubprogram(name: "protocol.UnmarshalJSON..1command_line_arguments.Message_Source", linkageName: "command_line_arguments.Message_Source.UnmarshalJSON", scope: null, file: !7, line: 83, type: !947, isLocal: false, isDefinition: true, scopeLine: 83, isOptimized: false, unit: !1, retainedNodes: !3)
!947 = !DISubroutineType(types: !948)
!948 = !{!28, !277, !277, !19}
!949 = !DILocalVariable(name: "data", arg: 2, scope: !946, file: !7, line: 83, type: !19)
!950 = !DILocation(line: 83, column: 40, scope: !946)
!951 = !DILocalVariable(name: "x", arg: 1, scope: !946, file: !7, line: 83, type: !277)
!952 = !DILocation(line: 83, column: 1, scope: !946)
!953 = !DILocation(line: 84, column: 40, scope: !954)
!954 = distinct !DILexicalBlock(scope: !946, file: !7, line: 83, column: 1)
!955 = !DILocation(line: 84, column: 22, scope: !954)
!956 = !DILocalVariable(name: "value", scope: !954, file: !7, line: 84, type: !518)
!957 = !DILocation(line: 84, column: 2, scope: !946)
!958 = !DILocalVariable(name: "err", scope: !954, file: !7, line: 84, type: !28)
!959 = !DILocation(line: 85, column: 9, scope: !954)
!960 = !DILocation(line: 86, column: 3, scope: !954)
!961 = !DILocalVariable(name: "$ret7", scope: !946, file: !7, line: 83, type: !28)
!962 = !DILocation(line: 83, column: 53, scope: !946)
!963 = !DILocation(line: 88, column: 2, scope: !954)
!964 = !DILocation(line: 88, column: 5, scope: !954)
!965 = !DILocation(line: 89, column: 2, scope: !954)
!966 = distinct !DISubprogram(name: "protocol.GetSource..1command_line_arguments.Message", linkageName: "command_line_arguments.Message.GetSource", scope: null, file: !7, line: 152, type: !967, isLocal: false, isDefinition: true, scopeLine: 152, isOptimized: false, unit: !1, retainedNodes: !3)
!967 = !DISubroutineType(types: !968)
!968 = !{!278, !272, !272}
!969 = !DILocalVariable(name: "m", arg: 1, scope: !966, file: !7, line: 152, type: !272)
!970 = !DILocation(line: 152, column: 1, scope: !966)
!971 = !DILocalVariable(name: "$ret13", scope: !966, file: !7, line: 152, type: !278)
!972 = !DILocation(line: 152, column: 31, scope: !966)
!973 = !DILocation(line: 153, column: 7, scope: !966)
!974 = !DILocation(line: 153, column: 18, scope: !966)
!975 = !DILocation(line: 153, column: 26, scope: !966)
!976 = !DILocation(line: 156, column: 2, scope: !966)
!977 = !DILocation(line: 154, column: 10, scope: !966)
!978 = !DILocation(line: 154, column: 3, scope: !966)
!979 = distinct !DISubprogram(name: "protocol.GetSuccess..1command_line_arguments.Message", linkageName: "command_line_arguments.Message.GetSuccess", scope: null, file: !7, line: 194, type: !980, isLocal: false, isDefinition: true, scopeLine: 194, isOptimized: false, unit: !1, retainedNodes: !3)
!980 = !DISubroutineType(types: !981)
!981 = !{!353, !272, !272}
!982 = !DILocalVariable(name: "m", arg: 1, scope: !979, file: !7, line: 194, type: !272)
!983 = !DILocation(line: 194, column: 1, scope: !979)
!984 = !DILocalVariable(name: "$ret19", scope: !979, file: !7, line: 194, type: !353)
!985 = !DILocation(line: 194, column: 32, scope: !979)
!986 = !DILocation(line: 195, column: 7, scope: !979)
!987 = !DILocation(line: 198, column: 2, scope: !979)
!988 = !DILocation(line: 196, column: 11, scope: !979)
!989 = !DILocation(line: 196, column: 3, scope: !979)
!990 = distinct !DISubprogram(name: "protocol.Reset..1command_line_arguments.Message", linkageName: "command_line_arguments.Message.Reset", scope: null, file: !7, line: 139, type: !991, isLocal: false, isDefinition: true, scopeLine: 139, isOptimized: false, unit: !1, retainedNodes: !3)
!991 = !DISubroutineType(types: !992)
!992 = !{!56, !272, !272}
!993 = !DILocalVariable(name: "m", arg: 1, scope: !990, file: !7, line: 139, type: !272)
!994 = !DILocation(line: 139, column: 1, scope: !990)
!995 = !DILocation(line: 139, column: 40, scope: !990)
!996 = distinct !DISubprogram(name: "protocol.String..1command_line_arguments.Message", linkageName: "command_line_arguments.Message.String", scope: null, file: !7, line: 140, type: !461, isLocal: false, isDefinition: true, scopeLine: 140, isOptimized: false, unit: !1, retainedNodes: !3)
!997 = !DILocalVariable(name: "m", arg: 1, scope: !996, file: !7, line: 140, type: !272)
!998 = !DILocation(line: 140, column: 1, scope: !996)
!999 = !DILocation(line: 140, column: 68, scope: !996)
!1000 = !DILocation(line: 140, column: 50, scope: !996)
!1001 = !DILocation(line: 140, column: 37, scope: !996)
!1002 = distinct !DISubprogram(name: "protocol.command_line_arguments.messageConnection..hash", linkageName: "command_line_arguments.command_line_arguments.messageConnection..hash", scope: null, file: !29, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!1003 = !DILocalVariable(name: "key", arg: 1, scope: !1002, file: !29, line: 1, type: !55)
!1004 = !DILocation(line: 1, column: 1, scope: !1002)
!1005 = !DILocalVariable(name: "seed", arg: 2, scope: !1002, file: !29, line: 1, type: !40)
!1006 = !DILocalVariable(name: "$ret70", scope: !1002, file: !29, line: 1, type: !40)
!1007 = distinct !DISubprogram(name: "protocol.command_line_arguments.messageConnection..eq", linkageName: "command_line_arguments.command_line_arguments.messageConnection..eq", scope: null, file: !29, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!1008 = !DILocalVariable(name: "key1", arg: 1, scope: !1007, file: !29, line: 1, type: !55)
!1009 = !DILocation(line: 1, column: 1, scope: !1007)
!1010 = !DILocalVariable(name: "key2", arg: 2, scope: !1007, file: !29, line: 1, type: !55)
!1011 = !DILocalVariable(name: "$ret71", scope: !1007, file: !29, line: 1, type: !65)
!1012 = distinct !DISubprogram(name: "protocol.Close..1command_line_arguments.messageConnection", linkageName: "command_line_arguments.messageConnection.Close", scope: null, file: !1013, line: 47, type: !1014, isLocal: false, isDefinition: true, scopeLine: 47, isOptimized: false, unit: !1, retainedNodes: !3)
!1013 = !DIFile(filename: "handlers.go", directory: ".")
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!28, !1016, !1016}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.messageConnection", file: !1013, line: 35, size: 128, align: 8, elements: !1018)
!1018 = !{!1019}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "internalConn", file: !1013, line: 36, baseType: !1020, size: 128, align: 64)
!1020 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteCloser", file: !1013, line: 19, size: 128, align: 8, elements: !1021)
!1021 = !{!1022, !1040}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !1013, line: 19, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !16, size: 256, align: 8, elements: !1025)
!1025 = !{!1026, !1027, !1031, !1039}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !16, line: 19, baseType: !36, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !16, line: 19, baseType: !1028, size: 64, align: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!28, !55}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !16, line: 19, baseType: !1032, size: 64, align: 64, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!1035, !55, !19}
!1035 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !16, size: 192, align: 8, elements: !1036)
!1036 = !{!1037, !1038}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !16, line: 19, baseType: !25, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !16, line: 19, baseType: !28, size: 128, align: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !16, line: 19, baseType: !1032, size: 64, align: 64, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !1013, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!1041 = !DILocalVariable(name: "smc", arg: 1, scope: !1012, file: !1013, line: 47, type: !1016)
!1042 = !DILocation(line: 47, column: 1, scope: !1012)
!1043 = !DILocation(line: 48, column: 12, scope: !1012)
!1044 = !DILocation(line: 48, column: 25, scope: !1012)
!1045 = !DILocation(line: 48, column: 2, scope: !1012)
!1046 = distinct !DISubprogram(name: "protocol.Read..1command_line_arguments.messageConnection", linkageName: "command_line_arguments.messageConnection.Read", scope: null, file: !1013, line: 39, type: !1047, isLocal: false, isDefinition: true, scopeLine: 39, isOptimized: false, unit: !1, retainedNodes: !3)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!1049, !1016, !1016}
!1049 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Message,error}", file: !16, size: 192, align: 8, elements: !1050)
!1050 = !{!1051, !1052}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 26, baseType: !272, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !16, line: 26, baseType: !28, size: 128, align: 64, offset: 64)
!1053 = !DILocalVariable(name: "smc", arg: 1, scope: !1046, file: !1013, line: 39, type: !1016)
!1054 = !DILocation(line: 39, column: 1, scope: !1046)
!1055 = !DILocalVariable(name: "$ret0", scope: !1046, file: !1013, line: 39, type: !272)
!1056 = !DILocation(line: 39, column: 39, scope: !1046)
!1057 = !DILocation(line: 40, column: 17, scope: !1046)
!1058 = !DILocation(line: 40, column: 9, scope: !1046)
!1059 = !DILocation(line: 40, column: 2, scope: !1046)
!1060 = distinct !DISubprogram(name: "protocol.Write..1command_line_arguments.messageConnection", linkageName: "command_line_arguments.messageConnection.Write", scope: null, file: !1013, line: 43, type: !1061, isLocal: false, isDefinition: true, scopeLine: 43, isOptimized: false, unit: !1, retainedNodes: !3)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!28, !1016, !1016, !272}
!1063 = !DILocalVariable(name: "smc", arg: 1, scope: !1060, file: !1013, line: 43, type: !1016)
!1064 = !DILocation(line: 43, column: 1, scope: !1060)
!1065 = !DILocalVariable(name: "msg", arg: 2, scope: !1060, file: !1013, line: 43, type: !272)
!1066 = !DILocation(line: 43, column: 37, scope: !1060)
!1067 = !DILocation(line: 44, column: 18, scope: !1060)
!1068 = !DILocation(line: 44, column: 9, scope: !1060)
!1069 = !DILocation(line: 44, column: 2, scope: !1060)
!1070 = distinct !DISubprogram(name: "protocol.Read", linkageName: "command_line_arguments.Read", scope: null, file: !144, line: 86, type: !1071, isLocal: false, isDefinition: true, scopeLine: 86, isOptimized: false, unit: !1, retainedNodes: !3)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!1049, !1073}
!1073 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !1013, line: 19, size: 128, align: 8, elements: !1074)
!1074 = !{!1075, !1040}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !1013, line: 19, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !16, size: 128, align: 8, elements: !1078)
!1078 = !{!1026, !1079}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !16, line: 19, baseType: !1032, size: 64, align: 64, offset: 64)
!1080 = !DILocalVariable(name: "r", arg: 1, scope: !1070, file: !144, line: 86, type: !1073)
!1081 = !DILocation(line: 86, column: 11, scope: !1070)
!1082 = !DILocalVariable(name: "$ret67", scope: !1070, file: !144, line: 86, type: !272)
!1083 = !DILocation(line: 86, column: 25, scope: !1070)
!1084 = !DILocation(line: 87, column: 6, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1070, file: !144, line: 86, column: 1)
!1086 = !DILocalVariable(name: "incomingHeader", scope: !1085, file: !144, line: 87, type: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.header", file: !144, line: 40, size: 128, align: 8, elements: !1089)
!1089 = !{!1090, !1091, !1092}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !144, line: 42, baseType: !43, size: 32, align: 32)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "Checksum", file: !144, line: 46, baseType: !43, size: 32, align: 32, offset: 32)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", file: !144, line: 50, baseType: !1093, size: 64, align: 64, offset: 64)
!1093 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!1094 = !DILocation(line: 87, column: 6, scope: !1070)
!1095 = !DILocation(line: 89, column: 31, scope: !1085)
!1096 = !DILocation(line: 89, column: 45, scope: !1085)
!1097 = !DILocation(line: 89, column: 16, scope: !1085)
!1098 = !DILocalVariable(name: "err", scope: !1085, file: !144, line: 89, type: !28)
!1099 = !DILocation(line: 89, column: 2, scope: !1070)
!1100 = !DILocation(line: 90, column: 9, scope: !1085)
!1101 = !DILocalVariable(name: "$ret68", scope: !1070, file: !144, line: 86, type: !28)
!1102 = !DILocation(line: 86, column: 35, scope: !1070)
!1103 = !DILocation(line: 91, column: 3, scope: !1085)
!1104 = !DILocation(line: 94, column: 19, scope: !1085)
!1105 = !DILocation(line: 94, column: 34, scope: !1085)
!1106 = !DILocation(line: 95, column: 19, scope: !1085)
!1107 = !DILocation(line: 95, column: 3, scope: !1085)
!1108 = !DILocation(line: 98, column: 9, scope: !1085)
!1109 = !DILocalVariable(name: "msg", scope: !1085, file: !144, line: 98, type: !272)
!1110 = !DILocation(line: 98, column: 2, scope: !1070)
!1111 = !DILocation(line: 99, column: 37, scope: !1085)
!1112 = !DILocation(line: 99, column: 10, scope: !1085)
!1113 = !DILocalVariable(name: "n", scope: !1114, file: !144, line: 102, type: !43)
!1114 = distinct !DILexicalBlock(scope: !1085, file: !144, line: 102, column: 2)
!1115 = !DILocation(line: 102, column: 6, scope: !1085)
!1116 = !DILocation(line: 102, column: 40, scope: !1114)
!1117 = !DILocation(line: 102, column: 24, scope: !1114)
!1118 = !DILocation(line: 103, column: 28, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1114, file: !144, line: 102, column: 56)
!1120 = !DILocation(line: 103, column: 18, scope: !1119)
!1121 = !DILocation(line: 103, column: 24, scope: !1119)
!1122 = !DILocalVariable(name: "err", scope: !1119, file: !144, line: 103, type: !28)
!1123 = !DILocation(line: 103, column: 3, scope: !1114)
!1124 = !DILocation(line: 104, column: 10, scope: !1119)
!1125 = !DILocation(line: 105, column: 4, scope: !1119)
!1126 = !DILocalVariable(name: "nRead", scope: !1119, file: !144, line: 103, type: !25)
!1127 = !DILocation(line: 107, column: 8, scope: !1119)
!1128 = !DILocation(line: 107, column: 5, scope: !1119)
