; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22server\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22base64\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/AdRoll/hologram/log\22"
module asm "\09.ascii \22 \5C\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./credentials.go", directory: "/home/wangcong/go_path/src/github.com/AdRoll/hologram/server")
!3 = !{}
!4 = !{!5, !9}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "encoding_base64.StdEncoding", linkageName: "encoding_base64.StdEncoding", scope: !1, file: !11, line: 18, type: !12, isLocal: false, isDefinition: true)
!11 = !DIFile(filename: "usercache.go", directory: ".")
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "Encoding", file: !11, line: 18, size: 2624, align: 8, elements: !14)
!14 = !{!15, !20, !24, !26}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "encode", file: !11, line: 18, baseType: !16, size: 512, align: 8)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 512, align: 1, elements: !18)
!17 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!18 = !{!19}
!19 = !DISubrange(count: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "decodeMap", file: !11, line: 18, baseType: !21, size: 2048, align: 8, offset: 512)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 2048, align: 1, elements: !22)
!22 = !{!23}
!23 = !DISubrange(count: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "padChar", file: !11, line: 18, baseType: !25, size: 32, align: 32, offset: 2560)
!25 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "strict", file: !11, line: 18, baseType: !27, size: 8, align: 8, offset: 2592)
!27 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!28 = distinct !DISubprogram(name: "server.command_line_arguments.directSessionTokenService..hash", linkageName: "command_line_arguments.command_line_arguments.directSessionTokenService..hash", scope: null, file: !7, line: 1, type: !29, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!29 = !DISubroutineType(types: !30)
!30 = !{!31, !32, !31}
!31 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIBasicType(name: "void")
!34 = !DILocalVariable(name: "key", arg: 1, scope: !28, file: !7, line: 1, type: !32)
!35 = !DILocation(line: 1, column: 1, scope: !28)
!36 = !DILocalVariable(name: "seed", arg: 2, scope: !28, file: !7, line: 1, type: !31)
!37 = !DILocalVariable(name: "$ret25", scope: !28, file: !7, line: 1, type: !31)
!38 = distinct !DISubprogram(name: "server.command_line_arguments.directSessionTokenService..eq", linkageName: "command_line_arguments.command_line_arguments.directSessionTokenService..eq", scope: null, file: !7, line: 1, type: !39, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!39 = !DISubroutineType(types: !40)
!40 = !{!27, !32, !32}
!41 = !DILocalVariable(name: "key1", arg: 1, scope: !38, file: !7, line: 1, type: !32)
!42 = !DILocation(line: 1, column: 1, scope: !38)
!43 = !DILocalVariable(name: "key2", arg: 2, scope: !38, file: !7, line: 1, type: !32)
!44 = !DILocalVariable(name: "$ret26", scope: !38, file: !7, line: 1, type: !27)
!45 = distinct !DISubprogram(name: "server.AssumeRole..1command_line_arguments.directSessionTokenService", linkageName: "command_line_arguments.directSessionTokenService.AssumeRole", scope: null, file: !46, line: 87, type: !47, isLocal: false, isDefinition: true, scopeLine: 87, isOptimized: false, unit: !1, retainedNodes: !3)
!46 = !DIFile(filename: "credentials.go", directory: ".")
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !159, !159, !739, !60, !27}
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Credentials,error}", file: !50, size: 192, align: 8, elements: !51)
!50 = !DIFile(filename: "", directory: "")
!51 = !{!52, !106}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 35, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "Credentials", file: !46, line: 26, size: 256, align: 8, elements: !55)
!55 = !{!56, !58, !66, !104, !105}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_", file: !46, line: 26, baseType: !57, align: 8)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !7, line: 1, align: 8, elements: !3)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "AccessKeyId", file: !46, line: 26, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !61)
!61 = !{!62, !64}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !65, size: 64, align: 64, offset: 64)
!65 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Expiration", file: !46, line: 26, baseType: !67, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !46, line: 26, size: 192, align: 8, elements: !69)
!69 = !{!70, !72, !74}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !46, line: 26, baseType: !71, size: 64, align: 64)
!71 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !46, line: 26, baseType: !73, size: 64, align: 64, offset: 64)
!73 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !46, line: 26, baseType: !75, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !46, line: 26, size: 704, align: 8, elements: !77)
!77 = !{!78, !79, !90, !101, !102, !103}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !46, line: 26, baseType: !60, size: 128, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !46, line: 26, baseType: !80, size: 192, align: 64, offset: 128)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !50, size: 192, align: 8, elements: !81)
!81 = !{!82, !88, !89}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !46, line: 26, size: 256, align: 8, elements: !85)
!85 = !{!78, !86, !87}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !46, line: 26, baseType: !65, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !50, line: 1, baseType: !65, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !50, line: 1, baseType: !65, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !46, line: 26, baseType: !91, size: 192, align: 64, offset: 320)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !50, size: 192, align: 8, elements: !92)
!92 = !{!93, !88, !89}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !46, line: 26, size: 128, align: 8, elements: !96)
!96 = !{!97, !98, !99, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !46, line: 26, baseType: !73, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !46, line: 26, baseType: !17, size: 8, align: 8, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 72)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 80)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !46, line: 26, baseType: !73, size: 64, align: 64, offset: 512)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !46, line: 26, baseType: !73, size: 64, align: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !46, line: 26, baseType: !83, size: 64, align: 64, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "SecretAccessKey", file: !46, line: 26, baseType: !59, size: 64, align: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "SessionToken", file: !46, line: 26, baseType: !59, size: 64, align: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 35, baseType: !107, size: 128, align: 64, offset: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !108)
!108 = !{!109, !158}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !50, size: 128, align: 8, elements: !112)
!112 = !{!113, !154}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !50, line: 1, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !129, !135, !136, !137, !153}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !31, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !31, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !17, size: 8, align: 8, offset: 160)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !17, size: 8, align: 8, offset: 168)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !17, size: 8, align: 8, offset: 176)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !124, size: 64, align: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !126)
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !130, size: 64, align: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !132)
!132 = !{!133}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !63, size: 64, align: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !59, size: 64, align: 64, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !138, size: 64, align: 64, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !140)
!140 = !{!141, !142, !143}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !59, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !144, size: 192, align: 64, offset: 128)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !50, size: 192, align: 8, elements: !145)
!145 = !{!146, !88, !89}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !149)
!149 = !{!141, !142, !150, !151, !152}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !32, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !32, size: 64, align: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !32, size: 64, align: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !32, size: 64, align: 64, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !50, line: 1, baseType: !155, size: 64, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!60, !32}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !32, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.directSessionTokenService", file: !46, line: 53, size: 256, align: 8, elements: !161)
!161 = !{!162, !163, !737}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "iamAccount", file: !46, line: 54, baseType: !60, size: 128, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "sts", file: !46, line: 55, baseType: !164, size: 64, align: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "STS", file: !46, line: 26, size: 64, align: 8, elements: !166)
!166 = !{!167}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Client", file: !46, line: 26, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "Client", file: !46, line: 26, size: 4864, align: 8, elements: !170)
!170 = !{!171, !734, !735, !736}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Retryer", file: !46, line: 26, baseType: !172, size: 128, align: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "Retryer", file: !46, line: 26, size: 128, align: 8, elements: !173)
!173 = !{!174, !232}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !46, line: 26, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)int,*func(*void,*Request)Duration,*func(*void,*Request)bool}", file: !50, size: 256, align: 8, elements: !177)
!177 = !{!178, !179, !183, !730}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !50, line: 26, baseType: !114, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "MaxRetries", file: !50, line: 26, baseType: !180, size: 64, align: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!65, !32}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "RetryRules", file: !50, line: 26, baseType: !184, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!187, !32, !188}
!187 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !46, line: 26, size: 6656, align: 8, elements: !190)
!190 = !{!191, !624, !634, !677, !678, !679, !680, !694, !695, !696, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Config", file: !46, line: 26, baseType: !192, size: 1280, align: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !46, line: 26, size: 1280, align: 8, elements: !193)
!193 = !{!194, !196, !233, !234, !235, !236, !589, !592, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "CredentialsChainVerboseErrors", file: !46, line: 26, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Credentials", file: !46, line: 26, baseType: !197, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "Credentials", file: !46, line: 26, size: 768, align: 8, elements: !199)
!199 = !{!200, !207, !208, !213}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "creds", file: !46, line: 26, baseType: !201, size: 512, align: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !46, line: 26, size: 512, align: 8, elements: !202)
!202 = !{!203, !204, !205, !206}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "AccessKeyID", file: !46, line: 26, baseType: !60, size: 128, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "SecretAccessKey", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "SessionToken", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ProviderName", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "forceRefresh", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !46, line: 26, baseType: !209, size: 64, align: 32, offset: 544)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !46, line: 25, size: 64, align: 8, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !46, line: 25, baseType: !25, size: 32, align: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !46, line: 25, baseType: !8, size: 32, align: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "provider", file: !46, line: 26, baseType: !214, size: 128, align: 64, offset: 640)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "Provider", file: !46, line: 26, size: 128, align: 8, elements: !215)
!215 = !{!216, !232}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !46, line: 26, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)bool,*func(*void)struct{Value,error}}", file: !50, size: 192, align: 8, elements: !219)
!219 = !{!178, !220, !224}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "IsExpired", file: !50, line: 26, baseType: !221, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!27, !32}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Retrieve", file: !50, line: 26, baseType: !225, size: 64, align: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !32}
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Value,error}", file: !50, size: 640, align: 8, elements: !229)
!229 = !{!230, !231}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 26, baseType: !201, size: 512, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 26, baseType: !107, size: 128, align: 64, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !46, line: 1, baseType: !32, size: 64, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Endpoint", file: !46, line: 26, baseType: !59, size: 64, align: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Region", file: !46, line: 26, baseType: !59, size: 64, align: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "DisableSSL", file: !46, line: 26, baseType: !195, size: 64, align: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "HTTPClient", file: !46, line: 26, baseType: !237, size: 64, align: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Client", file: !46, line: 26, size: 384, align: 8, elements: !239)
!239 = !{!240, !543, !555, !588}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Transport", file: !46, line: 26, baseType: !241, size: 128, align: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "RoundTripper", file: !46, line: 26, size: 128, align: 8, elements: !242)
!242 = !{!243, !232}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !46, line: 26, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*Request)struct{*Response,error}}", file: !50, size: 128, align: 8, elements: !246)
!246 = !{!178, !247}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "RoundTrip", file: !50, line: 26, baseType: !248, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!251, !32, !307}
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Response,error}", file: !50, size: 192, align: 8, elements: !252)
!252 = !{!253, !542}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 26, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !46, line: 26, size: 1152, align: 8, elements: !256)
!256 = !{!257, !258, !259, !260, !261, !262, !276, !298, !299, !303, !304, !305, !306, !541}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !46, line: 26, baseType: !60, size: 128, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "StatusCode", file: !46, line: 26, baseType: !65, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Proto", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMajor", file: !46, line: 26, baseType: !65, size: 64, align: 64, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMinor", file: !46, line: 26, baseType: !65, size: 64, align: 64, offset: 384)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !46, line: 26, baseType: !263, size: 64, align: 64, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !265)
!265 = !{!266, !267, !268, !269, !271, !272, !273, !274, !275}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !65, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !17, size: 8, align: 8, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !17, size: 8, align: 8, offset: 72)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !270, size: 16, align: 16, offset: 80)
!270 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !32, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !32, size: 64, align: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !31, size: 64, align: 64, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !32, size: 64, align: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !46, line: 26, baseType: !277, size: 128, align: 64, offset: 512)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !46, line: 26, size: 128, align: 8, elements: !278)
!278 = !{!279, !232}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !46, line: 26, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !50, size: 192, align: 8, elements: !282)
!282 = !{!178, !283, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !50, line: 26, baseType: !284, size: 64, align: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!107, !32}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !50, line: 26, baseType: !288, size: 64, align: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!291, !32, !295}
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !50, size: 192, align: 8, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !50, line: 22, baseType: !65, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !50, line: 22, baseType: !107, size: 128, align: 64, offset: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !50, size: 192, align: 8, elements: !296)
!296 = !{!297, !88, !89}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !63, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !46, line: 26, baseType: !73, size: 64, align: 64, offset: 640)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 704)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !50, size: 192, align: 8, elements: !301)
!301 = !{!302, !88, !89}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !59, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 896)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Uncompressed", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 904)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !46, line: 26, baseType: !263, size: 64, align: 64, offset: 960)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Request", file: !46, line: 26, baseType: !307, size: 64, align: 64, offset: 1024)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !46, line: 26, size: 1984, align: 8, elements: !309)
!309 = !{!310, !311, !259, !260, !261, !262, !276, !330, !342, !343, !344, !345, !346, !347, !348, !354, !355, !356, !357, !514, !516, !517}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !46, line: 26, baseType: !60, size: 128, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !46, line: 26, baseType: !312, size: 64, align: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !46, line: 26, size: 1024, align: 8, elements: !314)
!314 = !{!315, !316, !317, !324, !325, !326, !327, !328, !329}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !46, line: 26, baseType: !60, size: 128, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !46, line: 26, baseType: !318, size: 64, align: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !46, line: 26, size: 320, align: 8, elements: !320)
!320 = !{!321, !322, !323}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !46, line: 26, baseType: !60, size: 128, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 576)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 704)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 768)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 896)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !46, line: 26, baseType: !331, size: 64, align: 64, offset: 640)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !46, line: 26, size: 64, align: 8, elements: !333)
!333 = !{!334}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !46, line: 26, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!338}
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !50, size: 256, align: 8, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 26, baseType: !277, size: 128, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 26, baseType: !107, size: 128, align: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !46, line: 26, baseType: !73, size: 64, align: 64, offset: 704)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 768)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 960)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 1024)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Form", file: !46, line: 26, baseType: !263, size: 64, align: 64, offset: 1152)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "PostForm", file: !46, line: 26, baseType: !263, size: 64, align: 64, offset: 1216)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "MultipartForm", file: !46, line: 26, baseType: !349, size: 64, align: 64, offset: 1280)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", file: !46, line: 26, size: 128, align: 8, elements: !351)
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !46, line: 26, baseType: !263, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !46, line: 26, baseType: !263, size: 64, align: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !46, line: 26, baseType: !263, size: 64, align: 64, offset: 1344)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 1408)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "RequestURI", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 1536)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !46, line: 26, baseType: !358, size: 64, align: 64, offset: 1664)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionState", file: !46, line: 26, size: 1344, align: 8, elements: !360)
!360 = !{!361, !362, !363, !364, !365, !366, !367, !368, !502, !507, !512, !513}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !46, line: 26, baseType: !270, size: 16, align: 16)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "HandshakeComplete", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 16)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "DidResume", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 24)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuite", file: !46, line: 26, baseType: !270, size: 16, align: 16, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocol", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocolIsMutual", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "PeerCertificates", file: !46, line: 26, baseType: !369, size: 192, align: 64, offset: 384)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !50, size: 192, align: 8, elements: !370)
!370 = !{!371, !88, !89}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !46, line: 26, size: 10624, align: 8, elements: !375)
!375 = !{!376, !377, !378, !379, !380, !381, !382, !384, !386, !390, !391, !404, !430, !431, !432, !433, !435, !445, !446, !451, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !476, !481, !482, !483, !484, !495, !496, !497, !498, !499, !500, !501}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !46, line: 26, baseType: !295, size: 192, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !46, line: 26, baseType: !295, size: 192, align: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !46, line: 26, baseType: !295, size: 192, align: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !46, line: 26, baseType: !295, size: 192, align: 64, offset: 576)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !46, line: 26, baseType: !295, size: 192, align: 64, offset: 768)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !46, line: 26, baseType: !295, size: 192, align: 64, offset: 960)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !46, line: 26, baseType: !383, size: 64, align: 64, offset: 1152)
!383 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !46, line: 26, baseType: !385, size: 64, align: 64, offset: 1216)
!385 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !46, line: 26, baseType: !387, size: 128, align: 64, offset: 1280)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "RequestRetryer", file: !46, line: 26, size: 128, align: 8, elements: !388)
!388 = !{!389, !232}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !46, line: 1, baseType: !114, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !46, line: 26, baseType: !65, size: 64, align: 64, offset: 1408)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !46, line: 26, baseType: !392, size: 64, align: 64, offset: 1472)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !46, line: 26, size: 256, align: 8, elements: !394)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !46, line: 26, baseType: !27, size: 8, align: 8)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !46, line: 26, baseType: !397, size: 192, align: 64, offset: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !46, line: 26, size: 192, align: 8, elements: !398)
!398 = !{!399, !402, !403}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !46, line: 1, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !46, line: 1, baseType: !65, size: 64, align: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !46, line: 1, baseType: !65, size: 64, align: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !46, line: 26, baseType: !405, size: 1984, align: 64, offset: 1536)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !46, line: 26, size: 1984, align: 8, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !429}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !46, line: 26, baseType: !300, size: 192, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 384)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 576)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 768)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 960)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 1152)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 1344)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 1472)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !46, line: 26, baseType: !417, size: 192, align: 64, offset: 1600)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !50, size: 192, align: 8, elements: !418)
!418 = !{!419, !88, !89}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !46, line: 26, size: 320, align: 8, elements: !422)
!422 = !{!423, !428}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !46, line: 26, baseType: !424, size: 192, align: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !46, line: 26, size: 192, align: 8, elements: !425)
!425 = !{!426, !402, !403}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !46, line: 1, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !46, line: 26, baseType: !387, size: 128, align: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !46, line: 26, baseType: !417, size: 192, align: 64, offset: 1792)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !46, line: 26, baseType: !405, size: 1984, align: 64, offset: 3520)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !46, line: 26, baseType: !68, size: 192, align: 64, offset: 5504)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !46, line: 26, baseType: !68, size: 192, align: 64, offset: 5696)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !46, line: 26, baseType: !434, size: 64, align: 64, offset: 5888)
!434 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !46, line: 26, baseType: !436, size: 192, align: 64, offset: 5952)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !50, size: 192, align: 8, elements: !437)
!437 = !{!438, !88, !89}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !46, line: 26, size: 448, align: 8, elements: !441)
!441 = !{!442, !443, !444}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !46, line: 26, baseType: !424, size: 192, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !46, line: 26, baseType: !295, size: 192, align: 64, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !46, line: 26, baseType: !436, size: 192, align: 64, offset: 6144)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !46, line: 26, baseType: !447, size: 192, align: 64, offset: 6336)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !50, size: 192, align: 8, elements: !448)
!448 = !{!449, !88, !89}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !46, line: 26, baseType: !452, size: 192, align: 64, offset: 6528)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !50, size: 192, align: 8, elements: !453)
!453 = !{!454, !88, !89}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !455, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !46, line: 26, baseType: !447, size: 192, align: 64, offset: 6720)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 6912)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 6920)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !46, line: 26, baseType: !65, size: 64, align: 64, offset: 6976)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 7040)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !46, line: 26, baseType: !295, size: 192, align: 64, offset: 7104)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !46, line: 26, baseType: !295, size: 192, align: 64, offset: 7296)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 7488)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 7680)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 7872)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 8064)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !46, line: 26, baseType: !469, size: 192, align: 64, offset: 8256)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !50, size: 192, align: 8, elements: !470)
!470 = !{!471, !88, !89}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !46, line: 26, size: 192, align: 8, elements: !474)
!474 = !{!475, !402, !403}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !46, line: 1, baseType: !63, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !46, line: 26, baseType: !477, size: 192, align: 64, offset: 8448)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !50, size: 192, align: 8, elements: !478)
!478 = !{!479, !88, !89}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !480, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 8640)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 8704)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 8896)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !46, line: 26, baseType: !485, size: 192, align: 64, offset: 9088)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !50, size: 192, align: 8, elements: !486)
!486 = !{!487, !88, !89}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !46, line: 26, size: 384, align: 8, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !46, line: 26, baseType: !473, size: 192, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !46, line: 26, baseType: !494, size: 192, align: 64, offset: 192)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !46, line: 26, size: 192, align: 8, elements: !474)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !46, line: 26, baseType: !485, size: 192, align: 64, offset: 9280)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 9472)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 9664)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 9856)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 10048)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 10240)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !46, line: 26, baseType: !447, size: 192, align: 64, offset: 10432)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "VerifiedChains", file: !46, line: 26, baseType: !503, size: 192, align: 64, offset: 576)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !50, size: 192, align: 8, elements: !504)
!504 = !{!505, !88, !89}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !506, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !46, line: 26, baseType: !508, size: 192, align: 64, offset: 768)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !50, size: 192, align: 8, elements: !509)
!509 = !{!510, !88, !89}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !511, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPResponse", file: !46, line: 26, baseType: !295, size: 192, align: 64, offset: 960)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "TLSUnique", file: !46, line: 26, baseType: !295, size: 192, align: 64, offset: 1152)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", file: !46, line: 26, baseType: !515, size: 64, align: 64, offset: 1728)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !46, line: 26, baseType: !32, size: 64, align: 64, offset: 1792)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !46, line: 26, baseType: !518, size: 128, align: 64, offset: 1856)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !46, line: 26, size: 128, align: 8, elements: !519)
!519 = !{!520, !232}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !46, line: 26, baseType: !521, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,RequestRetryer)RequestRetryer}", file: !50, size: 320, align: 8, elements: !523)
!523 = !{!178, !524, !532, !536, !537}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !50, line: 26, baseType: !525, size: 64, align: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!528, !32}
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !50, size: 256, align: 8, elements: !529)
!529 = !{!530, !531}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !50, line: 26, baseType: !68, size: 192, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !50, line: 26, baseType: !27, size: 8, align: 8, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !50, line: 26, baseType: !533, size: 64, align: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!515, !32}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !50, line: 26, baseType: !284, size: 64, align: 64, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !50, line: 26, baseType: !538, size: 64, align: 64, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!387, !32, !387}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !46, line: 26, baseType: !358, size: 64, align: 64, offset: 1088)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 26, baseType: !107, size: 128, align: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "CheckRedirect", file: !46, line: 26, baseType: !544, size: 64, align: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !46, line: 26, size: 64, align: 8, elements: !546)
!546 = !{!547}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !46, line: 26, baseType: !548, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!107, !307, !551}
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Request,int,int}", file: !50, size: 192, align: 8, elements: !552)
!552 = !{!553, !88, !89}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !554, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Jar", file: !46, line: 26, baseType: !556, size: 128, align: 64, offset: 192)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "CookieJar", file: !46, line: 26, size: 128, align: 8, elements: !557)
!557 = !{!558, !232}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !46, line: 26, baseType: !559, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*URL)struct{**Cookie,int,int},*func(*void,*URL,struct{**Cookie,int,int})void}", file: !50, size: 192, align: 8, elements: !561)
!561 = !{!178, !562, !584}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Cookies", file: !50, line: 26, baseType: !563, size: 64, align: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!566, !32, !312}
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Cookie,int,int}", file: !50, size: 192, align: 8, elements: !567)
!567 = !{!568, !88, !89}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !569, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cookie", file: !46, line: 26, size: 1280, align: 8, elements: !572)
!572 = !{!573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !46, line: 26, baseType: !60, size: 128, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Domain", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Expires", file: !46, line: 26, baseType: !68, size: 192, align: 64, offset: 512)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "RawExpires", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 704)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "MaxAge", file: !46, line: 26, baseType: !65, size: 64, align: 64, offset: 832)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Secure", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 896)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "HttpOnly", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 904)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 960)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Unparsed", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 1088)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "SetCookies", file: !50, line: 26, baseType: !585, size: 64, align: 64, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!33, !32, !312, !566}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Timeout", file: !46, line: 26, baseType: !187, size: 64, align: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "LogLevel", file: !46, line: 26, baseType: !590, size: 64, align: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIBasicType(name: "LogLevelType", size: 64, encoding: DW_ATE_unsigned)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Logger", file: !46, line: 26, baseType: !593, size: 128, align: 64, offset: 448)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "Logger", file: !46, line: 26, size: 128, align: 8, elements: !594)
!594 = !{!595, !232}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !46, line: 26, baseType: !596, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*RequestRetryer,int,int})void}", file: !50, size: 128, align: 8, elements: !598)
!598 = !{!178, !599}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Log", file: !50, line: 26, baseType: !600, size: 64, align: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!33, !32, !603}
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*RequestRetryer,int,int}", file: !50, size: 192, align: 8, elements: !604)
!604 = !{!605, !88, !89}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !606, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "MaxRetries", file: !46, line: 26, baseType: !427, size: 64, align: 64, offset: 576)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Retryer", file: !46, line: 26, baseType: !387, size: 128, align: 64, offset: 640)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "DisableParamValidation", file: !46, line: 26, baseType: !195, size: 64, align: 64, offset: 768)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "DisableComputeChecksums", file: !46, line: 26, baseType: !195, size: 64, align: 64, offset: 832)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "S3ForcePathStyle", file: !46, line: 26, baseType: !195, size: 64, align: 64, offset: 896)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "S3Disable100Continue", file: !46, line: 26, baseType: !195, size: 64, align: 64, offset: 960)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "S3UseAccelerate", file: !46, line: 26, baseType: !195, size: 64, align: 64, offset: 1024)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "EC2MetadataDisableTimeoutOverride", file: !46, line: 26, baseType: !195, size: 64, align: 64, offset: 1088)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "UseDualStack", file: !46, line: 26, baseType: !195, size: 64, align: 64, offset: 1152)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "SleepDelay", file: !46, line: 26, baseType: !617, size: 64, align: 64, offset: 1216)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !46, line: 26, size: 64, align: 8, elements: !619)
!619 = !{!620}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !46, line: 26, baseType: !621, size: 64, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!33, !187}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ClientInfo", file: !46, line: 26, baseType: !625, size: 896, align: 64, offset: 1280)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientInfo", file: !46, line: 26, size: 896, align: 8, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !633}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ServiceName", file: !46, line: 26, baseType: !60, size: 128, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "APIVersion", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "Endpoint", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "SigningName", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 384)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "SigningRegion", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 512)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "JSONVersion", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 640)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "TargetPrefix", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 768)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Handlers", file: !46, line: 26, baseType: !635, size: 2560, align: 64, offset: 2176)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "Handlers", file: !46, line: 26, size: 2560, align: 8, elements: !636)
!636 = !{!637, !668, !669, !670, !671, !672, !673, !674, !675, !676}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Validate", file: !46, line: 26, baseType: !638, size: 256, align: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "HandlerList", file: !46, line: 26, size: 256, align: 8, elements: !639)
!639 = !{!640, !655}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "list", file: !46, line: 26, baseType: !641, size: 192, align: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*NamedHandler,int,int}", file: !50, size: 192, align: 8, elements: !642)
!642 = !{!643, !88, !89}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !644, size: 64, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "NamedHandler", file: !46, line: 26, size: 192, align: 8, elements: !646)
!646 = !{!573, !647}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", file: !46, line: 26, baseType: !648, size: 64, align: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !46, line: 26, size: 64, align: 8, elements: !650)
!650 = !{!651}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !46, line: 26, baseType: !652, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!33, !32}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "AfterEachFn", file: !46, line: 26, baseType: !656, size: 64, align: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !46, line: 26, size: 64, align: 8, elements: !658)
!658 = !{!659}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !46, line: 26, baseType: !660, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!27, !663}
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "HandlerListRunItem", file: !46, line: 26, size: 320, align: 8, elements: !664)
!664 = !{!665, !666, !667}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Index", file: !46, line: 26, baseType: !65, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Handler", file: !46, line: 26, baseType: !645, size: 192, align: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Request", file: !46, line: 26, baseType: !32, size: 64, align: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Build", file: !46, line: 26, baseType: !638, size: 256, align: 64, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Sign", file: !46, line: 26, baseType: !638, size: 256, align: 64, offset: 512)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Send", file: !46, line: 26, baseType: !638, size: 256, align: 64, offset: 768)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ValidateResponse", file: !46, line: 26, baseType: !638, size: 256, align: 64, offset: 1024)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Unmarshal", file: !46, line: 26, baseType: !638, size: 256, align: 64, offset: 1280)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "UnmarshalMeta", file: !46, line: 26, baseType: !638, size: 256, align: 64, offset: 1536)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "UnmarshalError", file: !46, line: 26, baseType: !638, size: 256, align: 64, offset: 1792)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Retry", file: !46, line: 26, baseType: !638, size: 256, align: 64, offset: 2048)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "AfterRetry", file: !46, line: 26, baseType: !638, size: 256, align: 64, offset: 2304)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Retryer", file: !46, line: 26, baseType: !172, size: 128, align: 64, offset: 4736)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Time", file: !46, line: 26, baseType: !68, size: 192, align: 64, offset: 4864)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ExpireTime", file: !46, line: 26, baseType: !187, size: 64, align: 64, offset: 5056)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Operation", file: !46, line: 26, baseType: !681, size: 64, align: 64, offset: 5120)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "Operation", file: !46, line: 26, size: 448, align: 8, elements: !683)
!683 = !{!573, !684, !685, !686}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "HTTPMethod", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "HTTPPath", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Paginator", file: !46, line: 26, baseType: !687, size: 64, align: 64, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "Paginator", file: !46, line: 26, size: 640, align: 8, elements: !689)
!689 = !{!690, !691, !692, !693}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "InputTokens", file: !46, line: 26, baseType: !300, size: 192, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "OutputTokens", file: !46, line: 26, baseType: !300, size: 192, align: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "LimitToken", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 384)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "TruncationToken", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 512)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "HTTPRequest", file: !46, line: 26, baseType: !307, size: 64, align: 64, offset: 5184)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "HTTPResponse", file: !46, line: 26, baseType: !254, size: 64, align: 64, offset: 5248)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !46, line: 26, baseType: !697, size: 128, align: 64, offset: 5312)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadSeeker", file: !46, line: 26, size: 128, align: 8, elements: !698)
!698 = !{!699, !232}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !46, line: 26, baseType: !700, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,int64,int)struct{int64,error}}", file: !50, size: 192, align: 8, elements: !702)
!702 = !{!178, !703, !704}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !50, line: 26, baseType: !288, size: 64, align: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Seek", file: !50, line: 26, baseType: !705, size: 64, align: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!708, !32, !73, !65}
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !50, size: 192, align: 8, elements: !709)
!709 = !{!710, !542}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 26, baseType: !73, size: 64, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "BodyStart", file: !46, line: 26, baseType: !73, size: 64, align: 64, offset: 5440)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Params", file: !46, line: 26, baseType: !387, size: 128, align: 64, offset: 5504)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !46, line: 26, baseType: !107, size: 128, align: 64, offset: 5632)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Data", file: !46, line: 26, baseType: !387, size: 128, align: 64, offset: 5760)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "RequestID", file: !46, line: 26, baseType: !60, size: 128, align: 64, offset: 5888)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "RetryCount", file: !46, line: 26, baseType: !65, size: 64, align: 64, offset: 6016)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Retryable", file: !46, line: 26, baseType: !195, size: 64, align: 64, offset: 6080)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "RetryDelay", file: !46, line: 26, baseType: !187, size: 64, align: 64, offset: 6144)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "NotHoist", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 6208)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "SignedHeaderVals", file: !46, line: 26, baseType: !263, size: 64, align: 64, offset: 6272)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "LastSignedAt", file: !46, line: 26, baseType: !68, size: 192, align: 64, offset: 6336)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "built", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 6528)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "safeBody", file: !46, line: 26, baseType: !724, size: 64, align: 64, offset: 6592)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: ".github.com/AdRoll/hologram/vendor/github.com/aws/aws-sdk-go/aws/request.offsetReader", file: !46, line: 26, size: 256, align: 8, elements: !726)
!726 = !{!727, !728, !729}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !46, line: 26, baseType: !697, size: 128, align: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !46, line: 26, baseType: !209, size: 64, align: 32, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !46, line: 26, baseType: !27, size: 8, align: 8, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ShouldRetry", file: !50, line: 26, baseType: !731, size: 64, align: 64, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!27, !32, !188}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ClientInfo", file: !46, line: 26, baseType: !625, size: 896, align: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "Config", file: !46, line: 26, baseType: !192, size: 1280, align: 64, offset: 1024)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Handlers", file: !46, line: 26, baseType: !635, size: 2560, align: 64, offset: 2304)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "accountAliases", file: !46, line: 56, baseType: !738, size: 64, align: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "User", file: !11, line: 31, size: 640, align: 8, elements: !741)
!741 = !{!742, !743, !771, !772}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Username", file: !11, line: 32, baseType: !60, size: 128, align: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "SSHKeys", file: !11, line: 33, baseType: !744, size: 192, align: 64, offset: 128)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*PublicKey,int,int}", file: !50, size: 192, align: 8, elements: !745)
!745 = !{!746, !88, !89}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !747, size: 64, align: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "PublicKey", file: !749, line: 28, size: 128, align: 8, elements: !750)
!749 = !DIFile(filename: "server.go", directory: ".")
!750 = !{!751, !770}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !749, line: 28, baseType: !752, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{*uint8,int,int},*func(*void)string,*func(*void,struct{*uint8,int,int},*Signature)error}", file: !50, size: 256, align: 8, elements: !754)
!754 = !{!755, !756, !760, !761}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !50, line: 28, baseType: !114, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Marshal", file: !50, line: 28, baseType: !757, size: 64, align: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!295, !32}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !50, line: 28, baseType: !155, size: 64, align: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Verify", file: !50, line: 28, baseType: !762, size: 64, align: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!107, !32, !295, !765}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "Signature", file: !749, line: 28, size: 320, align: 8, elements: !767)
!767 = !{!768, !769}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Format", file: !749, line: 28, baseType: !60, size: 128, align: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "Blob", file: !749, line: 28, baseType: !295, size: 192, align: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !749, line: 1, baseType: !32, size: 64, align: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ARNs", file: !11, line: 34, baseType: !300, size: 192, align: 64, offset: 320)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultRole", file: !11, line: 35, baseType: !60, size: 128, align: 64, offset: 512)
!773 = !DILocalVariable(name: "s", arg: 1, scope: !45, file: !46, line: 87, type: !159)
!774 = !DILocation(line: 87, column: 1, scope: !45)
!775 = !DILocalVariable(name: "user", arg: 2, scope: !45, file: !46, line: 87, type: !739)
!776 = !DILocation(line: 87, column: 48, scope: !45)
!777 = !DILocalVariable(name: "role", arg: 3, scope: !45, file: !46, line: 87, type: !60)
!778 = !DILocation(line: 87, column: 60, scope: !45)
!779 = !DILocalVariable(name: "enableLDAPRoles", arg: 4, scope: !45, file: !46, line: 87, type: !27)
!780 = !DILocation(line: 87, column: 73, scope: !45)
!781 = !DILocalVariable(name: "$ret3", scope: !45, file: !46, line: 87, type: !53)
!782 = !DILocation(line: 87, column: 96, scope: !45)
!783 = !DILocation(line: 88, column: 6, scope: !784)
!784 = distinct !DILexicalBlock(scope: !45, file: !46, line: 87, column: 1)
!785 = !DILocalVariable(name: "arn", scope: !784, file: !46, line: 88, type: !59)
!786 = !DILocation(line: 88, column: 6, scope: !45)
!787 = !DILocation(line: 88, column: 35, scope: !784)
!788 = !DILocation(line: 88, column: 49, scope: !784)
!789 = !DILocation(line: 88, column: 19, scope: !784)
!790 = !DILocation(line: 90, column: 73, scope: !784)
!791 = !DILocation(line: 90, column: 6, scope: !784)
!792 = !DILocation(line: 92, column: 2, scope: !784)
!793 = !DILocalVariable(name: "found", scope: !794, file: !46, line: 93, type: !27)
!794 = distinct !DILexicalBlock(scope: !784, file: !46, line: 92, column: 21)
!795 = !DILocation(line: 93, column: 3, scope: !784)
!796 = !DILocation(line: 94, column: 3, scope: !797)
!797 = distinct !DILexicalBlock(scope: !794, file: !46, line: 94, column: 3)
!798 = !DILocalVariable(name: "a", scope: !797, file: !46, line: 94, type: !60)
!799 = !DILocation(line: 94, column: 7, scope: !794)
!800 = !DILocation(line: 95, column: 35, scope: !797)
!801 = !DILocation(line: 95, column: 8, scope: !797)
!802 = !DILocation(line: 96, column: 11, scope: !797)
!803 = !DILocation(line: 102, column: 7, scope: !794)
!804 = !DILocation(line: 104, column: 6, scope: !794)
!805 = !DILocation(line: 105, column: 31, scope: !794)
!806 = !DILocation(line: 105, column: 23, scope: !794)
!807 = !DILocalVariable(name: "$ret4", scope: !45, file: !46, line: 87, type: !107)
!808 = !DILocation(line: 87, column: 114, scope: !45)
!809 = !DILocation(line: 105, column: 4, scope: !794)
!810 = !DILocation(line: 108, column: 6, scope: !784)
!811 = !DILocation(line: 109, column: 2, scope: !784)
!812 = !DILocalVariable(name: "duration", scope: !784, file: !46, line: 109, type: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!814 = !DILocation(line: 109, column: 2, scope: !45)
!815 = !DILocation(line: 110, column: 13, scope: !784)
!816 = !DILocation(line: 110, column: 18, scope: !784)
!817 = !DILocalVariable(name: "options", scope: !784, file: !46, line: 110, type: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "AssumeRoleInput", file: !46, line: 26, size: 448, align: 8, elements: !820)
!820 = !{!56, !821, !822, !823, !824, !825, !826, !827}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "DurationSeconds", file: !46, line: 26, baseType: !813, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ExternalId", file: !46, line: 26, baseType: !59, size: 64, align: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "Policy", file: !46, line: 26, baseType: !59, size: 64, align: 64, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "RoleArn", file: !46, line: 26, baseType: !59, size: 64, align: 64, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "RoleSessionName", file: !46, line: 26, baseType: !59, size: 64, align: 64, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !46, line: 26, baseType: !59, size: 64, align: 64, offset: 320)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "TokenCode", file: !46, line: 26, baseType: !59, size: 64, align: 64, offset: 384)
!828 = !DILocation(line: 110, column: 2, scope: !45)
!829 = !DILocation(line: 116, column: 13, scope: !784)
!830 = !DILocation(line: 116, column: 17, scope: !784)
!831 = !DILocalVariable(name: "r", scope: !784, file: !46, line: 116, type: !832)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "AssumeRoleOutput", file: !46, line: 26, size: 192, align: 8, elements: !834)
!834 = !{!56, !835, !841, !842}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "AssumedRoleUser", file: !46, line: 26, baseType: !836, size: 64, align: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "AssumedRoleUser", file: !46, line: 26, size: 128, align: 8, elements: !838)
!838 = !{!56, !839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "Arn", file: !46, line: 26, baseType: !59, size: 64, align: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "AssumedRoleId", file: !46, line: 26, baseType: !59, size: 64, align: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "Credentials", file: !46, line: 26, baseType: !53, size: 64, align: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "PackedPolicySize", file: !46, line: 26, baseType: !813, size: 64, align: 64, offset: 128)
!843 = !DILocation(line: 116, column: 2, scope: !45)
!844 = !DILocalVariable(name: "err", scope: !784, file: !46, line: 116, type: !107)
!845 = !DILocation(line: 117, column: 9, scope: !784)
!846 = !DILocation(line: 118, column: 30, scope: !784)
!847 = !DILocation(line: 118, column: 7, scope: !784)
!848 = !DILocation(line: 119, column: 3, scope: !784)
!849 = !DILocation(line: 121, column: 10, scope: !784)
!850 = !DILocation(line: 121, column: 2, scope: !784)
!851 = distinct !DISubprogram(name: "server.GetSessionToken..1command_line_arguments.directSessionTokenService", linkageName: "command_line_arguments.directSessionTokenService.GetSessionToken", scope: null, file: !46, line: 124, type: !852, isLocal: false, isDefinition: true, scopeLine: 124, isOptimized: false, unit: !1, retainedNodes: !3)
!852 = !DISubroutineType(types: !853)
!853 = !{!49, !159, !159}
!854 = !DILocalVariable(name: "s", arg: 1, scope: !851, file: !46, line: 124, type: !159)
!855 = !DILocation(line: 124, column: 1, scope: !851)
!856 = !DILocalVariable(name: "$ret5", scope: !851, file: !46, line: 124, type: !53)
!857 = !DILocation(line: 124, column: 56, scope: !851)
!858 = !DILocation(line: 125, column: 2, scope: !859)
!859 = distinct !DILexicalBlock(scope: !851, file: !46, line: 124, column: 1)
!860 = !DILocalVariable(name: "input", scope: !859, file: !46, line: 125, type: !861)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "GetSessionTokenInput", file: !46, line: 26, size: 192, align: 8, elements: !863)
!863 = !{!56, !821, !864, !865}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !46, line: 26, baseType: !59, size: 64, align: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "TokenCode", file: !46, line: 26, baseType: !59, size: 64, align: 64, offset: 128)
!866 = !DILocation(line: 125, column: 2, scope: !851)
!867 = !DILocation(line: 125, column: 15, scope: !859)
!868 = !DILocation(line: 126, column: 20, scope: !859)
!869 = !DILocation(line: 126, column: 24, scope: !859)
!870 = !DILocalVariable(name: "response", scope: !859, file: !46, line: 126, type: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "GetSessionTokenOutput", file: !46, line: 26, size: 64, align: 8, elements: !873)
!873 = !{!56, !874}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "Credentials", file: !46, line: 26, baseType: !53, size: 64, align: 64)
!875 = !DILocation(line: 126, column: 2, scope: !851)
!876 = !DILocalVariable(name: "err", scope: !859, file: !46, line: 126, type: !107)
!877 = !DILocation(line: 127, column: 9, scope: !859)
!878 = !DILocalVariable(name: "$ret6", scope: !851, file: !46, line: 124, type: !107)
!879 = !DILocation(line: 124, column: 74, scope: !851)
!880 = !DILocation(line: 128, column: 3, scope: !859)
!881 = !DILocation(line: 130, column: 17, scope: !859)
!882 = !DILocation(line: 130, column: 2, scope: !859)
!883 = distinct !DISubprogram(name: "server.Start..1command_line_arguments.directSessionTokenService", linkageName: "command_line_arguments.directSessionTokenService.Start", scope: null, file: !46, line: 67, type: !884, isLocal: false, isDefinition: true, scopeLine: 67, isOptimized: false, unit: !1, retainedNodes: !3)
!884 = !DISubroutineType(types: !885)
!885 = !{!107, !159, !159}
!886 = !DILocalVariable(name: "s", arg: 1, scope: !883, file: !46, line: 67, type: !159)
!887 = !DILocation(line: 67, column: 1, scope: !883)
!888 = !DILocalVariable(name: "$ret1", scope: !883, file: !46, line: 67, type: !107)
!889 = !DILocation(line: 67, column: 45, scope: !883)
!890 = !DILocation(line: 68, column: 2, scope: !883)
!891 = distinct !DISubprogram(name: "server.NewDirectSessionTokenService", linkageName: "command_line_arguments.NewDirectSessionTokenService", scope: null, file: !46, line: 63, type: !892, isLocal: false, isDefinition: true, scopeLine: 63, isOptimized: false, unit: !1, retainedNodes: !3)
!892 = !DISubroutineType(types: !893)
!893 = !{!159, !60, !164, !738}
!894 = !DILocalVariable(name: "iamAccount", arg: 1, scope: !891, file: !46, line: 63, type: !60)
!895 = !DILocation(line: 63, column: 35, scope: !891)
!896 = !DILocalVariable(name: "sts", arg: 2, scope: !891, file: !46, line: 63, type: !164)
!897 = !DILocation(line: 63, column: 54, scope: !891)
!898 = !DILocalVariable(name: "accountAliases", arg: 3, scope: !891, file: !46, line: 63, type: !738)
!899 = !DILocation(line: 63, column: 68, scope: !891)
!900 = !DILocalVariable(name: "$ret0", scope: !891, file: !46, line: 63, type: !159)
!901 = !DILocation(line: 63, column: 103, scope: !891)
!902 = !DILocation(line: 64, column: 9, scope: !891)
!903 = !DILocation(line: 64, column: 10, scope: !891)
!904 = !DILocation(line: 64, column: 2, scope: !891)
!905 = distinct !DISubprogram(name: "server.BuildARN", linkageName: "command_line_arguments.BuildARN", scope: null, file: !46, line: 71, type: !906, isLocal: false, isDefinition: true, scopeLine: 71, isOptimized: false, unit: !1, retainedNodes: !3)
!906 = !DISubroutineType(types: !907)
!907 = !{!60, !60, !60, !738}
!908 = !DILocalVariable(name: "role", arg: 1, scope: !905, file: !46, line: 71, type: !60)
!909 = !DILocation(line: 71, column: 15, scope: !905)
!910 = !DILocalVariable(name: "defaultAccount", arg: 2, scope: !905, file: !46, line: 71, type: !60)
!911 = !DILocation(line: 71, column: 28, scope: !905)
!912 = !DILocalVariable(name: "accountAliases", arg: 3, scope: !905, file: !46, line: 71, type: !738)
!913 = !DILocation(line: 71, column: 51, scope: !905)
!914 = !DILocation(line: 74, column: 19, scope: !915)
!915 = distinct !DILexicalBlock(scope: !905, file: !46, line: 71, column: 1)
!916 = !DILocalVariable(name: "split", scope: !915, file: !46, line: 74, type: !300)
!917 = !DILocation(line: 74, column: 2, scope: !905)
!918 = !DILocation(line: 75, column: 16, scope: !915)
!919 = !DILocation(line: 75, column: 39, scope: !915)
!920 = !DILocation(line: 75, column: 50, scope: !915)
!921 = !DILocation(line: 75, column: 66, scope: !915)
!922 = !DILocation(line: 75, column: 77, scope: !915)
!923 = !DILocation(line: 0, scope: !915)
!924 = !DILocalVariable(name: "arn", scope: !915, file: !46, line: 72, type: !60)
!925 = !DILocation(line: 72, column: 6, scope: !905)
!926 = !DILocalVariable(name: "$ret2", scope: !905, file: !46, line: 71, type: !60)
!927 = !DILocation(line: 71, column: 86, scope: !905)
!928 = !DILocation(line: 84, column: 2, scope: !915)
!929 = !DILocation(line: 77, column: 20, scope: !915)
!930 = !DILocation(line: 77, column: 9, scope: !915)
!931 = !DILocation(line: 76, column: 36, scope: !915)
!932 = !DILocation(line: 76, column: 52, scope: !915)
!933 = !DILocation(line: 76, column: 69, scope: !915)
!934 = !DILocation(line: 76, column: 13, scope: !915)
!935 = !DILocation(line: 79, column: 20, scope: !915)
!936 = !DILocation(line: 79, column: 9, scope: !915)
!937 = !DILocation(line: 80, column: 13, scope: !915)
!938 = !DILocation(line: 82, column: 13, scope: !915)
!939 = distinct !DISubprogram(name: "server.Modify..1command_line_arguments.persistentLDAP", linkageName: "command_line_arguments.persistentLDAP.Modify", scope: null, file: !940, line: 45, type: !941, isLocal: false, isDefinition: true, scopeLine: 45, isOptimized: false, unit: !1, retainedNodes: !3)
!940 = !DIFile(filename: "persistent_ldap.go", directory: ".")
!941 = !DISubroutineType(types: !942)
!942 = !{!107, !943, !943, !968}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.persistentLDAP", file: !940, line: 21, size: 192, align: 8, elements: !945)
!945 = !{!946, !1069}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "open", file: !940, line: 22, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !940, line: 22, size: 64, align: 8, elements: !949)
!949 = !{!950}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !940, line: 22, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!954}
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{LDAPImplementation,error}", file: !50, size: 256, align: 8, elements: !955)
!955 = !{!956, !1068}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 22, baseType: !957, size: 128, align: 64)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "LDAPImplementation", file: !11, line: 52, size: 128, align: 8, elements: !958)
!958 = !{!959, !1067}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 52, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*ModifyRequest)error,*func(*void,*SearchRequest)struct{*SearchResult,error}}", file: !50, size: 192, align: 8, elements: !962)
!962 = !{!963, !964, !983}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !50, line: 52, baseType: !114, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "Modify", file: !50, line: 52, baseType: !965, size: 64, align: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!107, !32, !968}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "ModifyRequest", file: !940, line: 18, size: 704, align: 8, elements: !970)
!970 = !{!971, !972, !981, !982}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "dn", file: !940, line: 18, baseType: !60, size: 128, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "addAttributes", file: !940, line: 18, baseType: !973, size: 192, align: 64, offset: 128)
!973 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*PartialAttribute,int,int}", file: !50, size: 192, align: 8, elements: !974)
!974 = !{!975, !88, !89}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartialAttribute", file: !940, line: 18, size: 320, align: 8, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "attrType", file: !940, line: 18, baseType: !60, size: 128, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "attrVals", file: !940, line: 18, baseType: !300, size: 192, align: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "deleteAttributes", file: !940, line: 18, baseType: !973, size: 192, align: 64, offset: 320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "replaceAttributes", file: !940, line: 18, baseType: !973, size: 192, align: 64, offset: 512)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "Search", file: !50, line: 52, baseType: !984, size: 64, align: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!987, !32, !1055}
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*SearchResult,error}", file: !50, size: 192, align: 8, elements: !988)
!988 = !{!989, !1054}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !50, line: 53, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "SearchResult", file: !940, line: 18, size: 576, align: 8, elements: !992)
!992 = !{!993, !1012, !1013}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "Entries", file: !940, line: 18, baseType: !994, size: 192, align: 64)
!994 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Entry,int,int}", file: !50, size: 192, align: 8, elements: !995)
!995 = !{!996, !88, !89}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !940, line: 18, size: 320, align: 8, elements: !1000)
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "DN", file: !940, line: 18, baseType: !60, size: 128, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", file: !940, line: 18, baseType: !1003, size: 192, align: 64, offset: 128)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**EntryAttribute,int,int}", file: !50, size: 192, align: 8, elements: !1004)
!1004 = !{!1005, !88, !89}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryAttribute", file: !940, line: 18, size: 320, align: 8, elements: !1009)
!1009 = !{!1010, !1011}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !940, line: 18, baseType: !60, size: 128, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "Values", file: !940, line: 18, baseType: !300, size: 192, align: 64, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "Referrals", file: !940, line: 18, baseType: !300, size: 192, align: 64, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "Controls", file: !940, line: 18, baseType: !1014, size: 192, align: 64, offset: 384)
!1014 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Control,int,int}", file: !50, size: 192, align: 8, elements: !1015)
!1015 = !{!1016, !88, !89}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !50, line: 1, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DICompositeType(tag: DW_TAG_structure_type, name: "Control", file: !940, line: 18, size: 128, align: 8, elements: !1019)
!1019 = !{!1020, !1053}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !940, line: 18, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
