; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22remote\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22gzip\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22compress/gzip\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22compress/gzip\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22tls\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/tls\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/tls\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22x509\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/x509\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/x509\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./bindata.go", directory: "/home/wangcong/go_path/src/github.com/AdRoll/hologram/transport/remote")
!3 = !{}
!4 = !{!5, !17, !19, !21, !41, !43}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments._selfSignedCaCert", linkageName: "command_line_arguments._selfSignedCaCert", scope: !1, file: !7, line: 73, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "bindata.go", directory: ".")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !9, size: 192, align: 8, elements: !10)
!9 = !DIFile(filename: "", directory: "")
!10 = !{!11, !14, !16}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !9, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!15 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !9, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "command_line_arguments._selfSignedCert", linkageName: "command_line_arguments._selfSignedCert", scope: !1, file: !7, line: 93, type: !8, isLocal: true, isDefinition: true)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "command_line_arguments._selfSignedKey", linkageName: "command_line_arguments._selfSignedKey", scope: !1, file: !7, line: 113, type: !8, isLocal: true, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "command_line_arguments._bindata", linkageName: "command_line_arguments._bindata", scope: !1, file: !7, line: 184, type: !23, isLocal: true, isDefinition: true)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !25, line: 1, size: 384, align: 8, elements: !26)
!25 = !DIFile(filename: "<built-in>", directory: "")
!26 = !{!27, !28, !29, !30, !32, !34, !37, !38, !40}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !25, line: 1, baseType: !15, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !25, line: 1, baseType: !13, size: 8, align: 8, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !25, line: 1, baseType: !13, size: 8, align: 8, offset: 72)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !25, line: 1, baseType: !31, size: 16, align: 16, offset: 80)
!31 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !25, line: 1, baseType: !33, size: 32, align: 32, offset: 96)
!33 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !25, line: 1, baseType: !35, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIBasicType(name: "void")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !25, line: 1, baseType: !35, size: 64, align: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !25, line: 1, baseType: !39, size: 64, align: 64, offset: 256)
!39 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !25, line: 1, baseType: !35, size: 64, align: 64, offset: 320)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !25, line: 1, type: !33, isLocal: false, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "command_line_arguments._bintree", linkageName: "command_line_arguments._bintree", scope: !1, file: !7, line: 229, type: !45, isLocal: true, isDefinition: true)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.bintree", file: !7, line: 225, size: 128, align: 8, elements: !47)
!47 = !{!48, !196}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Func", file: !7, line: 226, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 226, size: 64, align: 8, elements: !51)
!51 = !{!52}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 226, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!56}
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.command-line-arguments.asset,error}", file: !9, size: 192, align: 8, elements: !57)
!57 = !{!58, !186}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 226, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.asset", file: !7, line: 42, size: 320, align: 8, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", file: !7, line: 43, baseType: !8, size: 192, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "info", file: !7, line: 44, baseType: !64, size: 128, align: 64, offset: 192)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileInfo", file: !7, line: 15, size: 128, align: 8, elements: !65)
!65 = !{!66, !185}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 15, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)bool,*func(*void)Time,*func(*void)FileMode,*func(*void)string,*func(*void)int64,*func(*void)DecrypterOpts}", file: !9, size: 448, align: 8, elements: !69)
!69 = !{!70, !121, !125, !163, !168, !172, !176}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 15, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !25, line: 1, size: 576, align: 8, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !88, !97, !98, !104, !120}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !25, line: 1, baseType: !39, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !25, line: 1, baseType: !39, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !25, line: 1, baseType: !33, size: 32, align: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !25, line: 1, baseType: !13, size: 8, align: 8, offset: 160)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !25, line: 1, baseType: !13, size: 8, align: 8, offset: 168)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !25, line: 1, baseType: !13, size: 8, align: 8, offset: 176)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !25, line: 1, baseType: !81, size: 64, align: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 1, size: 64, align: 8, elements: !83)
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 1, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!39, !35, !39}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !25, line: 1, baseType: !89, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !25, line: 1, size: 64, align: 8, elements: !91)
!91 = !{!92}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !25, line: 1, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !35, !35}
!96 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !25, line: 1, baseType: !12, size: 64, align: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !25, line: 1, baseType: !99, size: 64, align: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !25, line: 1, size: 128, align: 8, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !25, line: 1, baseType: !12, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !25, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !25, line: 1, baseType: !105, size: 64, align: 64, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !25, line: 1, size: 320, align: 8, elements: !107)
!107 = !{!108, !109, !110}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !25, line: 1, baseType: !99, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !25, line: 1, baseType: !99, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !25, line: 1, baseType: !111, size: 192, align: 64, offset: 128)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !9, size: 192, align: 8, elements: !112)
!112 = !{!113, !14, !16}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !25, line: 1, size: 320, align: 8, elements: !116)
!116 = !{!108, !109, !117, !118, !119}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !25, line: 1, baseType: !35, size: 64, align: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !25, line: 1, baseType: !35, size: 64, align: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !25, line: 1, baseType: !35, size: 64, align: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !25, line: 1, baseType: !35, size: 64, align: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "IsDir", file: !9, line: 15, baseType: !122, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!96, !35}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ModTime", file: !9, line: 15, baseType: !126, size: 64, align: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!129, !35}
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 12, size: 192, align: 8, elements: !130)
!130 = !{!131, !133, !135}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 12, baseType: !132, size: 64, align: 64)
!132 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 12, baseType: !134, size: 64, align: 64, offset: 64)
!134 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 12, baseType: !136, size: 64, align: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 12, size: 704, align: 8, elements: !138)
!138 = !{!139, !140, !149, !160, !161, !162}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 12, baseType: !100, size: 128, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 12, baseType: !141, size: 192, align: 64, offset: 128)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !9, size: 192, align: 8, elements: !142)
!142 = !{!143, !14, !16}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 12, size: 256, align: 8, elements: !146)
!146 = !{!139, !147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 12, baseType: !15, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 12, baseType: !96, size: 8, align: 8, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 12, baseType: !150, size: 192, align: 64, offset: 320)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !9, size: 192, align: 8, elements: !151)
!151 = !{!152, !14, !16}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 12, size: 128, align: 8, elements: !155)
!155 = !{!156, !157, !158, !159}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 12, baseType: !134, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 12, baseType: !13, size: 8, align: 8, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 12, baseType: !96, size: 8, align: 8, offset: 72)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 12, baseType: !96, size: 8, align: 8, offset: 80)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 12, baseType: !134, size: 64, align: 64, offset: 512)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 12, baseType: !134, size: 64, align: 64, offset: 576)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 12, baseType: !144, size: 64, align: 64, offset: 640)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", file: !9, line: 15, baseType: !164, size: 64, align: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!167, !35}
!167 = !DIBasicType(name: "FileMode", size: 32, encoding: DW_ATE_unsigned)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !9, line: 15, baseType: !169, size: 64, align: 64, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!100, !35}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !9, line: 15, baseType: !173, size: 64, align: 64, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!134, !35}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Sys", file: !9, line: 15, baseType: !177, size: 64, align: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!180, !35}
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecrypterOpts", file: !181, line: 20, size: 128, align: 8, elements: !182)
!181 = !DIFile(filename: "client.go", directory: ".")
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !181, line: 1, baseType: !71, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !181, line: 1, baseType: !35, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !35, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 226, baseType: !187, size: 128, align: 64, offset: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !25, line: 1, size: 128, align: 8, elements: !188)
!188 = !{!189, !195}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !25, line: 1, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !9, size: 128, align: 8, elements: !192)
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 1, baseType: !71, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !9, line: 1, baseType: !169, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !25, line: 1, baseType: !35, size: 64, align: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Children", file: !7, line: 227, baseType: !23, size: 64, align: 64, offset: 64)
!197 = distinct !DISubprogram(name: "remote.bindataRead", scope: null, file: !7, line: 22, type: !198, isLocal: true, isDefinition: true, scopeLine: 22, isOptimized: false, unit: !1, retainedNodes: !3)
!198 = !DISubroutineType(types: !199)
!199 = !{!200, !8, !100}
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !9, size: 320, align: 8, elements: !201)
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 22, baseType: !8, size: 192, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 22, baseType: !187, size: 128, align: 64, offset: 192)
!204 = !DILocalVariable(name: "data", arg: 1, scope: !197, file: !7, line: 22, type: !8)
!205 = !DILocation(line: 22, column: 18, scope: !197)
!206 = !DILocalVariable(name: "name", arg: 2, scope: !197, file: !7, line: 22, type: !100)
!207 = !DILocation(line: 22, column: 31, scope: !197)
!208 = !DILocation(line: 23, column: 34, scope: !209)
!209 = distinct !DILexicalBlock(scope: !197, file: !7, line: 22, column: 1)
!210 = !DILocation(line: 23, column: 18, scope: !209)
!211 = !DILocalVariable(name: "gz", scope: !209, file: !7, line: 23, type: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !7, line: 12, size: 5312, align: 8, elements: !214)
!214 = !{!215, !223, !247, !259, !260, !261, !265, !266}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !7, line: 12, baseType: !216, size: 704, align: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "Header", file: !7, line: 12, size: 704, align: 8, elements: !217)
!217 = !{!218, !219, !220, !221, !222}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Comment", file: !7, line: 12, baseType: !100, size: 128, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Extra", file: !7, line: 12, baseType: !8, size: 192, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ModTime", file: !7, line: 12, baseType: !129, size: 192, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !7, line: 12, baseType: !100, size: 128, align: 64, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "OS", file: !7, line: 12, baseType: !13, size: 8, align: 8, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !7, line: 12, baseType: !224, size: 128, align: 64, offset: 704)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !7, line: 12, size: 128, align: 8, elements: !225)
!225 = !{!226, !185}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 12, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void)struct{uint8,error}}", file: !9, size: 192, align: 8, elements: !229)
!229 = !{!230, !231, !239}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 12, baseType: !71, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !9, line: 12, baseType: !232, size: 64, align: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!235, !35, !8}
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !9, size: 192, align: 8, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !9, line: 11, baseType: !15, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !9, line: 11, baseType: !187, size: 128, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ReadByte", file: !9, line: 12, baseType: !240, size: 64, align: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!243, !35}
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{uint8,error}", file: !9, size: 192, align: 8, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 12, baseType: !13, size: 8, align: 8)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 12, baseType: !187, size: 128, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "decompressor", file: !7, line: 12, baseType: !248, size: 128, align: 64, offset: 832)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !7, line: 12, size: 128, align: 8, elements: !249)
!249 = !{!250, !185}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 12, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !9, size: 192, align: 8, elements: !253)
!253 = !{!230, !254, !258}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !9, line: 12, baseType: !255, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!187, !35}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !9, line: 12, baseType: !232, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "digest", file: !7, line: 12, baseType: !33, size: 32, align: 32, offset: 960)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 12, baseType: !33, size: 32, align: 32, offset: 992)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 12, baseType: !262, size: 4096, align: 8, offset: 1024)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 4096, align: 1, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 512)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !7, line: 12, baseType: !187, size: 128, align: 64, offset: 5120)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "multistream", file: !7, line: 12, baseType: !96, size: 8, align: 8, offset: 5248)
!267 = !DILocation(line: 23, column: 2, scope: !197)
!268 = !DILocalVariable(name: "err", scope: !209, file: !7, line: 23, type: !187)
!269 = !DILocation(line: 24, column: 9, scope: !209)
!270 = !DILocation(line: 25, column: 19, scope: !209)
!271 = !DILocation(line: 25, column: 47, scope: !209)
!272 = !DILocalVariable(name: "$ret1", scope: !197, file: !7, line: 22, type: !187)
!273 = !DILocation(line: 22, column: 53, scope: !197)
!274 = !DILocation(line: 25, column: 3, scope: !209)
!275 = !DILocation(line: 28, column: 6, scope: !209)
!276 = !DILocalVariable(name: "buf", scope: !209, file: !7, line: 28, type: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", file: !7, line: 11, size: 832, align: 8, elements: !279)
!279 = !{!280, !281, !282, !286}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 11, baseType: !8, size: 192, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "off", file: !7, line: 11, baseType: !15, size: 64, align: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "bootstrap", file: !7, line: 11, baseType: !283, size: 512, align: 8, offset: 256)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 512, align: 1, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "lastRead", file: !7, line: 11, baseType: !287, size: 8, align: 8, offset: 768)
!287 = !DIBasicType(name: ".bytes.readOp", size: 8, encoding: DW_ATE_signed)
!288 = !DILocation(line: 28, column: 6, scope: !197)
!289 = !DILocation(line: 29, column: 19, scope: !209)
!290 = !DILocation(line: 29, column: 25, scope: !209)
!291 = !DILocation(line: 29, column: 14, scope: !209)
!292 = !DILocation(line: 30, column: 13, scope: !209)
!293 = !DILocation(line: 32, column: 9, scope: !209)
!294 = !DILocation(line: 33, column: 19, scope: !209)
!295 = !DILocation(line: 33, column: 47, scope: !209)
!296 = !DILocation(line: 33, column: 3, scope: !209)
!297 = !DILocalVariable(name: "clErr", scope: !209, file: !7, line: 30, type: !187)
!298 = !DILocation(line: 30, column: 2, scope: !197)
!299 = !DILocation(line: 35, column: 11, scope: !209)
!300 = !DILocation(line: 36, column: 3, scope: !209)
!301 = !DILocation(line: 39, column: 12, scope: !209)
!302 = !DILocation(line: 39, column: 2, scope: !209)
!303 = distinct !DISubprogram(name: "remote.command_line_arguments.bindataFileInfo..hash", linkageName: "command_line_arguments.command_line_arguments.bindataFileInfo..hash", scope: null, file: !25, line: 1, type: !86, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!304 = !DILocalVariable(name: "key", arg: 1, scope: !303, file: !25, line: 1, type: !35)
!305 = !DILocation(line: 1, column: 1, scope: !303)
!306 = !DILocalVariable(name: "seed", arg: 2, scope: !303, file: !25, line: 1, type: !39)
!307 = !DILocalVariable(name: "$ret32", scope: !303, file: !25, line: 1, type: !39)
!308 = distinct !DISubprogram(name: "remote.command_line_arguments.bindataFileInfo..eq", linkageName: "command_line_arguments.command_line_arguments.bindataFileInfo..eq", scope: null, file: !25, line: 1, type: !94, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!309 = !DILocalVariable(name: "key1", arg: 1, scope: !308, file: !25, line: 1, type: !35)
!310 = !DILocation(line: 1, column: 1, scope: !308)
!311 = !DILocalVariable(name: "key2", arg: 2, scope: !308, file: !25, line: 1, type: !35)
!312 = !DILocalVariable(name: "$ret33", scope: !308, file: !25, line: 1, type: !96)
!313 = distinct !DISubprogram(name: "remote.IsDir.command_line_arguments.bindataFileInfo", linkageName: "command_line_arguments.bindataFileInfo.IsDir", scope: null, file: !7, line: 66, type: !314, isLocal: false, isDefinition: true, scopeLine: 66, isOptimized: false, unit: !1, retainedNodes: !3)
!314 = !DISubroutineType(types: !315)
!315 = !{!96, !316, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.bindataFileInfo", file: !7, line: 47, size: 448, align: 8, elements: !318)
!318 = !{!319, !320, !321, !322}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 48, baseType: !100, size: 128, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 49, baseType: !134, size: 64, align: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "mode", file: !7, line: 50, baseType: !167, size: 32, align: 32, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "modTime", file: !7, line: 51, baseType: !129, size: 192, align: 64, offset: 256)
!323 = !DILocalVariable(name: "pointer", arg: 1, scope: !313, file: !7, line: 66, type: !316)
!324 = !DILocation(line: 66, column: 1, scope: !313)
!325 = !DILocalVariable(name: "$ret6", scope: !313, file: !7, line: 66, type: !96)
!326 = !DILocation(line: 66, column: 35, scope: !313)
!327 = !DILocation(line: 67, column: 2, scope: !313)
!328 = distinct !DISubprogram(name: "remote.ModTime.command_line_arguments.bindataFileInfo", linkageName: "command_line_arguments.bindataFileInfo.ModTime", scope: null, file: !7, line: 63, type: !329, isLocal: false, isDefinition: true, scopeLine: 63, isOptimized: false, unit: !1, retainedNodes: !3)
!329 = !DISubroutineType(types: !330)
!330 = !{!129, !316, !316}
!331 = !DILocalVariable(name: "pointer", arg: 1, scope: !328, file: !7, line: 63, type: !316)
!332 = !DILocation(line: 63, column: 1, scope: !328)
!333 = !DILocation(line: 64, column: 11, scope: !328)
!334 = !DILocation(line: 64, column: 2, scope: !328)
!335 = distinct !DISubprogram(name: "remote.Mode.command_line_arguments.bindataFileInfo", linkageName: "command_line_arguments.bindataFileInfo.Mode", scope: null, file: !7, line: 60, type: !336, isLocal: false, isDefinition: true, scopeLine: 60, isOptimized: false, unit: !1, retainedNodes: !3)
!336 = !DISubroutineType(types: !337)
!337 = !{!167, !316, !316}
!338 = !DILocalVariable(name: "pointer", arg: 1, scope: !335, file: !7, line: 60, type: !316)
!339 = !DILocation(line: 60, column: 1, scope: !335)
!340 = !DILocalVariable(name: "fi", scope: !335, file: !7, line: 60, type: !317)
!341 = !DILocalVariable(name: "$ret4", scope: !335, file: !7, line: 60, type: !167)
!342 = !DILocation(line: 60, column: 34, scope: !335)
!343 = !DILocation(line: 61, column: 2, scope: !335)
!344 = distinct !DISubprogram(name: "remote.Name.command_line_arguments.bindataFileInfo", linkageName: "command_line_arguments.bindataFileInfo.Name", scope: null, file: !7, line: 54, type: !345, isLocal: false, isDefinition: true, scopeLine: 54, isOptimized: false, unit: !1, retainedNodes: !3)
!345 = !DISubroutineType(types: !346)
!346 = !{!100, !316, !316}
!347 = !DILocalVariable(name: "pointer", arg: 1, scope: !344, file: !7, line: 54, type: !316)
!348 = !DILocation(line: 54, column: 1, scope: !344)
!349 = !DILocalVariable(name: "fi", scope: !344, file: !7, line: 54, type: !317)
!350 = !DILocalVariable(name: "$ret2", scope: !344, file: !7, line: 54, type: !100)
!351 = !DILocation(line: 54, column: 34, scope: !344)
!352 = !DILocation(line: 55, column: 2, scope: !344)
!353 = distinct !DISubprogram(name: "remote.Size.command_line_arguments.bindataFileInfo", linkageName: "command_line_arguments.bindataFileInfo.Size", scope: null, file: !7, line: 57, type: !354, isLocal: false, isDefinition: true, scopeLine: 57, isOptimized: false, unit: !1, retainedNodes: !3)
!354 = !DISubroutineType(types: !355)
!355 = !{!134, !316, !316}
!356 = !DILocalVariable(name: "pointer", arg: 1, scope: !353, file: !7, line: 57, type: !316)
!357 = !DILocation(line: 57, column: 1, scope: !353)
!358 = !DILocalVariable(name: "fi", scope: !353, file: !7, line: 57, type: !317)
!359 = !DILocalVariable(name: "$ret3", scope: !353, file: !7, line: 57, type: !134)
!360 = !DILocation(line: 57, column: 34, scope: !353)
!361 = !DILocation(line: 58, column: 2, scope: !353)
!362 = distinct !DISubprogram(name: "remote.Sys.command_line_arguments.bindataFileInfo", linkageName: "command_line_arguments.bindataFileInfo.Sys", scope: null, file: !7, line: 69, type: !363, isLocal: false, isDefinition: true, scopeLine: 69, isOptimized: false, unit: !1, retainedNodes: !3)
!363 = !DISubroutineType(types: !364)
!364 = !{!180, !316, !316}
!365 = !DILocalVariable(name: "pointer", arg: 1, scope: !362, file: !7, line: 69, type: !316)
!366 = !DILocation(line: 69, column: 1, scope: !362)
!367 = !DILocalVariable(name: "$ret7", scope: !362, file: !7, line: 69, type: !180)
!368 = !DILocation(line: 69, column: 33, scope: !362)
!369 = !DILocation(line: 70, column: 2, scope: !362)
!370 = distinct !DISubprogram(name: "remote.selfSignedCaCert", scope: null, file: !7, line: 82, type: !54, isLocal: true, isDefinition: true, scopeLine: 82, isOptimized: false, unit: !1, retainedNodes: !3)
!371 = !DILocalVariable(name: "info", scope: !372, file: !7, line: 88, type: !317)
!372 = distinct !DILexicalBlock(scope: !370, file: !7, line: 82, column: 1)
!373 = !DILocation(line: 88, column: 2, scope: !370)
!374 = !DILocalVariable(name: "$ret10", scope: !370, file: !7, line: 82, type: !59)
!375 = !DILocation(line: 82, column: 26, scope: !370)
!376 = !DILocation(line: 76, column: 9, scope: !377, inlinedAt: !380)
!377 = distinct !DISubprogram(name: "remote.selfSignedCaCertBytes", scope: null, file: !7, line: 75, type: !378, isLocal: true, isDefinition: true, scopeLine: 75, isOptimized: false, unit: !1, retainedNodes: !3)
!378 = !DISubroutineType(types: !379)
!379 = !{!200}
!380 = distinct !DILocation(line: 83, column: 16, scope: !372)
!381 = !DILocation(line: 76, column: 2, scope: !377, inlinedAt: !380)
!382 = !DILocalVariable(name: "err", scope: !372, file: !7, line: 83, type: !187)
!383 = !DILocation(line: 83, column: 2, scope: !370)
!384 = !DILocation(line: 84, column: 9, scope: !372)
!385 = !DILocalVariable(name: "$ret11", scope: !370, file: !7, line: 82, type: !187)
!386 = !DILocation(line: 82, column: 34, scope: !370)
!387 = !DILocation(line: 85, column: 3, scope: !372)
!388 = !DILocation(line: 88, column: 105, scope: !372)
!389 = !DILocation(line: 88, column: 10, scope: !372)
!390 = !DILocation(line: 89, column: 7, scope: !372)
!391 = !DILocation(line: 89, column: 8, scope: !372)
!392 = !DILocalVariable(name: "a", scope: !372, file: !7, line: 89, type: !59)
!393 = !DILocation(line: 89, column: 2, scope: !370)
!394 = !DILocation(line: 90, column: 2, scope: !372)
!395 = distinct !DISubprogram(name: "remote.selfSignedCert", scope: null, file: !7, line: 102, type: !54, isLocal: true, isDefinition: true, scopeLine: 102, isOptimized: false, unit: !1, retainedNodes: !3)
!396 = !DILocalVariable(name: "info", scope: !397, file: !7, line: 108, type: !317)
!397 = distinct !DILexicalBlock(scope: !395, file: !7, line: 102, column: 1)
!398 = !DILocation(line: 108, column: 2, scope: !395)
!399 = !DILocalVariable(name: "$ret14", scope: !395, file: !7, line: 102, type: !59)
!400 = !DILocation(line: 102, column: 24, scope: !395)
!401 = !DILocation(line: 96, column: 9, scope: !402, inlinedAt: !403)
!402 = distinct !DISubprogram(name: "remote.selfSignedCertBytes", scope: null, file: !7, line: 95, type: !378, isLocal: true, isDefinition: true, scopeLine: 95, isOptimized: false, unit: !1, retainedNodes: !3)
!403 = distinct !DILocation(line: 103, column: 16, scope: !397)
!404 = !DILocation(line: 96, column: 2, scope: !402, inlinedAt: !403)
!405 = !DILocalVariable(name: "err", scope: !397, file: !7, line: 103, type: !187)
!406 = !DILocation(line: 103, column: 2, scope: !395)
!407 = !DILocation(line: 104, column: 9, scope: !397)
!408 = !DILocalVariable(name: "$ret15", scope: !395, file: !7, line: 102, type: !187)
!409 = !DILocation(line: 102, column: 32, scope: !395)
!410 = !DILocation(line: 105, column: 3, scope: !397)
!411 = !DILocation(line: 108, column: 102, scope: !397)
!412 = !DILocation(line: 108, column: 10, scope: !397)
!413 = !DILocation(line: 109, column: 7, scope: !397)
!414 = !DILocation(line: 109, column: 8, scope: !397)
!415 = !DILocalVariable(name: "a", scope: !397, file: !7, line: 109, type: !59)
!416 = !DILocation(line: 109, column: 2, scope: !395)
!417 = !DILocation(line: 110, column: 2, scope: !397)
!418 = distinct !DISubprogram(name: "remote.selfSignedKey", scope: null, file: !7, line: 122, type: !54, isLocal: true, isDefinition: true, scopeLine: 122, isOptimized: false, unit: !1, retainedNodes: !3)
!419 = !DILocalVariable(name: "info", scope: !420, file: !7, line: 128, type: !317)
!420 = distinct !DILexicalBlock(scope: !418, file: !7, line: 122, column: 1)
!421 = !DILocation(line: 128, column: 2, scope: !418)
!422 = !DILocalVariable(name: "$ret18", scope: !418, file: !7, line: 122, type: !59)
!423 = !DILocation(line: 122, column: 23, scope: !418)
!424 = !DILocation(line: 116, column: 9, scope: !425, inlinedAt: !426)
!425 = distinct !DISubprogram(name: "remote.selfSignedKeyBytes", scope: null, file: !7, line: 115, type: !378, isLocal: true, isDefinition: true, scopeLine: 115, isOptimized: false, unit: !1, retainedNodes: !3)
!426 = distinct !DILocation(line: 123, column: 16, scope: !420)
!427 = !DILocation(line: 116, column: 2, scope: !425, inlinedAt: !426)
!428 = !DILocalVariable(name: "err", scope: !420, file: !7, line: 123, type: !187)
!429 = !DILocation(line: 123, column: 2, scope: !418)
!430 = !DILocation(line: 124, column: 9, scope: !420)
!431 = !DILocalVariable(name: "$ret19", scope: !418, file: !7, line: 122, type: !187)
!432 = !DILocation(line: 122, column: 31, scope: !418)
!433 = !DILocation(line: 125, column: 3, scope: !420)
!434 = !DILocation(line: 128, column: 101, scope: !420)
!435 = !DILocation(line: 128, column: 10, scope: !420)
!436 = !DILocation(line: 129, column: 7, scope: !420)
!437 = !DILocation(line: 129, column: 8, scope: !420)
!438 = !DILocalVariable(name: "a", scope: !420, file: !7, line: 129, type: !59)
!439 = !DILocation(line: 129, column: 2, scope: !418)
!440 = !DILocation(line: 130, column: 2, scope: !420)
!441 = distinct !DISubprogram(name: "remote.Asset", linkageName: "command_line_arguments.Asset", scope: null, file: !7, line: 136, type: !442, isLocal: false, isDefinition: true, scopeLine: 136, isOptimized: false, unit: !1, retainedNodes: !3)
!442 = !DISubroutineType(types: !443)
!443 = !{!200, !100}
!444 = !DILocalVariable(name: "name", arg: 1, scope: !441, file: !7, line: 136, type: !100)
!445 = !DILocation(line: 136, column: 12, scope: !441)
!446 = !DILocation(line: 137, column: 28, scope: !447)
!447 = distinct !DILexicalBlock(scope: !441, file: !7, line: 136, column: 1)
!448 = !DILocalVariable(name: "cannonicalName", scope: !447, file: !7, line: 137, type: !100)
!449 = !DILocation(line: 137, column: 2, scope: !441)
!450 = !DILocalVariable(name: "f", scope: !451, file: !7, line: 138, type: !49)
!451 = distinct !DILexicalBlock(scope: !447, file: !7, line: 138, column: 2)
!452 = !DILocation(line: 138, column: 5, scope: !447)
!453 = !DILocalVariable(name: "ok", scope: !451, file: !7, line: 138, type: !96)
!454 = !DILocation(line: 138, column: 14, scope: !451)
!455 = !DILocation(line: 138, column: 5, scope: !451)
!456 = !DILocation(line: 138, column: 2, scope: !451)
!457 = !DILocation(line: 139, column: 13, scope: !458)
!458 = distinct !DILexicalBlock(scope: !451, file: !7, line: 138, column: 43)
!459 = !DILocalVariable(name: "a", scope: !458, file: !7, line: 139, type: !59)
!460 = !DILocation(line: 139, column: 3, scope: !451)
!461 = !DILocalVariable(name: "err", scope: !458, file: !7, line: 139, type: !187)
!462 = !DILocation(line: 140, column: 10, scope: !458)
!463 = !DILocation(line: 145, column: 18, scope: !447)
!464 = !DILocalVariable(name: "$ret21", scope: !441, file: !7, line: 136, type: !187)
!465 = !DILocation(line: 136, column: 34, scope: !441)
!466 = !DILocation(line: 145, column: 2, scope: !447)
!467 = !DILocation(line: 141, column: 20, scope: !458)
!468 = !DILocation(line: 141, column: 69, scope: !458)
!469 = !DILocation(line: 141, column: 4, scope: !458)
!470 = !DILocation(line: 143, column: 11, scope: !458)
!471 = !DILocation(line: 143, column: 3, scope: !458)
!472 = distinct !DISubprogram(name: "remote.MustAsset", linkageName: "command_line_arguments.MustAsset", scope: null, file: !7, line: 150, type: !473, isLocal: false, isDefinition: true, scopeLine: 150, isOptimized: false, unit: !1, retainedNodes: !3)
!473 = !DISubroutineType(types: !474)
!474 = !{!8, !100}
!475 = !DILocalVariable(name: "name", arg: 1, scope: !472, file: !7, line: 150, type: !100)
!476 = !DILocation(line: 150, column: 16, scope: !472)
!477 = !DILocation(line: 151, column: 12, scope: !478)
!478 = distinct !DILexicalBlock(scope: !472, file: !7, line: 150, column: 1)
!479 = !DILocalVariable(name: "err", scope: !478, file: !7, line: 151, type: !187)
!480 = !DILocation(line: 151, column: 2, scope: !472)
!481 = !DILocation(line: 152, column: 9, scope: !478)
!482 = !DILocation(line: 153, column: 45, scope: !478)
!483 = !DILocation(line: 153, column: 3, scope: !478)
!484 = !DILocation(line: 153, column: 22, scope: !478)
!485 = !DILocation(line: 156, column: 2, scope: !478)
!486 = distinct !DISubprogram(name: "remote.AssetInfo", linkageName: "command_line_arguments.AssetInfo", scope: null, file: !7, line: 162, type: !487, isLocal: false, isDefinition: true, scopeLine: 162, isOptimized: false, unit: !1, retainedNodes: !3)
!487 = !DISubroutineType(types: !488)
!488 = !{!489, !100}
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{FileInfo,error}", file: !9, size: 256, align: 8, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 162, baseType: !64, size: 128, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 162, baseType: !187, size: 128, align: 64, offset: 128)
!493 = !DILocalVariable(name: "name", arg: 1, scope: !486, file: !7, line: 162, type: !100)
!494 = !DILocation(line: 162, column: 16, scope: !486)
!495 = !DILocation(line: 163, column: 28, scope: !496)
!496 = distinct !DILexicalBlock(scope: !486, file: !7, line: 162, column: 1)
!497 = !DILocalVariable(name: "cannonicalName", scope: !496, file: !7, line: 163, type: !100)
!498 = !DILocation(line: 163, column: 2, scope: !486)
!499 = !DILocalVariable(name: "f", scope: !500, file: !7, line: 164, type: !49)
!500 = distinct !DILexicalBlock(scope: !496, file: !7, line: 164, column: 2)
!501 = !DILocation(line: 164, column: 5, scope: !496)
!502 = !DILocalVariable(name: "ok", scope: !500, file: !7, line: 164, type: !96)
!503 = !DILocation(line: 164, column: 14, scope: !500)
!504 = !DILocation(line: 164, column: 5, scope: !500)
!505 = !DILocation(line: 164, column: 2, scope: !500)
!506 = !DILocation(line: 165, column: 13, scope: !507)
!507 = distinct !DILexicalBlock(scope: !500, file: !7, line: 164, column: 43)
!508 = !DILocalVariable(name: "a", scope: !507, file: !7, line: 165, type: !59)
!509 = !DILocation(line: 165, column: 3, scope: !500)
!510 = !DILocalVariable(name: "err", scope: !507, file: !7, line: 165, type: !187)
!511 = !DILocation(line: 166, column: 10, scope: !507)
!512 = !DILocation(line: 171, column: 18, scope: !496)
!513 = !DILocalVariable(name: "$ret24", scope: !486, file: !7, line: 162, type: !187)
!514 = !DILocation(line: 162, column: 43, scope: !486)
!515 = !DILocation(line: 171, column: 2, scope: !496)
!516 = !DILocation(line: 167, column: 20, scope: !507)
!517 = !DILocation(line: 167, column: 73, scope: !507)
!518 = !DILocation(line: 167, column: 4, scope: !507)
!519 = !DILocation(line: 169, column: 11, scope: !507)
!520 = !DILocation(line: 169, column: 3, scope: !507)
!521 = distinct !DISubprogram(name: "remote.AssetNames", linkageName: "command_line_arguments.AssetNames", scope: null, file: !7, line: 175, type: !522, isLocal: false, isDefinition: true, scopeLine: 175, isOptimized: false, unit: !1, retainedNodes: !3)
!522 = !DISubroutineType(types: !523)
!523 = !{!524}
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !9, size: 192, align: 8, elements: !525)
!525 = !{!526, !14, !16}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !99, size: 64, align: 64)
!527 = !DILocation(line: 176, column: 33, scope: !528)
!528 = distinct !DILexicalBlock(scope: !521, file: !7, line: 175, column: 1)
!529 = !DILocation(line: 176, column: 29, scope: !528)
!530 = !DILocation(line: 176, column: 11, scope: !528)
!531 = !DILocation(line: 177, column: 2, scope: !532)
!532 = distinct !DILexicalBlock(scope: !528, file: !7, line: 177, column: 2)
!533 = !DILocation(line: 178, column: 11, scope: !532)
!534 = !DILocation(line: 178, column: 9, scope: !532)
!535 = !DILocation(line: 180, column: 2, scope: !528)
!536 = distinct !DISubprogram(name: "remote.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 8, type: !537, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!537 = !DISubroutineType(types: !538)
!538 = !{!36}
!539 = !DILocation(line: 1, column: 1, scope: !540)
!540 = !DILexicalBlockFile(scope: !536, file: !25, discriminator: 0)
!541 = !DILocation(line: 184, column: 16, scope: !542)
!542 = !DILexicalBlockFile(scope: !536, file: !7, discriminator: 0)
!543 = !DILocation(line: 184, column: 5, scope: !542)
!544 = !DILocation(line: 230, column: 52, scope: !542)
!545 = !DILocation(line: 231, column: 47, scope: !542)
!546 = !DILocation(line: 232, column: 45, scope: !542)
!547 = !DILocation(line: 230, column: 25, scope: !542)
!548 = !DILocation(line: 230, column: 26, scope: !542)
!549 = !DILocation(line: 231, column: 22, scope: !542)
!550 = !DILocation(line: 231, column: 23, scope: !542)
!551 = !DILocation(line: 232, column: 21, scope: !542)
!552 = !DILocation(line: 232, column: 22, scope: !542)
!553 = !DILocation(line: 229, column: 30, scope: !542)
!554 = !DILocation(line: 229, column: 16, scope: !542)
!555 = !DILocation(line: 229, column: 17, scope: !542)
!556 = !DILocation(line: 229, column: 5, scope: !542)
!557 = distinct !DISubprogram(name: "remote.AssetDir", linkageName: "command_line_arguments.AssetDir", scope: null, file: !7, line: 203, type: !558, isLocal: false, isDefinition: true, scopeLine: 203, isOptimized: false, unit: !1, retainedNodes: !3)
!558 = !DISubroutineType(types: !559)
!559 = !{!560, !100}
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*string,int,int},error}", file: !9, size: 320, align: 8, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 203, baseType: !524, size: 192, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 203, baseType: !187, size: 128, align: 64, offset: 192)
!564 = !DILocalVariable(name: "name", arg: 1, scope: !557, file: !7, line: 203, type: !100)
!565 = !DILocation(line: 203, column: 15, scope: !557)
!566 = !DILocation(line: 204, column: 10, scope: !567)
!567 = distinct !DILexicalBlock(scope: !557, file: !7, line: 203, column: 1)
!568 = !DILocalVariable(name: "node", scope: !567, file: !7, line: 204, type: !45)
!569 = !DILocation(line: 204, column: 2, scope: !557)
!570 = !DILocation(line: 205, column: 15, scope: !567)
!571 = !DILocation(line: 206, column: 29, scope: !572)
!572 = distinct !DILexicalBlock(scope: !567, file: !7, line: 205, column: 20)
!573 = !DILocalVariable(name: "cannonicalName", scope: !572, file: !7, line: 206, type: !100)
!574 = !DILocation(line: 206, column: 3, scope: !567)
!575 = !DILocation(line: 207, column: 23, scope: !572)
!576 = !DILocalVariable(name: "pathList", scope: !572, file: !7, line: 207, type: !524)
!577 = !DILocation(line: 207, column: 3, scope: !567)
!578 = !DILocation(line: 208, column: 3, scope: !579)
!579 = distinct !DILexicalBlock(scope: !572, file: !7, line: 208, column: 3)
!580 = !DILocation(line: 215, column: 9, scope: !567)
!581 = !DILocation(line: 209, column: 15, scope: !579)
!582 = !DILocation(line: 209, column: 24, scope: !579)
!583 = !DILocation(line: 210, column: 12, scope: !579)
!584 = !DILocation(line: 211, column: 21, scope: !579)
!585 = !DILocalVariable(name: "$ret27", scope: !557, file: !7, line: 203, type: !187)
!586 = !DILocation(line: 203, column: 39, scope: !557)
!587 = !DILocation(line: 211, column: 5, scope: !579)
!588 = !DILocation(line: 215, column: 15, scope: !567)
!589 = !DILocation(line: 216, column: 19, scope: !567)
!590 = !DILocation(line: 216, column: 3, scope: !567)
!591 = !DILocation(line: 218, column: 34, scope: !567)
!592 = !DILocation(line: 218, column: 26, scope: !567)
!593 = !DILocation(line: 218, column: 8, scope: !567)
!594 = !DILocation(line: 219, column: 29, scope: !595)
!595 = distinct !DILexicalBlock(scope: !567, file: !7, line: 219, column: 2)
!596 = !DILocation(line: 219, column: 2, scope: !595)
!597 = !DILocation(line: 220, column: 8, scope: !595)
!598 = !DILocation(line: 220, column: 6, scope: !595)
!599 = !DILocation(line: 222, column: 2, scope: !567)
!600 = distinct !DISubprogram(name: "remote.RestoreAsset", linkageName: "command_line_arguments.RestoreAsset", scope: null, file: !7, line: 236, type: !601, isLocal: false, isDefinition: true, scopeLine: 236, isOptimized: false, unit: !1, retainedNodes: !3)
!601 = !DISubroutineType(types: !602)
!602 = !{!187, !100, !100}
!603 = !DILocalVariable(name: "dir", arg: 1, scope: !600, file: !7, line: 236, type: !100)
!604 = !DILocation(line: 236, column: 19, scope: !600)
!605 = !DILocalVariable(name: "name", arg: 2, scope: !600, file: !7, line: 236, type: !100)
!606 = !DILocation(line: 236, column: 24, scope: !600)
!607 = !DILocation(line: 237, column: 15, scope: !608)
!608 = distinct !DILexicalBlock(scope: !600, file: !7, line: 236, column: 1)
!609 = !DILocalVariable(name: "err", scope: !608, file: !7, line: 237, type: !187)
!610 = !DILocation(line: 237, column: 2, scope: !600)
!611 = !DILocation(line: 238, column: 9, scope: !608)
!612 = !DILocalVariable(name: "$ret28", scope: !600, file: !7, line: 236, type: !187)
!613 = !DILocation(line: 236, column: 37, scope: !600)
!614 = !DILocation(line: 239, column: 3, scope: !608)
!615 = !DILocation(line: 241, column: 15, scope: !608)
!616 = !DILocalVariable(name: "info", scope: !608, file: !7, line: 241, type: !64)
!617 = !DILocation(line: 241, column: 2, scope: !600)
!618 = !DILocation(line: 242, column: 9, scope: !608)
!619 = !DILocation(line: 243, column: 3, scope: !608)
!620 = !DILocation(line: 245, column: 44, scope: !608)
!621 = !DILocation(line: 245, column: 20, scope: !608)
!622 = !DILocation(line: 245, column: 11, scope: !608)
!623 = !DILocation(line: 246, column: 9, scope: !608)
!624 = !DILocation(line: 247, column: 3, scope: !608)
!625 = !DILocation(line: 249, column: 25, scope: !608)
!626 = !DILocation(line: 249, column: 57, scope: !608)
!627 = !DILocalVariable(name: "data", scope: !608, file: !7, line: 237, type: !8)
!628 = !DILocation(line: 249, column: 15, scope: !608)
!629 = !DILocation(line: 250, column: 9, scope: !608)
!630 = !DILocation(line: 251, column: 3, scope: !608)
!631 = !DILocation(line: 253, column: 19, scope: !608)
!632 = !DILocation(line: 253, column: 45, scope: !608)
!633 = !DILocation(line: 253, column: 61, scope: !608)
!634 = !DILocation(line: 253, column: 11, scope: !608)
!635 = !DILocation(line: 254, column: 9, scope: !608)
!636 = !DILocation(line: 0, scope: !608)
!637 = distinct !DISubprogram(name: "remote._filePath", scope: null, file: !7, line: 277, type: !638, isLocal: true, isDefinition: true, scopeLine: 277, isOptimized: false, unit: !1, retainedNodes: !3)
!638 = !DISubroutineType(types: !639)
!639 = !{!100, !100, !100}
!640 = !DILocalVariable(name: "dir", arg: 1, scope: !637, file: !7, line: 277, type: !100)
!641 = !DILocation(line: 277, column: 16, scope: !637)
!642 = !DILocalVariable(name: "name", arg: 2, scope: !637, file: !7, line: 277, type: !100)
!643 = !DILocation(line: 277, column: 21, scope: !637)
!644 = !DILocation(line: 278, column: 28, scope: !645)
!645 = distinct !DILexicalBlock(scope: !637, file: !7, line: 277, column: 1)
!646 = !DILocalVariable(name: "cannonicalName", scope: !645, file: !7, line: 278, type: !100)
!647 = !DILocation(line: 278, column: 2, scope: !637)
!648 = !DILocation(line: 279, column: 53, scope: !645)
!649 = !DILocation(line: 279, column: 30, scope: !645)
!650 = !DILocation(line: 279, column: 23, scope: !645)
!651 = !DILocation(line: 279, column: 18, scope: !645)
!652 = !DILocation(line: 279, column: 2, scope: !645)
!653 = distinct !DISubprogram(name: "remote.RestoreAssets", linkageName: "command_line_arguments.RestoreAssets", scope: null, file: !7, line: 261, type: !601, isLocal: false, isDefinition: true, scopeLine: 261, isOptimized: false, unit: !1, retainedNodes: !3)
!654 = !DILocalVariable(name: "dir", arg: 1, scope: !653, file: !7, line: 261, type: !100)
!655 = !DILocation(line: 261, column: 20, scope: !653)
!656 = !DILocalVariable(name: "name", arg: 2, scope: !653, file: !7, line: 261, type: !100)
!657 = !DILocation(line: 261, column: 25, scope: !653)
!658 = !DILocation(line: 262, column: 19, scope: !659)
!659 = distinct !DILexicalBlock(scope: !653, file: !7, line: 261, column: 1)
!660 = !DILocalVariable(name: "children", scope: !659, file: !7, line: 262, type: !524)
!661 = !DILocation(line: 262, column: 2, scope: !653)
!662 = !DILocalVariable(name: "err", scope: !659, file: !7, line: 262, type: !187)
!663 = !DILocation(line: 264, column: 9, scope: !659)
!664 = !DILocation(line: 265, column: 10, scope: !659)
!665 = !DILocation(line: 265, column: 3, scope: !659)
!666 = !DILocation(line: 268, column: 2, scope: !667)
!667 = distinct !DILexicalBlock(scope: !659, file: !7, line: 268, column: 2)
!668 = !DILocation(line: 269, column: 37, scope: !667)
!669 = !DILocation(line: 269, column: 9, scope: !667)
!670 = !DILocation(line: 270, column: 10, scope: !667)
!671 = !DILocalVariable(name: "$ret29", scope: !653, file: !7, line: 261, type: !187)
!672 = !DILocation(line: 261, column: 38, scope: !653)
!673 = !DILocation(line: 271, column: 4, scope: !667)
!674 = !DILocation(line: 274, column: 2, scope: !659)
!675 = distinct !DISubprogram(name: "remote.NewClient", linkageName: "command_line_arguments.NewClient", scope: null, file: !181, line: 29, type: !676, isLocal: false, isDefinition: true, scopeLine: 29, isOptimized: false, unit: !1, retainedNodes: !3)
!676 = !DISubroutineType(types: !677)
!677 = !{!678, !100}
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{MessageReadWriteCloser,error}", file: !9, size: 256, align: 8, elements: !679)
!679 = !{!680, !801}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "retClient", file: !9, line: 29, baseType: !681, size: 128, align: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageReadWriteCloser", file: !181, line: 22, size: 128, align: 8, elements: !682)
!682 = !{!683, !184}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !181, line: 22, baseType: !684, size: 64, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)struct{*Message,error},*func(*void,*Message)error}", file: !9, size: 256, align: 8, elements: !686)
!686 = !{!687, !688, !689, !797}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 22, baseType: !71, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !9, line: 22, baseType: !255, size: 64, align: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !9, line: 22, baseType: !690, size: 64, align: 64, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!693, !35}
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Message,error}", file: !9, size: 192, align: 8, elements: !694)
!694 = !{!695, !796}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 22, baseType: !696, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !181, line: 22, size: 768, align: 8, elements: !698)
!698 = !{!699, !700, !703, !711, !748, !772, !781, !793, !794, !795}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !181, line: 22, baseType: !99, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Source", file: !181, line: 22, baseType: !701, size: 64, align: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIBasicType(name: "Message_Source", size: 32, encoding: DW_ATE_signed)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Ping", file: !181, line: 22, baseType: !704, size: 64, align: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ping", file: !181, line: 22, size: 256, align: 8, elements: !706)
!706 = !{!707, !710}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !181, line: 22, baseType: !708, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIBasicType(name: "Ping_RequestResponse", size: 32, encoding: DW_ATE_signed)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !181, line: 22, baseType: !8, size: 192, align: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ServerRequest", file: !181, line: 22, baseType: !712, size: 64, align: 64, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServerRequest", file: !181, line: 22, size: 512, align: 8, elements: !714)
!714 = !{!715, !722, !729, !734, !739, !747}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "AssumeRole", file: !181, line: 22, baseType: !716, size: 64, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "AssumeRole", file: !181, line: 22, size: 320, align: 8, elements: !718)
!718 = !{!719, !720, !721}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !181, line: 22, baseType: !99, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Role", file: !181, line: 22, baseType: !99, size: 64, align: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !181, line: 22, baseType: !8, size: 192, align: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ChallengeResponse", file: !181, line: 22, baseType: !723, size: 64, align: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHChallengeResponse", file: !181, line: 22, size: 448, align: 8, elements: !725)
!725 = !{!726, !727, !728}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !181, line: 22, baseType: !8, size: 192, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Format", file: !181, line: 22, baseType: !99, size: 64, align: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !181, line: 22, baseType: !8, size: 192, align: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "TokenResponse", file: !181, line: 22, baseType: !730, size: 64, align: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "MFATokenResponse", file: !181, line: 22, size: 256, align: 8, elements: !732)
!732 = !{!733, !710}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "TokenValue", file: !181, line: 22, baseType: !99, size: 64, align: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserCredentials", file: !181, line: 22, baseType: !735, size: 64, align: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "GetUserCredentials", file: !181, line: 22, size: 192, align: 8, elements: !737)
!737 = !{!738}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !181, line: 22, baseType: !8, size: 192, align: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "AddSSHkey", file: !181, line: 22, baseType: !740, size: 64, align: 64, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "AddSSHKey", file: !181, line: 22, size: 384, align: 8, elements: !742)
!742 = !{!743, !744, !745, !746}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Username", file: !181, line: 22, baseType: !99, size: 64, align: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "Passwordhash", file: !181, line: 22, baseType: !99, size: 64, align: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Sshkeybytes", file: !181, line: 22, baseType: !99, size: 64, align: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !181, line: 22, baseType: !8, size: 192, align: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !181, line: 22, baseType: !8, size: 192, align: 64, offset: 320)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ServerResponse", file: !181, line: 22, baseType: !749, size: 64, align: 64, offset: 256)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServerResponse", file: !181, line: 22, size: 448, align: 8, elements: !751)
!751 = !{!752, !757, !760, !769, !728}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Challenge", file: !181, line: 22, baseType: !753, size: 64, align: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHChallenge", file: !181, line: 22, size: 384, align: 8, elements: !755)
!755 = !{!756, !746}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Challenge", file: !181, line: 22, baseType: !8, size: 192, align: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "VerificationFailure", file: !181, line: 22, baseType: !758, size: 64, align: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHVerificationFailure", file: !181, line: 22, size: 192, align: 8, elements: !737)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Credentials", file: !181, line: 22, baseType: !761, size: 64, align: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "STSCredentials", file: !181, line: 22, size: 448, align: 8, elements: !763)
!763 = !{!764, !765, !766, !767, !728}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "AccessKeyId", file: !181, line: 22, baseType: !99, size: 64, align: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "SecretAccessKey", file: !181, line: 22, baseType: !99, size: 64, align: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "AccessToken", file: !181, line: 22, baseType: !99, size: 64, align: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Expiration", file: !181, line: 22, baseType: !768, size: 64, align: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "TokenRequest", file: !181, line: 22, baseType: !770, size: 64, align: 64, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "MFATokenRequest", file: !181, line: 22, size: 192, align: 8, elements: !737)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "AgentRequest", file: !181, line: 22, baseType: !773, size: 64, align: 64, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "AgentRequest", file: !181, line: 22, size: 576, align: 8, elements: !775)
!775 = !{!776, !777, !778, !779, !780}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "SshAgentSock", file: !181, line: 22, baseType: !99, size: 64, align: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "AssumeRole", file: !181, line: 22, baseType: !716, size: 64, align: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserCredentials", file: !181, line: 22, baseType: !735, size: 64, align: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "SshKeyFile", file: !181, line: 22, baseType: !8, size: 192, align: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !181, line: 22, baseType: !8, size: 192, align: 64, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "AgentResponse", file: !181, line: 22, baseType: !782, size: 64, align: 64, offset: 384)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "AgentResponse", file: !181, line: 22, size: 320, align: 8, elements: !784)
!784 = !{!785, !788, !721}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "Success", file: !181, line: 22, baseType: !786, size: 64, align: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "Success", file: !181, line: 22, size: 192, align: 8, elements: !737)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "Failure", file: !181, line: 22, baseType: !789, size: 64, align: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "Failure", file: !181, line: 22, size: 256, align: 8, elements: !791)
!791 = !{!792, !710}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorMessage", file: !181, line: 22, baseType: !99, size: 64, align: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Success", file: !181, line: 22, baseType: !786, size: 64, align: 64, offset: 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "Failure", file: !181, line: 22, baseType: !789, size: 64, align: 64, offset: 512)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !181, line: 22, baseType: !8, size: 192, align: 64, offset: 576)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 22, baseType: !187, size: 128, align: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !9, line: 22, baseType: !798, size: 64, align: 64, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!187, !35, !696}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !9, line: 29, baseType: !187, size: 128, align: 64, offset: 128)
!802 = !DILocalVariable(name: "address", arg: 1, scope: !675, file: !181, line: 29, type: !100)
!803 = !DILocation(line: 29, column: 16, scope: !675)
!804 = !DILocalVariable(name: "retClient", scope: !675, file: !181, line: 29, type: !681)
!805 = !DILocation(line: 29, column: 33, scope: !675)
!806 = !DILocation(line: 30, column: 15, scope: !807)
!807 = distinct !DILexicalBlock(scope: !675, file: !181, line: 29, column: 1)
!808 = !DILocalVariable(name: "pool", scope: !807, file: !181, line: 30, type: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertPool", file: !181, line: 19, size: 320, align: 8, elements: !811)
!811 = !{!812, !813, !814}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "bySubjectKeyId", file: !181, line: 19, baseType: !23, size: 64, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "byName", file: !181, line: 19, baseType: !23, size: 64, align: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "certs", file: !181, line: 19, baseType: !815, size: 192, align: 64, offset: 128)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !9, size: 192, align: 8, elements: !816)
!816 = !{!817, !14, !16}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !818, size: 64, align: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !181, line: 19, size: 10624, align: 8, elements: !821)
!821 = !{!822, !823, !824, !825, !826, !827, !828, !830, !832, !833, !834, !847, !873, !874, !875, !876, !878, !888, !889, !894, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !919, !942, !943, !944, !945, !956, !957, !958, !959, !960, !961, !962}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !181, line: 19, baseType: !8, size: 192, align: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !181, line: 19, baseType: !8, size: 192, align: 64, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !181, line: 19, baseType: !8, size: 192, align: 64, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !181, line: 19, baseType: !8, size: 192, align: 64, offset: 576)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !181, line: 19, baseType: !8, size: 192, align: 64, offset: 768)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !181, line: 19, baseType: !8, size: 192, align: 64, offset: 960)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !181, line: 19, baseType: !829, size: 64, align: 64, offset: 1152)
!829 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !181, line: 19, baseType: !831, size: 64, align: 64, offset: 1216)
!831 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !181, line: 19, baseType: !180, size: 128, align: 64, offset: 1280)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !181, line: 19, baseType: !15, size: 64, align: 64, offset: 1408)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !181, line: 19, baseType: !835, size: 64, align: 64, offset: 1472)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !181, line: 19, size: 256, align: 8, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !181, line: 19, baseType: !96, size: 8, align: 8)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !181, line: 19, baseType: !840, size: 192, align: 64, offset: 64)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !181, line: 19, size: 192, align: 8, elements: !841)
!841 = !{!842, !845, !846}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !181, line: 1, baseType: !843, size: 64, align: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !181, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !181, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !181, line: 19, baseType: !848, size: 1984, align: 64, offset: 1536)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !181, line: 19, size: 1984, align: 8, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !872}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !181, line: 19, baseType: !524, size: 192, align: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !181, line: 19, baseType: !524, size: 192, align: 64, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !181, line: 19, baseType: !524, size: 192, align: 64, offset: 384)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !181, line: 19, baseType: !524, size: 192, align: 64, offset: 576)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !181, line: 19, baseType: !524, size: 192, align: 64, offset: 768)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !181, line: 19, baseType: !524, size: 192, align: 64, offset: 960)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !181, line: 19, baseType: !524, size: 192, align: 64, offset: 1152)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !181, line: 19, baseType: !100, size: 128, align: 64, offset: 1344)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !181, line: 19, baseType: !100, size: 128, align: 64, offset: 1472)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !181, line: 19, baseType: !860, size: 192, align: 64, offset: 1600)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !9, size: 192, align: 8, elements: !861)
!861 = !{!862, !14, !16}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !863, size: 64, align: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !181, line: 19, size: 320, align: 8, elements: !865)
!865 = !{!866, !871}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !181, line: 19, baseType: !867, size: 192, align: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !181, line: 19, size: 192, align: 8, elements: !868)
!868 = !{!869, !845, !846}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !181, line: 1, baseType: !870, size: 64, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !181, line: 19, baseType: !180, size: 128, align: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !181, line: 19, baseType: !860, size: 192, align: 64, offset: 1792)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !181, line: 19, baseType: !848, size: 1984, align: 64, offset: 3520)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !181, line: 19, baseType: !129, size: 192, align: 64, offset: 5504)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !181, line: 19, baseType: !129, size: 192, align: 64, offset: 5696)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !181, line: 19, baseType: !877, size: 64, align: 64, offset: 5888)
!877 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !181, line: 19, baseType: !879, size: 192, align: 64, offset: 5952)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !9, size: 192, align: 8, elements: !880)
!880 = !{!881, !14, !16}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !882, size: 64, align: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !181, line: 19, size: 448, align: 8, elements: !884)
!884 = !{!885, !886, !887}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !181, line: 19, baseType: !867, size: 192, align: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !181, line: 19, baseType: !96, size: 8, align: 8, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !181, line: 19, baseType: !8, size: 192, align: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !181, line: 19, baseType: !879, size: 192, align: 64, offset: 6144)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !181, line: 19, baseType: !890, size: 192, align: 64, offset: 6336)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !9, size: 192, align: 8, elements: !891)
!891 = !{!892, !14, !16}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !893, size: 64, align: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !181, line: 19, baseType: !895, size: 192, align: 64, offset: 6528)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !9, size: 192, align: 8, elements: !896)
!896 = !{!897, !14, !16}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !898, size: 64, align: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !181, line: 19, baseType: !890, size: 192, align: 64, offset: 6720)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !181, line: 19, baseType: !96, size: 8, align: 8, offset: 6912)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !181, line: 19, baseType: !96, size: 8, align: 8, offset: 6920)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !181, line: 19, baseType: !15, size: 64, align: 64, offset: 6976)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !181, line: 19, baseType: !96, size: 8, align: 8, offset: 7040)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !181, line: 19, baseType: !8, size: 192, align: 64, offset: 7104)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !181, line: 19, baseType: !8, size: 192, align: 64, offset: 7296)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !181, line: 19, baseType: !524, size: 192, align: 64, offset: 7488)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !181, line: 19, baseType: !524, size: 192, align: 64, offset: 7680)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !181, line: 19, baseType: !524, size: 192, align: 64, offset: 7872)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !181, line: 19, baseType: !524, size: 192, align: 64, offset: 8064)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !181, line: 19, baseType: !912, size: 192, align: 64, offset: 8256)
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !9, size: 192, align: 8, elements: !913)
!913 = !{!914, !14, !16}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !915, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !181, line: 19, size: 192, align: 8, elements: !917)
!917 = !{!918, !845, !846}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !181, line: 1, baseType: !12, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !181, line: 19, baseType: !920, size: 192, align: 64, offset: 8448)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !9, size: 192, align: 8, elements: !921)
!921 = !{!922, !14, !16}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !923, size: 64, align: 64)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !181, line: 19, size: 1024, align: 8, elements: !926)
!926 = !{!927, !928, !929, !936, !937, !938, !939, !940, !941}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !181, line: 19, baseType: !100, size: 128, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !181, line: 19, baseType: !100, size: 128, align: 64, offset: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !181, line: 19, baseType: !930, size: 64, align: 64, offset: 256)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !181, line: 19, size: 320, align: 8, elements: !932)
!932 = !{!933, !934, !935}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !181, line: 19, baseType: !100, size: 128, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !181, line: 19, baseType: !100, size: 128, align: 64, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !181, line: 19, baseType: !96, size: 8, align: 8, offset: 256)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !181, line: 19, baseType: !100, size: 128, align: 64, offset: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !181, line: 19, baseType: !100, size: 128, align: 64, offset: 448)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !181, line: 19, baseType: !100, size: 128, align: 64, offset: 576)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !181, line: 19, baseType: !96, size: 8, align: 8, offset: 704)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !181, line: 19, baseType: !100, size: 128, align: 64, offset: 768)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !181, line: 19, baseType: !100, size: 128, align: 64, offset: 896)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !181, line: 19, baseType: !96, size: 8, align: 8, offset: 8640)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !181, line: 19, baseType: !524, size: 192, align: 64, offset: 8704)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !181, line: 19, baseType: !524, size: 192, align: 64, offset: 8896)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !181, line: 19, baseType: !946, size: 192, align: 64, offset: 9088)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !9, size: 192, align: 8, elements: !947)
!947 = !{!948, !14, !16}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !181, line: 19, size: 384, align: 8, elements: !952)
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !181, line: 19, baseType: !916, size: 192, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !181, line: 19, baseType: !955, size: 192, align: 64, offset: 192)
!955 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !181, line: 19, size: 192, align: 8, elements: !917)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !181, line: 19, baseType: !946, size: 192, align: 64, offset: 9280)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !181, line: 19, baseType: !524, size: 192, align: 64, offset: 9472)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !181, line: 19, baseType: !524, size: 192, align: 64, offset: 9664)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !181, line: 19, baseType: !524, size: 192, align: 64, offset: 9856)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !181, line: 19, baseType: !524, size: 192, align: 64, offset: 10048)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !181, line: 19, baseType: !524, size: 192, align: 64, offset: 10240)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !181, line: 19, baseType: !890, size: 192, align: 64, offset: 10432)
!963 = !DILocation(line: 30, column: 2, scope: !675)
!964 = !DILocation(line: 31, column: 13, scope: !807)
!965 = !DILocalVariable(name: "err", scope: !675, file: !181, line: 29, type: !187)
!966 = !DILocation(line: 29, column: 76, scope: !675)
!967 = !DILocation(line: 32, column: 9, scope: !807)
!968 = !DILocation(line: 33, column: 3, scope: !807)
!969 = !DILocalVariable(name: "ca", scope: !807, file: !181, line: 31, type: !8)
!970 = !DILocation(line: 31, column: 2, scope: !675)
!971 = !DILocation(line: 36, column: 6, scope: !807)
!972 = !DILocation(line: 38, column: 13, scope: !807)
!973 = !DILocation(line: 38, column: 18, scope: !807)
!974 = !DILocalVariable(name: "tlsConf", scope: !807, file: !181, line: 38, type: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !181, line: 19, size: 2944, align: 8, elements: !977)
!977 = !{!978, !987, !995, !1012, !1013, !1086, !1099, !1110, !1122, !1123, !1124, !1125, !1127, !1128, !1129, !1130, !1131, !1132, !1136, !1164, !1165, !1166, !1167, !1168, !1170, !1178, !1188, !1196}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "Rand", file: !181, line: 19, baseType: !979, size: 128, align: 64)
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !7, line: 11, size: 128, align: 8, elements: !980)
!980 = !{!981, !185}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 11, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !9, size: 128, align: 8, elements: !984)
!984 = !{!985, !986}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 11, baseType: !71, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !9, line: 11, baseType: !232, size: 64, align: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "Time", file: !181, line: 19, baseType: !988, size: 64, align: 64, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 15, size: 64, align: 8, elements: !990)
!990 = !{!991}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 15, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!129}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "Certificates", file: !181, line: 19, baseType: !996, size: 192, align: 64, offset: 192)
!996 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,int,int}", file: !9, size: 192, align: 8, elements: !997)
!997 = !{!998, !14, !16}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !181, line: 19, size: 768, align: 8, elements: !1001)
!1001 = !{!1002, !1007, !1009, !1010, !1011}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "Certificate", file: !181, line: 19, baseType: !1003, size: 192, align: 64)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !9, size: 192, align: 8, elements: !1004)
!1004 = !{!1005, !14, !16}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "PrivateKey", file: !181, line: 19, baseType: !1008, size: 128, align: 64, offset: 192)
!1008 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !181, line: 19, size: 128, align: 8, elements: !182)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPStaple", file: !181, line: 19, baseType: !8, size: 192, align: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !181, line: 19, baseType: !1003, size: 192, align: 64, offset: 512)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "Leaf", file: !181, line: 19, baseType: !819, size: 64, align: 64, offset: 704)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "NameToCertificate", file: !181, line: 19, baseType: !23, size: 64, align: 64, offset: 384)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "GetCertificate", file: !181, line: 19, baseType: !1014, size: 64, align: 64, offset: 448)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !181, line: 19, size: 64, align: 8, elements: !1016)
!1016 = !{!1017}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !181, line: 19, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!1021, !1025}
!1021 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,error}", file: !9, size: 192, align: 8, elements: !1022)
!1022 = !{!1023, !1024}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 19, baseType: !999, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 19, baseType: !187, size: 128, align: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientHelloInfo", file: !181, line: 19, size: 1408, align: 8, elements: !1027)
!1027 = !{!1028, !1033, !1034, !1040, !1041, !1047, !1048, !1049}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuites", file: !181, line: 19, baseType: !1029, size: 192, align: 64)
!1029 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint16,int,int}", file: !9, size: 192, align: 8, elements: !1030)
!1030 = !{!1031, !14, !16}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !181, line: 19, baseType: !100, size: 128, align: 64, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedCurves", file: !181, line: 19, baseType: !1035, size: 192, align: 64, offset: 320)
!1035 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*CurveID,int,int}", file: !9, size: 192, align: 8, elements: !1036)
!1036 = !{!1037, !14, !16}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DIBasicType(name: "CurveID", size: 16, encoding: DW_ATE_unsigned)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedPoints", file: !181, line: 19, baseType: !8, size: 192, align: 64, offset: 512)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureSchemes", file: !181, line: 19, baseType: !1042, size: 192, align: 64, offset: 704)
!1042 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*SignatureScheme,int,int}", file: !9, size: 192, align: 8, elements: !1043)
!1043 = !{!1044, !14, !16}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DIBasicType(name: "SignatureScheme", size: 16, encoding: DW_ATE_unsigned)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedProtos", file: !181, line: 19, baseType: !524, size: 192, align: 64, offset: 896)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedVersions", file: !181, line: 19, baseType: !1029, size: 192, align: 64, offset: 1088)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "Conn", file: !181, line: 19, baseType: !1050, size: 128, align: 64, offset: 1280)
!1050 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !181, line: 19, size: 128, align: 8, elements: !1051)
!1051 = !{!1052, !184}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !181, line: 19, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)Addr,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void)Addr,*func(*void,Time)error,*func(*void,Time)error,*func(*void,Time)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !9, size: 576, align: 8, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1070, !1078, !1079, !1083, !1084, !1085}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 19, baseType: !71, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !9, line: 19, baseType: !255, size: 64, align: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "LocalAddr", file: !9, line: 19, baseType: !1059, size: 64, align: 64, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!1062, !35}
!1062 = !DICompositeType(tag: DW_TAG_structure_type, name: "Addr", file: !181, line: 19, size: 128, align: 8, elements: !1063)
!1063 = !{!1064, !184}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !181, line: 19, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)string}", file: !9, size: 192, align: 8, elements: !1067)
!1067 = !{!1056, !1068, !1069}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "Network", file: !9, line: 19, baseType: !169, size: 64, align: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !9, line: 19, baseType: !169, size: 64, align: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !9, line: 19, baseType: !1071, size: 64, align: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!1074, !35, !8}
!1074 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !9, size: 192, align: 8, elements: !1075)
!1075 = !{!1076, !1077}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !9, line: 19, baseType: !15, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !9, line: 19, baseType: !187, size: 128, align: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !9, line: 19, baseType: !1059, size: 64, align: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "SetDeadline", file: !9, line: 19, baseType: !1080, size: 64, align: 64, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!187, !35, !129}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "SetReadDeadline", file: !9, line: 19, baseType: !1080, size: 64, align: 64, offset: 384)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "SetWriteDeadline", file: !9, line: 19, baseType: !1080, size: 64, align: 64, offset: 448)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !9, line: 19, baseType: !1071, size: 64, align: 64, offset: 512)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "GetClientCertificate", file: !181, line: 19, baseType: !1087, size: 64, align: 64, offset: 512)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !181, line: 19, size: 64, align: 8, elements: !1089)
!1089 = !{!1090}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !181, line: 19, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!1021, !1094}
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertificateRequestInfo", file: !181, line: 19, size: 384, align: 8, elements: !1096)
!1096 = !{!1097, !1098}
