; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22local\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22protocol\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/AdRoll/hologram/protocol\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/AdRoll/hologram/protocol\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22net\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22net\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22net\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3)
!2 = !DIFile(filename: "./client.go", directory: "/home/wangcong/go_path/src/github.com/AdRoll/hologram/transport/local")
!3 = !{}
!4 = distinct !DISubprogram(name: "local.NewClient", linkageName: "command_line_arguments.NewClient", scope: null, file: !5, line: 28, type: !6, isLocal: false, isDefinition: true, scopeLine: 28, isOptimized: false, unit: !1, retainedNodes: !3)
!5 = !DIFile(filename: "client.go", directory: ".")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !55}
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{MessageReadWriteCloser,error}", file: !9, size: 256, align: 8, elements: !10)
!9 = !DIFile(filename: "", directory: "")
!10 = !{!11, !212}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "retClient", file: !9, line: 28, baseType: !12, size: 128, align: 64)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageReadWriteCloser", file: !5, line: 21, size: 128, align: 8, elements: !13)
!13 = !{!14, !211}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 21, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)struct{*Message,error},*func(*void,*Message)error}", file: !9, size: 256, align: 8, elements: !17)
!17 = !{!18, !79, !95, !207}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 21, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !21, line: 1, size: 576, align: 8, elements: !22)
!21 = !DIFile(filename: "<built-in>", directory: "")
!22 = !{!23, !25, !26, !28, !30, !31, !32, !42, !51, !53, !60, !78}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !21, line: 1, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !21, line: 1, baseType: !24, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !21, line: 1, baseType: !27, size: 32, align: 32, offset: 128)
!27 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !21, line: 1, baseType: !29, size: 8, align: 8, offset: 160)
!29 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !21, line: 1, baseType: !29, size: 8, align: 8, offset: 168)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !21, line: 1, baseType: !29, size: 8, align: 8, offset: 176)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !21, line: 1, baseType: !33, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !21, line: 1, size: 64, align: 8, elements: !35)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !21, line: 1, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!24, !40, !24}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "void")
!42 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !21, line: 1, baseType: !43, size: 64, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !21, line: 1, size: 64, align: 8, elements: !45)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !21, line: 1, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !40, !40}
!50 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !21, line: 1, baseType: !52, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !21, line: 1, baseType: !54, size: 64, align: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !21, line: 1, size: 128, align: 8, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !21, line: 1, baseType: !52, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !21, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !21, line: 1, baseType: !61, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !21, line: 1, size: 320, align: 8, elements: !63)
!63 = !{!64, !65, !66}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !21, line: 1, baseType: !54, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !21, line: 1, baseType: !54, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !21, line: 1, baseType: !67, size: 192, align: 64, offset: 128)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !9, size: 192, align: 8, elements: !68)
!68 = !{!69, !76, !77}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !21, line: 1, size: 320, align: 8, elements: !72)
!72 = !{!64, !65, !73, !74, !75}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !21, line: 1, baseType: !40, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !21, line: 1, baseType: !40, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !21, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !9, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !9, line: 1, baseType: !59, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !21, line: 1, baseType: !40, size: 64, align: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !9, line: 21, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!83, !40}
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !21, line: 1, size: 128, align: 8, elements: !84)
!84 = !{!85, !94}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !21, line: 1, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !9, size: 128, align: 8, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 1, baseType: !19, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !9, line: 1, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!55, !40}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !21, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !9, line: 21, baseType: !96, size: 64, align: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!99, !40}
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Message,error}", file: !9, size: 192, align: 8, elements: !100)
!100 = !{!101, !206}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 21, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "Message", file: !5, line: 21, size: 768, align: 8, elements: !104)
!104 = !{!105, !106, !109, !120, !157, !182, !191, !203, !204, !205}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !5, line: 21, baseType: !54, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Source", file: !5, line: 21, baseType: !107, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIBasicType(name: "Message_Source", size: 32, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Ping", file: !5, line: 21, baseType: !110, size: 64, align: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ping", file: !5, line: 21, size: 256, align: 8, elements: !112)
!112 = !{!113, !116}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !5, line: 21, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIBasicType(name: "Ping_RequestResponse", size: 32, encoding: DW_ATE_signed)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !5, line: 21, baseType: !117, size: 192, align: 64, offset: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !9, size: 192, align: 8, elements: !118)
!118 = !{!119, !76, !77}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !52, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ServerRequest", file: !5, line: 21, baseType: !121, size: 64, align: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServerRequest", file: !5, line: 21, size: 512, align: 8, elements: !123)
!123 = !{!124, !131, !138, !143, !148, !156}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "AssumeRole", file: !5, line: 21, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "AssumeRole", file: !5, line: 21, size: 320, align: 8, elements: !127)
!127 = !{!128, !129, !130}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !5, line: 21, baseType: !54, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Role", file: !5, line: 21, baseType: !54, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !5, line: 21, baseType: !117, size: 192, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ChallengeResponse", file: !5, line: 21, baseType: !132, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHChallengeResponse", file: !5, line: 21, size: 448, align: 8, elements: !134)
!134 = !{!135, !136, !137}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !5, line: 21, baseType: !117, size: 192, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Format", file: !5, line: 21, baseType: !54, size: 64, align: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !5, line: 21, baseType: !117, size: 192, align: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "TokenResponse", file: !5, line: 21, baseType: !139, size: 64, align: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "MFATokenResponse", file: !5, line: 21, size: 256, align: 8, elements: !141)
!141 = !{!142, !116}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "TokenValue", file: !5, line: 21, baseType: !54, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserCredentials", file: !5, line: 21, baseType: !144, size: 64, align: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "GetUserCredentials", file: !5, line: 21, size: 192, align: 8, elements: !146)
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !5, line: 21, baseType: !117, size: 192, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "AddSSHkey", file: !5, line: 21, baseType: !149, size: 64, align: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "AddSSHKey", file: !5, line: 21, size: 384, align: 8, elements: !151)
!151 = !{!152, !153, !154, !155}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Username", file: !5, line: 21, baseType: !54, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Passwordhash", file: !5, line: 21, baseType: !54, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Sshkeybytes", file: !5, line: 21, baseType: !54, size: 64, align: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !5, line: 21, baseType: !117, size: 192, align: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !5, line: 21, baseType: !117, size: 192, align: 64, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ServerResponse", file: !5, line: 21, baseType: !158, size: 64, align: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServerResponse", file: !5, line: 21, size: 448, align: 8, elements: !160)
!160 = !{!161, !166, !169, !179, !137}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Challenge", file: !5, line: 21, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHChallenge", file: !5, line: 21, size: 384, align: 8, elements: !164)
!164 = !{!165, !155}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Challenge", file: !5, line: 21, baseType: !117, size: 192, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "VerificationFailure", file: !5, line: 21, baseType: !167, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSHVerificationFailure", file: !5, line: 21, size: 192, align: 8, elements: !146)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Credentials", file: !5, line: 21, baseType: !170, size: 64, align: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "STSCredentials", file: !5, line: 21, size: 448, align: 8, elements: !172)
!172 = !{!173, !174, !175, !176, !137}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "AccessKeyId", file: !5, line: 21, baseType: !54, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "SecretAccessKey", file: !5, line: 21, baseType: !54, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "AccessToken", file: !5, line: 21, baseType: !54, size: 64, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Expiration", file: !5, line: 21, baseType: !177, size: 64, align: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "TokenRequest", file: !5, line: 21, baseType: !180, size: 64, align: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "MFATokenRequest", file: !5, line: 21, size: 192, align: 8, elements: !146)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "AgentRequest", file: !5, line: 21, baseType: !183, size: 64, align: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "AgentRequest", file: !5, line: 21, size: 576, align: 8, elements: !185)
!185 = !{!186, !187, !188, !189, !190}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "SshAgentSock", file: !5, line: 21, baseType: !54, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "AssumeRole", file: !5, line: 21, baseType: !125, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserCredentials", file: !5, line: 21, baseType: !144, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "SshKeyFile", file: !5, line: 21, baseType: !117, size: 192, align: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !5, line: 21, baseType: !117, size: 192, align: 64, offset: 384)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "AgentResponse", file: !5, line: 21, baseType: !192, size: 64, align: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "AgentResponse", file: !5, line: 21, size: 320, align: 8, elements: !194)
!194 = !{!195, !198, !130}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Success", file: !5, line: 21, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "Success", file: !5, line: 21, size: 192, align: 8, elements: !146)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Failure", file: !5, line: 21, baseType: !199, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "Failure", file: !5, line: 21, size: 256, align: 8, elements: !201)
!201 = !{!202, !116}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorMessage", file: !5, line: 21, baseType: !54, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Success", file: !5, line: 21, baseType: !196, size: 64, align: 64, offset: 448)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Failure", file: !5, line: 21, baseType: !199, size: 64, align: 64, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "XXX_unrecognized", file: !5, line: 21, baseType: !117, size: 192, align: 64, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 21, baseType: !83, size: 128, align: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !9, line: 21, baseType: !208, size: 64, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!83, !40, !102}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !5, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !9, line: 28, baseType: !83, size: 128, align: 64, offset: 128)
!213 = !DILocalVariable(name: "address", arg: 1, scope: !4, file: !5, line: 28, type: !55)
!214 = !DILocation(line: 28, column: 16, scope: !4)
!215 = !DILocalVariable(name: "retClient", scope: !4, file: !5, line: 28, type: !12)
!216 = !DILocation(line: 28, column: 33, scope: !4)
!217 = !DILocation(line: 29, column: 26, scope: !218)
!218 = distinct !DILexicalBlock(scope: !4, file: !5, line: 28, column: 1)
!219 = !DILocalVariable(name: "localSocket", scope: !218, file: !5, line: 29, type: !220)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !5, line: 19, size: 128, align: 8, elements: !221)
!221 = !{!222, !211}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 19, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)Addr,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void)Addr,*func(*void,Time)error,*func(*void,Time)error,*func(*void,Time)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !9, size: 576, align: 8, elements: !225)
!225 = !{!226, !227, !228, !240, !248, !249, !286, !287, !288}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 19, baseType: !19, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !9, line: 19, baseType: !80, size: 64, align: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "LocalAddr", file: !9, line: 19, baseType: !229, size: 64, align: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!232, !40}
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "Addr", file: !5, line: 19, size: 128, align: 8, elements: !233)
!233 = !{!234, !211}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 19, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)string}", file: !9, size: 192, align: 8, elements: !237)
!237 = !{!226, !238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Network", file: !9, line: 19, baseType: !91, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !9, line: 19, baseType: !91, size: 64, align: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !9, line: 19, baseType: !241, size: 64, align: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!244, !40, !117}
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !9, size: 192, align: 8, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !9, line: 19, baseType: !59, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !9, line: 19, baseType: !83, size: 128, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !9, line: 19, baseType: !229, size: 64, align: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "SetDeadline", file: !9, line: 19, baseType: !250, size: 64, align: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!83, !40, !253}
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !5, line: 19, size: 192, align: 8, elements: !254)
!254 = !{!255, !257, !258}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !5, line: 19, baseType: !256, size: 64, align: 64)
!256 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !5, line: 19, baseType: !178, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !5, line: 19, baseType: !259, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !5, line: 19, size: 704, align: 8, elements: !261)
!261 = !{!262, !263, !272, !283, !284, !285}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !5, line: 19, baseType: !55, size: 128, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !5, line: 19, baseType: !264, size: 192, align: 64, offset: 128)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !9, size: 192, align: 8, elements: !265)
!265 = !{!266, !76, !77}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !5, line: 19, size: 256, align: 8, elements: !269)
!269 = !{!262, !270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !5, line: 19, baseType: !59, size: 64, align: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !5, line: 19, baseType: !50, size: 8, align: 8, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !5, line: 19, baseType: !273, size: 192, align: 64, offset: 320)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !9, size: 192, align: 8, elements: !274)
!274 = !{!275, !76, !77}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !5, line: 19, size: 128, align: 8, elements: !278)
!278 = !{!279, !280, !281, !282}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !5, line: 19, baseType: !178, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !5, line: 19, baseType: !29, size: 8, align: 8, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !5, line: 19, baseType: !50, size: 8, align: 8, offset: 72)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !5, line: 19, baseType: !50, size: 8, align: 8, offset: 80)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !5, line: 19, baseType: !178, size: 64, align: 64, offset: 512)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !5, line: 19, baseType: !178, size: 64, align: 64, offset: 576)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !5, line: 19, baseType: !267, size: 64, align: 64, offset: 640)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "SetReadDeadline", file: !9, line: 19, baseType: !250, size: 64, align: 64, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "SetWriteDeadline", file: !9, line: 19, baseType: !250, size: 64, align: 64, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !9, line: 19, baseType: !241, size: 64, align: 64, offset: 512)
!289 = !DILocation(line: 29, column: 2, scope: !4)
!290 = !DILocalVariable(name: "err", scope: !4, file: !5, line: 28, type: !83)
!291 = !DILocation(line: 28, column: 76, scope: !4)
!292 = !DILocation(line: 30, column: 9, scope: !218)
!293 = !DILocation(line: 31, column: 3, scope: !218)
!294 = !DILocation(line: 34, column: 44, scope: !218)
!295 = !DILocation(line: 34, column: 23, scope: !218)
!296 = !DILocation(line: 35, column: 2, scope: !218)
!297 = distinct !DISubprogram(name: "local.Close..1command_line_arguments.server", linkageName: "command_line_arguments.server.Close", scope: null, file: !298, line: 47, type: !299, isLocal: false, isDefinition: true, scopeLine: 47, isOptimized: false, unit: !1, retainedNodes: !3)
!298 = !DIFile(filename: "server.go", directory: ".")
!299 = !DISubroutineType(types: !300)
!300 = !{!83, !301, !301}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.server", file: !298, line: 23, size: 192, align: 8, elements: !303)
!303 = !{!304, !321}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "s", file: !298, line: 24, baseType: !305, size: 128, align: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "Listener", file: !5, line: 19, size: 128, align: 8, elements: !306)
!306 = !{!307, !211}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 19, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Conn,error},*func(*void)Addr,*func(*void)error}", file: !9, size: 256, align: 8, elements: !310)
!310 = !{!226, !311, !319, !320}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Accept", file: !9, line: 19, baseType: !312, size: 64, align: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!315, !40}
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Conn,error}", file: !9, size: 256, align: 8, elements: !316)
!316 = !{!317, !318}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 19, baseType: !220, size: 128, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 19, baseType: !83, size: 128, align: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", file: !9, line: 19, baseType: !229, size: 64, align: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !9, line: 19, baseType: !80, size: 64, align: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "handler", file: !298, line: 25, baseType: !322, size: 64, align: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 21, size: 64, align: 8, elements: !324)
!324 = !{!325}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 21, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!41, !12}
!329 = !DILocalVariable(name: "us", arg: 1, scope: !297, file: !298, line: 47, type: !301)
!330 = !DILocation(line: 47, column: 1, scope: !297)
!331 = !DILocation(line: 48, column: 11, scope: !297)
!332 = !DILocation(line: 48, column: 13, scope: !297)
!333 = !DILocation(line: 48, column: 2, scope: !297)
!334 = distinct !DISubprogram(name: "local.listen..1command_line_arguments.server", linkageName: "command_line_arguments.server.listen", scope: null, file: !298, line: 32, type: !335, isLocal: false, isDefinition: true, scopeLine: 32, isOptimized: false, unit: !1, retainedNodes: !3)
!335 = !DISubroutineType(types: !336)
!336 = !{!41, !301, !301}
!337 = !DILocalVariable(name: "us", arg: 1, scope: !334, file: !298, line: 32, type: !301)
!338 = !DILocation(line: 32, column: 1, scope: !334)
!339 = !DILocation(line: 34, column: 18, scope: !340)
!340 = distinct !DILexicalBlock(scope: !334, file: !298, line: 33, column: 6)
!341 = !DILocation(line: 34, column: 20, scope: !340)
!342 = !DILocalVariable(name: "conn", scope: !340, file: !298, line: 34, type: !220)
!343 = !DILocation(line: 34, column: 3, scope: !334)
!344 = !DILocalVariable(name: "err", scope: !340, file: !298, line: 34, type: !83)
!345 = !DILocation(line: 35, column: 10, scope: !340)
!346 = !DILocation(line: 39, column: 40, scope: !340)
!347 = !DILocation(line: 39, column: 19, scope: !340)
!348 = !DILocalVariable(name: "smc", scope: !340, file: !298, line: 39, type: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: ".github.com/AdRoll/hologram/protocol.messageConnection", file: !5, line: 21, size: 128, align: 8, elements: !351)
!351 = !{!352}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "internalConn", file: !5, line: 21, baseType: !353, size: 128, align: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteCloser", file: !5, line: 21, size: 128, align: 8, elements: !354)
!354 = !{!355, !211}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 21, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !9, size: 256, align: 8, elements: !358)
!358 = !{!18, !79, !359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !9, line: 21, baseType: !241, size: 64, align: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !9, line: 21, baseType: !241, size: 64, align: 64, offset: 192)
!361 = !DILocation(line: 39, column: 3, scope: !334)
!362 = !DILocation(line: 40, column: 8, scope: !340)
!363 = !DILocation(line: 40, column: 3, scope: !340)
!364 = distinct !DISubprogram(name: "local.command_line_arguments..thunk0", scope: null, file: !298, line: 40, type: !365, isLocal: true, isDefinition: true, scopeLine: 40, isOptimized: false, unit: !1, retainedNodes: !3)
!365 = !DISubroutineType(types: !366)
!366 = !{!41, !367}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*__go_descriptor,*.github.com/AdRoll/hologram/protocol.messageConnection}", file: !9, size: 128, align: 8, elements: !369)
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !9, line: 40, baseType: !322, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !9, line: 40, baseType: !349, size: 64, align: 64, offset: 64)
!372 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !364, file: !298, line: 40, type: !367)
!373 = !DILocation(line: 40, column: 3, scope: !364)
!374 = distinct !DISubprogram(name: "local.NewServer", linkageName: "command_line_arguments.NewServer", scope: null, file: !298, line: 55, type: !375, isLocal: false, isDefinition: true, scopeLine: 55, isOptimized: false, unit: !1, retainedNodes: !3)
!375 = !DISubroutineType(types: !376)
!376 = !{!377, !55, !322}
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.command-line-arguments.server,error}", file: !9, size: 192, align: 8, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "retServer", file: !9, line: 55, baseType: !301, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !9, line: 55, baseType: !83, size: 128, align: 64, offset: 64)
!381 = !DILocalVariable(name: "address", arg: 1, scope: !374, file: !298, line: 55, type: !55)
!382 = !DILocation(line: 55, column: 16, scope: !374)
!383 = !DILocalVariable(name: "handler", arg: 2, scope: !374, file: !298, line: 55, type: !322)
!384 = !DILocation(line: 55, column: 32, scope: !374)
!385 = !DILocalVariable(name: "retServer", scope: !374, file: !298, line: 55, type: !301)
!386 = !DILocation(line: 55, column: 73, scope: !374)
!387 = !DILocation(line: 56, column: 21, scope: !388)
!388 = distinct !DILexicalBlock(scope: !374, file: !298, line: 55, column: 1)
!389 = !DILocalVariable(name: "err", scope: !374, file: !298, line: 55, type: !83)
!390 = !DILocation(line: 55, column: 92, scope: !374)
!391 = !DILocation(line: 57, column: 9, scope: !388)
!392 = !DILocation(line: 58, column: 3, scope: !388)
!393 = !DILocation(line: 61, column: 14, scope: !388)
!394 = !DILocation(line: 61, column: 15, scope: !388)
!395 = !DILocation(line: 66, column: 2, scope: !388)
!396 = !DILocation(line: 67, column: 2, scope: !388)
!397 = distinct !DISubprogram(name: "local.command_line_arguments..thunk1", scope: null, file: !298, line: 66, type: !398, isLocal: true, isDefinition: true, scopeLine: 66, isOptimized: false, unit: !1, retainedNodes: !3)
!398 = !DISubroutineType(types: !399)
!399 = !{!41, !400}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.command-line-arguments.server}", file: !9, size: 64, align: 8, elements: !402)
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !9, line: 66, baseType: !301, size: 64, align: 64)
!404 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !397, file: !298, line: 66, type: !400)
!405 = !DILocation(line: 66, column: 2, scope: !397)
!406 = distinct !DISubprogram(name: "local.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !5, line: 16, type: !407, isLocal: false, isDefinition: true, scopeLine: 16, isOptimized: false, unit: !1, retainedNodes: !3)
!407 = !DISubroutineType(types: !408)
!408 = !{!41}
!409 = !DILocation(line: 1, column: 1, scope: !410)
!410 = !DILexicalBlockFile(scope: !406, file: !21, discriminator: 0)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "local"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "command-line-arguments"
	.ascii ";\n"
	.ascii "import "
	.ascii "protocol"
	.ascii " "
	.ascii "github.com/AdRoll/hologram/protocol"
	.ascii " \""
	.ascii "github.com/AdRoll/hologram/protocol"
	.ascii "\";\n"
	.ascii "import "
	.ascii "net"
	.ascii " "
	.ascii "net"
	.ascii " \""
	.ascii "net"
	.ascii "\";\n"
	.ascii "init"
	.ascii " "
	.ascii "bufio"
	.ascii " "
	.ascii "bufio..import"
	.ascii " "
	.ascii "bytes"
	.ascii " "
	.ascii "bytes..import"
	.ascii " "
	.ascii "context"
	.ascii " "
	.ascii "context..import"
	.ascii " "
	.ascii "base64"
	.ascii " "
	.ascii "encoding_base64..import"
	.ascii " "
	.ascii "binary"
	.ascii " "
	.ascii "encoding_binary..import"
	.ascii " "
	.ascii "json"
	.ascii " "
	.ascii "encoding_json..import"
	.ascii " "
	.ascii "fmt"
	.ascii " "
	.ascii "fmt..import"
	.ascii " "
	.ascii "protocol"
	.ascii " "
	.ascii "github_com_AdRoll_hologram_protocol..import"
	.ascii " "
	.ascii "proto"
	.ascii " "
	.ascii "github_com_AdRoll_hologram_vendor_github_com_golang_protobuf_proto..import"
	.ascii " "
	.ascii "crc32"
	.ascii " "
	.ascii "hash_crc32..import"
	.ascii " "
	.ascii "poll"
	.ascii " "
	.ascii "internal_poll..import"
	.ascii " "
	.ascii "testlog"
	.ascii " "
	.ascii "internal_testlog..import"
	.ascii " "
	.ascii "io"
	.ascii " "
	.ascii "io..import"
	.ascii " "
	.ascii "log"
	.ascii " "
	.ascii "log..import"
	.ascii " "
	.ascii "rand"
	.ascii " "
	.ascii "math_rand..import"
	.ascii " "
	.ascii "net"
	.ascii " "
