; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22pie\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/natefinch/pie\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/natefinch/pie\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22os\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22os\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22os\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./main.go", directory: "/home/wangcong/go_path/src/github.com/natefinch/pie/examples/consumer/master_consumer")
!3 = !{}
!4 = !{!5, !74}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "os.Stderr", linkageName: "os.Stderr", scope: !1, file: !7, line: 10, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "main.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !7, line: 10, size: 64, align: 8, elements: !10)
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !7, line: 10, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !7, line: 10, size: 640, align: 8, elements: !14)
!14 = !{!15, !55, !61, !72, !73}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !7, line: 10, baseType: !16, size: 384, align: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !7, line: 10, size: 384, align: 8, elements: !17)
!17 = !{!18, !26, !28, !33, !49, !50, !52, !53, !54}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !7, line: 10, baseType: !19, size: 128, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !7, line: 10, size: 128, align: 8, elements: !20)
!20 = !{!21, !23, !25}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 10, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !7, line: 10, baseType: !24, size: 32, align: 32, offset: 64)
!24 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !7, line: 10, baseType: !24, size: 32, align: 32, offset: 96)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !7, line: 10, baseType: !27, size: 64, align: 64, offset: 128)
!27 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !7, line: 10, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !7, line: 10, size: 64, align: 8, elements: !30)
!30 = !{!31}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !7, line: 10, baseType: !32, size: 64, align: 64)
!32 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !7, line: 10, baseType: !34, size: 64, align: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !36, size: 192, align: 8, elements: !37)
!36 = !DIFile(filename: "", directory: "")
!37 = !{!38, !47, !48}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !7, line: 10, size: 128, align: 8, elements: !41)
!41 = !{!42, !45}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !7, line: 10, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !7, line: 10, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !36, line: 1, baseType: !27, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !36, line: 1, baseType: !27, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !7, line: 10, baseType: !24, size: 32, align: 32, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !7, line: 10, baseType: !51, size: 8, align: 8, offset: 352)
!51 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !7, line: 10, baseType: !51, size: 8, align: 8, offset: 360)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !7, line: 10, baseType: !51, size: 8, align: 8, offset: 368)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !7, line: 10, baseType: !51, size: 8, align: 8, offset: 376)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 10, baseType: !56, size: 128, align: 64, offset: 384)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !57, line: 1, size: 128, align: 8, elements: !58)
!57 = !DIFile(filename: "<built-in>", directory: "")
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !57, line: 1, baseType: !43, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !57, line: 1, baseType: !27, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !7, line: 10, baseType: !62, size: 64, align: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !7, line: 10, size: 256, align: 8, elements: !64)
!64 = !{!65, !69}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 10, baseType: !66, size: 192, align: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !36, size: 192, align: 8, elements: !67)
!67 = !{!68, !47, !48}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !43, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !7, line: 10, baseType: !70, size: 64, align: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !7, line: 10, align: 8, elements: !3)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !7, line: 10, baseType: !51, size: 8, align: 8, offset: 576)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !7, line: 10, baseType: !51, size: 8, align: 8, offset: 584)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !57, line: 1, type: !24, isLocal: false, isDefinition: true)
!76 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !7, line: 6, type: !77, isLocal: false, isDefinition: true, scopeLine: 6, isOptimized: false, unit: !1, retainedNodes: !3)
!77 = !DISubroutineType(types: !78)
!78 = !{!79}
!79 = !DIBasicType(name: "void")
!80 = !DILocation(line: 1, column: 1, scope: !81)
!81 = !DILexicalBlockFile(scope: !76, file: !57, discriminator: 0)
!82 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !7, line: 16, type: !77, isLocal: false, isDefinition: true, scopeLine: 16, isOptimized: false, unit: !1, retainedNodes: !3)
!83 = !DILocation(line: 17, column: 6, scope: !84)
!84 = distinct !DILexicalBlock(scope: !82, file: !7, line: 16, column: 1)
!85 = !DILocalVariable(name: "path", scope: !84, file: !7, line: 18, type: !56)
!86 = !DILocation(line: 18, column: 2, scope: !82)
!87 = !DILocation(line: 23, column: 33, scope: !84)
!88 = !DILocation(line: 23, column: 16, scope: !84)
!89 = !DILocalVariable(name: "err", scope: !84, file: !7, line: 23, type: !90)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !57, line: 1, size: 128, align: 8, elements: !91)
!91 = !{!92, !147}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !57, line: 1, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !36, size: 128, align: 8, elements: !95)
!95 = !{!96, !143}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !36, line: 1, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !57, line: 1, size: 576, align: 8, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !105, !106, !115, !123, !124, !126, !142}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !57, line: 1, baseType: !32, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !57, line: 1, baseType: !32, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !57, line: 1, baseType: !24, size: 32, align: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !57, line: 1, baseType: !44, size: 8, align: 8, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !57, line: 1, baseType: !44, size: 8, align: 8, offset: 168)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !57, line: 1, baseType: !44, size: 8, align: 8, offset: 176)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !57, line: 1, baseType: !107, size: 64, align: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !57, line: 1, size: 64, align: 8, elements: !109)
!109 = !{!110}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !57, line: 1, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!32, !114, !32}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !57, line: 1, baseType: !116, size: 64, align: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !57, line: 1, size: 64, align: 8, elements: !118)
!118 = !{!119}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !57, line: 1, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!51, !114, !114}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !57, line: 1, baseType: !43, size: 64, align: 64, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !57, line: 1, baseType: !125, size: 64, align: 64, offset: 384)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !57, line: 1, baseType: !127, size: 64, align: 64, offset: 448)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !57, line: 1, size: 320, align: 8, elements: !129)
!129 = !{!130, !131, !132}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !57, line: 1, baseType: !125, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !57, line: 1, baseType: !125, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !57, line: 1, baseType: !133, size: 192, align: 64, offset: 128)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !36, size: 192, align: 8, elements: !134)
!134 = !{!135, !47, !48}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !57, line: 1, size: 320, align: 8, elements: !138)
!138 = !{!130, !131, !139, !140, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !57, line: 1, baseType: !114, size: 64, align: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !57, line: 1, baseType: !114, size: 64, align: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !57, line: 1, baseType: !114, size: 64, align: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !57, line: 1, baseType: !114, size: 64, align: 64, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !36, line: 1, baseType: !144, size: 64, align: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!56, !114}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !57, line: 1, baseType: !114, size: 64, align: 64, offset: 64)
!148 = !DILocation(line: 23, column: 2, scope: !82)
!149 = !DILocation(line: 24, column: 9, scope: !84)
!150 = !DILocation(line: 27, column: 35, scope: !151)
!151 = distinct !DILexicalBlock(scope: !84, file: !7, line: 27, column: 2)
!152 = !DILocalVariable(name: "s", scope: !84, file: !7, line: 23, type: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "Server", file: !7, line: 13, size: 320, align: 8, elements: !154)
!154 = !{!155, !205, !234}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "server", file: !7, line: 13, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "Server", file: !7, line: 13, size: 576, align: 8, elements: !158)
!158 = !{!159, !190, !191, !198, !199}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "serviceMap", file: !7, line: 13, baseType: !160, size: 320, align: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map", file: !7, line: 13, size: 320, align: 8, elements: !161)
!161 = !{!162, !168, !175, !189}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !7, line: 13, baseType: !163, size: 64, align: 32)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 9, size: 64, align: 8, elements: !164)
!164 = !{!165, !167}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 9, baseType: !166, size: 32, align: 32)
!166 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 9, baseType: !24, size: 32, align: 32, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "read", file: !7, line: 13, baseType: !169, size: 128, align: 64, offset: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !7, line: 13, size: 128, align: 8, elements: !170)
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "v", file: !7, line: 13, baseType: !172, size: 128, align: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !36, size: 128, align: 8, elements: !173)
!173 = !{!96, !174}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !36, line: 1, baseType: !114, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", file: !7, line: 13, baseType: !176, size: 64, align: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !57, line: 1, size: 384, align: 8, elements: !178)
!178 = !{!179, !180, !181, !182, !184, !185, !186, !187, !188}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !57, line: 1, baseType: !27, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !57, line: 1, baseType: !44, size: 8, align: 8, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !57, line: 1, baseType: !44, size: 8, align: 8, offset: 72)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !57, line: 1, baseType: !183, size: 16, align: 16, offset: 80)
!183 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !57, line: 1, baseType: !24, size: 32, align: 32, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !57, line: 1, baseType: !114, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !57, line: 1, baseType: !114, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !57, line: 1, baseType: !32, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !57, line: 1, baseType: !114, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "misses", file: !7, line: 13, baseType: !27, size: 64, align: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "reqLock", file: !7, line: 13, baseType: !163, size: 64, align: 32, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "freeReq", file: !7, line: 13, baseType: !192, size: 64, align: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !7, line: 13, size: 256, align: 8, elements: !194)
!194 = !{!195, !196, !197}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ServiceMethod", file: !7, line: 13, baseType: !56, size: 128, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Seq", file: !7, line: 13, baseType: !22, size: 64, align: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !7, line: 13, baseType: !114, size: 64, align: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "respLock", file: !7, line: 13, baseType: !163, size: 64, align: 32, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "freeResp", file: !7, line: 13, baseType: !200, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !7, line: 13, size: 384, align: 8, elements: !202)
!202 = !{!195, !196, !203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !7, line: 13, baseType: !56, size: 128, align: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !7, line: 13, baseType: !114, size: 64, align: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "rwc", file: !7, line: 13, baseType: !206, size: 128, align: 64, offset: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteCloser", file: !7, line: 13, size: 128, align: 8, elements: !207)
!207 = !{!208, !233}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 13, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !36, size: 256, align: 8, elements: !211)
!211 = !{!212, !213, !217, !225}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !36, line: 13, baseType: !97, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !36, line: 13, baseType: !214, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!90, !114}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !36, line: 13, baseType: !218, size: 64, align: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!221, !114, !66}
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !36, size: 192, align: 8, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !36, line: 13, baseType: !27, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !36, line: 13, baseType: !90, size: 128, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !36, line: 13, baseType: !226, size: 64, align: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!229, !114, !66}
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !36, size: 192, align: 8, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !36, line: 9, baseType: !27, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !36, line: 9, baseType: !90, size: 128, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !114, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "codec", file: !7, line: 13, baseType: !235, size: 128, align: 64, offset: 192)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServerCodec", file: !7, line: 13, size: 128, align: 8, elements: !236)
!236 = !{!237, !233}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 13, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*_type,*void})error,*func(*void,*Request)error,*func(*void,*Response,struct{*_type,*void})error}", file: !36, size: 320, align: 8, elements: !240)
!240 = !{!212, !213, !241, !245, !249}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ReadRequestBody", file: !36, line: 13, baseType: !242, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!90, !114, !172}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ReadRequestHeader", file: !36, line: 13, baseType: !246, size: 64, align: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!90, !114, !192}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "WriteResponse", file: !36, line: 13, baseType: !250, size: 64, align: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!90, !114, !200, !172}
!253 = !DILocation(line: 27, column: 13, scope: !151)
!254 = !DILocalVariable(name: "err", scope: !151, file: !7, line: 27, type: !90)
!255 = !DILocation(line: 27, column: 5, scope: !84)
!256 = !DILocation(line: 27, column: 47, scope: !151)
!257 = !DILocation(line: 25, column: 46, scope: !84)
!258 = !DILocation(line: 25, column: 7, scope: !84)
!259 = !DILocation(line: 30, column: 36, scope: !260)
!260 = distinct !DILexicalBlock(scope: !84, file: !7, line: 30, column: 2)
!261 = !DILocation(line: 30, column: 13, scope: !260)
!262 = !DILocalVariable(name: "err", scope: !260, file: !7, line: 30, type: !90)
!263 = !DILocation(line: 30, column: 5, scope: !84)
!264 = !DILocation(line: 30, column: 49, scope: !260)
!265 = !DILocation(line: 28, column: 45, scope: !151)
!266 = !DILocation(line: 28, column: 7, scope: !151)
!267 = !DILocation(line: 33, column: 3, scope: !84)
!268 = !DILocation(line: 31, column: 46, scope: !260)
!269 = !DILocation(line: 31, column: 7, scope: !260)
!270 = distinct !DISubprogram(name: "main.SayHi.main.api", linkageName: "main.api.SayHi", scope: null, file: !7, line: 38, type: !271, isLocal: false, isDefinition: true, scopeLine: 38, isOptimized: false, unit: !1, retainedNodes: !3)
!271 = !DISubroutineType(types: !272)
!272 = !{!90, !273, !273, !56, !125}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: ".main.api", file: !7, line: 36, align: 8, elements: !3)
!275 = !DILocalVariable(name: "r.0.pointer", arg: 1, scope: !270, file: !7, line: 38, type: !273)
!276 = !DILocation(line: 38, column: 1, scope: !270)
!277 = !DILocalVariable(name: "name", arg: 2, scope: !270, file: !7, line: 38, type: !56)
!278 = !DILocation(line: 38, column: 18, scope: !270)
!279 = !DILocalVariable(name: "response", arg: 3, scope: !270, file: !7, line: 38, type: !125)
!280 = !DILocation(line: 38, column: 31, scope: !270)
!281 = !DILocation(line: 39, column: 6, scope: !270)
!282 = !DILocation(line: 41, column: 17, scope: !270)
!283 = !DILocation(line: 41, column: 12, scope: !270)
!284 = !DILocalVariable(name: "$ret0", scope: !270, file: !7, line: 38, type: !90)
!285 = !DILocation(line: 38, column: 49, scope: !270)
!286 = !DILocation(line: 42, column: 2, scope: !270)
!287 = distinct !DISubprogram(name: "main.SayBye.main.api2", linkageName: "main.api2.SayBye", scope: null, file: !7, line: 47, type: !288, isLocal: false, isDefinition: true, scopeLine: 47, isOptimized: false, unit: !1, retainedNodes: !3)
!288 = !DISubroutineType(types: !289)
!289 = !{!90, !290, !290, !56, !125}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: ".main.api2", file: !7, line: 45, align: 8, elements: !3)
!292 = !DILocalVariable(name: "r.1.pointer", arg: 1, scope: !287, file: !7, line: 47, type: !290)
!293 = !DILocation(line: 47, column: 1, scope: !287)
!294 = !DILocalVariable(name: "name", arg: 2, scope: !287, file: !7, line: 47, type: !56)
!295 = !DILocation(line: 47, column: 20, scope: !287)
!296 = !DILocalVariable(name: "response", arg: 3, scope: !287, file: !7, line: 47, type: !125)
!297 = !DILocation(line: 47, column: 33, scope: !287)
!298 = !DILocation(line: 48, column: 6, scope: !287)
!299 = !DILocation(line: 50, column: 18, scope: !287)
!300 = !DILocation(line: 50, column: 12, scope: !287)
!301 = !DILocalVariable(name: "$ret1", scope: !287, file: !7, line: 47, type: !90)
!302 = !DILocation(line: 47, column: 51, scope: !287)
!303 = !DILocation(line: 51, column: 2, scope: !287)
