; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22pie\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/natefinch/pie\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/natefinch/pie\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22jsonrpc\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22net/rpc/jsonrpc\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22net/rpc/jsonrpc\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22runtime\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./main.go", directory: "/home/wangcong/go_path/src/github.com/natefinch/pie/examples/provider/plugin_provider")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !10, line: 5, type: !11, isLocal: false, isDefinition: true, scopeLine: 5, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DIFile(filename: "main.go", directory: ".")
!11 = !DISubroutineType(types: !12)
!12 = !{!13}
!13 = !DIBasicType(name: "void")
!14 = !DILocation(line: 1, column: 1, scope: !15)
!15 = !DILexicalBlockFile(scope: !9, file: !7, discriminator: 0)
!16 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !10, line: 14, type: !11, isLocal: false, isDefinition: true, scopeLine: 14, isOptimized: false, unit: !1, retainedNodes: !3)
!17 = !DILocation(line: 15, column: 6, scope: !18)
!18 = distinct !DILexicalBlock(scope: !16, file: !10, line: 14, column: 1)
!19 = !DILocation(line: 17, column: 11, scope: !18)
!20 = !DILocation(line: 18, column: 37, scope: !21)
!21 = distinct !DILexicalBlock(scope: !18, file: !10, line: 18, column: 2)
!22 = !DILocalVariable(name: "p", scope: !18, file: !10, line: 17, type: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "Server", file: !10, line: 11, size: 320, align: 8, elements: !24)
!24 = !{!25, !135, !178}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "server", file: !10, line: 11, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "Server", file: !10, line: 11, size: 576, align: 8, elements: !28)
!28 = !{!29, !119, !120, !128, !129}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "serviceMap", file: !10, line: 11, baseType: !30, size: 320, align: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map", file: !10, line: 11, size: 320, align: 8, elements: !31)
!31 = !{!32, !38, !104, !118}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !10, line: 11, baseType: !33, size: 64, align: 32)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !10, line: 8, size: 64, align: 8, elements: !34)
!34 = !{!35, !37}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !10, line: 8, baseType: !36, size: 32, align: 32)
!36 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !10, line: 8, baseType: !8, size: 32, align: 32, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "read", file: !10, line: 11, baseType: !39, size: 128, align: 64, offset: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !10, line: 11, size: 128, align: 8, elements: !40)
!40 = !{!41}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "v", file: !10, line: 11, baseType: !42, size: 128, align: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !43, size: 128, align: 8, elements: !44)
!43 = !DIFile(filename: "", directory: "")
!44 = !{!45, !103}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !43, line: 1, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !48)
!48 = !{!49, !51, !52, !53, !55, !56, !57, !66, !75, !77, !84, !102}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !50, size: 64, align: 64)
!50 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !50, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !54, size: 8, align: 8, offset: 160)
!54 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !54, size: 8, align: 8, offset: 168)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !54, size: 8, align: 8, offset: 176)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !58, size: 64, align: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!50, !65, !50}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !67, size: 64, align: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !69)
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !65, !65}
!74 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !76, size: 64, align: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !78, size: 64, align: 64, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !80)
!80 = !{!81, !82}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !76, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !83, size: 64, align: 64, offset: 64)
!83 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !85, size: 64, align: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !87)
!87 = !{!88, !89, !90}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !78, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !78, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !91, size: 192, align: 64, offset: 128)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !43, size: 192, align: 8, elements: !92)
!92 = !{!93, !100, !101}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !96)
!96 = !{!88, !89, !97, !98, !99}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !65, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !65, size: 64, align: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !65, size: 64, align: 64, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !43, line: 1, baseType: !83, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !43, line: 1, baseType: !83, size: 64, align: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !65, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !43, line: 1, baseType: !65, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", file: !10, line: 11, baseType: !105, size: 64, align: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !107)
!107 = !{!108, !109, !110, !111, !113, !114, !115, !116, !117}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !83, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !54, size: 8, align: 8, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !54, size: 8, align: 8, offset: 72)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !112, size: 16, align: 16, offset: 80)
!112 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !65, size: 64, align: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !65, size: 64, align: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !50, size: 64, align: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !65, size: 64, align: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "misses", file: !10, line: 11, baseType: !83, size: 64, align: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "reqLock", file: !10, line: 11, baseType: !33, size: 64, align: 32, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "freeReq", file: !10, line: 11, baseType: !121, size: 64, align: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !10, line: 9, size: 256, align: 8, elements: !123)
!123 = !{!124, !125, !127}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ServiceMethod", file: !10, line: 9, baseType: !79, size: 128, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Seq", file: !10, line: 9, baseType: !126, size: 64, align: 64, offset: 128)
!126 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !10, line: 9, baseType: !65, size: 64, align: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "respLock", file: !10, line: 11, baseType: !33, size: 64, align: 32, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "freeResp", file: !10, line: 11, baseType: !130, size: 64, align: 64, offset: 512)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !10, line: 9, size: 384, align: 8, elements: !132)
!132 = !{!124, !125, !133, !134}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !10, line: 9, baseType: !79, size: 128, align: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !10, line: 9, baseType: !65, size: 64, align: 64, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "rwc", file: !10, line: 11, baseType: !136, size: 128, align: 64, offset: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteCloser", file: !10, line: 9, size: 128, align: 8, elements: !137)
!137 = !{!138, !177}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 9, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !43, size: 256, align: 8, elements: !141)
!141 = !{!142, !143, !158, !169}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !43, line: 9, baseType: !46, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !43, line: 9, baseType: !144, size: 64, align: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!147, !65}
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !148)
!148 = !{!149, !157}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !43, size: 128, align: 8, elements: !152)
!152 = !{!45, !153}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !43, line: 1, baseType: !154, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!79, !65}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !65, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !43, line: 9, baseType: !159, size: 64, align: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !65, !166}
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !43, size: 192, align: 8, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !43, line: 9, baseType: !83, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !43, line: 9, baseType: !147, size: 128, align: 64, offset: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !43, size: 192, align: 8, elements: !167)
!167 = !{!168, !100, !101}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !43, line: 1, baseType: !76, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !43, line: 9, baseType: !170, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!173, !65, !166}
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !43, size: 192, align: 8, elements: !174)
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !43, line: 8, baseType: !83, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !43, line: 8, baseType: !147, size: 128, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !65, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "codec", file: !10, line: 11, baseType: !179, size: 128, align: 64, offset: 192)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServerCodec", file: !10, line: 9, size: 128, align: 8, elements: !180)
!180 = !{!181, !177}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 9, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*_type,*void})error,*func(*void,*Request)error,*func(*void,*Response,struct{*_type,*void})error}", file: !43, size: 320, align: 8, elements: !184)
!184 = !{!142, !143, !185, !189, !193}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ReadRequestBody", file: !43, line: 9, baseType: !186, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!147, !65, !42}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ReadRequestHeader", file: !43, line: 9, baseType: !190, size: 64, align: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!147, !65, !121}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "WriteResponse", file: !43, line: 9, baseType: !194, size: 64, align: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!147, !65, !130, !42}
!197 = !DILocation(line: 17, column: 2, scope: !16)
!198 = !DILocation(line: 18, column: 13, scope: !21)
!199 = !DILocalVariable(name: "err", scope: !21, file: !10, line: 18, type: !147)
!200 = !DILocation(line: 18, column: 5, scope: !18)
!201 = !DILocation(line: 18, column: 49, scope: !21)
!202 = !DILocation(line: 21, column: 38, scope: !203)
!203 = distinct !DILexicalBlock(scope: !18, file: !10, line: 21, column: 2)
!204 = !DILocation(line: 21, column: 13, scope: !203)
!205 = !DILocalVariable(name: "err", scope: !203, file: !10, line: 21, type: !147)
!206 = !DILocation(line: 21, column: 5, scope: !18)
!207 = !DILocation(line: 21, column: 51, scope: !203)
!208 = !DILocation(line: 19, column: 47, scope: !21)
!209 = !DILocation(line: 19, column: 7, scope: !21)
!210 = !DILocation(line: 24, column: 3, scope: !18)
!211 = !DILocation(line: 22, column: 48, scope: !203)
!212 = !DILocation(line: 22, column: 7, scope: !203)
!213 = distinct !DISubprogram(name: "main.SayHi.main.api", linkageName: "main.api.SayHi", scope: null, file: !10, line: 29, type: !214, isLocal: false, isDefinition: true, scopeLine: 29, isOptimized: false, unit: !1, retainedNodes: !3)
!214 = !DISubroutineType(types: !215)
!215 = !{!147, !216, !216, !79, !78}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: ".main.api", file: !10, line: 27, align: 8, elements: !3)
!218 = !DILocalVariable(name: "r.0.pointer", arg: 1, scope: !213, file: !10, line: 29, type: !216)
!219 = !DILocation(line: 29, column: 1, scope: !213)
!220 = !DILocalVariable(name: "name", arg: 2, scope: !213, file: !10, line: 29, type: !79)
!221 = !DILocation(line: 29, column: 18, scope: !213)
!222 = !DILocalVariable(name: "response", arg: 3, scope: !213, file: !10, line: 29, type: !78)
!223 = !DILocation(line: 29, column: 31, scope: !213)
!224 = !DILocation(line: 30, column: 6, scope: !213)
!225 = !DILocation(line: 32, column: 17, scope: !213)
!226 = !DILocation(line: 32, column: 12, scope: !213)
!227 = !DILocalVariable(name: "$ret0", scope: !213, file: !10, line: 29, type: !147)
!228 = !DILocation(line: 29, column: 49, scope: !213)
!229 = !DILocation(line: 33, column: 2, scope: !213)
!230 = distinct !DISubprogram(name: "main.SayBye.main.api2", linkageName: "main.api2.SayBye", scope: null, file: !10, line: 38, type: !231, isLocal: false, isDefinition: true, scopeLine: 38, isOptimized: false, unit: !1, retainedNodes: !3)
!231 = !DISubroutineType(types: !232)
!232 = !{!147, !233, !233, !79, !78}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: ".main.api2", file: !10, line: 36, align: 8, elements: !3)
!235 = !DILocalVariable(name: "r.1.pointer", arg: 1, scope: !230, file: !10, line: 38, type: !233)
!236 = !DILocation(line: 38, column: 1, scope: !230)
!237 = !DILocalVariable(name: "name", arg: 2, scope: !230, file: !10, line: 38, type: !79)
!238 = !DILocation(line: 38, column: 20, scope: !230)
!239 = !DILocalVariable(name: "response", arg: 3, scope: !230, file: !10, line: 38, type: !78)
!240 = !DILocation(line: 38, column: 33, scope: !230)
!241 = !DILocation(line: 39, column: 6, scope: !230)
!242 = !DILocation(line: 41, column: 18, scope: !230)
!243 = !DILocation(line: 41, column: 12, scope: !230)
!244 = !DILocalVariable(name: "$ret1", scope: !230, file: !10, line: 38, type: !147)
!245 = !DILocation(line: 38, column: 51, scope: !230)
!246 = !DILocation(line: 42, column: 2, scope: !230)
