; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22pie\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/natefinch/pie\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/natefinch/pie\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22rpc\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22net/rpc\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22net/rpc\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22jsonrpc\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22net/rpc/jsonrpc\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22net/rpc/jsonrpc\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./main.go", directory: "/home/wangcong/go_path/src/github.com/natefinch/pie/examples/provider/master_provider")
!3 = !{}
!4 = !{!5, !74}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "os.Stderr", linkageName: "os.Stderr", scope: !1, file: !7, line: 12, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "main.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !7, line: 12, size: 64, align: 8, elements: !10)
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !7, line: 12, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !7, line: 12, size: 640, align: 8, elements: !14)
!14 = !{!15, !55, !61, !72, !73}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !7, line: 12, baseType: !16, size: 384, align: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !7, line: 12, size: 384, align: 8, elements: !17)
!17 = !{!18, !26, !28, !33, !49, !50, !52, !53, !54}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !7, line: 12, baseType: !19, size: 128, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !7, line: 12, size: 128, align: 8, elements: !20)
!20 = !{!21, !23, !25}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 12, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !7, line: 12, baseType: !24, size: 32, align: 32, offset: 64)
!24 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !7, line: 12, baseType: !24, size: 32, align: 32, offset: 96)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !7, line: 12, baseType: !27, size: 64, align: 64, offset: 128)
!27 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !7, line: 12, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !7, line: 12, size: 64, align: 8, elements: !30)
!30 = !{!31}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !7, line: 12, baseType: !32, size: 64, align: 64)
!32 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !7, line: 12, baseType: !34, size: 64, align: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !36, size: 192, align: 8, elements: !37)
!36 = !DIFile(filename: "", directory: "")
!37 = !{!38, !47, !48}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !7, line: 12, size: 128, align: 8, elements: !41)
!41 = !{!42, !45}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !7, line: 12, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !7, line: 12, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !36, line: 1, baseType: !27, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !36, line: 1, baseType: !27, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !7, line: 12, baseType: !24, size: 32, align: 32, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !7, line: 12, baseType: !51, size: 8, align: 8, offset: 352)
!51 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !7, line: 12, baseType: !51, size: 8, align: 8, offset: 360)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !7, line: 12, baseType: !51, size: 8, align: 8, offset: 368)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !7, line: 12, baseType: !51, size: 8, align: 8, offset: 376)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 12, baseType: !56, size: 128, align: 64, offset: 384)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !57, line: 1, size: 128, align: 8, elements: !58)
!57 = !DIFile(filename: "<built-in>", directory: "")
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !57, line: 1, baseType: !43, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !57, line: 1, baseType: !27, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !7, line: 12, baseType: !62, size: 64, align: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !7, line: 12, size: 256, align: 8, elements: !64)
!64 = !{!65, !69}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 12, baseType: !66, size: 192, align: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !36, size: 192, align: 8, elements: !67)
!67 = !{!68, !47, !48}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !43, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !7, line: 12, baseType: !70, size: 64, align: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !7, line: 12, align: 8, elements: !3)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !7, line: 12, baseType: !51, size: 8, align: 8, offset: 576)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !7, line: 12, baseType: !51, size: 8, align: 8, offset: 584)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !57, line: 1, type: !24, isLocal: false, isDefinition: true)
!76 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !7, line: 6, type: !77, isLocal: false, isDefinition: true, scopeLine: 6, isOptimized: false, unit: !1, retainedNodes: !3)
!77 = !DISubroutineType(types: !78)
!78 = !{!79}
!79 = !DIBasicType(name: "void")
!80 = !DILocation(line: 1, column: 1, scope: !81)
!81 = !DILexicalBlockFile(scope: !76, file: !57, discriminator: 0)
!82 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !7, line: 18, type: !77, isLocal: false, isDefinition: true, scopeLine: 18, isOptimized: false, unit: !1, retainedNodes: !3)
!83 = !DILocation(line: 19, column: 6, scope: !84)
!84 = distinct !DILexicalBlock(scope: !82, file: !7, line: 18, column: 1)
!85 = !DILocation(line: 44, column: 1, scope: !82)
!86 = !DILocalVariable(name: "path", scope: !84, file: !7, line: 21, type: !56)
!87 = !DILocation(line: 21, column: 2, scope: !82)
!88 = !DILocation(line: 26, column: 67, scope: !84)
!89 = !DILocation(line: 26, column: 21, scope: !84)
!90 = !DILocalVariable(name: "client", scope: !84, file: !7, line: 26, type: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "Client", file: !7, line: 10, size: 704, align: 8, elements: !93)
!93 = !{!94, !191, !197, !198, !199, !200, !214, !215}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "codec", file: !7, line: 10, baseType: !95, size: 128, align: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientCodec", file: !7, line: 10, size: 128, align: 8, elements: !96)
!96 = !{!97, !190}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 10, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*_type,*void})error,*func(*void,*Response)error,*func(*void,*Request,struct{*_type,*void})error}", file: !36, size: 320, align: 8, elements: !100)
!100 = !{!101, !148, !164, !171, !182}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !36, line: 10, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !57, line: 1, size: 576, align: 8, elements: !104)
!104 = !{!105, !106, !107, !108, !109, !110, !111, !120, !128, !129, !131, !147}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !57, line: 1, baseType: !32, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !57, line: 1, baseType: !32, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !57, line: 1, baseType: !24, size: 32, align: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !57, line: 1, baseType: !44, size: 8, align: 8, offset: 160)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !57, line: 1, baseType: !44, size: 8, align: 8, offset: 168)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !57, line: 1, baseType: !44, size: 8, align: 8, offset: 176)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !57, line: 1, baseType: !112, size: 64, align: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !57, line: 1, size: 64, align: 8, elements: !114)
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !57, line: 1, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!32, !119, !32}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !57, line: 1, baseType: !121, size: 64, align: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !57, line: 1, size: 64, align: 8, elements: !123)
!123 = !{!124}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !57, line: 1, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!51, !119, !119}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !57, line: 1, baseType: !43, size: 64, align: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !57, line: 1, baseType: !130, size: 64, align: 64, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !57, line: 1, baseType: !132, size: 64, align: 64, offset: 448)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !57, line: 1, size: 320, align: 8, elements: !134)
!134 = !{!135, !136, !137}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !57, line: 1, baseType: !130, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !57, line: 1, baseType: !130, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !57, line: 1, baseType: !138, size: 192, align: 64, offset: 128)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !36, size: 192, align: 8, elements: !139)
!139 = !{!140, !47, !48}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !36, line: 1, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !57, line: 1, size: 320, align: 8, elements: !143)
!143 = !{!135, !136, !144, !145, !146}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !57, line: 1, baseType: !119, size: 64, align: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !57, line: 1, baseType: !119, size: 64, align: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !57, line: 1, baseType: !119, size: 64, align: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !57, line: 1, baseType: !119, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !36, line: 10, baseType: !149, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!152, !119}
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !57, line: 1, size: 128, align: 8, elements: !153)
!153 = !{!154, !163}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !57, line: 1, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !36, size: 128, align: 8, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !36, line: 1, baseType: !102, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !36, line: 1, baseType: !160, size: 64, align: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!56, !119}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !57, line: 1, baseType: !119, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ReadResponseBody", file: !36, line: 10, baseType: !165, size: 64, align: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!152, !119, !168}
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !36, size: 128, align: 8, elements: !169)
!169 = !{!158, !170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !36, line: 1, baseType: !119, size: 64, align: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ReadResponseHeader", file: !36, line: 10, baseType: !172, size: 64, align: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!152, !119, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !7, line: 10, size: 384, align: 8, elements: !177)
!177 = !{!178, !179, !180, !181}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ServiceMethod", file: !7, line: 10, baseType: !56, size: 128, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Seq", file: !7, line: 10, baseType: !22, size: 64, align: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !7, line: 10, baseType: !56, size: 128, align: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !7, line: 10, baseType: !119, size: 64, align: 64, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "WriteRequest", file: !36, line: 10, baseType: !183, size: 64, align: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!152, !119, !186, !168}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !7, line: 10, size: 256, align: 8, elements: !188)
!188 = !{!178, !179, !189}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !7, line: 10, baseType: !119, size: 64, align: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !119, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "reqMutex", file: !7, line: 10, baseType: !192, size: 64, align: 32, offset: 128)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 9, size: 64, align: 8, elements: !193)
!193 = !{!194, !196}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 9, baseType: !195, size: 32, align: 32)
!195 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 9, baseType: !24, size: 32, align: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "request", file: !7, line: 10, baseType: !187, size: 256, align: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !7, line: 10, baseType: !192, size: 64, align: 32, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !7, line: 10, baseType: !22, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pending", file: !7, line: 10, baseType: !201, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !57, line: 1, size: 384, align: 8, elements: !203)
!203 = !{!204, !205, !206, !207, !209, !210, !211, !212, !213}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !57, line: 1, baseType: !27, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !57, line: 1, baseType: !44, size: 8, align: 8, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !57, line: 1, baseType: !44, size: 8, align: 8, offset: 72)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !57, line: 1, baseType: !208, size: 16, align: 16, offset: 80)
!208 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !57, line: 1, baseType: !24, size: 32, align: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !57, line: 1, baseType: !119, size: 64, align: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !57, line: 1, baseType: !119, size: 64, align: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !57, line: 1, baseType: !32, size: 64, align: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !57, line: 1, baseType: !119, size: 64, align: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "closing", file: !7, line: 10, baseType: !51, size: 8, align: 8, offset: 640)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", file: !7, line: 10, baseType: !51, size: 8, align: 8, offset: 648)
!216 = !DILocation(line: 26, column: 2, scope: !82)
!217 = !DILocalVariable(name: "err", scope: !84, file: !7, line: 26, type: !152)
!218 = !DILocation(line: 27, column: 9, scope: !84)
!219 = !DILocation(line: 30, column: 2, scope: !84)
!220 = !DILocation(line: 28, column: 42, scope: !84)
!221 = !DILocation(line: 28, column: 7, scope: !84)
!222 = !DILocation(line: 31, column: 7, scope: !84)
!223 = !DILocation(line: 32, column: 15, scope: !84)
!224 = !DILocation(line: 33, column: 9, scope: !84)
!225 = !DILocation(line: 36, column: 6, scope: !84)
!226 = !DILocation(line: 34, column: 41, scope: !84)
!227 = !DILocation(line: 34, column: 7, scope: !84)
!228 = !DILocation(line: 38, column: 14, scope: !84)
!229 = !DILocation(line: 39, column: 9, scope: !84)
!230 = !DILocation(line: 42, column: 6, scope: !84)
!231 = !DILocation(line: 40, column: 42, scope: !84)
!232 = !DILocation(line: 40, column: 7, scope: !84)
!233 = distinct !DISubprogram(name: "main.main..thunk0", scope: null, file: !7, line: 30, type: !234, isLocal: true, isDefinition: true, scopeLine: 30, isOptimized: false, unit: !1, retainedNodes: !3)
!234 = !DISubroutineType(types: !235)
!235 = !{!51, !236}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Client}", file: !36, size: 64, align: 8, elements: !238)
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !36, line: 30, baseType: !91, size: 64, align: 64)
!240 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !233, file: !7, line: 30, type: !236)
!241 = !DILocation(line: 30, column: 2, scope: !233)
!242 = !DILocalVariable(name: "$ret0", scope: !233, file: !7, line: 30, type: !51)
!243 = distinct !DISubprogram(name: "main.SayHi.main.plug", linkageName: "main.plug.SayHi", scope: null, file: !7, line: 50, type: !244, isLocal: false, isDefinition: true, scopeLine: 50, isOptimized: false, unit: !1, retainedNodes: !3)
!244 = !DISubroutineType(types: !245)
!245 = !{!246, !250, !250, !56}
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !36, size: 256, align: 8, elements: !247)
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "result", file: !36, line: 50, baseType: !56, size: 128, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !36, line: 50, baseType: !152, size: 128, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: ".main.plug", file: !7, line: 46, size: 64, align: 8, elements: !252)
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "client", file: !7, line: 47, baseType: !91, size: 64, align: 64)
!254 = !DILocalVariable(name: "pointer", arg: 1, scope: !243, file: !7, line: 50, type: !250)
!255 = !DILocation(line: 50, column: 1, scope: !243)
!256 = !DILocalVariable(name: "name", arg: 2, scope: !243, file: !7, line: 50, type: !56)
!257 = !DILocation(line: 50, column: 21, scope: !243)
!258 = !DILocalVariable(name: "p", scope: !243, file: !7, line: 50, type: !251)
!259 = !DILocation(line: 50, column: 35, scope: !243)
!260 = !DILocation(line: 51, column: 38, scope: !243)
!261 = !DILocation(line: 51, column: 44, scope: !243)
!262 = !DILocation(line: 51, column: 16, scope: !243)
!263 = !DILocalVariable(name: "err", scope: !243, file: !7, line: 50, type: !152)
!264 = !DILocation(line: 50, column: 50, scope: !243)
!265 = !DILocation(line: 52, column: 2, scope: !243)
!266 = !DILocalVariable(name: "result", scope: !243, file: !7, line: 50, type: !130)
!267 = distinct !DISubprogram(name: "main.SayBye.main.plug", linkageName: "main.plug.SayBye", scope: null, file: !7, line: 55, type: !244, isLocal: false, isDefinition: true, scopeLine: 55, isOptimized: false, unit: !1, retainedNodes: !3)
!268 = !DILocalVariable(name: "pointer", arg: 1, scope: !267, file: !7, line: 55, type: !250)
!269 = !DILocation(line: 55, column: 1, scope: !267)
!270 = !DILocalVariable(name: "name", arg: 2, scope: !267, file: !7, line: 55, type: !56)
!271 = !DILocation(line: 55, column: 22, scope: !267)
!272 = !DILocalVariable(name: "p", scope: !267, file: !7, line: 55, type: !251)
!273 = !DILocation(line: 55, column: 36, scope: !267)
!274 = !DILocation(line: 56, column: 40, scope: !267)
!275 = !DILocation(line: 56, column: 46, scope: !267)
!276 = !DILocation(line: 56, column: 16, scope: !267)
!277 = !DILocalVariable(name: "err", scope: !267, file: !7, line: 55, type: !152)
!278 = !DILocation(line: 55, column: 51, scope: !267)
!279 = !DILocation(line: 57, column: 2, scope: !267)
!280 = !DILocalVariable(name: "result", scope: !267, file: !7, line: 55, type: !130)
!281 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", scope: null, file: !57, line: 1, type: !117, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!282 = !DILocalVariable(name: "key", arg: 1, scope: !281, file: !57, line: 1, type: !119)
!283 = !DILocation(line: 1, column: 1, scope: !281)
!284 = !DILocalVariable(name: "seed", arg: 2, scope: !281, file: !57, line: 1, type: !32)
!285 = !DILocalVariable(name: "$ret15", scope: !281, file: !57, line: 1, type: !32)
!286 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", scope: null, file: !57, line: 1, type: !126, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!287 = !DILocalVariable(name: "key1", arg: 1, scope: !286, file: !57, line: 1, type: !119)
!288 = !DILocation(line: 1, column: 1, scope: !286)
!289 = !DILocalVariable(name: "key2", arg: 2, scope: !286, file: !57, line: 1, type: !119)
!290 = !DILocalVariable(name: "$ret16", scope: !286, file: !57, line: 1, type: !51)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "main"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "main"
	.ascii ";\n"
	.ascii "import "
	.ascii "pie"
	.ascii " "
	.ascii "github.com/natefinch/pie"
	.ascii " \""
	.ascii "github.com/natefinch/pie"
