; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22pie\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/natefinch/pie\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/natefinch/pie\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22rpc\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22net/rpc\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22net/rpc\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./master.go", directory: "/home/wangcong/go_path/src/github.com/natefinch/pie/examples/python-plugin")
!3 = !{}
!4 = !{!5, !9, !18}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "main.max", linkageName: "main.max", scope: !1, file: !7, line: 14, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "master.go", directory: ".")
!8 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "main.path", linkageName: "main.path", scope: !1, file: !7, line: 15, type: !11, isLocal: true, isDefinition: true)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !12, line: 1, size: 128, align: 8, elements: !13)
!12 = !DIFile(filename: "<built-in>", directory: "")
!13 = !{!14, !17}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !12, line: 1, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !12, line: 1, baseType: !8, size: 64, align: 64, offset: 64)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "os.Stderr", linkageName: "os.Stderr", scope: !1, file: !7, line: 8, type: !20, isLocal: false, isDefinition: true)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !7, line: 8, size: 64, align: 8, elements: !22)
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !7, line: 8, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !7, line: 8, size: 640, align: 8, elements: !26)
!26 = !{!27, !64, !65, !76, !77}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !7, line: 8, baseType: !28, size: 384, align: 64)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !7, line: 8, size: 384, align: 8, elements: !29)
!29 = !{!30, !38, !39, !44, !58, !59, !61, !62, !63}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !7, line: 8, baseType: !31, size: 128, align: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !7, line: 8, size: 128, align: 8, elements: !32)
!32 = !{!33, !35, !37}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 8, baseType: !34, size: 64, align: 64)
!34 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !7, line: 8, baseType: !36, size: 32, align: 32, offset: 64)
!36 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !7, line: 8, baseType: !36, size: 32, align: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !7, line: 8, baseType: !8, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !7, line: 8, baseType: !40, size: 64, align: 64, offset: 192)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !7, line: 8, size: 64, align: 8, elements: !41)
!41 = !{!42}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !7, line: 8, baseType: !43, size: 64, align: 64)
!43 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !7, line: 8, baseType: !45, size: 64, align: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !47, size: 192, align: 8, elements: !48)
!47 = !DIFile(filename: "", directory: "")
!48 = !{!49, !56, !57}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !7, line: 8, size: 128, align: 8, elements: !52)
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !7, line: 8, baseType: !15, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !7, line: 8, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !47, line: 1, baseType: !8, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !47, line: 1, baseType: !8, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !7, line: 8, baseType: !36, size: 32, align: 32, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !7, line: 8, baseType: !60, size: 8, align: 8, offset: 352)
!60 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !7, line: 8, baseType: !60, size: 8, align: 8, offset: 360)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !7, line: 8, baseType: !60, size: 8, align: 8, offset: 368)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !7, line: 8, baseType: !60, size: 8, align: 8, offset: 376)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 8, baseType: !11, size: 128, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !7, line: 8, baseType: !66, size: 64, align: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !7, line: 8, size: 256, align: 8, elements: !68)
!68 = !{!69, !73}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 8, baseType: !70, size: 192, align: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !47, size: 192, align: 8, elements: !71)
!71 = !{!72, !56, !57}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !15, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !7, line: 8, baseType: !74, size: 64, align: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !7, line: 8, align: 8, elements: !3)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !7, line: 8, baseType: !60, size: 8, align: 8, offset: 576)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !7, line: 8, baseType: !60, size: 8, align: 8, offset: 584)
!78 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !7, line: 1, type: !79, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!79 = !DISubroutineType(types: !80)
!80 = !{!81}
!81 = !DIBasicType(name: "void")
!82 = !DILocation(line: 1, column: 1, scope: !83)
!83 = !DILexicalBlockFile(scope: !78, file: !12, discriminator: 0)
!84 = !DILocation(line: 31, column: 1, scope: !85)
!85 = !DILexicalBlockFile(scope: !78, file: !7, discriminator: 0)
!86 = distinct !DISubprogram(name: "main.Add.main.plug", linkageName: "main.plug.Add", scope: null, file: !7, line: 72, type: !87, isLocal: false, isDefinition: true, scopeLine: 72, isOptimized: false, unit: !1, retainedNodes: !3)
!87 = !DISubroutineType(types: !88)
!88 = !{!89, !151, !151, !8, !8}
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !47, size: 192, align: 8, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "result", file: !47, line: 72, baseType: !8, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !47, line: 72, baseType: !93, size: 128, align: 64, offset: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !12, line: 1, size: 128, align: 8, elements: !94)
!94 = !{!95, !150}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !12, line: 1, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !47, size: 128, align: 8, elements: !98)
!98 = !{!99, !146}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !47, line: 1, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !12, line: 1, size: 576, align: 8, elements: !102)
!102 = !{!103, !104, !105, !106, !107, !108, !109, !118, !126, !127, !129, !145}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !12, line: 1, baseType: !43, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !12, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !12, line: 1, baseType: !36, size: 32, align: 32, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !12, line: 1, baseType: !16, size: 8, align: 8, offset: 160)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !12, line: 1, baseType: !16, size: 8, align: 8, offset: 168)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !12, line: 1, baseType: !16, size: 8, align: 8, offset: 176)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !12, line: 1, baseType: !110, size: 64, align: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !12, line: 1, size: 64, align: 8, elements: !112)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !12, line: 1, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!43, !117, !43}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !12, line: 1, baseType: !119, size: 64, align: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !12, line: 1, size: 64, align: 8, elements: !121)
!121 = !{!122}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !12, line: 1, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!60, !117, !117}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !12, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !12, line: 1, baseType: !128, size: 64, align: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !12, line: 1, baseType: !130, size: 64, align: 64, offset: 448)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !12, line: 1, size: 320, align: 8, elements: !132)
!132 = !{!133, !134, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !12, line: 1, baseType: !128, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !12, line: 1, baseType: !128, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !12, line: 1, baseType: !136, size: 192, align: 64, offset: 128)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !47, size: 192, align: 8, elements: !137)
!137 = !{!138, !56, !57}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !12, line: 1, size: 320, align: 8, elements: !141)
!141 = !{!133, !134, !142, !143, !144}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !12, line: 1, baseType: !117, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !12, line: 1, baseType: !117, size: 64, align: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !12, line: 1, baseType: !117, size: 64, align: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !12, line: 1, baseType: !117, size: 64, align: 64, offset: 512)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !47, line: 1, baseType: !147, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!11, !117}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !12, line: 1, baseType: !117, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: ".main.plug", file: !7, line: 17, size: 64, align: 8, elements: !153)
!153 = !{!154}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Client", file: !7, line: 18, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "Client", file: !7, line: 6, size: 704, align: 8, elements: !157)
!157 = !{!158, !197, !203, !204, !205, !206, !220, !221}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "codec", file: !7, line: 6, baseType: !159, size: 128, align: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientCodec", file: !7, line: 6, size: 128, align: 8, elements: !160)
!160 = !{!161, !196}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 6, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*_type,*void})error,*func(*void,*Response)error,*func(*void,*Request,struct{*_type,*void})error}", file: !47, size: 320, align: 8, elements: !164)
!164 = !{!165, !166, !170, !177, !188}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !47, line: 6, baseType: !100, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !47, line: 6, baseType: !167, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!93, !117}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ReadResponseBody", file: !47, line: 6, baseType: !171, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!93, !117, !174}
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !47, size: 128, align: 8, elements: !175)
!175 = !{!99, !176}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !47, line: 1, baseType: !117, size: 64, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ReadResponseHeader", file: !47, line: 6, baseType: !178, size: 64, align: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!93, !117, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !7, line: 6, size: 384, align: 8, elements: !183)
!183 = !{!184, !185, !186, !187}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ServiceMethod", file: !7, line: 6, baseType: !11, size: 128, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Seq", file: !7, line: 6, baseType: !34, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !7, line: 6, baseType: !11, size: 128, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !7, line: 6, baseType: !117, size: 64, align: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "WriteRequest", file: !47, line: 6, baseType: !189, size: 64, align: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!93, !117, !192, !174}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !7, line: 6, size: 256, align: 8, elements: !194)
!194 = !{!184, !185, !195}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !7, line: 6, baseType: !117, size: 64, align: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !117, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "reqMutex", file: !7, line: 6, baseType: !198, size: 64, align: 32, offset: 128)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 5, size: 64, align: 8, elements: !199)
!199 = !{!200, !202}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 5, baseType: !201, size: 32, align: 32)
!201 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 5, baseType: !36, size: 32, align: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "request", file: !7, line: 6, baseType: !193, size: 256, align: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !7, line: 6, baseType: !198, size: 64, align: 32, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !7, line: 6, baseType: !34, size: 64, align: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pending", file: !7, line: 6, baseType: !207, size: 64, align: 64, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !12, line: 1, size: 384, align: 8, elements: !209)
!209 = !{!210, !211, !212, !213, !215, !216, !217, !218, !219}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !12, line: 1, baseType: !8, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !12, line: 1, baseType: !16, size: 8, align: 8, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !12, line: 1, baseType: !16, size: 8, align: 8, offset: 72)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !12, line: 1, baseType: !214, size: 16, align: 16, offset: 80)
!214 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !12, line: 1, baseType: !36, size: 32, align: 32, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !12, line: 1, baseType: !117, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !12, line: 1, baseType: !117, size: 64, align: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !12, line: 1, baseType: !43, size: 64, align: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !12, line: 1, baseType: !117, size: 64, align: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "closing", file: !7, line: 6, baseType: !60, size: 8, align: 8, offset: 640)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", file: !7, line: 6, baseType: !60, size: 8, align: 8, offset: 648)
!222 = !DILocalVariable(name: "pointer", arg: 1, scope: !86, file: !7, line: 72, type: !151)
!223 = !DILocation(line: 72, column: 1, scope: !86)
!224 = !DILocalVariable(name: "num1", arg: 2, scope: !86, file: !7, line: 72, type: !8)
!225 = !DILocation(line: 72, column: 19, scope: !86)
!226 = !DILocalVariable(name: "num2", arg: 3, scope: !86, file: !7, line: 72, type: !8)
!227 = !DILocation(line: 72, column: 25, scope: !86)
!228 = !DILocalVariable(name: "p", scope: !86, file: !7, line: 72, type: !152)
!229 = !DILocation(line: 72, column: 36, scope: !86)
!230 = !DILocalVariable(name: "result", scope: !86, file: !7, line: 72, type: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!232 = !DILocation(line: 73, column: 29, scope: !86)
!233 = !DILocation(line: 73, column: 48, scope: !86)
!234 = !DILocation(line: 73, column: 16, scope: !86)
!235 = !DILocalVariable(name: "err", scope: !86, file: !7, line: 72, type: !93)
!236 = !DILocation(line: 72, column: 48, scope: !86)
!237 = !DILocation(line: 74, column: 9, scope: !86)
!238 = !DILocation(line: 74, column: 2, scope: !86)
!239 = distinct !DISubprogram(name: "main.main..init0", linkageName: "main.main..init0", scope: null, file: !7, line: 31, type: !79, isLocal: false, isDefinition: true, scopeLine: 31, isOptimized: false, unit: !1, retainedNodes: !3)
!240 = !DILocation(line: 32, column: 6, scope: !239)
!241 = distinct !DISubprogram(name: "main.main..thunk0", scope: null, file: !7, line: 51, type: !242, isLocal: true, isDefinition: true, scopeLine: 51, isOptimized: false, unit: !1, retainedNodes: !3)
!242 = !DISubroutineType(types: !243)
!243 = !{!81, !244}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time}", file: !47, size: 192, align: 8, elements: !246)
!246 = !{!247}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !47, line: 51, baseType: !248, size: 192, align: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 5, size: 192, align: 8, elements: !249)
!249 = !{!250, !251, !253}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 5, baseType: !34, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 5, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 5, baseType: !254, size: 64, align: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 5, size: 704, align: 8, elements: !256)
!256 = !{!257, !258, !267, !278, !279, !280}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 5, baseType: !11, size: 128, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 5, baseType: !259, size: 192, align: 64, offset: 128)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !47, size: 192, align: 8, elements: !260)
!260 = !{!261, !56, !57}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 5, size: 256, align: 8, elements: !264)
!264 = !{!257, !265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 5, baseType: !8, size: 64, align: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 5, baseType: !60, size: 8, align: 8, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 5, baseType: !268, size: 192, align: 64, offset: 320)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !47, size: 192, align: 8, elements: !269)
!269 = !{!270, !56, !57}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !47, line: 1, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 5, size: 128, align: 8, elements: !273)
!273 = !{!274, !275, !276, !277}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 5, baseType: !252, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 5, baseType: !16, size: 8, align: 8, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 5, baseType: !60, size: 8, align: 8, offset: 72)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 5, baseType: !60, size: 8, align: 8, offset: 80)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 5, baseType: !252, size: 64, align: 64, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 5, baseType: !252, size: 64, align: 64, offset: 576)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 5, baseType: !262, size: 64, align: 64, offset: 640)
!281 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !241, file: !7, line: 51, type: !244)
!282 = !DILocation(line: 51, column: 2, scope: !241)
!283 = !DILocalVariable(name: "name", arg: 2, scope: !284, file: !7, line: 35, type: !11)
!284 = distinct !DISubprogram(name: "main.timeTrack", scope: null, file: !7, line: 35, type: !285, isLocal: true, isDefinition: true, scopeLine: 35, isOptimized: false, unit: !1, retainedNodes: !3)
!285 = !DISubroutineType(types: !286)
!286 = !{!81, !248, !11}
!287 = !DILocation(line: 35, column: 33, scope: !284, inlinedAt: !288)
!288 = distinct !DILocation(line: 51, column: 2, scope: !241)
!289 = !DILocalVariable(name: "start", arg: 1, scope: !284, file: !7, line: 35, type: !248)
!290 = !DILocation(line: 35, column: 16, scope: !284, inlinedAt: !288)
!291 = !DILocation(line: 36, column: 18, scope: !292, inlinedAt: !288)
!292 = distinct !DILexicalBlock(scope: !284, file: !7, line: 35, column: 1)
!293 = !DILocalVariable(name: "elapsed", scope: !292, file: !7, line: 36, type: !294)
!294 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!295 = !DILocation(line: 36, column: 2, scope: !284, inlinedAt: !288)
!296 = !DILocation(line: 37, column: 6, scope: !292, inlinedAt: !288)
!297 = distinct !DISubprogram(name: "main.main..thunk1", scope: null, file: !7, line: 54, type: !298, isLocal: true, isDefinition: true, scopeLine: 54, isOptimized: false, unit: !1, retainedNodes: !3)
!298 = !DISubroutineType(types: !299)
!299 = !{!81, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,int,*__go_channel,*.main.plug}", file: !47, size: 256, align: 8, elements: !302)
!302 = !{!303, !304, !305, !308}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !47, line: 54, baseType: !8, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "a1", file: !47, line: 54, baseType: !8, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "a2", file: !47, line: 54, baseType: !306, size: 64, align: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !12, line: 1, align: 8, elements: !3)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "a3", file: !47, line: 54, baseType: !151, size: 64, align: 64, offset: 192)
!309 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !297, file: !7, line: 54, type: !300)
!310 = !DILocation(line: 54, column: 3, scope: !297)
!311 = !DILocation(line: 40, column: 13, scope: !312, inlinedAt: !315)
!312 = distinct !DISubprogram(name: "main.doCall", scope: null, file: !7, line: 40, type: !313, isLocal: true, isDefinition: true, scopeLine: 40, isOptimized: false, unit: !1, retainedNodes: !3)
!313 = !DISubroutineType(types: !314)
!314 = !{!81, !8, !8, !306, !151}
!315 = distinct !DILocation(line: 54, column: 3, scope: !297)
!316 = !DILocalVariable(name: "a", arg: 1, scope: !312, file: !7, line: 40, type: !8)
!317 = !DILocalVariable(name: "b", arg: 2, scope: !312, file: !7, line: 40, type: !8)
!318 = !DILocation(line: 40, column: 16, scope: !312, inlinedAt: !315)
!319 = !DILocalVariable(name: "c", arg: 3, scope: !312, file: !7, line: 40, type: !306)
!320 = !DILocation(line: 40, column: 23, scope: !312, inlinedAt: !315)
!321 = !DILocalVariable(name: "plugin", arg: 4, scope: !312, file: !7, line: 40, type: !151)
!322 = !DILocation(line: 40, column: 38, scope: !312, inlinedAt: !315)
!323 = !DILocation(line: 42, column: 20, scope: !324, inlinedAt: !315)
!324 = distinct !DILexicalBlock(scope: !312, file: !7, line: 40, column: 1)
!325 = !DILocalVariable(name: "res", scope: !324, file: !7, line: 42, type: !8)
!326 = !DILocation(line: 42, column: 2, scope: !312, inlinedAt: !315)
!327 = !DILocalVariable(name: "err", scope: !324, file: !7, line: 42, type: !93)
!328 = !DILocation(line: 43, column: 9, scope: !324, inlinedAt: !315)
!329 = !DILocation(line: 44, column: 31, scope: !324, inlinedAt: !315)
!330 = !DILocation(line: 44, column: 7, scope: !324, inlinedAt: !315)
!331 = !DILocation(line: 46, column: 13, scope: !324, inlinedAt: !315)
!332 = !DILocalVariable(name: "ret", scope: !324, file: !7, line: 46, type: !11)
!333 = !DILocation(line: 46, column: 2, scope: !312, inlinedAt: !315)
!334 = !DILocation(line: 47, column: 4, scope: !324, inlinedAt: !315)
!335 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !7, line: 58, type: !79, isLocal: false, isDefinition: true, scopeLine: 58, isOptimized: false, unit: !1, retainedNodes: !3)
!336 = !DILocation(line: 59, column: 8, scope: !337)
!337 = distinct !DILexicalBlock(scope: !335, file: !7, line: 58, column: 1)
!338 = !DILocation(line: 70, column: 1, scope: !335)
!339 = !DILocalVariable(name: "ic", scope: !337, file: !7, line: 59, type: !306)
!340 = !DILocation(line: 59, column: 2, scope: !335)
!341 = !DILocation(line: 21, column: 21, scope: !342, inlinedAt: !345)
!342 = distinct !DISubprogram(name: "main.createClient", scope: null, file: !7, line: 21, type: !343, isLocal: true, isDefinition: true, scopeLine: 21, isOptimized: false, unit: !1, retainedNodes: !3)
!343 = !DISubroutineType(types: !344)
!344 = !{!151}
!345 = distinct !DILocation(line: 60, column: 12, scope: !337)
!346 = !DILocalVariable(name: "$ret0", scope: !342, file: !7, line: 21, type: !151)
!347 = !DILocation(line: 22, column: 6, scope: !348, inlinedAt: !345)
!348 = distinct !DILexicalBlock(scope: !342, file: !7, line: 21, column: 1)
!349 = !DILocation(line: 23, column: 67, scope: !348, inlinedAt: !345)
!350 = !DILocation(line: 23, column: 21, scope: !348, inlinedAt: !345)
!351 = !DILocalVariable(name: "client", scope: !348, file: !7, line: 23, type: !155)
!352 = !DILocation(line: 23, column: 2, scope: !342, inlinedAt: !345)
!353 = !DILocalVariable(name: "err", scope: !348, file: !7, line: 23, type: !93)
!354 = !DILocation(line: 24, column: 9, scope: !348, inlinedAt: !345)
!355 = !DILocation(line: 27, column: 7, scope: !348, inlinedAt: !345)
!356 = !DILocation(line: 27, column: 8, scope: !348, inlinedAt: !345)
!357 = !DILocation(line: 25, column: 34, scope: !348, inlinedAt: !345)
!358 = !DILocation(line: 25, column: 7, scope: !348, inlinedAt: !345)
