; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22pie\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/natefinch/pie\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/natefinch/pie\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22rpc\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22net/rpc\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22net/rpc\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22runtime\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./main.go", directory: "/home/wangcong/go_path/src/github.com/natefinch/pie/examples/consumer/plugin_consumer")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !10, line: 4, type: !11, isLocal: false, isDefinition: true, scopeLine: 4, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DIFile(filename: "main.go", directory: ".")
!11 = !DISubroutineType(types: !12)
!12 = !{!13}
!13 = !DIBasicType(name: "void")
!14 = !DILocation(line: 1, column: 1, scope: !15)
!15 = !DILexicalBlockFile(scope: !9, file: !7, discriminator: 0)
!16 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !10, line: 13, type: !11, isLocal: false, isDefinition: true, scopeLine: 13, isOptimized: false, unit: !1, retainedNodes: !3)
!17 = !DILocation(line: 14, column: 6, scope: !18)
!18 = distinct !DILexicalBlock(scope: !16, file: !10, line: 13, column: 1)
!19 = !DILocation(line: 16, column: 16, scope: !18)
!20 = !DILocation(line: 16, column: 7, scope: !18)
!21 = !DILocalVariable(name: "p", scope: !18, file: !10, line: 16, type: !22)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: ".main.plug", file: !10, line: 29, size: 64, align: 8, elements: !23)
!23 = !{!24}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "client", file: !10, line: 30, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "Client", file: !10, line: 8, size: 704, align: 8, elements: !27)
!27 = !{!28, !138, !144, !145, !146, !147, !161, !162}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "codec", file: !10, line: 8, baseType: !29, size: 128, align: 64)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientCodec", file: !10, line: 8, size: 128, align: 8, elements: !30)
!30 = !{!31, !137}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 8, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*_type,*void})error,*func(*void,*Response)error,*func(*void,*Request,struct{*_type,*void})error}", file: !34, size: 320, align: 8, elements: !35)
!34 = !DIFile(filename: "", directory: "")
!35 = !{!36, !94, !110, !117, !129}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !34, line: 8, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !39)
!39 = !{!40, !42, !43, !44, !46, !47, !48, !57, !66, !68, !75, !93}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !41, size: 64, align: 64)
!41 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !41, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !45, size: 8, align: 8, offset: 160)
!45 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !45, size: 8, align: 8, offset: 168)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !45, size: 8, align: 8, offset: 176)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !49, size: 64, align: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !51)
!51 = !{!52}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!41, !56, !41}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !58, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !56, !56}
!65 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !67, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !69, size: 64, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !71)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !67, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !74, size: 64, align: 64, offset: 64)
!74 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !76, size: 64, align: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !78)
!78 = !{!79, !80, !81}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !69, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !69, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !82, size: 192, align: 64, offset: 128)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !34, size: 192, align: 8, elements: !83)
!83 = !{!84, !91, !92}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !34, line: 1, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !87)
!87 = !{!79, !80, !88, !89, !90}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !56, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !56, size: 64, align: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !56, size: 64, align: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !34, line: 1, baseType: !74, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !34, line: 1, baseType: !74, size: 64, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !56, size: 64, align: 64, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !34, line: 8, baseType: !95, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !56}
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !99)
!99 = !{!100, !109}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !34, size: 128, align: 8, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !34, line: 1, baseType: !37, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !34, line: 1, baseType: !106, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!70, !56}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ReadResponseBody", file: !34, line: 8, baseType: !111, size: 64, align: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!98, !56, !114}
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !34, size: 128, align: 8, elements: !115)
!115 = !{!104, !116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !34, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ReadResponseHeader", file: !34, line: 8, baseType: !118, size: 64, align: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!98, !56, !121}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !10, line: 8, size: 384, align: 8, elements: !123)
!123 = !{!124, !125, !127, !128}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ServiceMethod", file: !10, line: 8, baseType: !70, size: 128, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Seq", file: !10, line: 8, baseType: !126, size: 64, align: 64, offset: 128)
!126 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !10, line: 8, baseType: !70, size: 128, align: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !10, line: 8, baseType: !56, size: 64, align: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "WriteRequest", file: !34, line: 8, baseType: !130, size: 64, align: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!98, !56, !133, !114}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !10, line: 8, size: 256, align: 8, elements: !135)
!135 = !{!124, !125, !136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !10, line: 8, baseType: !56, size: 64, align: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "reqMutex", file: !10, line: 8, baseType: !139, size: 64, align: 32, offset: 128)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !10, line: 7, size: 64, align: 8, elements: !140)
!140 = !{!141, !143}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !10, line: 7, baseType: !142, size: 32, align: 32)
!142 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !10, line: 7, baseType: !8, size: 32, align: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "request", file: !10, line: 8, baseType: !134, size: 256, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !10, line: 8, baseType: !139, size: 64, align: 32, offset: 448)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !10, line: 8, baseType: !126, size: 64, align: 64, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pending", file: !10, line: 8, baseType: !148, size: 64, align: 64, offset: 576)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !150)
!150 = !{!151, !152, !153, !154, !156, !157, !158, !159, !160}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !74, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !45, size: 8, align: 8, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !45, size: 8, align: 8, offset: 72)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !155, size: 16, align: 16, offset: 80)
!155 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !56, size: 64, align: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !56, size: 64, align: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !41, size: 64, align: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !56, size: 64, align: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "closing", file: !10, line: 8, baseType: !65, size: 8, align: 8, offset: 640)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", file: !10, line: 8, baseType: !65, size: 8, align: 8, offset: 648)
!163 = !DILocation(line: 16, column: 2, scope: !16)
!164 = !DILocation(line: 17, column: 13, scope: !18)
!165 = !DILocalVariable(name: "err", scope: !18, file: !10, line: 17, type: !98)
!166 = !DILocation(line: 17, column: 2, scope: !16)
!167 = !DILocation(line: 18, column: 9, scope: !18)
!168 = !DILocation(line: 21, column: 6, scope: !18)
!169 = !DILocation(line: 22, column: 12, scope: !18)
!170 = !DILocation(line: 23, column: 9, scope: !18)
!171 = !DILocation(line: 19, column: 38, scope: !18)
!172 = !DILocation(line: 19, column: 7, scope: !18)
!173 = !DILocation(line: 26, column: 6, scope: !18)
!174 = !DILocation(line: 24, column: 39, scope: !18)
!175 = !DILocation(line: 24, column: 7, scope: !18)
!176 = distinct !DISubprogram(name: "main.SayHi.main.plug", linkageName: "main.plug.SayHi", scope: null, file: !10, line: 33, type: !177, isLocal: false, isDefinition: true, scopeLine: 33, isOptimized: false, unit: !1, retainedNodes: !3)
!177 = !DISubroutineType(types: !178)
!178 = !{!179, !183, !183, !70}
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !34, size: 256, align: 8, elements: !180)
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "result", file: !34, line: 33, baseType: !70, size: 128, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !34, line: 33, baseType: !98, size: 128, align: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!184 = !DILocalVariable(name: "pointer", arg: 1, scope: !176, file: !10, line: 33, type: !183)
!185 = !DILocation(line: 33, column: 1, scope: !176)
!186 = !DILocalVariable(name: "name", arg: 2, scope: !176, file: !10, line: 33, type: !70)
!187 = !DILocation(line: 33, column: 21, scope: !176)
!188 = !DILocalVariable(name: "p", scope: !176, file: !10, line: 33, type: !22)
!189 = !DILocation(line: 33, column: 35, scope: !176)
!190 = !DILocation(line: 34, column: 36, scope: !176)
!191 = !DILocation(line: 34, column: 42, scope: !176)
!192 = !DILocation(line: 34, column: 16, scope: !176)
!193 = !DILocalVariable(name: "err", scope: !176, file: !10, line: 33, type: !98)
!194 = !DILocation(line: 33, column: 50, scope: !176)
!195 = !DILocation(line: 35, column: 2, scope: !176)
!196 = !DILocalVariable(name: "result", scope: !176, file: !10, line: 33, type: !69)
!197 = distinct !DISubprogram(name: "main.SayBye.main.plug", linkageName: "main.plug.SayBye", scope: null, file: !10, line: 38, type: !177, isLocal: false, isDefinition: true, scopeLine: 38, isOptimized: false, unit: !1, retainedNodes: !3)
!198 = !DILocalVariable(name: "pointer", arg: 1, scope: !197, file: !10, line: 38, type: !183)
!199 = !DILocation(line: 38, column: 1, scope: !197)
!200 = !DILocalVariable(name: "name", arg: 2, scope: !197, file: !10, line: 38, type: !70)
!201 = !DILocation(line: 38, column: 22, scope: !197)
!202 = !DILocalVariable(name: "p", scope: !197, file: !10, line: 38, type: !22)
!203 = !DILocation(line: 38, column: 36, scope: !197)
!204 = !DILocation(line: 39, column: 38, scope: !197)
!205 = !DILocation(line: 39, column: 44, scope: !197)
!206 = !DILocation(line: 39, column: 16, scope: !197)
!207 = !DILocalVariable(name: "err", scope: !197, file: !10, line: 38, type: !98)
!208 = !DILocation(line: 38, column: 51, scope: !197)
!209 = !DILocation(line: 40, column: 2, scope: !197)
!210 = !DILocalVariable(name: "result", scope: !197, file: !10, line: 38, type: !69)
!211 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", scope: null, file: !7, line: 1, type: !54, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!212 = !DILocalVariable(name: "key", arg: 1, scope: !211, file: !7, line: 1, type: !56)
!213 = !DILocation(line: 1, column: 1, scope: !211)
!214 = !DILocalVariable(name: "seed", arg: 2, scope: !211, file: !7, line: 1, type: !41)
!215 = !DILocalVariable(name: "$ret6", scope: !211, file: !7, line: 1, type: !41)
!216 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", scope: null, file: !7, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!217 = !DILocalVariable(name: "key1", arg: 1, scope: !216, file: !7, line: 1, type: !56)
!218 = !DILocation(line: 1, column: 1, scope: !216)
!219 = !DILocalVariable(name: "key2", arg: 2, scope: !216, file: !7, line: 1, type: !56)
!220 = !DILocalVariable(name: "$ret7", scope: !216, file: !7, line: 1, type: !65)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "main"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "main"
	.ascii ";\n"
	.ascii "import "
	.ascii "pie"
	.ascii " "
	.ascii "github.com/natefinch/pie"
	.ascii " \""
	.ascii "github.com/natefinch/pie"
	.ascii "\";\n"
	.ascii "import "
	.ascii "log"
	.ascii " "
	.ascii "log"
	.ascii " \""
	.ascii "log"
	.ascii "\";\n"
	.ascii "import "
	.ascii "rpc"
	.ascii " "
	.ascii "net/rpc"
	.ascii " \""
	.ascii "net/rpc"
	.ascii "\";\n"
	.ascii "import "
	.ascii "runtime"
	.ascii " "
