; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22pie\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22io\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22io\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22io\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22rpc\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22net/rpc\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22net/rpc\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./doc.go", directory: "/home/wangcong/go_path/src/github.com/natefinch/pie")
!3 = !{}
!4 = !{!5, !81, !83, !137, !139, !282, !285}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.errProcStopTimeout", linkageName: "command_line_arguments.errProcStopTimeout", scope: !1, file: !7, line: 13, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "pie.go", directory: ".")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !9, line: 1, size: 128, align: 8, elements: !10)
!9 = !DIFile(filename: "<built-in>", directory: "")
!10 = !{!11, !80}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !9, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !14, size: 128, align: 8, elements: !15)
!14 = !DIFile(filename: "", directory: "")
!15 = !{!16, !76}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 1, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !9, line: 1, size: 576, align: 8, elements: !19)
!19 = !{!20, !22, !23, !25, !27, !28, !29, !39, !48, !50, !57, !75}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !9, line: 1, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !9, line: 1, baseType: !21, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !9, line: 1, baseType: !24, size: 32, align: 32, offset: 128)
!24 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !9, line: 1, baseType: !26, size: 8, align: 8, offset: 160)
!26 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !9, line: 1, baseType: !26, size: 8, align: 8, offset: 168)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !9, line: 1, baseType: !26, size: 8, align: 8, offset: 176)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !9, line: 1, baseType: !30, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !9, line: 1, size: 64, align: 8, elements: !32)
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !9, line: 1, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{!21, !37, !21}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIBasicType(name: "void")
!39 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !9, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !9, line: 1, size: 64, align: 8, elements: !42)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !9, line: 1, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !37, !37}
!47 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !9, line: 1, baseType: !49, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !9, line: 1, baseType: !51, size: 64, align: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !9, line: 1, size: 128, align: 8, elements: !53)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !9, line: 1, baseType: !49, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !9, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !9, line: 1, baseType: !58, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !9, line: 1, size: 320, align: 8, elements: !60)
!60 = !{!61, !62, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !9, line: 1, baseType: !51, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !9, line: 1, baseType: !51, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !9, line: 1, baseType: !64, size: 192, align: 64, offset: 128)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !14, size: 192, align: 8, elements: !65)
!65 = !{!66, !73, !74}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !9, line: 1, size: 320, align: 8, elements: !69)
!69 = !{!61, !62, !70, !71, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !14, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !14, line: 1, baseType: !56, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !14, line: 1, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!52, !37}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !9, line: 1, type: !24, isLocal: false, isDefinition: true)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "os.Stdin", linkageName: "os.Stdin", scope: !1, file: !7, line: 8, type: !85, isLocal: false, isDefinition: true)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !7, line: 8, size: 64, align: 8, elements: !87)
!87 = !{!88}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !7, line: 8, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !7, line: 8, size: 640, align: 8, elements: !91)
!91 = !{!92, !123, !124, !135, !136}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !7, line: 8, baseType: !93, size: 384, align: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !7, line: 8, size: 384, align: 8, elements: !94)
!94 = !{!95, !102, !103, !107, !118, !119, !120, !121, !122}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !7, line: 8, baseType: !96, size: 128, align: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !7, line: 8, size: 128, align: 8, elements: !97)
!97 = !{!98, !100, !101}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 8, baseType: !99, size: 64, align: 64)
!99 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !7, line: 8, baseType: !24, size: 32, align: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !7, line: 8, baseType: !24, size: 32, align: 32, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !7, line: 8, baseType: !56, size: 64, align: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !7, line: 8, baseType: !104, size: 64, align: 64, offset: 192)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !7, line: 8, size: 64, align: 8, elements: !105)
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !7, line: 8, baseType: !21, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !7, line: 8, baseType: !108, size: 64, align: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !14, size: 192, align: 8, elements: !110)
!110 = !{!111, !73, !74}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !7, line: 8, size: 128, align: 8, elements: !114)
!114 = !{!115, !116}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !7, line: 8, baseType: !49, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !7, line: 8, baseType: !117, size: 64, align: 64, offset: 64)
!117 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !7, line: 8, baseType: !24, size: 32, align: 32, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !7, line: 8, baseType: !47, size: 8, align: 8, offset: 352)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !7, line: 8, baseType: !47, size: 8, align: 8, offset: 360)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !7, line: 8, baseType: !47, size: 8, align: 8, offset: 368)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !7, line: 8, baseType: !47, size: 8, align: 8, offset: 376)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 8, baseType: !52, size: 128, align: 64, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !7, line: 8, baseType: !125, size: 64, align: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !7, line: 8, size: 256, align: 8, elements: !127)
!127 = !{!128, !132}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 8, baseType: !129, size: 192, align: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !14, size: 192, align: 8, elements: !130)
!130 = !{!131, !73, !74}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !49, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !7, line: 8, baseType: !133, size: 64, align: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !7, line: 8, align: 8, elements: !3)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !7, line: 8, baseType: !47, size: 8, align: 8, offset: 576)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !7, line: 8, baseType: !47, size: 8, align: 8, offset: 584)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "os.Stdout", linkageName: "os.Stdout", scope: !1, file: !7, line: 8, type: !85, isLocal: false, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "command_line_arguments.makeCommand", linkageName: "command_line_arguments.makeCommand", scope: !1, file: !7, line: 168, type: !141, isLocal: true, isDefinition: true)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 168, size: 64, align: 8, elements: !143)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 168, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!148, !271, !52, !279}
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.commander", file: !7, line: 187, size: 128, align: 8, elements: !149)
!149 = !{!150, !189}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 187, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{.command-line-arguments.osProcess,error},*func(*void)struct{WriteCloser,error},*func(*void)struct{ReadCloser,error}}", file: !14, size: 256, align: 8, elements: !153)
!153 = !{!154, !155, !232, !256}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 187, baseType: !17, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Start", file: !14, line: 187, baseType: !156, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!159, !37}
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.command-line-arguments.osProcess,error}", file: !14, size: 256, align: 8, elements: !160)
!160 = !{!161, !231}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 192, baseType: !162, size: 128, align: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.osProcess", file: !7, line: 197, size: 128, align: 8, elements: !163)
!163 = !{!164, !189}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 197, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,Signal)error,*func(*void)struct{*ProcessState,error}}", file: !14, size: 256, align: 8, elements: !167)
!167 = !{!168, !169, !173, !190}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 197, baseType: !17, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Kill", file: !14, line: 197, baseType: !170, size: 64, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!8, !37}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Signal", file: !14, line: 197, baseType: !174, size: 64, align: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!8, !37, !177}
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "Signal", file: !7, line: 8, size: 128, align: 8, elements: !178)
!178 = !{!179, !189}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 8, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)string}", file: !14, size: 192, align: 8, elements: !182)
!182 = !{!183, !184, !188}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 8, baseType: !17, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Signal", file: !14, line: 8, baseType: !185, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!38, !37}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !14, line: 8, baseType: !77, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Wait", file: !14, line: 197, baseType: !191, size: 64, align: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!194, !37}
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ProcessState,error}", file: !14, size: 192, align: 8, elements: !195)
!195 = !{!196, !230}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 198, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProcessState", file: !7, line: 8, size: 192, align: 8, elements: !199)
!199 = !{!200, !201, !203}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pid", file: !7, line: 8, baseType: !56, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !7, line: 8, baseType: !202, size: 32, align: 32, offset: 64)
!202 = !DIBasicType(name: "WaitStatus", size: 32, encoding: DW_ATE_unsigned)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "rusage", file: !7, line: 8, baseType: !204, size: 64, align: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rusage", file: !7, line: 8, size: 1152, align: 8, elements: !206)
!206 = !{!207, !214, !215, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Utime", file: !7, line: 8, baseType: !208, size: 128, align: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timeval", file: !7, line: 8, size: 128, align: 8, elements: !209)
!209 = !{!210, !212}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Sec", file: !7, line: 8, baseType: !211, size: 64, align: 64)
!211 = !DIBasicType(name: "Timeval_sec_t", size: 64, encoding: DW_ATE_signed)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Usec", file: !7, line: 8, baseType: !213, size: 64, align: 64, offset: 64)
!213 = !DIBasicType(name: "Timeval_usec_t", size: 64, encoding: DW_ATE_signed)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Stime", file: !7, line: 8, baseType: !208, size: 128, align: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Maxrss", file: !7, line: 8, baseType: !216, size: 64, align: 64, offset: 256)
!216 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Ixrss", file: !7, line: 8, baseType: !216, size: 64, align: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Idrss", file: !7, line: 8, baseType: !216, size: 64, align: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Isrss", file: !7, line: 8, baseType: !216, size: 64, align: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Minflt", file: !7, line: 8, baseType: !216, size: 64, align: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Majflt", file: !7, line: 8, baseType: !216, size: 64, align: 64, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Nswap", file: !7, line: 8, baseType: !216, size: 64, align: 64, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Inblock", file: !7, line: 8, baseType: !216, size: 64, align: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Oublock", file: !7, line: 8, baseType: !216, size: 64, align: 64, offset: 768)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Msgsnd", file: !7, line: 8, baseType: !216, size: 64, align: 64, offset: 832)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Msgrcv", file: !7, line: 8, baseType: !216, size: 64, align: 64, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Nsignals", file: !7, line: 8, baseType: !216, size: 64, align: 64, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Nvcsw", file: !7, line: 8, baseType: !216, size: 64, align: 64, offset: 1024)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Nivcsw", file: !7, line: 8, baseType: !216, size: 64, align: 64, offset: 1088)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 198, baseType: !8, size: 128, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 192, baseType: !8, size: 128, align: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "StdinPipe", file: !14, line: 187, baseType: !233, size: 64, align: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!236, !37}
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{WriteCloser,error}", file: !14, size: 256, align: 8, elements: !237)
!237 = !{!238, !255}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 188, baseType: !239, size: 128, align: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "WriteCloser", file: !7, line: 6, size: 128, align: 8, elements: !240)
!240 = !{!241, !189}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 6, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !14, size: 192, align: 8, elements: !244)
!244 = !{!245, !246, !247}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 6, baseType: !17, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !14, line: 6, baseType: !170, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !14, line: 6, baseType: !248, size: 64, align: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!251, !37, !129}
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !14, size: 192, align: 8, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !14, line: 5, baseType: !56, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !14, line: 5, baseType: !8, size: 128, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 188, baseType: !8, size: 128, align: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "StdoutPipe", file: !14, line: 187, baseType: !257, size: 64, align: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!260, !37}
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !14, size: 256, align: 8, elements: !261)
!261 = !{!262, !270}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 7, baseType: !263, size: 128, align: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !7, line: 6, size: 128, align: 8, elements: !264)
!264 = !{!265, !189}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 6, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !14, size: 192, align: 8, elements: !268)
!268 = !{!245, !246, !269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !14, line: 6, baseType: !248, size: 64, align: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 7, baseType: !8, size: 128, align: 64, offset: 128)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !7, line: 5, size: 128, align: 8, elements: !272)
!272 = !{!273, !189}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 5, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !14, size: 128, align: 8, elements: !276)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 5, baseType: !17, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !14, line: 5, baseType: !248, size: 64, align: 64, offset: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !14, size: 192, align: 8, elements: !280)
!280 = !{!281, !73, !74}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !51, size: 64, align: 64)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "command_line_arguments.procTimeout", linkageName: "command_line_arguments.procTimeout", scope: !1, file: !7, line: 225, type: !284, isLocal: true, isDefinition: true)
!284 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "os.Interrupt", linkageName: "os.Interrupt", scope: !1, file: !7, line: 8, type: !177, isLocal: false, isDefinition: true)
!287 = distinct !DISubprogram(name: "pie.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !288, line: 37, type: !289, isLocal: false, isDefinition: true, scopeLine: 37, isOptimized: false, unit: !1, retainedNodes: !3)
!288 = !DIFile(filename: "doc.go", directory: ".")
!289 = !DISubroutineType(types: !290)
!290 = !{!38}
!291 = !DILocation(line: 1, column: 1, scope: !292)
!292 = !DILexicalBlockFile(scope: !287, file: !9, discriminator: 0)
!293 = !DILocation(line: 13, column: 33, scope: !294)
!294 = !DILexicalBlockFile(scope: !287, file: !7, discriminator: 0)
!295 = !DILocation(line: 13, column: 5, scope: !294)
!296 = !DILocation(line: 168, column: 5, scope: !294)
!297 = distinct !DISubprogram(name: "pie.NewProvider", linkageName: "command_line_arguments.NewProvider", scope: null, file: !7, line: 18, type: !298, isLocal: false, isDefinition: true, scopeLine: 18, isOptimized: false, unit: !1, retainedNodes: !3)
!298 = !DISubroutineType(types: !299)
!299 = !{!300}
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "Server", file: !7, line: 27, size: 320, align: 8, elements: !301)
!301 = !{!302, !352, !360}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "server", file: !7, line: 28, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "Server", file: !7, line: 7, size: 576, align: 8, elements: !305)
!305 = !{!306, !337, !338, !345, !346}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "serviceMap", file: !7, line: 7, baseType: !307, size: 320, align: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map", file: !7, line: 7, size: 320, align: 8, elements: !308)
!308 = !{!309, !315, !322, !336}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !7, line: 7, baseType: !310, size: 64, align: 32)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 6, size: 64, align: 8, elements: !311)
!311 = !{!312, !314}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 6, baseType: !313, size: 32, align: 32)
!313 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 6, baseType: !24, size: 32, align: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "read", file: !7, line: 7, baseType: !316, size: 128, align: 64, offset: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !7, line: 6, size: 128, align: 8, elements: !317)
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "v", file: !7, line: 6, baseType: !319, size: 128, align: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !14, size: 128, align: 8, elements: !320)
!320 = !{!16, !321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !14, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", file: !7, line: 7, baseType: !323, size: 64, align: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !9, line: 1, size: 384, align: 8, elements: !325)
!325 = !{!326, !327, !328, !329, !331, !332, !333, !334, !335}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !9, line: 1, baseType: !56, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !9, line: 1, baseType: !26, size: 8, align: 8, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !9, line: 1, baseType: !26, size: 8, align: 8, offset: 72)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !9, line: 1, baseType: !330, size: 16, align: 16, offset: 80)
!330 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !9, line: 1, baseType: !24, size: 32, align: 32, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !9, line: 1, baseType: !21, size: 64, align: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 320)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "misses", file: !7, line: 7, baseType: !56, size: 64, align: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "reqLock", file: !7, line: 7, baseType: !310, size: 64, align: 32, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "freeReq", file: !7, line: 7, baseType: !339, size: 64, align: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !7, line: 7, size: 256, align: 8, elements: !341)
!341 = !{!342, !343, !344}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ServiceMethod", file: !7, line: 7, baseType: !52, size: 128, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Seq", file: !7, line: 7, baseType: !99, size: 64, align: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !7, line: 7, baseType: !37, size: 64, align: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "respLock", file: !7, line: 7, baseType: !310, size: 64, align: 32, offset: 448)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "freeResp", file: !7, line: 7, baseType: !347, size: 64, align: 64, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !7, line: 7, size: 384, align: 8, elements: !349)
!349 = !{!342, !343, !350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !7, line: 7, baseType: !52, size: 128, align: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !7, line: 7, baseType: !37, size: 64, align: 64, offset: 320)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "rwc", file: !7, line: 29, baseType: !353, size: 128, align: 64, offset: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteCloser", file: !7, line: 6, size: 128, align: 8, elements: !354)
!354 = !{!355, !189}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 6, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !14, size: 256, align: 8, elements: !358)
!358 = !{!245, !246, !269, !359}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !14, line: 6, baseType: !248, size: 64, align: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "codec", file: !7, line: 30, baseType: !361, size: 128, align: 64, offset: 192)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "ServerCodec", file: !7, line: 7, size: 128, align: 8, elements: !362)
!362 = !{!363, !189}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 7, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*_type,*void})error,*func(*void,*Request)error,*func(*void,*Response,struct{*_type,*void})error}", file: !14, size: 320, align: 8, elements: !366)
!366 = !{!367, !368, !369, !373, !377}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 7, baseType: !17, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !14, line: 7, baseType: !170, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ReadRequestBody", file: !14, line: 7, baseType: !370, size: 64, align: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!8, !37, !319}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ReadRequestHeader", file: !14, line: 7, baseType: !374, size: 64, align: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!8, !37, !339}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "WriteResponse", file: !14, line: 7, baseType: !378, size: 64, align: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!8, !37, !347, !319}
!381 = !DILocation(line: 20, column: 15, scope: !297)
!382 = !DILocation(line: 21, column: 23, scope: !297)
!383 = !DILocation(line: 21, column: 33, scope: !297)
!384 = !DILocation(line: 19, column: 9, scope: !297)
!385 = !DILocalVariable(name: "$ret0", scope: !297, file: !7, line: 18, type: !300)
!386 = !DILocation(line: 18, column: 20, scope: !297)
!387 = !DILocation(line: 19, column: 2, scope: !297)
!388 = distinct !DISubprogram(name: "pie.command_line_arguments.rwCloser..hash", linkageName: "command_line_arguments.command_line_arguments.rwCloser..hash", scope: null, file: !9, line: 1, type: !35, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!389 = !DILocalVariable(name: "key", arg: 1, scope: !388, file: !9, line: 1, type: !37)
!390 = !DILocation(line: 1, column: 1, scope: !388)
!391 = !DILocalVariable(name: "seed", arg: 2, scope: !388, file: !9, line: 1, type: !21)
!392 = !DILocalVariable(name: "$ret51", scope: !388, file: !9, line: 1, type: !21)
!393 = distinct !DISubprogram(name: "pie.command_line_arguments.rwCloser..eq", linkageName: "command_line_arguments.command_line_arguments.rwCloser..eq", scope: null, file: !9, line: 1, type: !45, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!394 = !DILocalVariable(name: "key1", arg: 1, scope: !393, file: !9, line: 1, type: !37)
!395 = !DILocation(line: 1, column: 1, scope: !393)
!396 = !DILocalVariable(name: "key2", arg: 2, scope: !393, file: !9, line: 1, type: !37)
!397 = !DILocalVariable(name: "$ret52", scope: !393, file: !9, line: 1, type: !47)
!398 = distinct !DISubprogram(name: "pie.Close.command_line_arguments.rwCloser", linkageName: "command_line_arguments.rwCloser.Close", scope: null, file: !7, line: 254, type: !399, isLocal: false, isDefinition: true, scopeLine: 254, isOptimized: false, unit: !1, retainedNodes: !3)
!399 = !DISubroutineType(types: !400)
!400 = !{!8, !401, !401}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.rwCloser", file: !7, line: 247, size: 256, align: 8, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ReadCloser", file: !7, line: 248, baseType: !263, size: 128, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "WriteCloser", file: !7, line: 249, baseType: !239, size: 128, align: 64, offset: 128)
!406 = !DILocalVariable(name: "pointer", arg: 1, scope: !398, file: !7, line: 254, type: !401)
!407 = !DILocation(line: 254, column: 1, scope: !398)
!408 = !DILocalVariable(name: "rw", scope: !398, file: !7, line: 254, type: !402)
!409 = !DILocation(line: 255, column: 22, scope: !410)
!410 = distinct !DILexicalBlock(scope: !398, file: !7, line: 254, column: 1)
!411 = !DILocation(line: 256, column: 26, scope: !412)
!412 = distinct !DILexicalBlock(scope: !410, file: !7, line: 256, column: 2)
!413 = !DILocalVariable(name: "err", scope: !412, file: !7, line: 256, type: !8)
!414 = !DILocation(line: 256, column: 5, scope: !410)
!415 = !DILocation(line: 256, column: 40, scope: !412)
!416 = !DILocalVariable(name: "$ret18", scope: !398, file: !7, line: 254, type: !8)
!417 = !DILocation(line: 254, column: 28, scope: !398)
!418 = !DILocation(line: 257, column: 3, scope: !412)
!419 = distinct !DISubprogram(name: "pie.Read..stub.command_line_arguments.rwCloser", linkageName: "command_line_arguments.rwCloser.Read..stub", scope: null, file: !7, line: 5, type: !420, isLocal: false, isDefinition: true, scopeLine: 5, isOptimized: false, unit: !1, retainedNodes: !3)
!420 = !DISubroutineType(types: !421)
!421 = !{!422, !401, !401, !129}
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !14, size: 192, align: 8, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 5, baseType: !56, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 5, baseType: !8, size: 128, align: 64, offset: 64)
!426 = !DILocalVariable(name: "$p12", arg: 2, scope: !419, file: !7, line: 5, type: !129)
!427 = !DILocation(line: 5, column: 5, scope: !419)
!428 = !DILocalVariable(name: "$this11.pointer", arg: 1, scope: !419, file: !7, line: 5, type: !401)
!429 = !DILocalVariable(name: "$this11", scope: !419, file: !7, line: 5, type: !401)
!430 = !DILocalVariable(name: "$ret21", scope: !419, file: !7, line: 5, type: !56)
!431 = !DILocation(line: 247, column: 6, scope: !419)
!432 = distinct !DISubprogram(name: "pie.Write..stub.command_line_arguments.rwCloser", linkageName: "command_line_arguments.rwCloser.Write..stub", scope: null, file: !7, line: 5, type: !420, isLocal: false, isDefinition: true, scopeLine: 5, isOptimized: false, unit: !1, retainedNodes: !3)
!433 = !DILocalVariable(name: "$p10", arg: 2, scope: !432, file: !7, line: 5, type: !129)
!434 = !DILocation(line: 5, column: 5, scope: !432)
!435 = !DILocalVariable(name: "$this9.pointer", arg: 1, scope: !432, file: !7, line: 5, type: !401)
!436 = !DILocalVariable(name: "$this9", scope: !432, file: !7, line: 5, type: !401)
!437 = !DILocalVariable(name: "$ret19", scope: !432, file: !7, line: 5, type: !56)
!438 = !DILocation(line: 247, column: 6, scope: !432)
!439 = distinct !DISubprogram(name: "pie.command_line_arguments.Server..hash", linkageName: "command_line_arguments.command_line_arguments.Server..hash", scope: null, file: !9, line: 1, type: !35, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!440 = !DILocalVariable(name: "key", arg: 1, scope: !439, file: !9, line: 1, type: !37)
!441 = !DILocation(line: 1, column: 1, scope: !439)
!442 = !DILocalVariable(name: "seed", arg: 2, scope: !439, file: !9, line: 1, type: !21)
!443 = !DILocalVariable(name: "$ret49", scope: !439, file: !9, line: 1, type: !21)
!444 = distinct !DISubprogram(name: "pie.command_line_arguments.Server..eq", linkageName: "command_line_arguments.command_line_arguments.Server..eq", scope: null, file: !9, line: 1, type: !45, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!445 = !DILocalVariable(name: "key1", arg: 1, scope: !444, file: !9, line: 1, type: !37)
!446 = !DILocation(line: 1, column: 1, scope: !444)
!447 = !DILocalVariable(name: "key2", arg: 2, scope: !444, file: !9, line: 1, type: !37)
!448 = !DILocalVariable(name: "$ret50", scope: !444, file: !9, line: 1, type: !47)
!449 = distinct !DISubprogram(name: "pie.Close.command_line_arguments.Server", linkageName: "command_line_arguments.Server.Close", scope: null, file: !7, line: 36, type: !450, isLocal: false, isDefinition: true, scopeLine: 36, isOptimized: false, unit: !1, retainedNodes: !3)
!450 = !DISubroutineType(types: !451)
!451 = !{!8, !452, !452}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!453 = !DILocalVariable(name: "pointer", arg: 1, scope: !449, file: !7, line: 36, type: !452)
!454 = !DILocation(line: 36, column: 1, scope: !449)
!455 = !DILocalVariable(name: "s", scope: !449, file: !7, line: 36, type: !300)
!456 = !DILocation(line: 37, column: 13, scope: !449)
!457 = !DILocation(line: 38, column: 17, scope: !449)
!458 = !DILocation(line: 38, column: 3, scope: !449)
!459 = !DILocation(line: 40, column: 14, scope: !449)
!460 = !DILocation(line: 40, column: 2, scope: !449)
!461 = distinct !DISubprogram(name: "pie.Register.command_line_arguments.Server", linkageName: "command_line_arguments.Server.Register", scope: null, file: !7, line: 67, type: !462, isLocal: false, isDefinition: true, scopeLine: 67, isOptimized: false, unit: !1, retainedNodes: !3)
!462 = !DISubroutineType(types: !463)
!463 = !{!8, !452, !452, !319}
!464 = !DILocalVariable(name: "pointer", arg: 1, scope: !461, file: !7, line: 67, type: !452)
!465 = !DILocation(line: 67, column: 1, scope: !461)
!466 = !DILocalVariable(name: "rcvr", arg: 2, scope: !461, file: !7, line: 67, type: !319)
!467 = !DILocation(line: 67, column: 26, scope: !461)
!468 = !DILocalVariable(name: "s", scope: !461, file: !7, line: 67, type: !300)
!469 = !DILocation(line: 68, column: 17, scope: !461)
!470 = !DILocation(line: 68, column: 2, scope: !461)
!471 = distinct !DISubprogram(name: "pie.RegisterName.command_line_arguments.Server", linkageName: "command_line_arguments.Server.RegisterName", scope: null, file: !7, line: 73, type: !472, isLocal: false, isDefinition: true, scopeLine: 73, isOptimized: false, unit: !1, retainedNodes: !3)
!472 = !DISubroutineType(types: !473)
!473 = !{!8, !452, !452, !52, !319}
!474 = !DILocalVariable(name: "pointer", arg: 1, scope: !471, file: !7, line: 73, type: !452)
!475 = !DILocation(line: 73, column: 1, scope: !471)
!476 = !DILocalVariable(name: "name", arg: 2, scope: !471, file: !7, line: 73, type: !52)
!477 = !DILocation(line: 73, column: 30, scope: !471)
!478 = !DILocalVariable(name: "rcvr", arg: 3, scope: !471, file: !7, line: 73, type: !319)
!479 = !DILocation(line: 73, column: 43, scope: !471)
!480 = !DILocalVariable(name: "s", scope: !471, file: !7, line: 73, type: !300)
!481 = !DILocation(line: 74, column: 17, scope: !471)
!482 = !DILocation(line: 74, column: 2, scope: !471)
!483 = distinct !DISubprogram(name: "pie.Serve.command_line_arguments.Server", linkageName: "command_line_arguments.Server.Serve", scope: null, file: !7, line: 45, type: !484, isLocal: false, isDefinition: true, scopeLine: 45, isOptimized: false, unit: !1, retainedNodes: !3)
!484 = !DISubroutineType(types: !485)
!485 = !{!38, !452, !452}
!486 = !DILocalVariable(name: "pointer", arg: 1, scope: !483, file: !7, line: 45, type: !452)
!487 = !DILocation(line: 45, column: 1, scope: !483)
!488 = !DILocalVariable(name: "s", scope: !483, file: !7, line: 45, type: !300)
!489 = !DILocation(line: 46, column: 10, scope: !483)
!490 = distinct !DISubprogram(name: "pie.ServeCodec.command_line_arguments.Server", linkageName: "command_line_arguments.Server.ServeCodec", scope: null, file: !7, line: 51, type: !491, isLocal: false, isDefinition: true, scopeLine: 51, isOptimized: false, unit: !1, retainedNodes: !3)
!491 = !DISubroutineType(types: !492)
!492 = !{!38, !452, !452, !493}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 51, size: 64, align: 8, elements: !495)
!495 = !{!496}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 51, baseType: !497, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!361, !353}
!500 = !DILocalVariable(name: "pointer", arg: 1, scope: !490, file: !7, line: 51, type: !452)
!501 = !DILocation(line: 51, column: 1, scope: !490)
!502 = !DILocalVariable(name: "f", arg: 2, scope: !490, file: !7, line: 51, type: !493)
!503 = !DILocation(line: 51, column: 28, scope: !490)
!504 = !DILocalVariable(name: "s", scope: !490, file: !7, line: 51, type: !300)
!505 = !DILocation(line: 52, column: 22, scope: !490)
!506 = !DILocation(line: 52, column: 10, scope: !490)
!507 = distinct !DISubprogram(name: "pie.StartProvider", linkageName: "command_line_arguments.StartProvider", scope: null, file: !7, line: 82, type: !508, isLocal: false, isDefinition: true, scopeLine: 82, isOptimized: false, unit: !1, retainedNodes: !3)
!508 = !DISubroutineType(types: !509)
!509 = !{!510, !271, !52, !279}
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Client,error}", file: !14, size: 192, align: 8, elements: !511)
!511 = !{!512, !539}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 82, baseType: !513, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "Client", file: !7, line: 7, size: 704, align: 8, elements: !515)
!515 = !{!516, !532, !533, !534, !535, !536, !537, !538}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "codec", file: !7, line: 7, baseType: !517, size: 128, align: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientCodec", file: !7, line: 7, size: 128, align: 8, elements: !518)
!518 = !{!519, !189}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 7, baseType: !520, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*_type,*void})error,*func(*void,*Response)error,*func(*void,*Request,struct{*_type,*void})error}", file: !14, size: 320, align: 8, elements: !522)
!522 = !{!367, !368, !523, !524, !528}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ReadResponseBody", file: !14, line: 7, baseType: !370, size: 64, align: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ReadResponseHeader", file: !14, line: 7, baseType: !525, size: 64, align: 64, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!8, !37, !347}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "WriteRequest", file: !14, line: 7, baseType: !529, size: 64, align: 64, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!8, !37, !339, !319}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "reqMutex", file: !7, line: 7, baseType: !310, size: 64, align: 32, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "request", file: !7, line: 7, baseType: !340, size: 256, align: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !7, line: 7, baseType: !310, size: 64, align: 32, offset: 448)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !7, line: 7, baseType: !99, size: 64, align: 64, offset: 512)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "pending", file: !7, line: 7, baseType: !323, size: 64, align: 64, offset: 576)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "closing", file: !7, line: 7, baseType: !47, size: 8, align: 8, offset: 640)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", file: !7, line: 7, baseType: !47, size: 8, align: 8, offset: 648)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 82, baseType: !8, size: 128, align: 64, offset: 64)
!540 = !DILocalVariable(name: "args", arg: 3, scope: !507, file: !7, line: 82, type: !279)
!541 = !DILocation(line: 82, column: 51, scope: !507)
!542 = !DILocalVariable(name: "output", arg: 1, scope: !507, file: !7, line: 82, type: !271)
!543 = !DILocation(line: 82, column: 20, scope: !507)
!544 = !DILocalVariable(name: "path", arg: 2, scope: !507, file: !7, line: 82, type: !52)
!545 = !DILocation(line: 82, column: 38, scope: !507)
!546 = !DILocalVariable(name: "$ret4", scope: !507, file: !7, line: 82, type: !513)
!547 = !DILocation(line: 82, column: 68, scope: !507)
!548 = !DILocation(line: 83, column: 21, scope: !549)
!549 = distinct !DILexicalBlock(scope: !507, file: !7, line: 82, column: 1)
!550 = !DILocation(line: 83, column: 15, scope: !549)
!551 = !DILocalVariable(name: "err", scope: !549, file: !7, line: 83, type: !8)
!552 = !DILocation(line: 83, column: 2, scope: !507)
!553 = !DILocation(line: 84, column: 9, scope: !549)
!554 = !DILocalVariable(name: "$ret5", scope: !507, file: !7, line: 82, type: !8)
!555 = !DILocation(line: 82, column: 81, scope: !507)
!556 = !DILocation(line: 85, column: 3, scope: !549)
!557 = !DILocation(line: 87, column: 23, scope: !549)
!558 = !DILocation(line: 87, column: 13, scope: !549)
!559 = !DILocation(line: 87, column: 2, scope: !549)
!560 = distinct !DISubprogram(name: "pie.start", scope: null, file: !7, line: 139, type: !561, isLocal: true, isDefinition: true, scopeLine: 139, isOptimized: false, unit: !1, retainedNodes: !3)
!561 = !DISubroutineType(types: !562)
!562 = !{!563, !148}
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.command-line-arguments.ioPipe,error}", file: !14, size: 512, align: 8, elements: !564)
!564 = !{!565, !571}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_", file: !14, line: 139, baseType: !566, size: 384, align: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.ioPipe", file: !7, line: 205, size: 384, align: 8, elements: !567)
!567 = !{!568, !569, !570}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ReadCloser", file: !7, line: 206, baseType: !263, size: 128, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "WriteCloser", file: !7, line: 207, baseType: !239, size: 128, align: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "proc", file: !7, line: 208, baseType: !162, size: 128, align: 64, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !14, line: 139, baseType: !8, size: 128, align: 64, offset: 384)
!572 = !DILocalVariable(name: "cmd", arg: 1, scope: !560, file: !7, line: 139, type: !148)
!573 = !DILocation(line: 139, column: 12, scope: !560)
!574 = !DILocation(line: 140, column: 16, scope: !575)
!575 = distinct !DILexicalBlock(scope: !560, file: !7, line: 139, column: 1)
!576 = !DILocation(line: 164, column: 1, scope: !560)
!577 = !DILocation(line: 141, column: 9, scope: !575)
!578 = !DILocation(line: 142, column: 3, scope: !575)
!579 = !DILocation(line: 144, column: 8, scope: !575)
!580 = !DILocation(line: 144, column: 2, scope: !575)
!581 = !DILocation(line: 149, column: 17, scope: !575)
!582 = !DILocation(line: 150, column: 9, scope: !575)
!583 = !DILocation(line: 151, column: 3, scope: !575)
!584 = !DILocation(line: 153, column: 8, scope: !575)
!585 = !DILocation(line: 153, column: 2, scope: !575)
!586 = !DILocation(line: 159, column: 18, scope: !575)
!587 = !DILocation(line: 160, column: 9, scope: !575)
!588 = !DILocation(line: 161, column: 3, scope: !575)
!589 = !DILocation(line: 163, column: 9, scope: !575)
!590 = !DILocation(line: 163, column: 2, scope: !575)
!591 = !DILocation(line: 142, column: 3, scope: !560)
!592 = distinct !DISubprogram(name: "pie.command_line_arguments.ioPipe..hash", linkageName: "command_line_arguments.command_line_arguments.ioPipe..hash", scope: null, file: !9, line: 1, type: !35, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!593 = !DILocalVariable(name: "key", arg: 1, scope: !592, file: !9, line: 1, type: !37)
!594 = !DILocation(line: 1, column: 1, scope: !592)
!595 = !DILocalVariable(name: "seed", arg: 2, scope: !592, file: !9, line: 1, type: !21)
!596 = !DILocalVariable(name: "$ret53", scope: !592, file: !9, line: 1, type: !21)
!597 = distinct !DISubprogram(name: "pie.command_line_arguments.ioPipe..eq", linkageName: "command_line_arguments.command_line_arguments.ioPipe..eq", scope: null, file: !9, line: 1, type: !45, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!598 = !DILocalVariable(name: "key1", arg: 1, scope: !597, file: !9, line: 1, type: !37)
!599 = !DILocation(line: 1, column: 1, scope: !597)
!600 = !DILocalVariable(name: "key2", arg: 2, scope: !597, file: !9, line: 1, type: !37)
!601 = !DILocalVariable(name: "$ret54", scope: !597, file: !9, line: 1, type: !47)
!602 = distinct !DISubprogram(name: "pie.Close.command_line_arguments.ioPipe", linkageName: "command_line_arguments.ioPipe.Close", scope: null, file: !7, line: 212, type: !603, isLocal: false, isDefinition: true, scopeLine: 212, isOptimized: false, unit: !1, retainedNodes: !3)
!603 = !DISubroutineType(types: !604)
!604 = !{!8, !605, !605}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!606 = !DILocalVariable(name: "pointer", arg: 1, scope: !602, file: !7, line: 212, type: !605)
!607 = !DILocation(line: 212, column: 1, scope: !602)
!608 = !DILocation(line: 213, column: 23, scope: !609)
!609 = distinct !DILexicalBlock(scope: !602, file: !7, line: 212, column: 1)
!610 = !DILocalVariable(name: "err", scope: !609, file: !7, line: 213, type: !8)
!611 = !DILocation(line: 213, column: 2, scope: !602)
!612 = !DILocation(line: 214, column: 32, scope: !613)
!613 = distinct !DILexicalBlock(scope: !609, file: !7, line: 214, column: 2)
!614 = !DILocalVariable(name: "writeErr", scope: !613, file: !7, line: 214, type: !8)
!615 = !DILocation(line: 214, column: 5, scope: !609)
!616 = !DILocation(line: 214, column: 51, scope: !613)
!617 = !DILocalVariable(name: "iop", scope: !602, file: !7, line: 212, type: !566)
!618 = !DILocation(line: 217, column: 19, scope: !619)
!619 = distinct !DILexicalBlock(scope: !609, file: !7, line: 217, column: 2)
!620 = !DILocalVariable(name: "procErr", scope: !619, file: !7, line: 217, type: !8)
!621 = !DILocation(line: 217, column: 5, scope: !609)
!622 = !DILocation(line: 217, column: 41, scope: !619)
!623 = !DILocalVariable(name: "$ret16", scope: !602, file: !7, line: 212, type: !8)
!624 = !DILocation(line: 212, column: 27, scope: !602)
!625 = !DILocation(line: 220, column: 2, scope: !609)
!626 = distinct !DISubprogram(name: "pie.Read..stub.command_line_arguments.ioPipe", linkageName: "command_line_arguments.ioPipe.Read..stub", scope: null, file: !7, line: 5, type: !627, isLocal: false, isDefinition: true, scopeLine: 5, isOptimized: false, unit: !1, retainedNodes: !3)
!627 = !DISubroutineType(types: !628)
!628 = !{!422, !605, !605, !129}
!629 = !DILocalVariable(name: "$p16", arg: 2, scope: !626, file: !7, line: 5, type: !129)
!630 = !DILocation(line: 5, column: 5, scope: !626)
!631 = !DILocalVariable(name: "$this15.pointer", arg: 1, scope: !626, file: !7, line: 5, type: !605)
!632 = !DILocalVariable(name: "$this15", scope: !626, file: !7, line: 5, type: !605)
!633 = !DILocalVariable(name: "$ret25", scope: !626, file: !7, line: 5, type: !56)
!634 = !DILocation(line: 205, column: 6, scope: !626)
!635 = distinct !DISubprogram(name: "pie.Write..stub.command_line_arguments.ioPipe", linkageName: "command_line_arguments.ioPipe.Write..stub", scope: null, file: !7, line: 5, type: !627, isLocal: false, isDefinition: true, scopeLine: 5, isOptimized: false, unit: !1, retainedNodes: !3)
!636 = !DILocalVariable(name: "$p14", arg: 2, scope: !635, file: !7, line: 5, type: !129)
!637 = !DILocation(line: 5, column: 5, scope: !635)
!638 = !DILocalVariable(name: "$this13.pointer", arg: 1, scope: !635, file: !7, line: 5, type: !605)
!639 = !DILocalVariable(name: "$this13", scope: !635, file: !7, line: 5, type: !605)
!640 = !DILocalVariable(name: "$ret23", scope: !635, file: !7, line: 5, type: !56)
!641 = !DILocation(line: 205, column: 6, scope: !635)
!642 = distinct !DISubprogram(name: "pie.closeProc.command_line_arguments.ioPipe", linkageName: "command_line_arguments.ioPipe.closeProc", scope: null, file: !7, line: 229, type: !603, isLocal: false, isDefinition: true, scopeLine: 229, isOptimized: false, unit: !1, retainedNodes: !3)
!643 = !DILocalVariable(name: "pointer", arg: 1, scope: !642, file: !7, line: 229, type: !605)
!644 = !DILocation(line: 229, column: 1, scope: !642)
!645 = !DILocalVariable(name: "iop", scope: !642, file: !7, line: 229, type: !605)
!646 = !DILocation(line: 230, column: 2, scope: !647)
!647 = distinct !DILexicalBlock(scope: !642, file: !7, line: 229, column: 1)
!648 = !DILocalVariable(name: "result", scope: !647, file: !7, line: 230, type: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !9, line: 1, align: 8, elements: !3)
!652 = !DILocation(line: 230, column: 2, scope: !642)
!653 = !DILocation(line: 230, column: 12, scope: !647)
!654 = !DILocation(line: 231, column: 5, scope: !647)
!655 = !DILocation(line: 231, column: 2, scope: !647)
!656 = !DILocation(line: 232, column: 20, scope: !657)
!657 = distinct !DILexicalBlock(scope: !647, file: !7, line: 232, column: 2)
!658 = !DILocalVariable(name: "err", scope: !657, file: !7, line: 232, type: !8)
!659 = !DILocation(line: 232, column: 5, scope: !647)
!660 = !DILocation(line: 232, column: 47, scope: !657)
!661 = !DILocalVariable(name: "$ret17", scope: !642, file: !7, line: 229, type: !8)
!662 = !DILocation(line: 229, column: 31, scope: !642)
!663 = !DILocation(line: 233, column: 3, scope: !657)
!664 = !DILocation(line: 235, column: 2, scope: !647)
!665 = !DILocation(line: 236, column: 16, scope: !647)
!666 = !DILocation(line: 236, column: 2, scope: !647)
!667 = !DILocation(line: 238, column: 14, scope: !647)
!668 = !DILocation(line: 238, column: 2, scope: !647)
!669 = !DILocalVariable(name: "err", scope: !670, file: !7, line: 236, type: !8)
!670 = distinct !DILexicalBlock(scope: !647, file: !7, line: 237, column: 3)
!671 = !DILocation(line: 237, column: 3, scope: !670)
!672 = !DILocation(line: 239, column: 21, scope: !673)
!673 = distinct !DILexicalBlock(scope: !647, file: !7, line: 239, column: 3)
!674 = !DILocalVariable(name: "err", scope: !673, file: !7, line: 239, type: !8)
!675 = !DILocation(line: 239, column: 6, scope: !647)
!676 = !DILocation(line: 239, column: 34, scope: !673)
!677 = !DILocation(line: 242, column: 3, scope: !647)
!678 = !DILocation(line: 240, column: 65, scope: !673)
!679 = !DILocation(line: 240, column: 15, scope: !673)
!680 = !DILocation(line: 240, column: 4, scope: !673)
!681 = distinct !DISubprogram(name: "pie.StartProviderCodec", linkageName: "command_line_arguments.StartProviderCodec", scope: null, file: !7, line: 96, type: !682, isLocal: false, isDefinition: true, scopeLine: 96, isOptimized: false, unit: !1, retainedNodes: !3)
!682 = !DISubroutineType(types: !683)
!683 = !{!510, !684, !271, !52, !279}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 97, size: 64, align: 8, elements: !686)
!686 = !{!687}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 97, baseType: !688, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!517, !353}
!691 = !DILocalVariable(name: "args", arg: 4, scope: !681, file: !7, line: 100, type: !279)
!692 = !DILocation(line: 100, column: 2, scope: !681)
!693 = !DILocalVariable(name: "f", arg: 1, scope: !681, file: !7, line: 97, type: !684)
!694 = !DILocation(line: 97, column: 2, scope: !681)
!695 = !DILocalVariable(name: "output", arg: 2, scope: !681, file: !7, line: 98, type: !271)
!696 = !DILocation(line: 98, column: 2, scope: !681)
!697 = !DILocalVariable(name: "path", arg: 3, scope: !681, file: !7, line: 99, type: !52)
!698 = !DILocation(line: 99, column: 2, scope: !681)
!699 = !DILocalVariable(name: "$ret6", scope: !681, file: !7, line: 101, type: !513)
!700 = !DILocation(line: 101, column: 4, scope: !681)
!701 = !DILocation(line: 102, column: 21, scope: !702)
!702 = distinct !DILexicalBlock(scope: !681, file: !7, line: 96, column: 1)
!703 = !DILocation(line: 102, column: 15, scope: !702)
!704 = !DILocalVariable(name: "err", scope: !702, file: !7, line: 102, type: !8)
!705 = !DILocation(line: 102, column: 2, scope: !681)
!706 = !DILocation(line: 103, column: 9, scope: !702)
!707 = !DILocalVariable(name: "$ret7", scope: !681, file: !7, line: 101, type: !8)
!708 = !DILocation(line: 101, column: 17, scope: !681)
!709 = !DILocation(line: 104, column: 3, scope: !702)
!710 = !DILocation(line: 106, column: 32, scope: !702)
!711 = !DILocation(line: 106, column: 34, scope: !702)
!712 = !DILocation(line: 106, column: 13, scope: !702)
!713 = !DILocation(line: 106, column: 2, scope: !702)
!714 = distinct !DISubprogram(name: "pie.StartConsumer", linkageName: "command_line_arguments.StartConsumer", scope: null, file: !7, line: 113, type: !715, isLocal: false, isDefinition: true, scopeLine: 113, isOptimized: false, unit: !1, retainedNodes: !3)
!715 = !DISubroutineType(types: !716)
!716 = !{!717, !271, !52, !279}
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Server,error}", file: !14, size: 448, align: 8, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 113, baseType: !300, size: 320, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 113, baseType: !8, size: 128, align: 64, offset: 320)
!721 = !DILocalVariable(name: "args", arg: 3, scope: !714, file: !7, line: 113, type: !279)
!722 = !DILocation(line: 113, column: 51, scope: !714)
!723 = !DILocalVariable(name: "output", arg: 1, scope: !714, file: !7, line: 113, type: !271)
!724 = !DILocation(line: 113, column: 20, scope: !714)
!725 = !DILocalVariable(name: "path", arg: 2, scope: !714, file: !7, line: 113, type: !52)
!726 = !DILocation(line: 113, column: 38, scope: !714)
!727 = !DILocation(line: 114, column: 21, scope: !728)
!728 = distinct !DILexicalBlock(scope: !714, file: !7, line: 113, column: 1)
!729 = !DILocation(line: 114, column: 15, scope: !728)
!730 = !DILocalVariable(name: "err", scope: !728, file: !7, line: 114, type: !8)
!731 = !DILocation(line: 114, column: 2, scope: !714)
!732 = !DILocation(line: 115, column: 9, scope: !728)
!733 = !DILocalVariable(name: "$ret8", scope: !714, file: !7, line: 113, type: !300)
!734 = !DILocation(line: 113, column: 68, scope: !714)
!735 = !DILocalVariable(name: "$ret9", scope: !714, file: !7, line: 113, type: !8)
!736 = !DILocation(line: 113, column: 76, scope: !714)
!737 = !DILocation(line: 116, column: 3, scope: !728)
!738 = !DILocation(line: 119, column: 15, scope: !728)
!739 = !DILocation(line: 118, column: 9, scope: !728)
!740 = !DILocation(line: 118, column: 2, scope: !728)
!741 = distinct !DISubprogram(name: "pie.NewConsumer", linkageName: "command_line_arguments.NewConsumer", scope: null, file: !7, line: 126, type: !742, isLocal: false, isDefinition: true, scopeLine: 126, isOptimized: false, unit: !1, retainedNodes: !3)
!742 = !DISubroutineType(types: !743)
!743 = !{!513}
!744 = !DILocalVariable(name: "$ret10", scope: !741, file: !7, line: 126, type: !513)
!745 = !DILocation(line: 126, column: 20, scope: !741)
!746 = !DILocation(line: 127, column: 35, scope: !741)
!747 = !DILocation(line: 127, column: 45, scope: !741)
!748 = !DILocation(line: 127, column: 23, scope: !741)
!749 = !DILocation(line: 127, column: 13, scope: !741)
!750 = !DILocation(line: 127, column: 2, scope: !741)
!751 = distinct !DISubprogram(name: "pie.NewConsumerCodec", linkageName: "command_line_arguments.NewConsumerCodec", scope: null, file: !7, line: 133, type: !752, isLocal: false, isDefinition: true, scopeLine: 133, isOptimized: false, unit: !1, retainedNodes: !3)
!752 = !DISubroutineType(types: !753)
!753 = !{!513, !684}
!754 = !DILocalVariable(name: "f", arg: 1, scope: !751, file: !7, line: 133, type: !684)
!755 = !DILocation(line: 133, column: 23, scope: !751)
!756 = !DILocalVariable(name: "$ret11", scope: !751, file: !7, line: 133, type: !513)
!757 = !DILocation(line: 133, column: 67, scope: !751)
!758 = !DILocation(line: 134, column: 46, scope: !751)
!759 = !DILocation(line: 134, column: 56, scope: !751)
!760 = !DILocation(line: 134, column: 32, scope: !751)
!761 = !DILocation(line: 134, column: 34, scope: !751)
!762 = !DILocation(line: 134, column: 13, scope: !751)
!763 = !DILocation(line: 134, column: 2, scope: !751)
!764 = distinct !DISubprogram(name: "pie.start..func1", scope: null, file: !7, line: 144, type: !289, isLocal: true, isDefinition: true, scopeLine: 144, isOptimized: false, unit: !1, retainedNodes: !3)
!765 = !DILocation(line: 145, column: 6, scope: !764)
!766 = !DILocation(line: 145, column: 10, scope: !764)
!767 = !DILocation(line: 146, column: 4, scope: !764)
!768 = !DILocation(line: 146, column: 6, scope: !764)
!769 = distinct !DISubprogram(name: "pie.command_line_arguments..thunk0", scope: null, file: !7, line: 144, type: !770, isLocal: true, isDefinition: true, scopeLine: 144, isOptimized: false, unit: !1, retainedNodes: !3)
!770 = !DISubroutineType(types: !771)
!771 = !{!38, !772}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*__go_descriptor}", file: !14, size: 64, align: 8, elements: !774)
!774 = !{!775}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !14, line: 144, baseType: !776, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 8, size: 64, align: 8, elements: !778)
!778 = !{!779}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 8, baseType: !780, size: 64, align: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!781 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !769, file: !7, line: 144, type: !772)
!782 = !DILocation(line: 144, column: 2, scope: !769)
!783 = distinct !DISubprogram(name: "pie.start..func2", scope: null, file: !7, line: 153, type: !289, isLocal: true, isDefinition: true, scopeLine: 153, isOptimized: false, unit: !1, retainedNodes: !3)
!784 = !DILocation(line: 154, column: 6, scope: !783)
!785 = !DILocation(line: 154, column: 10, scope: !783)
!786 = !DILocation(line: 155, column: 4, scope: !783)
!787 = !DILocation(line: 155, column: 7, scope: !783)
!788 = distinct !DISubprogram(name: "pie.command_line_arguments..thunk1", scope: null, file: !7, line: 153, type: !770, isLocal: true, isDefinition: true, scopeLine: 153, isOptimized: false, unit: !1, retainedNodes: !3)
!789 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !788, file: !7, line: 153, type: !772)
!790 = !DILocation(line: 153, column: 2, scope: !788)
!791 = distinct !DISubprogram(name: "pie.func1", scope: null, file: !7, line: 168, type: !146, isLocal: true, isDefinition: true, scopeLine: 168, isOptimized: false, unit: !1, retainedNodes: !3)
!792 = !DILocalVariable(name: "args", arg: 3, scope: !791, file: !7, line: 168, type: !279)
!793 = !DILocation(line: 168, column: 50, scope: !791)
!794 = !DILocalVariable(name: "path", arg: 2, scope: !791, file: !7, line: 168, type: !52)
!795 = !DILocation(line: 168, column: 37, scope: !791)
!796 = !DILocation(line: 169, column: 14, scope: !797)
!797 = distinct !DILexicalBlock(scope: !791, file: !7, line: 168, column: 19)
!798 = !DILocalVariable(name: "cmd", scope: !797, file: !7, line: 169, type: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cmd", file: !7, line: 9, size: 2624, align: 8, elements: !801)
!801 = !{!802, !803, !804, !805, !806, !814, !815, !816, !821, !867, !882, !883, !939, !940, !941, !942, !953, !954, !966, !967}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !7, line: 9, baseType: !52, size: 128, align: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "Args", file: !7, line: 9, baseType: !279, size: 192, align: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "Env", file: !7, line: 9, baseType: !279, size: 192, align: 64, offset: 320)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "Dir", file: !7, line: 9, baseType: !52, size: 128, align: 64, offset: 512)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "Stdin", file: !7, line: 9, baseType: !807, size: 128, align: 64, offset: 640)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !7, line: 5, size: 128, align: 8, elements: !808)
!808 = !{!809, !189}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 5, baseType: !810, size: 64, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !14, size: 128, align: 8, elements: !812)
!812 = !{!277, !813}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !14, line: 5, baseType: !248, size: 64, align: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "Stdout", file: !7, line: 9, baseType: !271, size: 128, align: 64, offset: 768)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "Stderr", file: !7, line: 9, baseType: !271, size: 128, align: 64, offset: 896)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraFiles", file: !7, line: 9, baseType: !817, size: 192, align: 64, offset: 1024)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**File,int,int}", file: !14, size: 192, align: 8, elements: !818)
!818 = !{!819, !73, !74}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !820, size: 64, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "SysProcAttr", file: !7, line: 9, baseType: !822, size: 64, align: 64, offset: 1216)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "SysProcAttr", file: !7, line: 8, size: 1280, align: 8, elements: !824)
!824 = !{!825, !826, !838, !839, !840, !841, !842, !843, !844, !845, !846, !848, !849, !850, !860, !861, !862}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "Chroot", file: !7, line: 8, baseType: !52, size: 128, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Credential", file: !7, line: 8, baseType: !827, size: 64, align: 64, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "Credential", file: !7, line: 8, size: 320, align: 8, elements: !829)
!829 = !{!830, !831, !832, !837}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "Uid", file: !7, line: 8, baseType: !24, size: 32, align: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "Gid", file: !7, line: 8, baseType: !24, size: 32, align: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "Groups", file: !7, line: 8, baseType: !833, size: 192, align: 64, offset: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint32,int,int}", file: !14, size: 192, align: 8, elements: !834)
!834 = !{!835, !73, !74}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !836, size: 64, align: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "NoSetGroups", file: !7, line: 8, baseType: !47, size: 8, align: 8, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "Ptrace", file: !7, line: 8, baseType: !47, size: 8, align: 8, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "Setsid", file: !7, line: 8, baseType: !47, size: 8, align: 8, offset: 200)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "Setpgid", file: !7, line: 8, baseType: !47, size: 8, align: 8, offset: 208)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "Setctty", file: !7, line: 8, baseType: !47, size: 8, align: 8, offset: 216)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "Noctty", file: !7, line: 8, baseType: !47, size: 8, align: 8, offset: 224)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "Ctty", file: !7, line: 8, baseType: !56, size: 64, align: 64, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "Foreground", file: !7, line: 8, baseType: !47, size: 8, align: 8, offset: 320)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "Pgid", file: !7, line: 8, baseType: !56, size: 64, align: 64, offset: 384)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "Pdeathsig", file: !7, line: 8, baseType: !847, size: 64, align: 64, offset: 448)
!847 = !DIBasicType(name: "Signal", size: 64, encoding: DW_ATE_signed)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "Cloneflags", file: !7, line: 8, baseType: !21, size: 64, align: 64, offset: 512)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "Unshareflags", file: !7, line: 8, baseType: !21, size: 64, align: 64, offset: 576)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "UidMappings", file: !7, line: 8, baseType: !851, size: 192, align: 64, offset: 640)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*SysProcIDMap,int,int}", file: !14, size: 192, align: 8, elements: !852)
!852 = !{!853, !73, !74}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !854, size: 64, align: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "SysProcIDMap", file: !7, line: 8, size: 192, align: 8, elements: !856)
!856 = !{!857, !858, !859}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ContainerID", file: !7, line: 8, baseType: !56, size: 64, align: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "HostID", file: !7, line: 8, baseType: !56, size: 64, align: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !7, line: 8, baseType: !56, size: 64, align: 64, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "GidMappings", file: !7, line: 8, baseType: !851, size: 192, align: 64, offset: 832)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "GidMappingsEnableSetgroups", file: !7, line: 8, baseType: !47, size: 8, align: 8, offset: 1024)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "AmbientCaps", file: !7, line: 8, baseType: !863, size: 192, align: 64, offset: 1088)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !14, size: 192, align: 8, elements: !864)
!864 = !{!865, !73, !74}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !866, size: 64, align: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "Process", file: !7, line: 9, baseType: !868, size: 64, align: 64, offset: 1280)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "Process", file: !7, line: 8, size: 384, align: 8, elements: !870)
!870 = !{!871, !872, !873, !874}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "Pid", file: !7, line: 8, baseType: !56, size: 64, align: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "handle", file: !7, line: 8, baseType: !21, size: 64, align: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "isdone", file: !7, line: 8, baseType: !24, size: 32, align: 32, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "sigMu", file: !7, line: 8, baseType: !875, size: 192, align: 32, offset: 160)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !7, line: 8, size: 192, align: 8, elements: !876)
!876 = !{!877, !878, !879, !880, !881}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !7, line: 8, baseType: !310, size: 64, align: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !7, line: 8, baseType: !24, size: 32, align: 32, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !7, line: 8, baseType: !24, size: 32, align: 32, offset: 96)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !7, line: 8, baseType: !313, size: 32, align: 32, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !7, line: 8, baseType: !313, size: 32, align: 32, offset: 160)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessState", file: !7, line: 9, baseType: !197, size: 64, align: 64, offset: 1344)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !7, line: 9, baseType: !884, size: 128, align: 64, offset: 1408)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !7, line: 7, size: 128, align: 8, elements: !885)
!885 = !{!886, !189}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 7, baseType: !887, size: 64, align: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,struct{*_type,*void})struct{*_type,*void}}", file: !14, size: 320, align: 8, elements: !889)
!889 = !{!367, !890, !930, !934, !935}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !14, line: 7, baseType: !891, size: 64, align: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!894, !37}
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !14, size: 256, align: 8, elements: !895)
!895 = !{!896, !929}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !14, line: 7, baseType: !897, size: 192, align: 64)
!897 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 7, size: 192, align: 8, elements: !898)
!898 = !{!899, !900, !901}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 7, baseType: !99, size: 64, align: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 7, baseType: !216, size: 64, align: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 7, baseType: !902, size: 64, align: 64, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 7, size: 704, align: 8, elements: !904)
!904 = !{!905, !906, !915, !926, !927, !928}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 7, baseType: !52, size: 128, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 7, baseType: !907, size: 192, align: 64, offset: 128)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !14, size: 192, align: 8, elements: !908)
!908 = !{!909, !73, !74}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !910, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 7, size: 256, align: 8, elements: !912)
!912 = !{!905, !913, !914}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 7, baseType: !56, size: 64, align: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 7, baseType: !47, size: 8, align: 8, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 7, baseType: !916, size: 192, align: 64, offset: 320)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !14, size: 192, align: 8, elements: !917)
!917 = !{!918, !73, !74}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !919, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 7, size: 128, align: 8, elements: !921)
!921 = !{!922, !923, !924, !925}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 7, baseType: !216, size: 64, align: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 7, baseType: !26, size: 8, align: 8, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 7, baseType: !47, size: 8, align: 8, offset: 72)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 7, baseType: !47, size: 8, align: 8, offset: 80)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 7, baseType: !216, size: 64, align: 64, offset: 512)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 7, baseType: !216, size: 64, align: 64, offset: 576)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 7, baseType: !910, size: 64, align: 64, offset: 640)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !14, line: 7, baseType: !47, size: 8, align: 8, offset: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !14, line: 7, baseType: !931, size: 64, align: 64, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!650, !37}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !14, line: 7, baseType: !170, size: 64, align: 64, offset: 192)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !14, line: 7, baseType: !936, size: 64, align: 64, offset: 256)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!319, !37, !319}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "lookPathErr", file: !7, line: 9, baseType: !8, size: 128, align: 64, offset: 1536)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "finished", file: !7, line: 9, baseType: !47, size: 8, align: 8, offset: 1664)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "childFiles", file: !7, line: 9, baseType: !817, size: 192, align: 64, offset: 1728)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "closeAfterStart", file: !7, line: 9, baseType: !943, size: 192, align: 64, offset: 1920)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Closer,int,int}", file: !14, size: 192, align: 8, elements: !944)
!944 = !{!945, !73, !74}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "Closer", file: !7, line: 6, size: 128, align: 8, elements: !948)
!948 = !{!949, !189}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 6, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error}", file: !14, size: 128, align: 8, elements: !952)
!952 = !{!245, !246}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "closeAfterWait", file: !7, line: 9, baseType: !943, size: 192, align: 64, offset: 2112)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "goroutine", file: !7, line: 9, baseType: !955, size: 192, align: 64, offset: 2304)
!955 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**__go_descriptor,int,int}", file: !14, size: 192, align: 8, elements: !956)
!956 = !{!957, !73, !74}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 7, size: 64, align: 8, elements: !961)
!961 = !{!962}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 7, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!8}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "errch", file: !7, line: 9, baseType: !650, size: 64, align: 64, offset: 2496)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "waitDone", file: !7, line: 9, baseType: !650, size: 64, align: 64, offset: 2560)
!968 = !DILocation(line: 169, column: 2, scope: !791)
!969 = !DILocation(line: 170, column: 5, scope: !797)
!970 = !DILocation(line: 170, column: 13, scope: !797)
!971 = !DILocation(line: 171, column: 2, scope: !797)
!972 = !DILocation(line: 171, column: 9, scope: !797)
!973 = !DILocalVariable(name: "$ret13", scope: !791, file: !7, line: 168, type: !148)
!974 = !DILocation(line: 168, column: 65, scope: !791)
!975 = distinct !DISubprogram(name: "pie.CombinedOutput..stub.command_line_arguments.execCmd", linkageName: "command_line_arguments.execCmd.CombinedOutput..stub", scope: null, file: !7, line: 9, type: !976, isLocal: false, isDefinition: true, scopeLine: 9, isOptimized: false, unit: !1, retainedNodes: !3)
!976 = !DISubroutineType(types: !977)
!977 = !{!978, !982, !982}
!978 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !14, size: 320, align: 8, elements: !979)
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 9, baseType: !129, size: 192, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 9, baseType: !8, size: 128, align: 64, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.execCmd", file: !7, line: 174, size: 64, align: 8, elements: !984)
!984 = !{!985}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "Cmd", file: !7, line: 175, baseType: !799, size: 64, align: 64)
!986 = !DILocalVariable(name: "$this33.pointer", arg: 1, scope: !975, file: !7, line: 9, type: !982)
!987 = !DILocation(line: 9, column: 9, scope: !975)
!988 = !DILocalVariable(name: "$this33", scope: !975, file: !7, line: 9, type: !983)
!989 = !DILocation(line: 174, column: 6, scope: !975)
!990 = distinct !DISubprogram(name: "pie.Output..stub.command_line_arguments.execCmd", linkageName: "command_line_arguments.execCmd.Output..stub", scope: null, file: !7, line: 9, type: !976, isLocal: false, isDefinition: true, scopeLine: 9, isOptimized: false, unit: !1, retainedNodes: !3)
!991 = !DILocalVariable(name: "$this26.pointer", arg: 1, scope: !990, file: !7, line: 9, type: !982)
!992 = !DILocation(line: 9, column: 9, scope: !990)
!993 = !DILocalVariable(name: "$this26", scope: !990, file: !7, line: 9, type: !983)
!994 = !DILocation(line: 174, column: 6, scope: !990)
!995 = distinct !DISubprogram(name: "pie.Run..stub.command_line_arguments.execCmd", linkageName: "command_line_arguments.execCmd.Run..stub", scope: null, file: !7, line: 9, type: !996, isLocal: false, isDefinition: true, scopeLine: 9, isOptimized: false, unit: !1, retainedNodes: !3)
!996 = !DISubroutineType(types: !997)
!997 = !{!8, !982, !982}
!998 = !DILocalVariable(name: "$this24.pointer", arg: 1, scope: !995, file: !7, line: 9, type: !982)
!999 = !DILocation(line: 9, column: 9, scope: !995)
!1000 = !DILocalVariable(name: "$this24", scope: !995, file: !7, line: 9, type: !983)
!1001 = !DILocation(line: 174, column: 6, scope: !995)
!1002 = distinct !DISubprogram(name: "pie.Start.command_line_arguments.execCmd", linkageName: "command_line_arguments.execCmd.Start", scope: null, file: !7, line: 178, type: !1003, isLocal: false, isDefinition: true, scopeLine: 178, isOptimized: false, unit: !1, retainedNodes: !3)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!159, !982, !982}
!1005 = !DILocalVariable(name: "pointer", arg: 1, scope: !1002, file: !7, line: 178, type: !982)
!1006 = !DILocation(line: 178, column: 1, scope: !1002)
!1007 = !DILocalVariable(name: "e", scope: !1002, file: !7, line: 178, type: !983)
!1008 = !DILocation(line: 179, column: 17, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1002, file: !7, line: 179, column: 2)
!1010 = !DILocalVariable(name: "err", scope: !1009, file: !7, line: 179, type: !8)
!1011 = !DILocation(line: 179, column: 5, scope: !1002)
!1012 = !DILocation(line: 179, column: 31, scope: !1009)
!1013 = !DILocalVariable(name: "$ret14", scope: !1002, file: !7, line: 178, type: !162)
!1014 = !DILocation(line: 178, column: 27, scope: !1002)
!1015 = !DILocalVariable(name: "$ret15", scope: !1002, file: !7, line: 178, type: !8)
!1016 = !DILocation(line: 178, column: 38, scope: !1002)
!1017 = !DILocation(line: 180, column: 3, scope: !1009)
!1018 = !DILocation(line: 182, column: 14, scope: !1002)
!1019 = !DILocation(line: 182, column: 2, scope: !1002)
!1020 = distinct !DISubprogram(name: "pie.StderrPipe..stub.command_line_arguments.execCmd", linkageName: "command_line_arguments.execCmd.StderrPipe..stub", scope: null, file: !7, line: 9, type: !1021, isLocal: false, isDefinition: true, scopeLine: 9, isOptimized: false, unit: !1, retainedNodes: !3)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!260, !982, !982}
!1023 = !DILocalVariable(name: "$this20.pointer", arg: 1, scope: !1020, file: !7, line: 9, type: !982)
!1024 = !DILocation(line: 9, column: 9, scope: !1020)
!1025 = !DILocalVariable(name: "$this20", scope: !1020, file: !7, line: 9, type: !983)
!1026 = !DILocation(line: 174, column: 6, scope: !1020)
!1027 = distinct !DISubprogram(name: "pie.StdinPipe..stub.command_line_arguments.execCmd", linkageName: "command_line_arguments.execCmd.StdinPipe..stub", scope: null, file: !7, line: 9, type: !1028, isLocal: false, isDefinition: true, scopeLine: 9, isOptimized: false, unit: !1, retainedNodes: !3)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!236, !982, !982}
!1030 = !DILocalVariable(name: "$this30.pointer", arg: 1, scope: !1027, file: !7, line: 9, type: !982)
!1031 = !DILocation(line: 9, column: 9, scope: !1027)
!1032 = !DILocalVariable(name: "$this30", scope: !1027, file: !7, line: 9, type: !983)
!1033 = !DILocation(line: 174, column: 6, scope: !1027)
!1034 = distinct !DISubprogram(name: "pie.StdoutPipe..stub.command_line_arguments.execCmd", linkageName: "command_line_arguments.execCmd.StdoutPipe..stub", scope: null, file: !7, line: 9, type: !1021, isLocal: false, isDefinition: true, scopeLine: 9, isOptimized: false, unit: !1, retainedNodes: !3)
!1035 = !DILocalVariable(name: "$this21.pointer", arg: 1, scope: !1034, file: !7, line: 9, type: !982)
!1036 = !DILocation(line: 9, column: 9, scope: !1034)
!1037 = !DILocalVariable(name: "$this21", scope: !1034, file: !7, line: 9, type: !983)
!1038 = !DILocation(line: 174, column: 6, scope: !1034)
!1039 = distinct !DISubprogram(name: "pie.Wait..stub.command_line_arguments.execCmd", linkageName: "command_line_arguments.execCmd.Wait..stub", scope: null, file: !7, line: 9, type: !996, isLocal: false, isDefinition: true, scopeLine: 9, isOptimized: false, unit: !1, retainedNodes: !3)
!1040 = !DILocalVariable(name: "$this27.pointer", arg: 1, scope: !1039, file: !7, line: 9, type: !982)
!1041 = !DILocation(line: 9, column: 9, scope: !1039)
!1042 = !DILocalVariable(name: "$this27", scope: !1039, file: !7, line: 9, type: !983)
!1043 = !DILocation(line: 174, column: 6, scope: !1039)
!1044 = distinct !DISubprogram(name: "pie.os_exec.argv..stub.command_line_arguments.execCmd", linkageName: "command_line_arguments.execCmd.os_exec.argv..stub", scope: null, file: !7, line: 9, type: !1045, isLocal: false, isDefinition: true, scopeLine: 9, isOptimized: false, unit: !1, retainedNodes: !3)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!279, !982, !982}
!1047 = !DILocalVariable(name: "$this25.pointer", arg: 1, scope: !1044, file: !7, line: 9, type: !982)
!1048 = !DILocation(line: 9, column: 9, scope: !1044)
!1049 = !DILocalVariable(name: "$this25", scope: !1044, file: !7, line: 9, type: !983)
!1050 = !DILocation(line: 174, column: 6, scope: !1044)
!1051 = distinct !DISubprogram(name: "pie.os_exec.closeDescriptors..stub.command_line_arguments.execCmd", linkageName: "command_line_arguments.execCmd.os_exec.closeDescriptors..stub", scope: null, file: !7, line: 9, type: !1052, isLocal: false, isDefinition: true, scopeLine: 9, isOptimized: false, unit: !1, retainedNodes: !3)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!38, !982, !982, !943}
!1054 = !DILocalVariable(name: "$p23", arg: 2, scope: !1051, file: !7, line: 9, type: !943)
!1055 = !DILocation(line: 9, column: 9, scope: !1051)
!1056 = !DILocalVariable(name: "$this22.pointer", arg: 1, scope: !1051, file: !7, line: 9, type: !982)
!1057 = !DILocalVariable(name: "$this22", scope: !1051, file: !7, line: 9, type: !983)
!1058 = !DILocation(line: 174, column: 6, scope: !1051)
!1059 = distinct !DISubprogram(name: "pie.os_exec.envv..stub.command_line_arguments.execCmd", linkageName: "command_line_arguments.execCmd.os_exec.envv..stub", scope: null, file: !7, line: 9, type: !1045, isLocal: false, isDefinition: true, scopeLine: 9, isOptimized: false, unit: !1, retainedNodes: !3)
!1060 = !DILocalVariable(name: "$this19.pointer", arg: 1, scope: !1059, file: !7, line: 9, type: !982)
!1061 = !DILocation(line: 9, column: 9, scope: !1059)
!1062 = !DILocalVariable(name: "$this19", scope: !1059, file: !7, line: 9, type: !983)
!1063 = !DILocation(line: 174, column: 6, scope: !1059)
!1064 = distinct !DISubprogram(name: "pie.os_exec.stderr..stub.command_line_arguments.execCmd", linkageName: "command_line_arguments.execCmd.os_exec.stderr..stub", scope: null, file: !7, line: 9, type: !1065, isLocal: false, isDefinition: true, scopeLine: 9, isOptimized: false, unit: !1, retainedNodes: !3)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!1067, !982, !982}
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*File,error}", file: !14, size: 192, align: 8, elements: !1068)
!1068 = !{!1069, !1070}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 9, baseType: !85, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 9, baseType: !8, size: 128, align: 64, offset: 64)
!1071 = !DILocalVariable(name: "$this18.pointer", arg: 1, scope: !1064, file: !7, line: 9, type: !982)
!1072 = !DILocation(line: 9, column: 9, scope: !1064)
!1073 = !DILocalVariable(name: "$this18", scope: !1064, file: !7, line: 9, type: !983)
!1074 = !DILocalVariable(name: "$ret27", scope: !1064, file: !7, line: 9, type: !85)
!1075 = !DILocation(line: 174, column: 6, scope: !1064)
!1076 = distinct !DISubprogram(name: "pie.os_exec.stdin..stub.command_line_arguments.execCmd", linkageName: "command_line_arguments.execCmd.os_exec.stdin..stub", scope: null, file: !7, line: 9, type: !1065, isLocal: false, isDefinition: true, scopeLine: 9, isOptimized: false, unit: !1, retainedNodes: !3)
!1077 = !DILocalVariable(name: "$this32.pointer", arg: 1, scope: !1076, file: !7, line: 9, type: !982)
!1078 = !DILocation(line: 9, column: 9, scope: !1076)
!1079 = !DILocalVariable(name: "$this32", scope: !1076, file: !7, line: 9, type: !983)
