; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22command\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fuse\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bazil.org/fuse\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bazil.org/fuse\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22eval\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/ChrisRx/dungeonfs/pkg/eval\22"
module asm "\09.ascii \22 \5C\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./mount.go", directory: "/home/wangcong/go_path/src/github.com/ChrisRx/dungeonfs/cmd/dungeonfs/command")
!3 = !{}
!4 = !{!5, !9, !90, !95, !100, !105}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "github_com_ChrisRx_dungeonfs_pkg_game_fs_core.PkgLogger", linkageName: "github_com_ChrisRx_dungeonfs_pkg_game_fs_core.PkgLogger", scope: !1, file: !11, line: 18, type: !12, isLocal: false, isDefinition: true)
!11 = !DIFile(filename: "mount.go", directory: ".")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: ".github.com/ChrisRx/dungeonfs/pkg/game/fs/core.logger", file: !11, line: 18, size: 128, align: 8, elements: !13)
!13 = !{!14, !89}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 18, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*DecodeHookFunc,int,int})void}", file: !17, size: 128, align: 8, elements: !18)
!17 = !DIFile(filename: "", directory: "")
!18 = !{!19, !78}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 18, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !22)
!22 = !{!23, !25, !26, !27, !29, !30, !31, !41, !50, !52, !59, !77}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !24, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 160)
!28 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 168)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 176)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !32, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !34)
!34 = !{!35}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!24, !39, !24}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIBasicType(name: "void")
!41 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !42, size: 64, align: 64, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !44)
!44 = !{!45}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !39, !39}
!49 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !51, size: 64, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !53, size: 64, align: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !55)
!55 = !{!56, !57}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !51, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !60, size: 64, align: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !62)
!62 = !{!63, !64, !65}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !53, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !53, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !66, size: 192, align: 64, offset: 128)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !17, size: 192, align: 8, elements: !67)
!67 = !{!68, !75, !76}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !71)
!71 = !{!63, !64, !72, !73, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !17, line: 1, baseType: !58, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !17, line: 1, baseType: !58, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Printf", file: !17, line: 18, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!40, !39, !54, !82}
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*DecodeHookFunc,int,int}", file: !17, size: 192, align: 8, elements: !83)
!83 = !{!84, !75, !76}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeHookFunc", file: !11, line: 12, size: 128, align: 8, elements: !87)
!87 = !{!88, !89}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 1, baseType: !20, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !11, line: 1, baseType: !39, size: 64, align: 64, offset: 64)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "github_com_ChrisRx_dungeonfs_pkg_game_engine.PkgLogger", linkageName: "github_com_ChrisRx_dungeonfs_pkg_game_engine.PkgLogger", scope: !1, file: !11, line: 17, type: !92, isLocal: false, isDefinition: true)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: ".github.com/ChrisRx/dungeonfs/pkg/game/engine.logger", file: !11, line: 17, size: 128, align: 8, elements: !93)
!93 = !{!94, !89}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 17, baseType: !15, size: 64, align: 64)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "github_com_ChrisRx_dungeonfs_pkg_game_assets.PkgLogger", linkageName: "github_com_ChrisRx_dungeonfs_pkg_game_assets.PkgLogger", scope: !1, file: !11, line: 16, type: !97, isLocal: false, isDefinition: true)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: ".github.com/ChrisRx/dungeonfs/pkg/game/assets.logger", file: !11, line: 16, size: 128, align: 8, elements: !98)
!98 = !{!99, !89}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 16, baseType: !15, size: 64, align: 64)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "github_com_ChrisRx_dungeonfs_pkg_eval.PkgLogger", linkageName: "github_com_ChrisRx_dungeonfs_pkg_eval.PkgLogger", scope: !1, file: !11, line: 15, type: !102, isLocal: false, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: ".github.com/ChrisRx/dungeonfs/pkg/eval.logger", file: !11, line: 15, size: 128, align: 8, elements: !103)
!103 = !{!104, !89}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 15, baseType: !15, size: 64, align: 64)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "github_com_ChrisRx_dungeonfs_pkg_game_fs_core.GameEngine", linkageName: "github_com_ChrisRx_dungeonfs_pkg_game_fs_core.GameEngine", scope: !1, file: !11, line: 18, type: !107, isLocal: false, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "Engine", file: !11, line: 18, size: 128, align: 8, elements: !108)
!108 = !{!109, !89}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 18, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Node)error,*func(*void,ActionType,string,Node)Node,*func(*void,Node)struct{struct{*Dirent,int,int},error}}", file: !17, size: 256, align: 8, elements: !112)
!112 = !{!19, !113, !132, !137}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Access", file: !17, line: 18, baseType: !114, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!117, !39, !129}
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !118)
!118 = !{!119, !128}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !17, size: 128, align: 8, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 1, baseType: !20, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !17, line: 1, baseType: !125, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!54, !39}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !11, line: 16, size: 128, align: 8, elements: !130)
!130 = !{!131, !89}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 16, baseType: !39, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Actions", file: !17, line: 18, baseType: !133, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!129, !39, !136, !54, !129}
!136 = !DIBasicType(name: "ActionType", size: 64, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Entities", file: !17, line: 18, baseType: !138, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!141, !39, !129}
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*Dirent,int,int},error}", file: !17, size: 320, align: 8, elements: !142)
!142 = !{!143, !155}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 18, baseType: !144, size: 192, align: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Dirent,int,int}", file: !17, size: 192, align: 8, elements: !145)
!145 = !{!146, !75, !76}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dirent", file: !11, line: 10, size: 256, align: 8, elements: !149)
!149 = !{!150, !152, !154}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Inode", file: !11, line: 10, baseType: !151, size: 64, align: 64)
!151 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !11, line: 10, baseType: !153, size: 32, align: 32, offset: 64)
!153 = !DIBasicType(name: "DirentType", size: 32, encoding: DW_ATE_unsigned)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !11, line: 10, baseType: !54, size: 128, align: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 18, baseType: !117, size: 128, align: 64, offset: 192)
!156 = distinct !DISubprogram(name: "command.NewMountCommand", linkageName: "command_line_arguments.NewMountCommand", scope: null, file: !11, line: 22, type: !157, isLocal: false, isDefinition: true, scopeLine: 22, isOptimized: false, unit: !1, retainedNodes: !3)
!157 = !DISubroutineType(types: !158)
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "Command", file: !11, line: 11, size: 4800, align: 8, elements: !161)
!161 = !{!162, !163, !167, !168, !169, !170, !171, !172, !180, !181, !182, !183, !184, !198, !199, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !228, !232, !233, !234, !235, !236, !237, !242, !243, !258, !361, !362, !363, !364, !365, !366, !367, !375, !376, !384, !385, !386, !387}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Use", file: !11, line: 11, baseType: !54, size: 128, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Aliases", file: !11, line: 11, baseType: !164, size: 192, align: 64, offset: 128)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !17, size: 192, align: 8, elements: !165)
!165 = !{!166, !75, !76}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !53, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "SuggestFor", file: !11, line: 11, baseType: !164, size: 192, align: 64, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Short", file: !11, line: 11, baseType: !54, size: 128, align: 64, offset: 512)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Long", file: !11, line: 11, baseType: !54, size: 128, align: 64, offset: 640)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Example", file: !11, line: 11, baseType: !54, size: 128, align: 64, offset: 768)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ValidArgs", file: !11, line: 11, baseType: !164, size: 192, align: 64, offset: 896)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Args", file: !11, line: 11, baseType: !173, size: 64, align: 64, offset: 1088)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !11, line: 11, size: 64, align: 8, elements: !175)
!175 = !{!176}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !11, line: 11, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!117, !39, !164}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ArgAliases", file: !11, line: 11, baseType: !164, size: 192, align: 64, offset: 1152)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "BashCompletionFunction", file: !11, line: 11, baseType: !54, size: 128, align: 64, offset: 1344)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Deprecated", file: !11, line: 11, baseType: !54, size: 128, align: 64, offset: 1472)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Hidden", file: !11, line: 11, baseType: !49, size: 8, align: 8, offset: 1600)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Annotations", file: !11, line: 11, baseType: !185, size: 64, align: 64, offset: 1664)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !187)
!187 = !{!188, !189, !190, !191, !193, !194, !195, !196, !197}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !58, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 72)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !192, size: 16, align: 16, offset: 80)
!192 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !24, size: 64, align: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !11, line: 11, baseType: !54, size: 128, align: 64, offset: 1728)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "PersistentPreRun", file: !11, line: 11, baseType: !200, size: 64, align: 64, offset: 1856)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !11, line: 11, size: 64, align: 8, elements: !202)
!202 = !{!203}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !11, line: 11, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!40, !39, !164}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "PersistentPreRunE", file: !11, line: 11, baseType: !173, size: 64, align: 64, offset: 1920)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "PreRun", file: !11, line: 11, baseType: !200, size: 64, align: 64, offset: 1984)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "PreRunE", file: !11, line: 11, baseType: !173, size: 64, align: 64, offset: 2048)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Run", file: !11, line: 11, baseType: !200, size: 64, align: 64, offset: 2112)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "RunE", file: !11, line: 11, baseType: !173, size: 64, align: 64, offset: 2176)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "PostRun", file: !11, line: 11, baseType: !200, size: 64, align: 64, offset: 2240)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "PostRunE", file: !11, line: 11, baseType: !173, size: 64, align: 64, offset: 2304)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "PersistentPostRun", file: !11, line: 11, baseType: !200, size: 64, align: 64, offset: 2368)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "PersistentPostRunE", file: !11, line: 11, baseType: !173, size: 64, align: 64, offset: 2432)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "SilenceErrors", file: !11, line: 11, baseType: !49, size: 8, align: 8, offset: 2496)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "SilenceUsage", file: !11, line: 11, baseType: !49, size: 8, align: 8, offset: 2504)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "DisableFlagParsing", file: !11, line: 11, baseType: !49, size: 8, align: 8, offset: 2512)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "DisableAutoGenTag", file: !11, line: 11, baseType: !49, size: 8, align: 8, offset: 2520)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "DisableFlagsInUseLine", file: !11, line: 11, baseType: !49, size: 8, align: 8, offset: 2528)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "DisableSuggestions", file: !11, line: 11, baseType: !49, size: 8, align: 8, offset: 2536)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "SuggestionsMinimumDistance", file: !11, line: 11, baseType: !58, size: 64, align: 64, offset: 2560)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "TraverseChildren", file: !11, line: 11, baseType: !49, size: 8, align: 8, offset: 2624)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "FParseErrWhitelist", file: !11, line: 11, baseType: !225, size: 8, align: 8, offset: 2632)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "FParseErrWhitelist", file: !11, line: 11, size: 8, align: 8, elements: !226)
!226 = !{!227}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownFlags", file: !11, line: 11, baseType: !49, size: 8, align: 8)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "commands", file: !11, line: 11, baseType: !229, size: 192, align: 64, offset: 2688)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Command,int,int}", file: !17, size: 192, align: 8, elements: !230)
!230 = !{!231, !75, !76}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !39, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !11, line: 11, baseType: !39, size: 64, align: 64, offset: 2880)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "commandsMaxUseLen", file: !11, line: 11, baseType: !58, size: 64, align: 64, offset: 2944)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "commandsMaxCommandPathLen", file: !11, line: 11, baseType: !58, size: 64, align: 64, offset: 3008)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "commandsMaxNameLen", file: !11, line: 11, baseType: !58, size: 64, align: 64, offset: 3072)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "commandsAreSorted", file: !11, line: 11, baseType: !49, size: 8, align: 8, offset: 3136)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "commandCalledAs", file: !11, line: 11, baseType: !238, size: 192, align: 64, offset: 3200)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,bool}", file: !17, size: 192, align: 8, elements: !239)
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !17, line: 11, baseType: !54, size: 128, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "called", file: !17, line: 11, baseType: !49, size: 8, align: 8, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "args", file: !11, line: 11, baseType: !164, size: 192, align: 64, offset: 3392)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "flagErrorBuf", file: !11, line: 11, baseType: !244, size: 64, align: 64, offset: 3584)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", file: !11, line: 11, size: 832, align: 8, elements: !246)
!246 = !{!247, !251, !252, !256}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !11, line: 11, baseType: !248, size: 192, align: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !17, size: 192, align: 8, elements: !249)
!249 = !{!250, !75, !76}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !51, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "off", file: !11, line: 11, baseType: !58, size: 64, align: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "bootstrap", file: !11, line: 11, baseType: !253, size: 512, align: 8, offset: 256)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 512, align: 1, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "lastRead", file: !11, line: 11, baseType: !257, size: 8, align: 8, offset: 768)
!257 = !DIBasicType(name: ".bytes.readOp", size: 8, encoding: DW_ATE_signed)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !11, line: 11, baseType: !259, size: 64, align: 64, offset: 3648)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "FlagSet", file: !11, line: 11, size: 2048, align: 8, elements: !261)
!261 = !{!262, !270, !271, !273, !274, !275, !276, !308, !309, !310, !311, !312, !313, !314, !315, !317, !333, !334, !346}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Usage", file: !11, line: 11, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !11, line: 11, size: 64, align: 8, elements: !265)
!265 = !{!266}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !11, line: 11, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!40}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "SortFlags", file: !11, line: 11, baseType: !49, size: 8, align: 8, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ParseErrorsWhitelist", file: !11, line: 11, baseType: !272, size: 8, align: 8, offset: 72)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParseErrorsWhitelist", file: !11, line: 11, size: 8, align: 8, elements: !226)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !11, line: 11, baseType: !54, size: 128, align: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "parsed", file: !11, line: 11, baseType: !49, size: 8, align: 8, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "actual", file: !11, line: 11, baseType: !185, size: 64, align: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "orderedActual", file: !11, line: 11, baseType: !277, size: 192, align: 64, offset: 384)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Flag,int,int}", file: !17, size: 192, align: 8, elements: !278)
!278 = !{!279, !75, !76}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", file: !11, line: 11, size: 1216, align: 8, elements: !283)
!283 = !{!284, !285, !286, !287, !301, !302, !303, !304, !305, !306, !307}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !11, line: 11, baseType: !54, size: 128, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Shorthand", file: !11, line: 11, baseType: !54, size: 128, align: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Usage", file: !11, line: 11, baseType: !54, size: 128, align: 64, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !11, line: 11, baseType: !288, size: 128, align: 64, offset: 384)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !11, line: 11, size: 128, align: 8, elements: !289)
!289 = !{!290, !89}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 11, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)error,*func(*void)string,*func(*void)string}", file: !17, size: 256, align: 8, elements: !293)
!293 = !{!294, !295, !299, !300}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 11, baseType: !20, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Set", file: !17, line: 11, baseType: !296, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!117, !39, !54}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !17, line: 11, baseType: !125, size: 64, align: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !17, line: 11, baseType: !125, size: 64, align: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "DefValue", file: !11, line: 11, baseType: !54, size: 128, align: 64, offset: 512)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Changed", file: !11, line: 11, baseType: !49, size: 8, align: 8, offset: 640)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "NoOptDefVal", file: !11, line: 11, baseType: !54, size: 128, align: 64, offset: 704)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Deprecated", file: !11, line: 11, baseType: !54, size: 128, align: 64, offset: 832)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Hidden", file: !11, line: 11, baseType: !49, size: 8, align: 8, offset: 960)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ShorthandDeprecated", file: !11, line: 11, baseType: !54, size: 128, align: 64, offset: 1024)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Annotations", file: !11, line: 11, baseType: !185, size: 64, align: 64, offset: 1152)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "sortedActual", file: !11, line: 11, baseType: !277, size: 192, align: 64, offset: 576)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "formal", file: !11, line: 11, baseType: !185, size: 64, align: 64, offset: 768)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "orderedFormal", file: !11, line: 11, baseType: !277, size: 192, align: 64, offset: 832)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "sortedFormal", file: !11, line: 11, baseType: !277, size: 192, align: 64, offset: 1024)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "shorthands", file: !11, line: 11, baseType: !185, size: 64, align: 64, offset: 1216)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "args", file: !11, line: 11, baseType: !164, size: 192, align: 64, offset: 1280)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "argsLenAtDash", file: !11, line: 11, baseType: !58, size: 64, align: 64, offset: 1472)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "errorHandling", file: !11, line: 11, baseType: !316, size: 64, align: 64, offset: 1536)
!316 = !DIBasicType(name: "ErrorHandling", size: 64, encoding: DW_ATE_signed)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "output", file: !11, line: 11, baseType: !318, size: 128, align: 64, offset: 1600)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !11, line: 4, size: 128, align: 8, elements: !319)
!319 = !{!320, !89}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 4, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !17, size: 128, align: 8, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 4, baseType: !20, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !17, line: 4, baseType: !326, size: 64, align: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!329, !39, !248}
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !17, size: 192, align: 8, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !17, line: 4, baseType: !58, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !17, line: 4, baseType: !117, size: 128, align: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "interspersed", file: !11, line: 11, baseType: !49, size: 8, align: 8, offset: 1728)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "normalizeNameFunc", file: !11, line: 11, baseType: !335, size: 64, align: 64, offset: 1792)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !11, line: 11, size: 64, align: 8, elements: !337)
!337 = !{!338}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !11, line: 11, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!342, !39, !54}
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "NormalizedName", file: !11, line: 11, size: 128, align: 8, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !11, line: 1, baseType: !51, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !11, line: 1, baseType: !58, size: 64, align: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "addedGoFlagSets", file: !11, line: 11, baseType: !347, size: 192, align: 64, offset: 1856)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**FlagSet,int,int}", file: !17, size: 192, align: 8, elements: !348)
!348 = !{!349, !75, !76}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "FlagSet", file: !11, line: 11, size: 768, align: 8, elements: !353)
!353 = !{!262, !354, !355, !356, !357, !358, !359, !360}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !11, line: 11, baseType: !54, size: 128, align: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "parsed", file: !11, line: 11, baseType: !49, size: 8, align: 8, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "actual", file: !11, line: 11, baseType: !185, size: 64, align: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "formal", file: !11, line: 11, baseType: !185, size: 64, align: 64, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "args", file: !11, line: 11, baseType: !164, size: 192, align: 64, offset: 384)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "errorHandling", file: !11, line: 11, baseType: !316, size: 64, align: 64, offset: 576)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "output", file: !11, line: 11, baseType: !318, size: 128, align: 64, offset: 640)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pflags", file: !11, line: 11, baseType: !259, size: 64, align: 64, offset: 3712)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "lflags", file: !11, line: 11, baseType: !259, size: 64, align: 64, offset: 3776)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "iflags", file: !11, line: 11, baseType: !259, size: 64, align: 64, offset: 3840)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "parentsPflags", file: !11, line: 11, baseType: !259, size: 64, align: 64, offset: 3904)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "globNormFunc", file: !11, line: 11, baseType: !335, size: 64, align: 64, offset: 3968)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "output", file: !11, line: 11, baseType: !318, size: 128, align: 64, offset: 4032)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "usageFunc", file: !11, line: 11, baseType: !368, size: 64, align: 64, offset: 4160)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !11, line: 11, size: 64, align: 8, elements: !370)
!370 = !{!371}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !11, line: 11, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!117, !39}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "usageTemplate", file: !11, line: 11, baseType: !54, size: 128, align: 64, offset: 4224)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "flagErrorFunc", file: !11, line: 11, baseType: !377, size: 64, align: 64, offset: 4352)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !11, line: 11, size: 64, align: 8, elements: !379)
!379 = !{!380}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !11, line: 11, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!117, !39, !117}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "helpTemplate", file: !11, line: 11, baseType: !54, size: 128, align: 64, offset: 4416)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "helpFunc", file: !11, line: 11, baseType: !200, size: 64, align: 64, offset: 4544)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "helpCommand", file: !11, line: 11, baseType: !39, size: 64, align: 64, offset: 4608)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "versionTemplate", file: !11, line: 11, baseType: !54, size: 128, align: 64, offset: 4672)
!388 = !DILocalVariable(name: "$ret0", scope: !156, file: !11, line: 22, type: !159)
!389 = !DILocation(line: 22, column: 24, scope: !156)
!390 = !DILocation(line: 23, column: 8, scope: !391)
!391 = distinct !DILexicalBlock(scope: !156, file: !11, line: 22, column: 1)
!392 = !DILocation(line: 23, column: 15, scope: !391)
!393 = !DILocalVariable(name: "sc", scope: !391, file: !11, line: 23, type: !159)
!394 = !DILocation(line: 23, column: 2, scope: !156)
!395 = !DILocation(line: 27, column: 4, scope: !391)
!396 = !DILocation(line: 27, column: 12, scope: !391)
!397 = !DILocation(line: 28, column: 4, scope: !391)
!398 = !DILocation(line: 28, column: 12, scope: !391)
!399 = !DILocation(line: 29, column: 4, scope: !391)
!400 = !DILocation(line: 29, column: 12, scope: !391)
!401 = !DILocation(line: 30, column: 21, scope: !391)
!402 = !DILocation(line: 30, column: 8, scope: !391)
!403 = !DILocation(line: 31, column: 2, scope: !391)
!404 = distinct !DISubprogram(name: "command.runMountCommand", scope: null, file: !11, line: 34, type: !205, isLocal: true, isDefinition: true, scopeLine: 34, isOptimized: false, unit: !1, retainedNodes: !3)
!405 = !DILocalVariable(name: "args", arg: 2, scope: !404, file: !11, line: 34, type: !164)
!406 = !DILocation(line: 34, column: 42, scope: !404)
!407 = !DILocalVariable(name: "cmd", arg: 1, scope: !404, file: !11, line: 34, type: !159)
!408 = !DILocation(line: 34, column: 22, scope: !404)
!409 = !DILocation(line: 35, column: 9, scope: !410)
!410 = distinct !DILexicalBlock(scope: !404, file: !11, line: 34, column: 1)
!411 = !DILocation(line: 35, column: 15, scope: !410)
!412 = !DILocation(line: 36, column: 7, scope: !410)
!413 = !DILocation(line: 38, column: 29, scope: !414)
!414 = distinct !DILexicalBlock(scope: !410, file: !11, line: 38, column: 2)
!415 = !DILocation(line: 38, column: 18, scope: !414)
!416 = !DILocalVariable(name: "err", scope: !414, file: !11, line: 38, type: !117)
!417 = !DILocation(line: 38, column: 5, scope: !410)
!418 = !DILocation(line: 38, column: 54, scope: !414)
!419 = !DILocation(line: 38, column: 2, scope: !414)
!420 = !DILocation(line: 39, column: 7, scope: !414)
!421 = !DILocation(line: 41, column: 27, scope: !422)
!422 = distinct !DILexicalBlock(scope: !410, file: !11, line: 41, column: 2)
!423 = !DILocation(line: 41, column: 23, scope: !422)
!424 = !DILocation(line: 41, column: 18, scope: !422)
!425 = !DILocalVariable(name: "err", scope: !422, file: !11, line: 41, type: !117)
!426 = !DILocation(line: 41, column: 5, scope: !410)
!427 = !DILocation(line: 41, column: 36, scope: !422)
!428 = !DILocation(line: 41, column: 2, scope: !422)
!429 = !DILocation(line: 44, column: 11, scope: !410)
!430 = !DILocation(line: 44, column: 2, scope: !410)
!431 = !DILocation(line: 42, column: 6, scope: !422)
!432 = !DILocation(line: 64, column: 11, scope: !410)
!433 = !DILocation(line: 64, column: 27, scope: !410)
!434 = !DILocation(line: 49, column: 10, scope: !435)
!435 = distinct !DILexicalBlock(scope: !410, file: !11, line: 44, column: 29)
!436 = !DILocation(line: 45, column: 11, scope: !435)
!437 = !DILocation(line: 51, column: 12, scope: !435)
!438 = !DILocation(line: 51, column: 3, scope: !435)
!439 = !DILocation(line: 52, column: 11, scope: !435)
!440 = !DILocation(line: 54, column: 21, scope: !435)
!441 = !DILocalVariable(name: "exe", scope: !435, file: !11, line: 54, type: !54)
!442 = !DILocation(line: 54, column: 3, scope: !410)
!443 = !DILocalVariable(name: "err", scope: !435, file: !11, line: 54, type: !117)
!444 = !DILocation(line: 55, column: 10, scope: !435)
!445 = !DILocation(line: 52, column: 9, scope: !435)
!446 = !DILocation(line: 56, column: 8, scope: !435)
!447 = !DILocalVariable(name: "opts", scope: !435, file: !11, line: 45, type: !164)
!448 = !DILocation(line: 45, column: 3, scope: !410)
!449 = !DILocation(line: 58, column: 15, scope: !435)
!450 = !DILocalVariable(name: "cmd", scope: !435, file: !11, line: 58, type: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cmd", file: !11, line: 8, size: 2624, align: 8, elements: !453)
!453 = !{!454, !455, !456, !457, !458, !466, !467, !468, !521, !567, !587, !621, !680, !681, !682, !683, !696, !697, !709, !710}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !11, line: 8, baseType: !54, size: 128, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Args", file: !11, line: 8, baseType: !164, size: 192, align: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Env", file: !11, line: 8, baseType: !164, size: 192, align: 64, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Dir", file: !11, line: 8, baseType: !54, size: 128, align: 64, offset: 512)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Stdin", file: !11, line: 8, baseType: !459, size: 128, align: 64, offset: 640)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !11, line: 4, size: 128, align: 8, elements: !460)
!460 = !{!461, !89}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 4, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !17, size: 128, align: 8, elements: !464)
!464 = !{!324, !465}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !17, line: 4, baseType: !326, size: 64, align: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Stdout", file: !11, line: 8, baseType: !318, size: 128, align: 64, offset: 768)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Stderr", file: !11, line: 8, baseType: !318, size: 128, align: 64, offset: 896)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraFiles", file: !11, line: 8, baseType: !469, size: 192, align: 64, offset: 1024)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**File,int,int}", file: !17, size: 192, align: 8, elements: !470)
!470 = !{!471, !75, !76}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !11, line: 5, size: 64, align: 8, elements: !475)
!475 = !{!476}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !11, line: 5, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !11, line: 5, size: 640, align: 8, elements: !479)
!479 = !{!480, !510, !511, !519, !520}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !11, line: 5, baseType: !481, size: 384, align: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !11, line: 5, size: 384, align: 8, elements: !482)
!482 = !{!483, !489, !490, !494, !505, !506, !507, !508, !509}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !11, line: 5, baseType: !484, size: 128, align: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !11, line: 5, size: 128, align: 8, elements: !485)
!485 = !{!486, !487, !488}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !11, line: 5, baseType: !151, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !11, line: 5, baseType: !8, size: 32, align: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !11, line: 5, baseType: !8, size: 32, align: 32, offset: 96)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !11, line: 5, baseType: !58, size: 64, align: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !11, line: 5, baseType: !491, size: 64, align: 64, offset: 192)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !11, line: 5, size: 64, align: 8, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !11, line: 5, baseType: !24, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !11, line: 5, baseType: !495, size: 64, align: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !17, size: 192, align: 8, elements: !497)
!497 = !{!498, !75, !76}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !11, line: 5, size: 128, align: 8, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !11, line: 5, baseType: !51, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !11, line: 5, baseType: !504, size: 64, align: 64, offset: 64)
!504 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !11, line: 5, baseType: !8, size: 32, align: 32, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 352)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 360)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 368)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 376)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !11, line: 5, baseType: !54, size: 128, align: 64, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !11, line: 5, baseType: !512, size: 64, align: 64, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !11, line: 5, size: 256, align: 8, elements: !514)
!514 = !{!515, !516}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !11, line: 5, baseType: !248, size: 192, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !11, line: 5, baseType: !517, size: 64, align: 64, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !11, line: 5, align: 8, elements: !3)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 584)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "SysProcAttr", file: !11, line: 8, baseType: !522, size: 64, align: 64, offset: 1216)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "SysProcAttr", file: !11, line: 7, size: 1280, align: 8, elements: !524)
!524 = !{!525, !526, !538, !539, !540, !541, !542, !543, !544, !545, !546, !548, !549, !550, !560, !561, !562}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Chroot", file: !11, line: 7, baseType: !54, size: 128, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Credential", file: !11, line: 7, baseType: !527, size: 64, align: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "Credential", file: !11, line: 7, size: 320, align: 8, elements: !529)
!529 = !{!530, !531, !532, !537}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Uid", file: !11, line: 7, baseType: !8, size: 32, align: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Gid", file: !11, line: 7, baseType: !8, size: 32, align: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Groups", file: !11, line: 7, baseType: !533, size: 192, align: 64, offset: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint32,int,int}", file: !17, size: 192, align: 8, elements: !534)
!534 = !{!535, !75, !76}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "NoSetGroups", file: !11, line: 7, baseType: !49, size: 8, align: 8, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Ptrace", file: !11, line: 7, baseType: !49, size: 8, align: 8, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Setsid", file: !11, line: 7, baseType: !49, size: 8, align: 8, offset: 200)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Setpgid", file: !11, line: 7, baseType: !49, size: 8, align: 8, offset: 208)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Setctty", file: !11, line: 7, baseType: !49, size: 8, align: 8, offset: 216)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Noctty", file: !11, line: 7, baseType: !49, size: 8, align: 8, offset: 224)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Ctty", file: !11, line: 7, baseType: !58, size: 64, align: 64, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Foreground", file: !11, line: 7, baseType: !49, size: 8, align: 8, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Pgid", file: !11, line: 7, baseType: !58, size: 64, align: 64, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Pdeathsig", file: !11, line: 7, baseType: !547, size: 64, align: 64, offset: 448)
!547 = !DIBasicType(name: "Signal", size: 64, encoding: DW_ATE_signed)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Cloneflags", file: !11, line: 7, baseType: !24, size: 64, align: 64, offset: 512)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Unshareflags", file: !11, line: 7, baseType: !24, size: 64, align: 64, offset: 576)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "UidMappings", file: !11, line: 7, baseType: !551, size: 192, align: 64, offset: 640)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*SysProcIDMap,int,int}", file: !17, size: 192, align: 8, elements: !552)
!552 = !{!553, !75, !76}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !554, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "SysProcIDMap", file: !11, line: 7, size: 192, align: 8, elements: !556)
!556 = !{!557, !558, !559}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ContainerID", file: !11, line: 7, baseType: !58, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "HostID", file: !11, line: 7, baseType: !58, size: 64, align: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !11, line: 7, baseType: !58, size: 64, align: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "GidMappings", file: !11, line: 7, baseType: !551, size: 192, align: 64, offset: 832)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "GidMappingsEnableSetgroups", file: !11, line: 7, baseType: !49, size: 8, align: 8, offset: 1024)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "AmbientCaps", file: !11, line: 7, baseType: !563, size: 192, align: 64, offset: 1088)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !17, size: 192, align: 8, elements: !564)
!564 = !{!565, !75, !76}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !566, size: 64, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "Process", file: !11, line: 8, baseType: !568, size: 64, align: 64, offset: 1280)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "Process", file: !11, line: 7, size: 384, align: 8, elements: !570)
!570 = !{!571, !572, !573, !574}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Pid", file: !11, line: 7, baseType: !58, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "handle", file: !11, line: 7, baseType: !24, size: 64, align: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "isdone", file: !11, line: 7, baseType: !8, size: 32, align: 32, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "sigMu", file: !11, line: 7, baseType: !575, size: 192, align: 32, offset: 160)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !11, line: 7, size: 192, align: 8, elements: !576)
!576 = !{!577, !583, !584, !585, !586}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !11, line: 7, baseType: !578, size: 64, align: 32)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !11, line: 6, size: 64, align: 8, elements: !579)
!579 = !{!580, !582}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !11, line: 6, baseType: !581, size: 32, align: 32)
!581 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !11, line: 6, baseType: !8, size: 32, align: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !11, line: 7, baseType: !8, size: 32, align: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !11, line: 7, baseType: !8, size: 32, align: 32, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !11, line: 7, baseType: !581, size: 32, align: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !11, line: 7, baseType: !581, size: 32, align: 32, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessState", file: !11, line: 8, baseType: !588, size: 64, align: 64, offset: 1344)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProcessState", file: !11, line: 7, size: 192, align: 8, elements: !590)
!590 = !{!591, !592, !594}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "pid", file: !11, line: 7, baseType: !58, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !11, line: 7, baseType: !593, size: 32, align: 32, offset: 64)
!593 = !DIBasicType(name: "WaitStatus", size: 32, encoding: DW_ATE_unsigned)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "rusage", file: !11, line: 7, baseType: !595, size: 64, align: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rusage", file: !11, line: 7, size: 1152, align: 8, elements: !597)
!597 = !{!598, !605, !606, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Utime", file: !11, line: 7, baseType: !599, size: 128, align: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timeval", file: !11, line: 7, size: 128, align: 8, elements: !600)
!600 = !{!601, !603}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Sec", file: !11, line: 7, baseType: !602, size: 64, align: 64)
!602 = !DIBasicType(name: "Timeval_sec_t", size: 64, encoding: DW_ATE_signed)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Usec", file: !11, line: 7, baseType: !604, size: 64, align: 64, offset: 64)
!604 = !DIBasicType(name: "Timeval_usec_t", size: 64, encoding: DW_ATE_signed)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Stime", file: !11, line: 7, baseType: !599, size: 128, align: 64, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "Maxrss", file: !11, line: 7, baseType: !607, size: 64, align: 64, offset: 256)
!607 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Ixrss", file: !11, line: 7, baseType: !607, size: 64, align: 64, offset: 320)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Idrss", file: !11, line: 7, baseType: !607, size: 64, align: 64, offset: 384)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "Isrss", file: !11, line: 7, baseType: !607, size: 64, align: 64, offset: 448)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "Minflt", file: !11, line: 7, baseType: !607, size: 64, align: 64, offset: 512)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Majflt", file: !11, line: 7, baseType: !607, size: 64, align: 64, offset: 576)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Nswap", file: !11, line: 7, baseType: !607, size: 64, align: 64, offset: 640)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Inblock", file: !11, line: 7, baseType: !607, size: 64, align: 64, offset: 704)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "Oublock", file: !11, line: 7, baseType: !607, size: 64, align: 64, offset: 768)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Msgsnd", file: !11, line: 7, baseType: !607, size: 64, align: 64, offset: 832)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Msgrcv", file: !11, line: 7, baseType: !607, size: 64, align: 64, offset: 896)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Nsignals", file: !11, line: 7, baseType: !607, size: 64, align: 64, offset: 960)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Nvcsw", file: !11, line: 7, baseType: !607, size: 64, align: 64, offset: 1024)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Nivcsw", file: !11, line: 7, baseType: !607, size: 64, align: 64, offset: 1088)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !11, line: 8, baseType: !622, size: 128, align: 64, offset: 1408)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !11, line: 8, size: 128, align: 8, elements: !623)
!623 = !{!624, !89}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 8, baseType: !625, size: 64, align: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,DecodeHookFunc)DecodeHookFunc}", file: !17, size: 320, align: 8, elements: !627)
!627 = !{!628, !629, !669, !675, !676}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 8, baseType: !20, size: 64, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !17, line: 8, baseType: !630, size: 64, align: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!633, !39}
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !17, size: 256, align: 8, elements: !634)
!634 = !{!635, !668}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !17, line: 8, baseType: !636, size: 192, align: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !11, line: 5, size: 192, align: 8, elements: !637)
!637 = !{!638, !639, !640}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !11, line: 5, baseType: !151, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !11, line: 5, baseType: !607, size: 64, align: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !11, line: 5, baseType: !641, size: 64, align: 64, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !11, line: 5, size: 704, align: 8, elements: !643)
!643 = !{!644, !645, !654, !665, !666, !667}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !11, line: 5, baseType: !54, size: 128, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !11, line: 5, baseType: !646, size: 192, align: 64, offset: 128)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !17, size: 192, align: 8, elements: !647)
!647 = !{!648, !75, !76}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !649, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !11, line: 5, size: 256, align: 8, elements: !651)
!651 = !{!644, !652, !653}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !11, line: 5, baseType: !58, size: 64, align: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !11, line: 5, baseType: !655, size: 192, align: 64, offset: 320)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !17, size: 192, align: 8, elements: !656)
!656 = !{!657, !75, !76}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !658, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !11, line: 5, size: 128, align: 8, elements: !660)
!660 = !{!661, !662, !663, !664}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !11, line: 5, baseType: !607, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !11, line: 5, baseType: !28, size: 8, align: 8, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 72)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 80)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !11, line: 5, baseType: !607, size: 64, align: 64, offset: 512)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !11, line: 5, baseType: !607, size: 64, align: 64, offset: 576)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !11, line: 5, baseType: !649, size: 64, align: 64, offset: 640)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !17, line: 8, baseType: !49, size: 8, align: 8, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !17, line: 8, baseType: !670, size: 64, align: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!673, !39}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !7, line: 1, align: 8, elements: !3)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !17, line: 8, baseType: !372, size: 64, align: 64, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !17, line: 8, baseType: !677, size: 64, align: 64, offset: 256)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!86, !39, !86}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "lookPathErr", file: !11, line: 8, baseType: !117, size: 128, align: 64, offset: 1536)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "finished", file: !11, line: 8, baseType: !49, size: 8, align: 8, offset: 1664)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "childFiles", file: !11, line: 8, baseType: !469, size: 192, align: 64, offset: 1728)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "closeAfterStart", file: !11, line: 8, baseType: !684, size: 192, align: 64, offset: 1920)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Closer,int,int}", file: !17, size: 192, align: 8, elements: !685)
!685 = !{!686, !75, !76}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !687, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "Closer", file: !11, line: 5, size: 128, align: 8, elements: !689)
!689 = !{!690, !89}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 5, baseType: !691, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error}", file: !17, size: 128, align: 8, elements: !693)
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 5, baseType: !20, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !17, line: 5, baseType: !372, size: 64, align: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "closeAfterWait", file: !11, line: 8, baseType: !684, size: 192, align: 64, offset: 2112)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "goroutine", file: !11, line: 8, baseType: !698, size: 192, align: 64, offset: 2304)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**__go_descriptor,int,int}", file: !17, size: 192, align: 8, elements: !699)
!699 = !{!700, !75, !76}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !701, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !11, line: 8, size: 64, align: 8, elements: !704)
!704 = !{!705}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !11, line: 8, baseType: !706, size: 64, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!117}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "errch", file: !11, line: 8, baseType: !673, size: 64, align: 64, offset: 2496)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "waitDone", file: !11, line: 8, baseType: !673, size: 64, align: 64, offset: 2560)
!711 = !DILocation(line: 58, column: 3, scope: !410)
!712 = !DILocation(line: 59, column: 6, scope: !435)
!713 = !DILocation(line: 60, column: 33, scope: !435)
!714 = !DILocation(line: 60, column: 41, scope: !435)
!715 = !DILocation(line: 60, column: 14, scope: !435)
!716 = !DILocalVariable(name: "pid", scope: !435, file: !11, line: 60, type: !54)
!717 = !DILocation(line: 60, column: 3, scope: !410)
!718 = !DILocation(line: 61, column: 48, scope: !435)
!719 = !DILocation(line: 61, column: 10, scope: !435)
!720 = !DILocation(line: 62, column: 6, scope: !435)
!721 = !DILocation(line: 65, column: 18, scope: !410)
!722 = !DILocation(line: 65, column: 16, scope: !410)
!723 = !DILocation(line: 72, column: 14, scope: !410)
!724 = !DILocalVariable(name: "r", scope: !410, file: !11, line: 72, type: !725)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "Resources", file: !11, line: 16, size: 192, align: 8, elements: !727)
!727 = !{!728, !729, !730}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "components", file: !11, line: 16, baseType: !185, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "entities", file: !11, line: 16, baseType: !185, size: 64, align: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Level", file: !11, line: 16, baseType: !731, size: 64, align: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "Level", file: !11, line: 16, size: 320, align: 8, elements: !733)
!733 = !{!734, !868, !869, !870}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "root", file: !11, line: 16, baseType: !735, size: 128, align: 64)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entity", file: !11, line: 16, size: 128, align: 8, elements: !736)
!736 = !{!737, !89}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 16, baseType: !738, size: 64, align: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Context,*Attr)error,*func(*void)Nodes,*func(*void)struct{*uint8,int,int},*func(*void)bool,*func(*void)Dirent,*func(*void)bool,*func(*void)bool,*func(*void)NodeMetaData,*func(*void)string,*func(*void,NodeType,string)Node,*func(*void,struct{*Node,int,int})Node,*func(*void,struct{*string,int,int})string}", file: !17, size: 832, align: 8, elements: !740)
!740 = !{!741, !742, !766, !806, !810, !814, !818, !819, !820, !854, !855, !860, !864}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 16, baseType: !20, size: 64, align: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Attr", file: !17, line: 16, baseType: !743, size: 64, align: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!117, !39, !622, !746}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "Attr", file: !11, line: 10, size: 1280, align: 8, elements: !748)
!748 = !{!749, !751, !752, !753, !754, !755, !756, !757, !758, !760, !761, !762, !763, !764, !765}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", file: !11, line: 10, baseType: !750, size: 64, align: 64)
!750 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Inode", file: !11, line: 10, baseType: !151, size: 64, align: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !11, line: 10, baseType: !151, size: 64, align: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Blocks", file: !11, line: 10, baseType: !151, size: 64, align: 64, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Atime", file: !11, line: 10, baseType: !636, size: 192, align: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Mtime", file: !11, line: 10, baseType: !636, size: 192, align: 64, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Ctime", file: !11, line: 10, baseType: !636, size: 192, align: 64, offset: 640)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Crtime", file: !11, line: 10, baseType: !636, size: 192, align: 64, offset: 832)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", file: !11, line: 10, baseType: !759, size: 32, align: 32, offset: 1024)
!759 = !DIBasicType(name: "FileMode", size: 32, encoding: DW_ATE_unsigned)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Nlink", file: !11, line: 10, baseType: !8, size: 32, align: 32, offset: 1056)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Uid", file: !11, line: 10, baseType: !8, size: 32, align: 32, offset: 1088)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "Gid", file: !11, line: 10, baseType: !8, size: 32, align: 32, offset: 1120)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "Rdev", file: !11, line: 10, baseType: !8, size: 32, align: 32, offset: 1152)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !11, line: 10, baseType: !8, size: 32, align: 32, offset: 1184)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "BlockSize", file: !11, line: 10, baseType: !8, size: 32, align: 32, offset: 1216)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Children", file: !17, line: 16, baseType: !767, size: 64, align: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!770, !39}
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "Nodes", file: !11, line: 16, size: 128, align: 8, elements: !771)
!771 = !{!772, !89}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 16, baseType: !773, size: 64, align: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)void,*func(*void)struct{*Node,int,int},*func(*void,string)bool,*func(*void)struct{*Node,int,int},*func(*void,string)struct{Node,bool},*func(*void)struct{*Node,int,int},*func(*void,string,Node)void}", file: !17, size: 512, align: 8, elements: !775)
!775 = !{!741, !776, !780, !788, !792, !793, !801, !802}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Delete", file: !17, line: 16, baseType: !777, size: 64, align: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!40, !39, !54}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "Directories", file: !17, line: 16, baseType: !781, size: 64, align: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!784, !39}
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Node,int,int}", file: !17, size: 192, align: 8, elements: !785)
!785 = !{!786, !75, !76}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !787, size: 64, align: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "Exists", file: !17, line: 16, baseType: !789, size: 64, align: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!49, !39, !54}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Files", file: !17, line: 16, baseType: !781, size: 64, align: 64, offset: 256)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !17, line: 16, baseType: !794, size: 64, align: 64, offset: 320)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!797, !39, !54}
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Node,bool}", file: !17, size: 192, align: 8, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 16, baseType: !129, size: 128, align: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 16, baseType: !49, size: 8, align: 8, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "Iter", file: !17, line: 16, baseType: !781, size: 64, align: 64, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "Set", file: !17, line: 16, baseType: !803, size: 64, align: 64, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!40, !39, !54, !129}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "Content", file: !17, line: 16, baseType: !807, size: 64, align: 64, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!248, !39}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "Delete", file: !17, line: 16, baseType: !811, size: 64, align: 64, offset: 256)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!49, !39}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "Entry", file: !17, line: 16, baseType: !815, size: 64, align: 64, offset: 320)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!148, !39}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "IsDir", file: !17, line: 16, baseType: !811, size: 64, align: 64, offset: 384)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "IsFile", file: !17, line: 16, baseType: !811, size: 64, align: 64, offset: 448)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "MetaData", file: !17, line: 16, baseType: !821, size: 64, align: 64, offset: 512)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!824, !39}
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "NodeMetaData", file: !11, line: 16, size: 128, align: 8, elements: !825)
!825 = !{!826, !89}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 16, baseType: !827, size: 64, align: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)struct{DecodeHookFunc,bool},*func(*void,string)bool,*func(*void,string)struct{*uint8,int,int},*func(*void,string)string,*func(*void)FuncMap,*func(*void,string,DecodeHookFunc)void}", file: !17, size: 448, align: 8, elements: !829)
!829 = !{!741, !830, !837, !838, !842, !846, !850}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !17, line: 16, baseType: !831, size: 64, align: 64, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!834, !39, !54}
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{DecodeHookFunc,bool}", file: !17, size: 192, align: 8, elements: !835)
!835 = !{!836, !800}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 16, baseType: !86, size: 128, align: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "GetBool", file: !17, line: 16, baseType: !789, size: 64, align: 64, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "GetBytes", file: !17, line: 16, baseType: !839, size: 64, align: 64, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!248, !39, !54}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "GetString", file: !17, line: 16, baseType: !843, size: 64, align: 64, offset: 256)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!54, !39, !54}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "Iter", file: !17, line: 16, baseType: !847, size: 64, align: 64, offset: 320)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!185, !39}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "Set", file: !17, line: 16, baseType: !851, size: 64, align: 64, offset: 384)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!40, !39, !54, !86}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !17, line: 16, baseType: !125, size: 64, align: 64, offset: 576)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "New", file: !17, line: 16, baseType: !856, size: 64, align: 64, offset: 640)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!129, !39, !859, !54}
!859 = !DIBasicType(name: "NodeType", size: 64, encoding: DW_ATE_signed)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !17, line: 16, baseType: !861, size: 64, align: 64, offset: 704)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!129, !39, !784}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !17, line: 16, baseType: !865, size: 64, align: 64, offset: 768)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!54, !39, !164}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "objects", file: !11, line: 16, baseType: !185, size: 64, align: 64, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "paths", file: !11, line: 16, baseType: !185, size: 64, align: 64, offset: 192)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "properties", file: !11, line: 16, baseType: !185, size: 64, align: 64, offset: 256)
!871 = !DILocation(line: 72, column: 2, scope: !404)
!872 = !DILocation(line: 73, column: 28, scope: !410)
!873 = !DILocation(line: 73, column: 13, scope: !410)
!874 = !DILocalVariable(name: "d", scope: !410, file: !11, line: 73, type: !875)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "Directory", file: !11, line: 16, size: 640, align: 8, elements: !877)
!877 = !{!878}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "node", file: !11, line: 16, baseType: !879, size: 640, align: 64)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: ".github.com/ChrisRx/dungeonfs/pkg/game/fs/core.node", file: !11, line: 16, size: 640, align: 8, elements: !880)
!880 = !{!881, !882, !883, !884, !885, !886, !887}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "inode", file: !11, line: 16, baseType: !151, size: 64, align: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !11, line: 16, baseType: !54, size: 128, align: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "mode", file: !11, line: 16, baseType: !759, size: 32, align: 32, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "path", file: !11, line: 16, baseType: !54, size: 128, align: 64, offset: 256)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", file: !11, line: 16, baseType: !185, size: 64, align: 64, offset: 384)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !11, line: 16, baseType: !129, size: 128, align: 64, offset: 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", file: !11, line: 16, baseType: !185, size: 64, align: 64, offset: 576)
!888 = !DILocation(line: 73, column: 2, scope: !404)
!889 = !DILocalVariable(name: "err", scope: !410, file: !11, line: 73, type: !117)
!890 = !DILocation(line: 74, column: 9, scope: !410)
!891 = !DILocation(line: 66, column: 22, scope: !410)
!892 = !DILocation(line: 66, column: 20, scope: !410)
!893 = !DILocation(line: 67, column: 22, scope: !410)
!894 = !DILocation(line: 67, column: 20, scope: !410)
!895 = !DILocation(line: 68, column: 12, scope: !410)
!896 = !DILocation(line: 68, column: 28, scope: !410)
!897 = !DILocation(line: 69, column: 21, scope: !410)
!898 = !DILocation(line: 69, column: 19, scope: !410)
!899 = !DILocation(line: 78, column: 25, scope: !410)
!900 = !DILocation(line: 78, column: 16, scope: !410)
!901 = !DILocation(line: 75, column: 13, scope: !410)
!902 = !DILocation(line: 75, column: 7, scope: !410)
!903 = !DILocation(line: 80, column: 15, scope: !410)
!904 = !DILocalVariable(name: "f", scope: !410, file: !11, line: 80, type: !905)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DICompositeType(tag: DW_TAG_structure_type, name: "FS", file: !11, line: 18, size: 64, align: 8, elements: !907)
!907 = !{!908}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "root", file: !11, line: 18, baseType: !875, size: 64, align: 64)
!909 = !DILocation(line: 80, column: 2, scope: !404)
!910 = !DILocation(line: 81, column: 9, scope: !410)
!911 = !DILocation(line: 82, column: 13, scope: !410)
!912 = !DILocation(line: 82, column: 7, scope: !410)
!913 = !DILocation(line: 84, column: 12, scope: !410)
!914 = !DILocation(line: 84, column: 48, scope: !410)
!915 = !DILocalVariable(name: "ok", scope: !916, file: !11, line: 85, type: !49)
!916 = distinct !DILexicalBlock(scope: !410, file: !11, line: 85, column: 3)
!917 = !DILocation(line: 85, column: 6, scope: !410)
!918 = !DILocation(line: 85, column: 6, scope: !916)
!919 = !DILocation(line: 85, column: 56, scope: !916)
!920 = !DILocation(line: 86, column: 16, scope: !921)
!921 = distinct !DILexicalBlock(scope: !916, file: !11, line: 85, column: 60)
!922 = !DILocalVariable(name: "err", scope: !921, file: !11, line: 86, type: !117)
!923 = !DILocation(line: 86, column: 4, scope: !916)
!924 = !DILocation(line: 87, column: 11, scope: !921)
!925 = !DILocation(line: 88, column: 15, scope: !921)
!926 = !DILocation(line: 88, column: 9, scope: !921)
!927 = !DILocation(line: 90, column: 44, scope: !921)
!928 = !DILocation(line: 90, column: 14, scope: !921)
!929 = !DILocation(line: 90, column: 70, scope: !921)
!930 = !DILocation(line: 91, column: 15, scope: !921)
!931 = !DILocation(line: 91, column: 9, scope: !921)
!932 = !DILocation(line: 94, column: 14, scope: !916)
!933 = !DILocation(line: 94, column: 8, scope: !916)
!934 = distinct !DISubprogram(name: "command.NewUnmountCommand", linkageName: "command_line_arguments.NewUnmountCommand", scope: null, file: !935, line: 16, type: !157, isLocal: false, isDefinition: true, scopeLine: 16, isOptimized: false, unit: !1, retainedNodes: !3)
!935 = !DIFile(filename: "unmount.go", directory: ".")
!936 = !DILocalVariable(name: "$ret1", scope: !934, file: !935, line: 16, type: !159)
!937 = !DILocation(line: 16, column: 26, scope: !934)
!938 = !DILocation(line: 17, column: 8, scope: !939)
!939 = distinct !DILexicalBlock(scope: !934, file: !935, line: 16, column: 1)
!940 = !DILocation(line: 17, column: 15, scope: !939)
!941 = !DILocalVariable(name: "sc", scope: !939, file: !935, line: 17, type: !159)
!942 = !DILocation(line: 17, column: 2, scope: !934)
!943 = !DILocation(line: 23, column: 21, scope: !939)
!944 = !DILocation(line: 23, column: 8, scope: !939)
!945 = !DILocation(line: 24, column: 2, scope: !939)
!946 = distinct !DISubprogram(name: "command.runUnmountCommand", scope: null, file: !935, line: 27, type: !205, isLocal: true, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
