; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22command\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/ChrisRx/dungeonfs/cmd/dungeonfs/command\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/ChrisRx/dungeonfs/cmd/dungeonfs/command\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22cobra\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/spf13/cobra\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/spf13/cobra\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./main.go", directory: "/home/wangcong/go_path/src/github.com/ChrisRx/dungeonfs/cmd/dungeonfs")
!3 = !{}
!4 = !{!5, !311}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "main.RootCmd", linkageName: "main.RootCmd", scope: !1, file: !7, line: 11, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "main.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "Command", file: !7, line: 6, size: 4800, align: 8, elements: !10)
!10 = !{!11, !20, !28, !29, !30, !31, !32, !33, !102, !103, !104, !105, !106, !120, !121, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !150, !154, !155, !156, !157, !158, !159, !164, !165, !180, !284, !285, !286, !287, !288, !289, !290, !298, !299, !307, !308, !309, !310}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "Use", file: !7, line: 6, baseType: !12, size: 128, align: 64)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !13, line: 1, size: 128, align: 8, elements: !14)
!13 = !DIFile(filename: "<built-in>", directory: "")
!14 = !{!15, !18}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !13, line: 1, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !13, line: 1, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Aliases", file: !7, line: 6, baseType: !21, size: 192, align: 64, offset: 128)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !22, size: 192, align: 8, elements: !23)
!22 = !DIFile(filename: "", directory: "")
!23 = !{!24, !26, !27}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !22, line: 1, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !22, line: 1, baseType: !19, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !22, line: 1, baseType: !19, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "SuggestFor", file: !7, line: 6, baseType: !21, size: 192, align: 64, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "Short", file: !7, line: 6, baseType: !12, size: 128, align: 64, offset: 512)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Long", file: !7, line: 6, baseType: !12, size: 128, align: 64, offset: 640)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Example", file: !7, line: 6, baseType: !12, size: 128, align: 64, offset: 768)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ValidArgs", file: !7, line: 6, baseType: !21, size: 192, align: 64, offset: 896)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "Args", file: !7, line: 6, baseType: !34, size: 64, align: 64, offset: 1088)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 6, size: 64, align: 8, elements: !36)
!36 = !{!37}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 6, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !67, !21}
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !13, line: 1, size: 128, align: 8, elements: !42)
!42 = !{!43, !101}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !13, line: 1, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !22, size: 128, align: 8, elements: !46)
!46 = !{!47, !97}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !22, line: 1, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !13, line: 1, size: 576, align: 8, elements: !50)
!50 = !{!51, !53, !54, !56, !57, !58, !59, !69, !78, !79, !80, !96}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !13, line: 1, baseType: !52, size: 64, align: 64)
!52 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !13, line: 1, baseType: !52, size: 64, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !13, line: 1, baseType: !55, size: 32, align: 32, offset: 128)
!55 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !13, line: 1, baseType: !17, size: 8, align: 8, offset: 160)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !13, line: 1, baseType: !17, size: 8, align: 8, offset: 168)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !13, line: 1, baseType: !17, size: 8, align: 8, offset: 176)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !13, line: 1, baseType: !60, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !13, line: 1, size: 64, align: 8, elements: !62)
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !13, line: 1, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!52, !67, !52}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIBasicType(name: "void")
!69 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !13, line: 1, baseType: !70, size: 64, align: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !13, line: 1, size: 64, align: 8, elements: !72)
!72 = !{!73}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !13, line: 1, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !67, !67}
!77 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !13, line: 1, baseType: !16, size: 64, align: 64, offset: 320)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !13, line: 1, baseType: !25, size: 64, align: 64, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !13, line: 1, baseType: !81, size: 64, align: 64, offset: 448)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !13, line: 1, size: 320, align: 8, elements: !83)
!83 = !{!84, !85, !86}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !13, line: 1, baseType: !25, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !13, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !13, line: 1, baseType: !87, size: 192, align: 64, offset: 128)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !22, size: 192, align: 8, elements: !88)
!88 = !{!89, !26, !27}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !22, line: 1, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !13, line: 1, size: 320, align: 8, elements: !92)
!92 = !{!84, !85, !93, !94, !95}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !13, line: 1, baseType: !67, size: 64, align: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !13, line: 1, baseType: !67, size: 64, align: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !13, line: 1, baseType: !67, size: 64, align: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !13, line: 1, baseType: !67, size: 64, align: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !22, line: 1, baseType: !98, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!12, !67}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !13, line: 1, baseType: !67, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ArgAliases", file: !7, line: 6, baseType: !21, size: 192, align: 64, offset: 1152)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "BashCompletionFunction", file: !7, line: 6, baseType: !12, size: 128, align: 64, offset: 1344)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Deprecated", file: !7, line: 6, baseType: !12, size: 128, align: 64, offset: 1472)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Hidden", file: !7, line: 6, baseType: !77, size: 8, align: 8, offset: 1600)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Annotations", file: !7, line: 6, baseType: !107, size: 64, align: 64, offset: 1664)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !13, line: 1, size: 384, align: 8, elements: !109)
!109 = !{!110, !111, !112, !113, !115, !116, !117, !118, !119}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !13, line: 1, baseType: !19, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !13, line: 1, baseType: !17, size: 8, align: 8, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !13, line: 1, baseType: !17, size: 8, align: 8, offset: 72)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !13, line: 1, baseType: !114, size: 16, align: 16, offset: 80)
!114 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !13, line: 1, baseType: !55, size: 32, align: 32, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !13, line: 1, baseType: !67, size: 64, align: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !13, line: 1, baseType: !67, size: 64, align: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !13, line: 1, baseType: !52, size: 64, align: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !13, line: 1, baseType: !67, size: 64, align: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !7, line: 6, baseType: !12, size: 128, align: 64, offset: 1728)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "PersistentPreRun", file: !7, line: 6, baseType: !122, size: 64, align: 64, offset: 1856)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 6, size: 64, align: 8, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 6, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!68, !67, !21}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "PersistentPreRunE", file: !7, line: 6, baseType: !34, size: 64, align: 64, offset: 1920)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "PreRun", file: !7, line: 6, baseType: !122, size: 64, align: 64, offset: 1984)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "PreRunE", file: !7, line: 6, baseType: !34, size: 64, align: 64, offset: 2048)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Run", file: !7, line: 6, baseType: !122, size: 64, align: 64, offset: 2112)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "RunE", file: !7, line: 6, baseType: !34, size: 64, align: 64, offset: 2176)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "PostRun", file: !7, line: 6, baseType: !122, size: 64, align: 64, offset: 2240)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "PostRunE", file: !7, line: 6, baseType: !34, size: 64, align: 64, offset: 2304)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "PersistentPostRun", file: !7, line: 6, baseType: !122, size: 64, align: 64, offset: 2368)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "PersistentPostRunE", file: !7, line: 6, baseType: !34, size: 64, align: 64, offset: 2432)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "SilenceErrors", file: !7, line: 6, baseType: !77, size: 8, align: 8, offset: 2496)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "SilenceUsage", file: !7, line: 6, baseType: !77, size: 8, align: 8, offset: 2504)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "DisableFlagParsing", file: !7, line: 6, baseType: !77, size: 8, align: 8, offset: 2512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "DisableAutoGenTag", file: !7, line: 6, baseType: !77, size: 8, align: 8, offset: 2520)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "DisableFlagsInUseLine", file: !7, line: 6, baseType: !77, size: 8, align: 8, offset: 2528)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "DisableSuggestions", file: !7, line: 6, baseType: !77, size: 8, align: 8, offset: 2536)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "SuggestionsMinimumDistance", file: !7, line: 6, baseType: !19, size: 64, align: 64, offset: 2560)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "TraverseChildren", file: !7, line: 6, baseType: !77, size: 8, align: 8, offset: 2624)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "FParseErrWhitelist", file: !7, line: 6, baseType: !147, size: 8, align: 8, offset: 2632)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "FParseErrWhitelist", file: !7, line: 6, size: 8, align: 8, elements: !148)
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownFlags", file: !7, line: 6, baseType: !77, size: 8, align: 8)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "commands", file: !7, line: 6, baseType: !151, size: 192, align: 64, offset: 2688)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Command,int,int}", file: !22, size: 192, align: 8, elements: !152)
!152 = !{!153, !26, !27}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !22, line: 1, baseType: !67, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !7, line: 6, baseType: !67, size: 64, align: 64, offset: 2880)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "commandsMaxUseLen", file: !7, line: 6, baseType: !19, size: 64, align: 64, offset: 2944)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "commandsMaxCommandPathLen", file: !7, line: 6, baseType: !19, size: 64, align: 64, offset: 3008)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "commandsMaxNameLen", file: !7, line: 6, baseType: !19, size: 64, align: 64, offset: 3072)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "commandsAreSorted", file: !7, line: 6, baseType: !77, size: 8, align: 8, offset: 3136)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "commandCalledAs", file: !7, line: 6, baseType: !160, size: 192, align: 64, offset: 3200)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,bool}", file: !22, size: 192, align: 8, elements: !161)
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !22, line: 6, baseType: !12, size: 128, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "called", file: !22, line: 6, baseType: !77, size: 8, align: 8, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "args", file: !7, line: 6, baseType: !21, size: 192, align: 64, offset: 3392)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "flagErrorBuf", file: !7, line: 6, baseType: !166, size: 64, align: 64, offset: 3584)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", file: !7, line: 6, size: 832, align: 8, elements: !168)
!168 = !{!169, !173, !174, !178}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 6, baseType: !170, size: 192, align: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !22, size: 192, align: 8, elements: !171)
!171 = !{!172, !26, !27}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !22, line: 1, baseType: !16, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "off", file: !7, line: 6, baseType: !19, size: 64, align: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "bootstrap", file: !7, line: 6, baseType: !175, size: 512, align: 8, offset: 256)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 512, align: 1, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "lastRead", file: !7, line: 6, baseType: !179, size: 8, align: 8, offset: 768)
!179 = !DIBasicType(name: ".bytes.readOp", size: 8, encoding: DW_ATE_signed)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 6, baseType: !181, size: 64, align: 64, offset: 3648)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "FlagSet", file: !7, line: 6, size: 2048, align: 8, elements: !183)
!183 = !{!184, !192, !193, !195, !196, !197, !198, !231, !232, !233, !234, !235, !236, !237, !238, !240, !256, !257, !269}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Usage", file: !7, line: 6, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 6, size: 64, align: 8, elements: !187)
!187 = !{!188}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 6, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!68}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "SortFlags", file: !7, line: 6, baseType: !77, size: 8, align: 8, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ParseErrorsWhitelist", file: !7, line: 6, baseType: !194, size: 8, align: 8, offset: 72)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParseErrorsWhitelist", file: !7, line: 6, size: 8, align: 8, elements: !148)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 6, baseType: !12, size: 128, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "parsed", file: !7, line: 6, baseType: !77, size: 8, align: 8, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "actual", file: !7, line: 6, baseType: !107, size: 64, align: 64, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "orderedActual", file: !7, line: 6, baseType: !199, size: 192, align: 64, offset: 384)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Flag,int,int}", file: !22, size: 192, align: 8, elements: !200)
!200 = !{!201, !26, !27}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !22, line: 1, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", file: !7, line: 6, size: 1216, align: 8, elements: !205)
!205 = !{!206, !207, !208, !209, !224, !225, !226, !227, !228, !229, !230}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !7, line: 6, baseType: !12, size: 128, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Shorthand", file: !7, line: 6, baseType: !12, size: 128, align: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Usage", file: !7, line: 6, baseType: !12, size: 128, align: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 6, baseType: !210, size: 128, align: 64, offset: 384)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !7, line: 6, size: 128, align: 8, elements: !211)
!211 = !{!212, !223}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 6, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)error,*func(*void)string,*func(*void)string}", file: !22, size: 256, align: 8, elements: !215)
!215 = !{!216, !217, !221, !222}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !22, line: 6, baseType: !48, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Set", file: !22, line: 6, baseType: !218, size: 64, align: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!41, !67, !12}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !22, line: 6, baseType: !98, size: 64, align: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !22, line: 6, baseType: !98, size: 64, align: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !67, size: 64, align: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "DefValue", file: !7, line: 6, baseType: !12, size: 128, align: 64, offset: 512)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Changed", file: !7, line: 6, baseType: !77, size: 8, align: 8, offset: 640)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "NoOptDefVal", file: !7, line: 6, baseType: !12, size: 128, align: 64, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Deprecated", file: !7, line: 6, baseType: !12, size: 128, align: 64, offset: 832)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Hidden", file: !7, line: 6, baseType: !77, size: 8, align: 8, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ShorthandDeprecated", file: !7, line: 6, baseType: !12, size: 128, align: 64, offset: 1024)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Annotations", file: !7, line: 6, baseType: !107, size: 64, align: 64, offset: 1152)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "sortedActual", file: !7, line: 6, baseType: !199, size: 192, align: 64, offset: 576)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "formal", file: !7, line: 6, baseType: !107, size: 64, align: 64, offset: 768)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "orderedFormal", file: !7, line: 6, baseType: !199, size: 192, align: 64, offset: 832)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "sortedFormal", file: !7, line: 6, baseType: !199, size: 192, align: 64, offset: 1024)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "shorthands", file: !7, line: 6, baseType: !107, size: 64, align: 64, offset: 1216)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "args", file: !7, line: 6, baseType: !21, size: 192, align: 64, offset: 1280)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "argsLenAtDash", file: !7, line: 6, baseType: !19, size: 64, align: 64, offset: 1472)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "errorHandling", file: !7, line: 6, baseType: !239, size: 64, align: 64, offset: 1536)
!239 = !DIBasicType(name: "ErrorHandling", size: 64, encoding: DW_ATE_signed)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "output", file: !7, line: 6, baseType: !241, size: 128, align: 64, offset: 1600)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !7, line: 4, size: 128, align: 8, elements: !242)
!242 = !{!243, !223}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 4, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !22, size: 128, align: 8, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !22, line: 4, baseType: !48, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !22, line: 4, baseType: !249, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!252, !67, !170}
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !22, size: 192, align: 8, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !22, line: 4, baseType: !19, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !22, line: 4, baseType: !41, size: 128, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "interspersed", file: !7, line: 6, baseType: !77, size: 8, align: 8, offset: 1728)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "normalizeNameFunc", file: !7, line: 6, baseType: !258, size: 64, align: 64, offset: 1792)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 6, size: 64, align: 8, elements: !260)
!260 = !{!261}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 6, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!265, !67, !12}
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "NormalizedName", file: !7, line: 6, size: 128, align: 8, elements: !266)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !16, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !19, size: 64, align: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "addedGoFlagSets", file: !7, line: 6, baseType: !270, size: 192, align: 64, offset: 1856)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**FlagSet,int,int}", file: !22, size: 192, align: 8, elements: !271)
!271 = !{!272, !26, !27}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !22, line: 1, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "FlagSet", file: !7, line: 6, size: 768, align: 8, elements: !276)
!276 = !{!184, !277, !278, !279, !280, !281, !282, !283}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 6, baseType: !12, size: 128, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "parsed", file: !7, line: 6, baseType: !77, size: 8, align: 8, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "actual", file: !7, line: 6, baseType: !107, size: 64, align: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "formal", file: !7, line: 6, baseType: !107, size: 64, align: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "args", file: !7, line: 6, baseType: !21, size: 192, align: 64, offset: 384)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "errorHandling", file: !7, line: 6, baseType: !239, size: 64, align: 64, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "output", file: !7, line: 6, baseType: !241, size: 128, align: 64, offset: 640)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pflags", file: !7, line: 6, baseType: !181, size: 64, align: 64, offset: 3712)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "lflags", file: !7, line: 6, baseType: !181, size: 64, align: 64, offset: 3776)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "iflags", file: !7, line: 6, baseType: !181, size: 64, align: 64, offset: 3840)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "parentsPflags", file: !7, line: 6, baseType: !181, size: 64, align: 64, offset: 3904)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "globNormFunc", file: !7, line: 6, baseType: !258, size: 64, align: 64, offset: 3968)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "output", file: !7, line: 6, baseType: !241, size: 128, align: 64, offset: 4032)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "usageFunc", file: !7, line: 6, baseType: !291, size: 64, align: 64, offset: 4160)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 6, size: 64, align: 8, elements: !293)
!293 = !{!294}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 6, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!41, !67}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "usageTemplate", file: !7, line: 6, baseType: !12, size: 128, align: 64, offset: 4224)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "flagErrorFunc", file: !7, line: 6, baseType: !300, size: 64, align: 64, offset: 4352)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 6, size: 64, align: 8, elements: !302)
!302 = !{!303}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 6, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!41, !67, !41}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "helpTemplate", file: !7, line: 6, baseType: !12, size: 128, align: 64, offset: 4416)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "helpFunc", file: !7, line: 6, baseType: !122, size: 64, align: 64, offset: 4544)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "helpCommand", file: !7, line: 6, baseType: !67, size: 64, align: 64, offset: 4608)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "versionTemplate", file: !7, line: 6, baseType: !12, size: 128, align: 64, offset: 4672)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !13, line: 1, type: !55, isLocal: false, isDefinition: true)
!313 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !7, line: 1, type: !190, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!314 = !DILocation(line: 1, column: 1, scope: !315)
!315 = !DILexicalBlockFile(scope: !313, file: !13, discriminator: 0)
!316 = !DILocation(line: 11, column: 15, scope: !317)
!317 = !DILexicalBlockFile(scope: !313, file: !7, discriminator: 0)
!318 = !DILocation(line: 11, column: 22, scope: !317)
!319 = !DILocation(line: 11, column: 5, scope: !317)
!320 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !7, line: 16, type: !190, isLocal: false, isDefinition: true, scopeLine: 16, isOptimized: false, unit: !1, retainedNodes: !3)
!321 = !DILocation(line: 18, column: 11, scope: !320)
!322 = !DILocation(line: 19, column: 11, scope: !320)
!323 = !DILocation(line: 17, column: 9, scope: !320)
!324 = !DILocation(line: 17, column: 2, scope: !320)
!325 = !DILocation(line: 21, column: 12, scope: !326)
!326 = distinct !DILexicalBlock(scope: !320, file: !7, line: 21, column: 2)
!327 = !DILocation(line: 21, column: 19, scope: !326)
!328 = !DILocalVariable(name: "err", scope: !326, file: !7, line: 21, type: !41)
!329 = !DILocation(line: 21, column: 5, scope: !320)
!330 = !DILocation(line: 21, column: 35, scope: !326)
!331 = !DILocation(line: 22, column: 13, scope: !326)
!332 = !DILocation(line: 22, column: 7, scope: !326)
!333 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", scope: null, file: !13, line: 1, type: !65, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!334 = !DILocalVariable(name: "key", arg: 1, scope: !333, file: !13, line: 1, type: !67)
!335 = !DILocation(line: 1, column: 1, scope: !333)
!336 = !DILocalVariable(name: "seed", arg: 2, scope: !333, file: !13, line: 1, type: !52)
!337 = !DILocalVariable(name: "$ret6", scope: !333, file: !13, line: 1, type: !52)
!338 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", scope: null, file: !13, line: 1, type: !75, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!339 = !DILocalVariable(name: "key1", arg: 1, scope: !338, file: !13, line: 1, type: !67)
!340 = !DILocation(line: 1, column: 1, scope: !338)
!341 = !DILocalVariable(name: "key2", arg: 2, scope: !338, file: !13, line: 1, type: !67)
!342 = !DILocalVariable(name: "$ret7", scope: !338, file: !13, line: 1, type: !77)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "main"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "main"
	.ascii ";\n"
	.ascii "import "
	.ascii "command"
	.ascii " "
	.ascii "github.com/ChrisRx/dungeonfs/cmd/dungeonfs/command"
	.ascii " \""
	.ascii "github.com/ChrisRx/dungeonfs/cmd/dungeonfs/command"
	.ascii "\";\n"
	.ascii "import "
	.ascii "cobra"
	.ascii " "
	.ascii "github.com/spf13/cobra"
	.ascii " \""
	.ascii "github.com/spf13/cobra"
	.ascii "\";\n"
	.ascii "import "
	.ascii "log"
	.ascii " "
	.ascii "log"
	.ascii " \""
	.ascii "log"
	.ascii "\";\n"
	.ascii "import "
	.ascii "runtime"
	.ascii " "
	.ascii "runtime"
	.ascii " \""
	.ascii "runtime"
	.ascii "\";\n"
	.ascii "init"
	.ascii " "
	.ascii "fuse"
	.ascii " "
	.ascii "bazil_org_fuse..import"
	.ascii " "
	.ascii "fs"
	.ascii " "
