; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22assets\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22eval\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/ChrisRx/dungeonfs/pkg/eval\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/ChrisRx/dungeonfs/pkg/eval\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fs\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/ChrisRx/dungeonfs/pkg/game/fs\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/ChrisRx/dungeonfs/pkg/game/fs\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22core\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./assets.go", directory: "/home/wangcong/go_path/src/github.com/ChrisRx/dungeonfs/pkg/game/assets")
!3 = !{}
!4 = !{!5, !28, !30, !107}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.defaultAttrs", linkageName: "command_line_arguments.defaultAttrs", scope: !1, file: !7, line: 65, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "assets.go", directory: ".")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !10, line: 1, size: 384, align: 8, elements: !11)
!10 = !DIFile(filename: "<built-in>", directory: "")
!11 = !{!12, !14, !16, !17, !19, !21, !24, !25, !27}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !10, line: 1, baseType: !13, size: 64, align: 64)
!13 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !10, line: 1, baseType: !15, size: 8, align: 8, offset: 64)
!15 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !10, line: 1, baseType: !15, size: 8, align: 8, offset: 72)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !10, line: 1, baseType: !18, size: 16, align: 16, offset: 80)
!18 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !10, line: 1, baseType: !20, size: 32, align: 32, offset: 96)
!20 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "void")
!24 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !10, line: 1, baseType: !26, size: 64, align: 64, offset: 256)
!26 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 320)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !10, line: 1, type: !20, isLocal: false, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "command_line_arguments.PkgLogger", linkageName: "command_line_arguments.PkgLogger", scope: !1, file: !32, line: 11, type: !33, isLocal: false, isDefinition: true)
!32 = !DIFile(filename: "logging.go", directory: ".")
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.logger", file: !32, line: 7, size: 128, align: 8, elements: !34)
!34 = !{!35, !106}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !32, line: 7, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*Handle,int,int})void}", file: !38, size: 128, align: 8, elements: !39)
!38 = !DIFile(filename: "", directory: "")
!39 = !{!40, !94}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !38, line: 7, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !10, line: 1, size: 576, align: 8, elements: !43)
!43 = !{!44, !45, !46, !47, !48, !49, !50, !58, !67, !69, !75, !93}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !10, line: 1, baseType: !26, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !10, line: 1, baseType: !26, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !10, line: 1, baseType: !20, size: 32, align: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !10, line: 1, baseType: !15, size: 8, align: 8, offset: 160)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !10, line: 1, baseType: !15, size: 8, align: 8, offset: 168)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !10, line: 1, baseType: !15, size: 8, align: 8, offset: 176)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !10, line: 1, baseType: !51, size: 64, align: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 1, size: 64, align: 8, elements: !53)
!53 = !{!54}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 1, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!26, !22, !26}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !10, line: 1, baseType: !59, size: 64, align: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 1, size: 64, align: 8, elements: !61)
!61 = !{!62}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 1, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !22, !22}
!66 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !10, line: 1, baseType: !68, size: 64, align: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !10, line: 1, baseType: !70, size: 64, align: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !10, line: 1, size: 128, align: 8, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !10, line: 1, baseType: !68, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !10, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !10, line: 1, baseType: !76, size: 64, align: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !10, line: 1, size: 320, align: 8, elements: !78)
!78 = !{!79, !80, !81}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !10, line: 1, baseType: !70, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !10, line: 1, baseType: !70, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !10, line: 1, baseType: !82, size: 192, align: 64, offset: 128)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !38, size: 192, align: 8, elements: !83)
!83 = !{!84, !91, !92}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !10, line: 1, size: 320, align: 8, elements: !87)
!87 = !{!79, !80, !88, !89, !90}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !38, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !38, line: 1, baseType: !13, size: 64, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Printf", file: !38, line: 7, baseType: !95, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!23, !22, !71, !98}
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Handle,int,int}", file: !38, size: 192, align: 8, elements: !99)
!99 = !{!100, !91, !92}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "Handle", file: !7, line: 13, size: 128, align: 8, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !7, line: 1, baseType: !41, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !32, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "command_line_arguments.srcTmpl", linkageName: "command_line_arguments.srcTmpl", scope: !1, file: !109, line: 82, type: !71, isLocal: true, isDefinition: true)
!109 = !DIFile(filename: "level.go", directory: ".")
!110 = distinct !DISubprogram(name: "assets.Base..1command_line_arguments.Component", linkageName: "command_line_arguments.Component.Base", scope: null, file: !7, line: 35, type: !111, isLocal: false, isDefinition: true, scopeLine: 35, isOptimized: false, unit: !1, retainedNodes: !3)
!111 = !DISubroutineType(types: !112)
!112 = !{!71, !113, !113}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "Component", file: !7, line: 25, size: 576, align: 8, elements: !115)
!115 = !{!116, !117, !119, !120, !121}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 26, baseType: !71, size: 128, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "t", file: !7, line: 27, baseType: !118, size: 64, align: 64, offset: 128)
!118 = !DIBasicType(name: "ComponentType", size: 64, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "attrs", file: !7, line: 28, baseType: !8, size: 64, align: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "base", file: !7, line: 29, baseType: !71, size: 128, align: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "bases", file: !7, line: 30, baseType: !122, size: 192, align: 64, offset: 384)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Component,int,int}", file: !38, size: 192, align: 8, elements: !123)
!123 = !{!124, !91, !92}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !22, size: 64, align: 64)
!125 = !DILocalVariable(name: "c", arg: 1, scope: !110, file: !7, line: 35, type: !113)
!126 = !DILocation(line: 35, column: 1, scope: !110)
!127 = !DILocation(line: 35, column: 52, scope: !110)
!128 = !DILocation(line: 35, column: 44, scope: !110)
!129 = !DILocalVariable(name: "$ret2", scope: !110, file: !7, line: 35, type: !71)
!130 = !DILocation(line: 35, column: 28, scope: !110)
!131 = distinct !DISubprogram(name: "assets.Bases..1command_line_arguments.Component", linkageName: "command_line_arguments.Component.Bases", scope: null, file: !7, line: 36, type: !132, isLocal: false, isDefinition: true, scopeLine: 36, isOptimized: false, unit: !1, retainedNodes: !3)
!132 = !DISubroutineType(types: !133)
!133 = !{!122, !113, !113}
!134 = !DILocalVariable(name: "c", arg: 1, scope: !131, file: !7, line: 36, type: !113)
!135 = !DILocation(line: 36, column: 1, scope: !131)
!136 = !DILocation(line: 36, column: 52, scope: !131)
!137 = !DILocation(line: 36, column: 44, scope: !131)
!138 = distinct !DISubprogram(name: "assets.Name..1command_line_arguments.Component", linkageName: "command_line_arguments.Component.Name", scope: null, file: !7, line: 33, type: !111, isLocal: false, isDefinition: true, scopeLine: 33, isOptimized: false, unit: !1, retainedNodes: !3)
!139 = !DILocalVariable(name: "c", arg: 1, scope: !138, file: !7, line: 33, type: !113)
!140 = !DILocation(line: 33, column: 1, scope: !138)
!141 = !DILocation(line: 33, column: 52, scope: !138)
!142 = !DILocation(line: 33, column: 44, scope: !138)
!143 = !DILocalVariable(name: "$ret0", scope: !138, file: !7, line: 33, type: !71)
!144 = !DILocation(line: 33, column: 28, scope: !138)
!145 = distinct !DISubprogram(name: "assets.Type..1command_line_arguments.Component", linkageName: "command_line_arguments.Component.Type", scope: null, file: !7, line: 34, type: !146, isLocal: false, isDefinition: true, scopeLine: 34, isOptimized: false, unit: !1, retainedNodes: !3)
!146 = !DISubroutineType(types: !147)
!147 = !{!118, !113, !113}
!148 = !DILocalVariable(name: "c", arg: 1, scope: !145, file: !7, line: 34, type: !113)
!149 = !DILocation(line: 34, column: 1, scope: !145)
!150 = !DILocalVariable(name: "$ret1", scope: !145, file: !7, line: 34, type: !118)
!151 = !DILocation(line: 34, column: 28, scope: !145)
!152 = !DILocation(line: 34, column: 52, scope: !145)
!153 = !DILocation(line: 34, column: 44, scope: !145)
!154 = distinct !DISubprogram(name: "assets.LookupBaseType.command_line_arguments.Components", linkageName: "command_line_arguments.Components.LookupBaseType", scope: null, file: !7, line: 40, type: !155, isLocal: false, isDefinition: true, scopeLine: 40, isOptimized: false, unit: !1, retainedNodes: !3)
!155 = !DISubroutineType(types: !156)
!156 = !{!157, !161, !161, !71}
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Component,bool}", file: !38, size: 128, align: 8, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 40, baseType: !113, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 40, baseType: !66, size: 8, align: 8, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!162 = !DILocalVariable(name: "pointer", arg: 1, scope: !154, file: !7, line: 40, type: !161)
!163 = !DILocation(line: 40, column: 1, scope: !154)
!164 = !DILocalVariable(name: "t", arg: 2, scope: !154, file: !7, line: 40, type: !71)
!165 = !DILocation(line: 40, column: 36, scope: !154)
!166 = !DILocalVariable(name: "c", scope: !154, file: !7, line: 40, type: !8)
!167 = !DILocalVariable(name: "$ret4", scope: !154, file: !7, line: 40, type: !113)
!168 = !DILocation(line: 40, column: 47, scope: !154)
!169 = !DILocalVariable(name: "$ret5", scope: !154, file: !7, line: 40, type: !66)
!170 = !DILocation(line: 40, column: 59, scope: !154)
!171 = !DILocalVariable(name: "val", scope: !172, file: !7, line: 41, type: !113)
!172 = distinct !DILexicalBlock(scope: !154, file: !7, line: 41, column: 2)
!173 = !DILocation(line: 41, column: 5, scope: !154)
!174 = !DILocalVariable(name: "ok", scope: !172, file: !7, line: 41, type: !66)
!175 = !DILocation(line: 41, column: 5, scope: !172)
!176 = !DILocation(line: 41, column: 2, scope: !172)
!177 = !DILocation(line: 42, column: 3, scope: !172)
!178 = !DILocation(line: 44, column: 2, scope: !154)
!179 = distinct !DISubprogram(name: "assets.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 1, type: !180, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!180 = !DISubroutineType(types: !181)
!181 = !{!23}
!182 = !DILocation(line: 1, column: 1, scope: !183)
!183 = !DILexicalBlockFile(scope: !179, file: !10, discriminator: 0)
!184 = !DILocation(line: 65, column: 20, scope: !185)
!185 = !DILexicalBlockFile(scope: !179, file: !7, discriminator: 0)
!186 = !DILocation(line: 65, column: 5, scope: !185)
!187 = !DILocation(line: 13, column: 1, scope: !188)
!188 = !DILexicalBlockFile(scope: !179, file: !32, discriminator: 0)
!189 = distinct !DISubprogram(name: "assets.AddProperty..stub.command_line_arguments.Resources", linkageName: "command_line_arguments.Resources.AddProperty..stub", scope: null, file: !109, line: 87, type: !190, isLocal: false, isDefinition: true, scopeLine: 87, isOptimized: false, unit: !1, retainedNodes: !3)
!190 = !DISubroutineType(types: !191)
!191 = !{!192, !204, !204, !329, !71, !102}
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !10, line: 1, size: 128, align: 8, elements: !193)
!193 = !{!194, !203}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 1, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !38, size: 128, align: 8, elements: !197)
!197 = !{!198, !199}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !38, line: 1, baseType: !41, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !38, line: 1, baseType: !200, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!71, !22}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "Resources", file: !7, line: 70, size: 192, align: 8, elements: !206)
!206 = !{!207, !208, !209}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "components", file: !7, line: 71, baseType: !8, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "entities", file: !7, line: 72, baseType: !8, size: 64, align: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Level", file: !7, line: 73, baseType: !210, size: 64, align: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "Level", file: !109, line: 17, size: 320, align: 8, elements: !212)
!212 = !{!213, !424, !425, !426}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "root", file: !109, line: 18, baseType: !214, size: 128, align: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entity", file: !7, line: 60, size: 128, align: 8, elements: !215)
!215 = !{!216, !105}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 60, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Context,*Attr)error,*func(*void)Nodes,*func(*void)struct{*uint8,int,int},*func(*void)bool,*func(*void)Dirent,*func(*void)bool,*func(*void)bool,*func(*void)NodeMetaData,*func(*void)string,*func(*void,NodeType,string)Node,*func(*void,struct{*Node,int,int})Node,*func(*void,struct{*string,int,int})string}", file: !38, size: 832, align: 8, elements: !219)
!219 = !{!220, !221, !307, !350, !357, !361, !371, !372, !373, !407, !408, !413, !417}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !38, line: 12, baseType: !41, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Attr", file: !38, line: 12, baseType: !222, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!192, !22, !225, !287}
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !7, line: 12, size: 128, align: 8, elements: !226)
!226 = !{!227, !105}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 12, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,Handle)Handle}", file: !38, size: 320, align: 8, elements: !230)
!230 = !{!220, !231, !273, !279, !283}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !38, line: 12, baseType: !232, size: 64, align: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!235, !22}
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !38, size: 256, align: 8, elements: !236)
!236 = !{!237, !272}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !38, line: 12, baseType: !238, size: 192, align: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 5, size: 192, align: 8, elements: !239)
!239 = !{!240, !242, !244}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 5, baseType: !241, size: 64, align: 64)
!241 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 5, baseType: !243, size: 64, align: 64, offset: 64)
!243 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 5, baseType: !245, size: 64, align: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 5, size: 704, align: 8, elements: !247)
!247 = !{!248, !249, !258, !269, !270, !271}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 5, baseType: !71, size: 128, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 5, baseType: !250, size: 192, align: 64, offset: 128)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !38, size: 192, align: 8, elements: !251)
!251 = !{!252, !91, !92}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 5, size: 256, align: 8, elements: !255)
!255 = !{!248, !256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 5, baseType: !13, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 5, baseType: !66, size: 8, align: 8, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 5, baseType: !259, size: 192, align: 64, offset: 320)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !38, size: 192, align: 8, elements: !260)
!260 = !{!261, !91, !92}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 5, size: 128, align: 8, elements: !264)
!264 = !{!265, !266, !267, !268}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 5, baseType: !243, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 5, baseType: !15, size: 8, align: 8, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 5, baseType: !66, size: 8, align: 8, offset: 72)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 5, baseType: !66, size: 8, align: 8, offset: 80)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 5, baseType: !243, size: 64, align: 64, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 5, baseType: !243, size: 64, align: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 5, baseType: !253, size: 64, align: 64, offset: 640)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !38, line: 12, baseType: !66, size: 8, align: 8, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !38, line: 12, baseType: !274, size: 64, align: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!277, !22}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !10, line: 1, align: 8, elements: !3)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !38, line: 12, baseType: !280, size: 64, align: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!192, !22}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !38, line: 12, baseType: !284, size: 64, align: 64, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!102, !22, !102}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "Attr", file: !7, line: 12, size: 1280, align: 8, elements: !289)
!289 = !{!290, !292, !293, !294, !295, !296, !297, !298, !299, !301, !302, !303, !304, !305, !306}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", file: !7, line: 12, baseType: !291, size: 64, align: 64)
!291 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Inode", file: !7, line: 12, baseType: !241, size: 64, align: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !7, line: 12, baseType: !241, size: 64, align: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Blocks", file: !7, line: 12, baseType: !241, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Atime", file: !7, line: 12, baseType: !238, size: 192, align: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Mtime", file: !7, line: 12, baseType: !238, size: 192, align: 64, offset: 448)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Ctime", file: !7, line: 12, baseType: !238, size: 192, align: 64, offset: 640)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Crtime", file: !7, line: 12, baseType: !238, size: 192, align: 64, offset: 832)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", file: !7, line: 12, baseType: !300, size: 32, align: 32, offset: 1024)
!300 = !DIBasicType(name: "FileMode", size: 32, encoding: DW_ATE_unsigned)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Nlink", file: !7, line: 12, baseType: !20, size: 32, align: 32, offset: 1056)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Uid", file: !7, line: 12, baseType: !20, size: 32, align: 32, offset: 1088)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Gid", file: !7, line: 12, baseType: !20, size: 32, align: 32, offset: 1120)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Rdev", file: !7, line: 12, baseType: !20, size: 32, align: 32, offset: 1152)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !7, line: 12, baseType: !20, size: 32, align: 32, offset: 1184)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "BlockSize", file: !7, line: 12, baseType: !20, size: 32, align: 32, offset: 1216)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Children", file: !38, line: 12, baseType: !308, size: 64, align: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!311, !22}
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "Nodes", file: !7, line: 12, size: 128, align: 8, elements: !312)
!312 = !{!313, !105}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 12, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)void,*func(*void)struct{*Node,int,int},*func(*void,string)bool,*func(*void)struct{*Node,int,int},*func(*void,string)struct{Node,bool},*func(*void)struct{*Node,int,int},*func(*void,string,Node)void}", file: !38, size: 512, align: 8, elements: !316)
!316 = !{!220, !317, !321, !332, !336, !337, !345, !346}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Delete", file: !38, line: 12, baseType: !318, size: 64, align: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!23, !22, !71}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Directories", file: !38, line: 12, baseType: !322, size: 64, align: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!325, !22}
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Node,int,int}", file: !38, size: 192, align: 8, elements: !326)
!326 = !{!327, !91, !92}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !7, line: 12, size: 128, align: 8, elements: !330)
!330 = !{!331, !105}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 12, baseType: !22, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Exists", file: !38, line: 12, baseType: !333, size: 64, align: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!66, !22, !71}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Files", file: !38, line: 12, baseType: !322, size: 64, align: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !38, line: 12, baseType: !338, size: 64, align: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!341, !22, !71}
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Node,bool}", file: !38, size: 192, align: 8, elements: !342)
!342 = !{!343, !344}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 12, baseType: !329, size: 128, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 12, baseType: !66, size: 8, align: 8, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Iter", file: !38, line: 12, baseType: !322, size: 64, align: 64, offset: 384)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Set", file: !38, line: 12, baseType: !347, size: 64, align: 64, offset: 448)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!23, !22, !71, !329}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Content", file: !38, line: 12, baseType: !351, size: 64, align: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!354, !22}
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !38, size: 192, align: 8, elements: !355)
!355 = !{!356, !91, !92}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !68, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Delete", file: !38, line: 12, baseType: !358, size: 64, align: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!66, !22}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Entry", file: !38, line: 12, baseType: !362, size: 64, align: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!365, !22}
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dirent", file: !7, line: 12, size: 256, align: 8, elements: !366)
!366 = !{!367, !368, !370}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Inode", file: !7, line: 12, baseType: !241, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !7, line: 12, baseType: !369, size: 32, align: 32, offset: 64)
!369 = !DIBasicType(name: "DirentType", size: 32, encoding: DW_ATE_unsigned)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !7, line: 12, baseType: !71, size: 128, align: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "IsDir", file: !38, line: 12, baseType: !358, size: 64, align: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "IsFile", file: !38, line: 12, baseType: !358, size: 64, align: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "MetaData", file: !38, line: 12, baseType: !374, size: 64, align: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!377, !22}
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "NodeMetaData", file: !7, line: 12, size: 128, align: 8, elements: !378)
!378 = !{!379, !105}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 12, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)struct{Handle,bool},*func(*void,string)bool,*func(*void,string)struct{*uint8,int,int},*func(*void,string)string,*func(*void)CommentMap,*func(*void,string,Handle)void}", file: !38, size: 448, align: 8, elements: !382)
!382 = !{!220, !383, !390, !391, !395, !399, !403}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !38, line: 12, baseType: !384, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!387, !22, !71}
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Handle,bool}", file: !38, size: 192, align: 8, elements: !388)
!388 = !{!389, !344}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 12, baseType: !102, size: 128, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "GetBool", file: !38, line: 12, baseType: !333, size: 64, align: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "GetBytes", file: !38, line: 12, baseType: !392, size: 64, align: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!354, !22, !71}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "GetString", file: !38, line: 12, baseType: !396, size: 64, align: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!71, !22, !71}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Iter", file: !38, line: 12, baseType: !400, size: 64, align: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!8, !22}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Set", file: !38, line: 12, baseType: !404, size: 64, align: 64, offset: 384)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!23, !22, !71, !102}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !38, line: 12, baseType: !200, size: 64, align: 64, offset: 576)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "New", file: !38, line: 12, baseType: !409, size: 64, align: 64, offset: 640)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!329, !22, !412, !71}
!412 = !DIBasicType(name: "NodeType", size: 64, encoding: DW_ATE_signed)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !38, line: 12, baseType: !414, size: 64, align: 64, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!329, !22, !325}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !38, line: 12, baseType: !418, size: 64, align: 64, offset: 768)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!71, !22, !421}
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !38, size: 192, align: 8, elements: !422)
!422 = !{!423, !91, !92}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !70, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "objects", file: !109, line: 19, baseType: !8, size: 64, align: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "paths", file: !109, line: 19, baseType: !8, size: 64, align: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "properties", file: !109, line: 20, baseType: !8, size: 64, align: 64, offset: 256)
!427 = !DILocalVariable(name: "$p10", arg: 4, scope: !189, file: !109, line: 87, type: !102)
!428 = !DILocation(line: 87, column: 60, scope: !189)
!429 = !DILocalVariable(name: "$this7.pointer", arg: 1, scope: !189, file: !109, line: 87, type: !204)
!430 = !DILocation(line: 87, column: 28, scope: !189)
!431 = !DILocalVariable(name: "$p8", arg: 2, scope: !189, file: !109, line: 87, type: !329)
!432 = !DILocation(line: 87, column: 29, scope: !189)
!433 = !DILocalVariable(name: "$p9", arg: 3, scope: !189, file: !109, line: 87, type: !71)
!434 = !DILocation(line: 87, column: 43, scope: !189)
!435 = !DILocalVariable(name: "$this7", scope: !189, file: !109, line: 87, type: !205)
!436 = !DILocation(line: 70, column: 6, scope: !437)
!437 = !DILexicalBlockFile(scope: !189, file: !7, discriminator: 0)
!438 = distinct !DISubprogram(name: "assets.GetProperties..stub.command_line_arguments.Resources", linkageName: "command_line_arguments.Resources.GetProperties..stub", scope: null, file: !109, line: 122, type: !439, isLocal: false, isDefinition: true, scopeLine: 122, isOptimized: false, unit: !1, retainedNodes: !3)
!439 = !DISubroutineType(types: !440)
!440 = !{!441, !204, !204, !71}
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{CommentMap,bool}", file: !38, size: 128, align: 8, elements: !442)
!442 = !{!443, !444}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 122, baseType: !8, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 122, baseType: !66, size: 8, align: 8, offset: 64)
!445 = !DILocalVariable(name: "$this13.pointer", arg: 1, scope: !438, file: !109, line: 122, type: !204)
!446 = !DILocation(line: 122, column: 30, scope: !438)
!447 = !DILocalVariable(name: "$p14", arg: 2, scope: !438, file: !109, line: 122, type: !71)
!448 = !DILocation(line: 122, column: 31, scope: !438)
!449 = !DILocalVariable(name: "$this13", scope: !438, file: !109, line: 122, type: !205)
!450 = !DILocalVariable(name: "$ret25", scope: !438, file: !109, line: 122, type: !8)
!451 = !DILocation(line: 122, column: 44, scope: !438)
!452 = !DILocalVariable(name: "$ret26", scope: !438, file: !109, line: 122, type: !66)
!453 = !DILocation(line: 122, column: 69, scope: !438)
!454 = !DILocation(line: 70, column: 6, scope: !455)
!455 = !DILexicalBlockFile(scope: !438, file: !7, discriminator: 0)
!456 = distinct !DISubprogram(name: "assets.Root..stub.command_line_arguments.Resources", linkageName: "command_line_arguments.Resources.Root..stub", scope: null, file: !109, line: 34, type: !457, isLocal: false, isDefinition: true, scopeLine: 34, isOptimized: false, unit: !1, retainedNodes: !3)
!457 = !DISubroutineType(types: !458)
!458 = !{!459, !204, !204}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "Directory", file: !7, line: 13, size: 640, align: 8, elements: !461)
!461 = !{!462}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "node", file: !7, line: 13, baseType: !463, size: 640, align: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: ".github.com/ChrisRx/dungeonfs/pkg/game/fs/core.node", file: !7, line: 13, size: 640, align: 8, elements: !464)
!464 = !{!465, !466, !467, !468, !469, !470, !471}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "inode", file: !7, line: 13, baseType: !241, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 13, baseType: !71, size: 128, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "mode", file: !7, line: 13, baseType: !300, size: 32, align: 32, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "path", file: !7, line: 13, baseType: !71, size: 128, align: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", file: !7, line: 13, baseType: !8, size: 64, align: 64, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !7, line: 13, baseType: !329, size: 128, align: 64, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", file: !7, line: 13, baseType: !8, size: 64, align: 64, offset: 576)
!472 = !DILocalVariable(name: "$this15.pointer", arg: 1, scope: !456, file: !109, line: 34, type: !204)
!473 = !DILocation(line: 34, column: 21, scope: !456)
!474 = !DILocalVariable(name: "$this15", scope: !456, file: !109, line: 34, type: !205)
!475 = !DILocalVariable(name: "$ret27", scope: !456, file: !109, line: 34, type: !459)
!476 = !DILocation(line: 34, column: 24, scope: !456)
!477 = !DILocation(line: 70, column: 6, scope: !478)
!478 = !DILexicalBlockFile(scope: !456, file: !7, discriminator: 0)
!479 = distinct !DISubprogram(name: "assets.visit..stub.command_line_arguments.Resources", linkageName: "command_line_arguments.Resources.visit..stub", scope: null, file: !109, line: 54, type: !480, isLocal: false, isDefinition: true, scopeLine: 54, isOptimized: false, unit: !1, retainedNodes: !3)
!480 = !DISubroutineType(types: !481)
!481 = !{!23, !204, !204, !329}
!482 = !DILocalVariable(name: "$this11.pointer", arg: 1, scope: !479, file: !109, line: 54, type: !204)
!483 = !DILocation(line: 54, column: 22, scope: !479)
!484 = !DILocalVariable(name: "$p12", arg: 2, scope: !479, file: !109, line: 54, type: !329)
!485 = !DILocation(line: 54, column: 23, scope: !479)
!486 = !DILocalVariable(name: "$this11", scope: !479, file: !109, line: 54, type: !205)
!487 = !DILocation(line: 70, column: 6, scope: !488)
!488 = !DILexicalBlockFile(scope: !479, file: !7, discriminator: 0)
!489 = distinct !DISubprogram(name: "assets.GetObject..1command_line_arguments.Resources", linkageName: "command_line_arguments.Resources.GetObject", scope: null, file: !7, line: 89, type: !490, isLocal: false, isDefinition: true, scopeLine: 89, isOptimized: false, unit: !1, retainedNodes: !3)
!490 = !DISubroutineType(types: !491)
!491 = !{!214, !204, !204, !71}
!492 = !DILocalVariable(name: "r", arg: 1, scope: !489, file: !7, line: 89, type: !204)
!493 = !DILocation(line: 89, column: 1, scope: !489)
!494 = !DILocalVariable(name: "key", arg: 2, scope: !489, file: !7, line: 89, type: !71)
!495 = !DILocation(line: 89, column: 31, scope: !489)
!496 = !DILocalVariable(name: "ok", scope: !497, file: !7, line: 90, type: !66)
!497 = distinct !DILexicalBlock(scope: !489, file: !7, line: 90, column: 2)
!498 = !DILocation(line: 90, column: 5, scope: !489)
!499 = !DILocation(line: 90, column: 17, scope: !497)
!500 = !DILocation(line: 90, column: 5, scope: !497)
!501 = !DILocation(line: 90, column: 2, scope: !497)
!502 = !DILocalVariable(name: "val", scope: !497, file: !7, line: 90, type: !214)
!503 = !DILocalVariable(name: "$ret10", scope: !489, file: !7, line: 89, type: !214)
!504 = !DILocation(line: 89, column: 43, scope: !489)
!505 = !DILocation(line: 91, column: 3, scope: !497)
!506 = !DILocation(line: 93, column: 2, scope: !489)
!507 = distinct !DISubprogram(name: "assets.LoadDir..1command_line_arguments.Resources", linkageName: "command_line_arguments.Resources.LoadDir", scope: null, file: !7, line: 146, type: !508, isLocal: false, isDefinition: true, scopeLine: 146, isOptimized: false, unit: !1, retainedNodes: !3)
!508 = !DISubroutineType(types: !509)
!509 = !{!510, !204, !204, !71}
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Directory,error}", file: !38, size: 192, align: 8, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 146, baseType: !459, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 146, baseType: !192, size: 128, align: 64, offset: 64)
!514 = !DILocalVariable(name: "r", arg: 1, scope: !507, file: !7, line: 146, type: !204)
!515 = !DILocation(line: 146, column: 1, scope: !507)
!516 = !DILocalVariable(name: "folder", arg: 2, scope: !507, file: !7, line: 146, type: !71)
!517 = !DILocation(line: 146, column: 29, scope: !507)
!518 = !DILocalVariable(name: "$ret13", scope: !507, file: !7, line: 146, type: !459)
!519 = !DILocation(line: 146, column: 45, scope: !507)
!520 = !DILocation(line: 147, column: 44, scope: !521)
!521 = distinct !DILexicalBlock(scope: !507, file: !7, line: 146, column: 1)
!522 = !DILocation(line: 147, column: 30, scope: !521)
!523 = !DILocalVariable(name: "assetFiles", scope: !521, file: !7, line: 147, type: !421)
!524 = !DILocation(line: 147, column: 2, scope: !507)
!525 = !DILocalVariable(name: "err", scope: !521, file: !7, line: 147, type: !192)
!526 = !DILocation(line: 148, column: 9, scope: !521)
!527 = !DILocation(line: 151, column: 2, scope: !528)
!528 = distinct !DILexicalBlock(scope: !521, file: !7, line: 151, column: 2)
!529 = !DILocation(line: 149, column: 3, scope: !521)
!530 = !DILocalVariable(name: "$ret14", scope: !507, file: !7, line: 146, type: !192)
!531 = !DILocation(line: 146, column: 62, scope: !507)
!532 = !DILocalVariable(name: "f", scope: !528, file: !7, line: 151, type: !71)
!533 = !DILocation(line: 151, column: 6, scope: !521)
!534 = !DILocation(line: 152, column: 14, scope: !535)
!535 = distinct !DILexicalBlock(scope: !528, file: !7, line: 152, column: 3)
!536 = !DILocalVariable(name: "err", scope: !535, file: !7, line: 152, type: !192)
!537 = !DILocation(line: 152, column: 6, scope: !528)
!538 = !DILocation(line: 152, column: 32, scope: !535)
!539 = !DILocation(line: 153, column: 4, scope: !535)
!540 = !DILocation(line: 156, column: 16, scope: !521)
!541 = !DILocalVariable(name: "unresolved", scope: !521, file: !7, line: 156, type: !8)
!542 = !DILocation(line: 156, column: 2, scope: !507)
!543 = !DILocalVariable(name: "v", scope: !544, file: !7, line: 157, type: !113)
!544 = distinct !DILexicalBlock(scope: !521, file: !7, line: 157, column: 2)
!545 = !DILocation(line: 157, column: 6, scope: !521)
!546 = !DILocation(line: 157, column: 21, scope: !544)
!547 = !DILocation(line: 157, column: 2, scope: !544)
!548 = !DILocation(line: 159, column: 18, scope: !544)
!549 = !DILocation(line: 158, column: 7, scope: !544)
!550 = !DILocation(line: 158, column: 15, scope: !544)
!551 = !DILocation(line: 162, column: 6, scope: !521)
!552 = !DILocation(line: 162, column: 22, scope: !521)
!553 = !DILocation(line: 166, column: 59, scope: !554)
!554 = distinct !DILexicalBlock(scope: !555, file: !7, line: 163, column: 32)
!555 = distinct !DILexicalBlock(scope: !521, file: !7, line: 163, column: 3)
!556 = !DILocation(line: 166, column: 15, scope: !554)
!557 = !DILocalVariable(name: "c", scope: !554, file: !7, line: 168, type: !113)
!558 = !DILocation(line: 168, column: 4, scope: !555)
!559 = !DILocation(line: 168, column: 14, scope: !554)
!560 = !DILocation(line: 168, column: 4, scope: !554)
!561 = !DILocalVariable(name: "ok", scope: !554, file: !7, line: 164, type: !66)
!562 = !DILocation(line: 164, column: 4, scope: !555)
!563 = !DILocation(line: 169, column: 7, scope: !554)
!564 = !DILocation(line: 166, column: 5, scope: !554)
!565 = !DILocation(line: 170, column: 15, scope: !554)
!566 = !DILocation(line: 172, column: 5, scope: !554)
!567 = !DILocation(line: 170, column: 5, scope: !554)
!568 = !DILocation(line: 172, column: 14, scope: !554)
!569 = !DILocation(line: 172, column: 12, scope: !554)
!570 = !DILocation(line: 173, column: 13, scope: !554)
!571 = !DILocation(line: 173, column: 5, scope: !554)
!572 = !DILocation(line: 173, column: 8, scope: !554)
!573 = !DILocation(line: 174, column: 4, scope: !554)
!574 = !DILocation(line: 163, column: 3, scope: !555)
!575 = !DILocalVariable(name: "v", scope: !555, file: !7, line: 163, type: !113)
!576 = !DILocation(line: 163, column: 7, scope: !521)
!577 = !DILocation(line: 164, column: 44, scope: !554)
!578 = !DILocation(line: 164, column: 16, scope: !554)
!579 = !DILocation(line: 164, column: 27, scope: !554)
!580 = !DILocalVariable(name: "val", scope: !554, file: !7, line: 164, type: !113)
!581 = !DILocation(line: 165, column: 7, scope: !554)
!582 = !DILocalVariable(name: "c", scope: !583, file: !7, line: 177, type: !113)
!583 = distinct !DILexicalBlock(scope: !521, file: !7, line: 177, column: 2)
!584 = !DILocation(line: 177, column: 6, scope: !521)
!585 = !DILocation(line: 177, column: 21, scope: !583)
!586 = !DILocation(line: 177, column: 2, scope: !583)
!587 = !DILocation(line: 222, column: 23, scope: !521)
!588 = !DILocation(line: 180, column: 28, scope: !589)
!589 = distinct !DILexicalBlock(scope: !583, file: !7, line: 180, column: 4)
!590 = !DILocation(line: 180, column: 14, scope: !589)
!591 = !DILocalVariable(name: "n", scope: !589, file: !7, line: 180, type: !459)
!592 = !DILocation(line: 180, column: 4, scope: !583)
!593 = !DILocation(line: 181, column: 23, scope: !594)
!594 = distinct !DILexicalBlock(scope: !589, file: !7, line: 181, column: 4)
!595 = !DILocation(line: 199, column: 23, scope: !596)
!596 = distinct !DILexicalBlock(scope: !583, file: !7, line: 199, column: 4)
!597 = !DILocation(line: 199, column: 14, scope: !596)
!598 = !DILocalVariable(name: "n", scope: !596, file: !7, line: 199, type: !599)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !7, line: 13, size: 640, align: 8, elements: !461)
!601 = !DILocation(line: 199, column: 4, scope: !583)
!602 = !DILocation(line: 200, column: 23, scope: !603)
!603 = distinct !DILexicalBlock(scope: !596, file: !7, line: 200, column: 4)
!604 = !DILocation(line: 218, column: 4, scope: !583)
!605 = !DILocation(line: 181, column: 4, scope: !594)
!606 = !DILocalVariable(name: "k", scope: !594, file: !7, line: 181, type: !71)
!607 = !DILocation(line: 181, column: 8, scope: !589)
!608 = !DILocalVariable(name: "v", scope: !594, file: !7, line: 181, type: !102)
!609 = !DILocation(line: 182, column: 6, scope: !594)
!610 = !DILocation(line: 182, column: 30, scope: !594)
!611 = !DILocation(line: 182, column: 17, scope: !594)
!612 = !DILocation(line: 184, column: 4, scope: !613)
!613 = distinct !DILexicalBlock(scope: !589, file: !7, line: 184, column: 4)
!614 = !DILocalVariable(name: "k", scope: !613, file: !7, line: 184, type: !71)
!615 = !DILocation(line: 184, column: 8, scope: !589)
!616 = !DILocalVariable(name: "v", scope: !613, file: !7, line: 184, type: !102)
!617 = !DILocation(line: 185, column: 6, scope: !613)
!618 = !DILocation(line: 185, column: 30, scope: !613)
!619 = !DILocation(line: 185, column: 17, scope: !613)
!620 = !DILocalVariable(name: "base", scope: !621, file: !7, line: 187, type: !113)
!621 = distinct !DILexicalBlock(scope: !589, file: !7, line: 187, column: 4)
!622 = !DILocation(line: 187, column: 8, scope: !589)
!623 = !DILocation(line: 36, column: 1, scope: !131, inlinedAt: !624)
!624 = distinct !DILocation(line: 187, column: 26, scope: !621)
!625 = !DILocation(line: 36, column: 44, scope: !131, inlinedAt: !624)
!626 = !DILocation(line: 187, column: 4, scope: !621)
!627 = !DILocation(line: 189, column: 27, scope: !628)
!628 = distinct !DILexicalBlock(scope: !621, file: !7, line: 189, column: 5)
!629 = !DILocation(line: 189, column: 5, scope: !628)
!630 = !DILocation(line: 193, column: 7, scope: !628)
!631 = !DILocation(line: 193, column: 31, scope: !628)
!632 = !DILocation(line: 193, column: 18, scope: !628)
!633 = !DILocalVariable(name: "k", scope: !628, file: !7, line: 189, type: !71)
!634 = !DILocation(line: 189, column: 9, scope: !621)
!635 = !DILocalVariable(name: "v", scope: !628, file: !7, line: 189, type: !102)
!636 = !DILocation(line: 190, column: 11, scope: !628)
!637 = !DILocation(line: 196, column: 44, scope: !589)
!638 = !DILocation(line: 196, column: 13, scope: !589)
!639 = !DILocation(line: 33, column: 1, scope: !138, inlinedAt: !640)
!640 = distinct !DILocation(line: 197, column: 16, scope: !589)
!641 = !DILocation(line: 33, column: 44, scope: !138, inlinedAt: !640)
!642 = !DILocation(line: 33, column: 28, scope: !138, inlinedAt: !640)
!643 = !DILocation(line: 197, column: 25, scope: !589)
!644 = !DILocation(line: 197, column: 5, scope: !589)
!645 = !DILocation(line: 200, column: 4, scope: !603)
!646 = !DILocalVariable(name: "k", scope: !603, file: !7, line: 200, type: !71)
!647 = !DILocation(line: 200, column: 8, scope: !596)
!648 = !DILocalVariable(name: "v", scope: !603, file: !7, line: 200, type: !102)
!649 = !DILocation(line: 201, column: 6, scope: !603)
!650 = !DILocation(line: 201, column: 30, scope: !603)
!651 = !DILocation(line: 201, column: 17, scope: !603)
!652 = !DILocation(line: 203, column: 4, scope: !653)
!653 = distinct !DILexicalBlock(scope: !596, file: !7, line: 203, column: 4)
!654 = !DILocalVariable(name: "k", scope: !653, file: !7, line: 203, type: !71)
!655 = !DILocation(line: 203, column: 8, scope: !596)
!656 = !DILocalVariable(name: "v", scope: !653, file: !7, line: 203, type: !102)
!657 = !DILocation(line: 204, column: 6, scope: !653)
!658 = !DILocation(line: 204, column: 30, scope: !653)
!659 = !DILocation(line: 204, column: 17, scope: !653)
!660 = !DILocalVariable(name: "base", scope: !661, file: !7, line: 206, type: !113)
!661 = distinct !DILexicalBlock(scope: !596, file: !7, line: 206, column: 4)
!662 = !DILocation(line: 206, column: 8, scope: !596)
!663 = !DILocation(line: 36, column: 1, scope: !131, inlinedAt: !664)
!664 = distinct !DILocation(line: 206, column: 26, scope: !661)
!665 = !DILocation(line: 36, column: 44, scope: !131, inlinedAt: !664)
!666 = !DILocation(line: 206, column: 4, scope: !661)
!667 = !DILocation(line: 208, column: 27, scope: !668)
!668 = distinct !DILexicalBlock(scope: !661, file: !7, line: 208, column: 5)
!669 = !DILocation(line: 208, column: 5, scope: !668)
!670 = !DILocation(line: 212, column: 7, scope: !668)
!671 = !DILocation(line: 212, column: 31, scope: !668)
!672 = !DILocation(line: 212, column: 18, scope: !668)
!673 = !DILocalVariable(name: "k", scope: !668, file: !7, line: 208, type: !71)
!674 = !DILocation(line: 208, column: 9, scope: !661)
!675 = !DILocalVariable(name: "v", scope: !668, file: !7, line: 208, type: !102)
!676 = !DILocation(line: 209, column: 11, scope: !668)
!677 = !DILocation(line: 215, column: 44, scope: !596)
!678 = !DILocation(line: 215, column: 13, scope: !596)
!679 = !DILocation(line: 33, column: 1, scope: !138, inlinedAt: !680)
!680 = distinct !DILocation(line: 216, column: 16, scope: !596)
!681 = !DILocation(line: 33, column: 44, scope: !138, inlinedAt: !680)
!682 = !DILocation(line: 33, column: 28, scope: !138, inlinedAt: !680)
!683 = !DILocation(line: 216, column: 25, scope: !596)
!684 = !DILocation(line: 216, column: 5, scope: !596)
!685 = !DILocation(line: 178, column: 11, scope: !583)
!686 = !DILocation(line: 221, column: 11, scope: !521)
!687 = !DILocalVariable(name: "root", scope: !521, file: !7, line: 221, type: !214)
!688 = !DILocation(line: 221, column: 2, scope: !507)
!689 = !DILocation(line: 222, column: 7, scope: !521)
!690 = !DILocalVariable(name: "l", scope: !521, file: !7, line: 222, type: !210)
!691 = !DILocation(line: 222, column: 2, scope: !507)
!692 = !DILocation(line: 223, column: 3, scope: !521)
!693 = !DILocation(line: 223, column: 10, scope: !521)
!694 = !DILocation(line: 224, column: 10, scope: !521)
!695 = !DILocation(line: 224, column: 3, scope: !521)
!696 = !DILocation(line: 225, column: 10, scope: !521)
!697 = !DILocation(line: 225, column: 2, scope: !521)
!698 = distinct !DISubprogram(name: "assets.LoadFile..1command_line_arguments.Resources", linkageName: "command_line_arguments.Resources.LoadFile", scope: null, file: !7, line: 115, type: !699, isLocal: false, isDefinition: true, scopeLine: 115, isOptimized: false, unit: !1, retainedNodes: !3)
!699 = !DISubroutineType(types: !700)
!700 = !{!192, !204, !204, !71}
!701 = !DILocalVariable(name: "r", arg: 1, scope: !698, file: !7, line: 115, type: !204)
!702 = !DILocation(line: 115, column: 1, scope: !698)
!703 = !DILocalVariable(name: "f", arg: 2, scope: !698, file: !7, line: 115, type: !71)
!704 = !DILocation(line: 115, column: 30, scope: !698)
!705 = !DILocation(line: 116, column: 22, scope: !706)
!706 = distinct !DILexicalBlock(scope: !698, file: !7, line: 115, column: 1)
!707 = !DILocalVariable(name: "err", scope: !706, file: !7, line: 116, type: !192)
!708 = !DILocation(line: 116, column: 2, scope: !698)
!709 = !DILocation(line: 117, column: 9, scope: !706)
!710 = !DILocalVariable(name: "$ret12", scope: !698, file: !7, line: 115, type: !192)
!711 = !DILocation(line: 115, column: 40, scope: !698)
!712 = !DILocation(line: 118, column: 3, scope: !706)
!713 = !DILocation(line: 120, column: 2, scope: !706)
!714 = !DILocalVariable(name: "rs", scope: !706, file: !7, line: 120, type: !161)
!715 = !DILocation(line: 120, column: 2, scope: !698)
!716 = !DILocation(line: 120, column: 8, scope: !706)
!717 = !DILocation(line: 121, column: 37, scope: !706)
!718 = !DILocalVariable(name: "data", scope: !706, file: !7, line: 116, type: !354)
!719 = !DILocation(line: 121, column: 13, scope: !706)
!720 = !DILocation(line: 122, column: 9, scope: !706)
!721 = !DILocation(line: 123, column: 3, scope: !706)
!722 = !DILocation(line: 125, column: 2, scope: !723)
!723 = distinct !DILexicalBlock(scope: !706, file: !7, line: 125, column: 2)
!724 = !DILocation(line: 128, column: 4, scope: !725)
!725 = distinct !DILexicalBlock(scope: !723, file: !7, line: 125, column: 23)
!726 = !DILocation(line: 132, column: 11, scope: !725)
!727 = !DILocalVariable(name: "s", arg: 1, scope: !728, file: !7, line: 47, type: !71)
!728 = distinct !DISubprogram(name: "assets.parseBaseType", scope: null, file: !7, line: 47, type: !729, isLocal: true, isDefinition: true, scopeLine: 47, isOptimized: false, unit: !1, retainedNodes: !3)
!729 = !DISubroutineType(types: !730)
!730 = !{!118, !71}
!731 = !DILocation(line: 47, column: 20, scope: !728, inlinedAt: !732)
!732 = distinct !DILocation(line: 132, column: 11, scope: !725)
!733 = !DILocalVariable(name: "$ret6", scope: !728, file: !7, line: 47, type: !118)
!734 = !DILocation(line: 47, column: 30, scope: !728, inlinedAt: !732)
!735 = !DILocation(line: 49, column: 2, scope: !728, inlinedAt: !732)
!736 = !DILocation(line: 51, column: 2, scope: !728, inlinedAt: !732)
!737 = !DILocation(line: 53, column: 2, scope: !728, inlinedAt: !732)
!738 = !DILocation(line: 133, column: 11, scope: !725)
!739 = !DILocation(line: 135, column: 11, scope: !725)
!740 = !DILocation(line: 131, column: 16, scope: !725)
!741 = !DILocation(line: 130, column: 8, scope: !725)
!742 = !DILocation(line: 130, column: 9, scope: !725)
!743 = !DILocalVariable(name: "c", scope: !725, file: !7, line: 130, type: !113)
!744 = !DILocation(line: 130, column: 3, scope: !723)
!745 = !DILocalVariable(name: "ok", scope: !746, file: !7, line: 137, type: !66)
!746 = distinct !DILexicalBlock(scope: !725, file: !7, line: 137, column: 3)
!747 = !DILocation(line: 137, column: 6, scope: !725)
!748 = !DILocation(line: 137, column: 29, scope: !746)
!749 = !DILocation(line: 137, column: 16, scope: !746)
!750 = !DILocation(line: 137, column: 6, scope: !746)
!751 = !DILocation(line: 137, column: 3, scope: !746)
!752 = !DILocation(line: 138, column: 14, scope: !746)
!753 = !DILocation(line: 140, column: 17, scope: !725)
!754 = !DILocation(line: 140, column: 4, scope: !725)
!755 = !DILocation(line: 140, column: 26, scope: !725)
!756 = !DILocation(line: 138, column: 4, scope: !746)
!757 = !DILocation(line: 141, column: 12, scope: !725)
!758 = !DILocalVariable(name: "k", scope: !723, file: !7, line: 125, type: !71)
!759 = !DILocation(line: 125, column: 6, scope: !706)
!760 = !DILocalVariable(name: "v", scope: !723, file: !7, line: 125, type: !102)
!761 = !DILocation(line: 126, column: 20, scope: !725)
!762 = !DILocalVariable(name: "parts", scope: !725, file: !7, line: 126, type: !421)
!763 = !DILocation(line: 126, column: 3, scope: !723)
!764 = !DILocation(line: 127, column: 17, scope: !725)
!765 = !DILocation(line: 143, column: 2, scope: !706)
!766 = distinct !DISubprogram(name: "assets.AddProperty..1command_line_arguments.Level", linkageName: "command_line_arguments.Level.AddProperty", scope: null, file: !109, line: 87, type: !767, isLocal: false, isDefinition: true, scopeLine: 87, isOptimized: false, unit: !1, retainedNodes: !3)
!767 = !DISubroutineType(types: !768)
!768 = !{!192, !210, !210, !329, !71, !102}
!769 = !DILocalVariable(name: "v", arg: 4, scope: !766, file: !109, line: 87, type: !102)
!770 = !DILocation(line: 87, column: 60, scope: !766)
!771 = !DILocalVariable(name: "l", arg: 1, scope: !766, file: !109, line: 87, type: !210)
!772 = !DILocation(line: 87, column: 1, scope: !766)
!773 = !DILocalVariable(name: "node", arg: 2, scope: !766, file: !109, line: 87, type: !329)
!774 = !DILocation(line: 87, column: 29, scope: !766)
!775 = !DILocalVariable(name: "attrName", arg: 3, scope: !766, file: !109, line: 87, type: !71)
!776 = !DILocation(line: 87, column: 43, scope: !766)
!777 = !DILocalVariable(name: "ok", scope: !778, file: !109, line: 88, type: !66)
!778 = distinct !DILexicalBlock(scope: !766, file: !109, line: 87, column: 1)
!779 = !DILocation(line: 88, column: 2, scope: !766)
!780 = !DILocation(line: 88, column: 2, scope: !778)
!781 = !DILocalVariable(name: "c", scope: !778, file: !109, line: 88, type: !71)
!782 = !DILocation(line: 89, column: 5, scope: !778)
!783 = !DILocation(line: 90, column: 81, scope: !778)
!784 = !DILocation(line: 92, column: 13, scope: !778)
!785 = !DILocalVariable(name: "objects", scope: !778, file: !109, line: 92, type: !8)
!786 = !DILocation(line: 92, column: 2, scope: !766)
!787 = !DILocation(line: 93, column: 21, scope: !788)
!788 = distinct !DILexicalBlock(scope: !778, file: !109, line: 93, column: 2)
!789 = !DILocation(line: 90, column: 14, scope: !778)
!790 = !DILocation(line: 90, column: 3, scope: !778)
!791 = !DILocation(line: 93, column: 2, scope: !788)
!792 = !DILocation(line: 94, column: 14, scope: !788)
!793 = !DILocation(line: 94, column: 16, scope: !788)
!794 = !DILocalVariable(name: "v", scope: !788, file: !109, line: 93, type: !214)
!795 = !DILocation(line: 93, column: 6, scope: !778)
!796 = !DILocation(line: 96, column: 19, scope: !778)
!797 = !DILocation(line: 96, column: 2, scope: !778)
!798 = !DILocalVariable(name: "ctx", scope: !778, file: !109, line: 96, type: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !109, line: 12, size: 256, align: 8, elements: !802)
!802 = !{!803, !849, !850, !851}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "fset", file: !109, line: 12, baseType: !804, size: 64, align: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileSet", file: !109, line: 5, size: 512, align: 8, elements: !806)
!806 = !{!807, !820, !821, !848}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !109, line: 5, baseType: !808, size: 192, align: 32)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !7, line: 13, size: 192, align: 8, elements: !809)
!809 = !{!810, !816, !817, !818, !819}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !7, line: 13, baseType: !811, size: 64, align: 32)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 13, size: 64, align: 8, elements: !812)
!812 = !{!813, !815}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 13, baseType: !814, size: 32, align: 32)
!814 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 13, baseType: !20, size: 32, align: 32, offset: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !7, line: 13, baseType: !20, size: 32, align: 32, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !7, line: 13, baseType: !20, size: 32, align: 32, offset: 96)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !7, line: 13, baseType: !814, size: 32, align: 32, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !7, line: 13, baseType: !814, size: 32, align: 32, offset: 160)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "base", file: !109, line: 5, baseType: !13, size: 64, align: 64, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "files", file: !109, line: 5, baseType: !822, size: 192, align: 64, offset: 256)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**File,int,int}", file: !38, size: 192, align: 8, elements: !823)
!823 = !{!824, !91, !92}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !825, size: 64, align: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !109, line: 5, size: 768, align: 8, elements: !828)
!828 = !{!829, !830, !820, !831, !832, !833, !838}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "set", file: !109, line: 5, baseType: !22, size: 64, align: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !109, line: 5, baseType: !71, size: 128, align: 64, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !109, line: 5, baseType: !13, size: 64, align: 64, offset: 256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !109, line: 5, baseType: !811, size: 64, align: 32, offset: 320)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "lines", file: !109, line: 5, baseType: !834, size: 192, align: 64, offset: 384)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !38, size: 192, align: 8, elements: !835)
!835 = !{!836, !91, !92}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !837, size: 64, align: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "infos", file: !109, line: 5, baseType: !839, size: 192, align: 64, offset: 576)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.go/token.lineInfo,int,int}", file: !38, size: 192, align: 8, elements: !840)
!840 = !{!841, !91, !92}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !842, size: 64, align: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: ".go/token.lineInfo", file: !109, line: 5, size: 256, align: 8, elements: !844)
!844 = !{!845, !846, !847}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !109, line: 5, baseType: !13, size: 64, align: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "Filename", file: !109, line: 5, baseType: !71, size: 128, align: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "Line", file: !109, line: 5, baseType: !13, size: 64, align: 64, offset: 192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !109, line: 5, baseType: !826, size: 64, align: 64, offset: 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "identifiers", file: !109, line: 12, baseType: !8, size: 64, align: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "returnSet", file: !109, line: 12, baseType: !66, size: 8, align: 8, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "returnValue", file: !109, line: 12, baseType: !852, size: 64, align: 64, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !7, line: 7, size: 192, align: 8, elements: !854)
!854 = !{!855, !896, !897}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 7, baseType: !856, size: 64, align: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.rtype", file: !7, line: 7, size: 576, align: 8, elements: !858)
!858 = !{!859, !860, !861, !862, !863, !865, !866, !867, !872, !877, !878, !879, !895}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 7, baseType: !26, size: 64, align: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 7, baseType: !26, size: 64, align: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 7, baseType: !20, size: 32, align: 32, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 7, baseType: !15, size: 8, align: 8, offset: 160)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 7, baseType: !864, size: 8, align: 8, offset: 168)
!864 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 7, baseType: !15, size: 8, align: 8, offset: 176)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_", file: !7, line: 7, baseType: !15, size: 8, align: 8, offset: 184)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 7, baseType: !868, size: 64, align: 64, offset: 192)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 7, size: 64, align: 8, elements: !870)
!870 = !{!871}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 7, baseType: !55, size: 64, align: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 7, baseType: !873, size: 64, align: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 7, size: 64, align: 8, elements: !875)
!875 = !{!876}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 7, baseType: !63, size: 64, align: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 7, baseType: !68, size: 64, align: 64, offset: 320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 7, baseType: !70, size: 64, align: 64, offset: 384)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 7, baseType: !880, size: 64, align: 64, offset: 448)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.uncommonType", file: !7, line: 7, size: 320, align: 8, elements: !882)
!882 = !{!883, !884, !885}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 7, baseType: !70, size: 64, align: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 7, baseType: !70, size: 64, align: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 7, baseType: !886, size: 192, align: 64, offset: 128)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.reflect.method,int,int}", file: !38, size: 192, align: 8, elements: !887)
!887 = !{!888, !91, !92}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !889, size: 64, align: 64)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.method", file: !7, line: 7, size: 320, align: 8, elements: !891)
!891 = !{!883, !884, !892, !893, !894}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 7, baseType: !22, size: 64, align: 64, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 7, baseType: !22, size: 64, align: 64, offset: 192)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 7, baseType: !22, size: 64, align: 64, offset: 256)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 7, baseType: !22, size: 64, align: 64, offset: 512)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !7, line: 7, baseType: !22, size: 64, align: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !7, line: 7, baseType: !898, size: 64, align: 64, offset: 128)
!898 = !DIBasicType(name: ".reflect.flag", size: 64, encoding: DW_ATE_unsigned)
!899 = !DILocation(line: 96, column: 2, scope: !766)
!900 = !DILocalVariable(name: "err", scope: !778, file: !109, line: 96, type: !192)
!901 = !DILocation(line: 97, column: 9, scope: !778)
!902 = !DILocation(line: 98, column: 3, scope: !778)
!903 = !DILocalVariable(name: "$ret18", scope: !766, file: !109, line: 87, type: !192)
!904 = !DILocation(line: 87, column: 75, scope: !766)
!905 = !DILocation(line: 100, column: 40, scope: !778)
!906 = !DILocation(line: 100, column: 17, scope: !778)
!907 = !DILocalVariable(name: "src", scope: !778, file: !109, line: 100, type: !71)
!908 = !DILocation(line: 100, column: 2, scope: !766)
!909 = !DILocation(line: 101, column: 12, scope: !778)
!910 = !DILocation(line: 102, column: 16, scope: !778)
!911 = !DILocalVariable(name: "fset", scope: !778, file: !109, line: 102, type: !804)
!912 = !DILocation(line: 102, column: 2, scope: !766)
!913 = !DILocation(line: 103, column: 39, scope: !778)
!914 = !DILocation(line: 103, column: 19, scope: !778)
!915 = !DILocation(line: 103, column: 2, scope: !778)
!916 = !DILocalVariable(name: "t", scope: !778, file: !109, line: 103, type: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !109, line: 5, size: 1024, align: 8, elements: !920)
!920 = !{!921, !936, !937, !952, !974, !980, !999, !1004}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "Doc", file: !109, line: 5, baseType: !922, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "CommentGroup", file: !109, line: 5, size: 192, align: 8, elements: !924)
!924 = !{!925}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "List", file: !109, line: 5, baseType: !926, size: 192, align: 64)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Comment,int,int}", file: !38, size: 192, align: 8, elements: !927)
!927 = !{!928, !91, !92}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "Comment", file: !109, line: 5, size: 192, align: 8, elements: !932)
!932 = !{!933, !935}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "Slash", file: !109, line: 5, baseType: !934, size: 64, align: 64)
!934 = !DIBasicType(name: "Pos", size: 64, encoding: DW_ATE_signed)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "Text", file: !109, line: 5, baseType: !71, size: 128, align: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "Package", file: !109, line: 5, baseType: !934, size: 64, align: 64, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !109, line: 5, baseType: !938, size: 64, align: 64, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident", file: !109, line: 5, size: 256, align: 8, elements: !940)
!940 = !{!941, !942, !943}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "NamePos", file: !109, line: 5, baseType: !934, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !109, line: 5, baseType: !71, size: 128, align: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "Obj", file: !109, line: 5, baseType: !944, size: 64, align: 64, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !109, line: 5, size: 576, align: 8, elements: !946)
!946 = !{!947, !942, !949, !950, !951}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !109, line: 5, baseType: !948, size: 64, align: 64)
!948 = !DIBasicType(name: "ObjKind", size: 64, encoding: DW_ATE_signed)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "Decl", file: !109, line: 5, baseType: !102, size: 128, align: 64, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "Data", file: !109, line: 5, baseType: !102, size: 128, align: 64, offset: 320)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !109, line: 5, baseType: !102, size: 128, align: 64, offset: 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "Decls", file: !109, line: 5, baseType: !953, size: 192, align: 64, offset: 192)
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Decl,int,int}", file: !38, size: 192, align: 8, elements: !954)
!954 = !{!955, !91, !92}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "Decl", file: !109, line: 5, size: 128, align: 8, elements: !958)
!958 = !{!959, !973}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !109, line: 5, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Pos,*func(*void)Pos,*func(*void)void}", file: !38, size: 256, align: 8, elements: !962)
!962 = !{!963, !964, !968, !969}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !38, line: 5, baseType: !41, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "End", file: !38, line: 5, baseType: !965, size: 64, align: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!934, !22}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "Pos", file: !38, line: 5, baseType: !965, size: 64, align: 64, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "declNode", file: !38, line: 5, baseType: !970, size: 64, align: 64, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!23, !22}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !109, line: 1, baseType: !22, size: 64, align: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "Scope", file: !109, line: 5, baseType: !975, size: 64, align: 64, offset: 384)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scope", file: !109, line: 5, size: 128, align: 8, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "Outer", file: !109, line: 5, baseType: !22, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "Objects", file: !109, line: 5, baseType: !8, size: 64, align: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "Imports", file: !109, line: 5, baseType: !981, size: 192, align: 64, offset: 448)
!981 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**ImportSpec,int,int}", file: !38, size: 192, align: 8, elements: !982)
!982 = !{!983, !91, !92}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImportSpec", file: !109, line: 5, size: 320, align: 8, elements: !987)
!987 = !{!921, !988, !989, !997, !998}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !109, line: 5, baseType: !938, size: 64, align: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !109, line: 5, baseType: !990, size: 64, align: 64, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "BasicLit", file: !109, line: 5, size: 256, align: 8, elements: !992)
!992 = !{!993, !994, !996}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ValuePos", file: !109, line: 5, baseType: !934, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !109, line: 5, baseType: !995, size: 64, align: 64, offset: 64)
!995 = !DIBasicType(name: "Token", size: 64, encoding: DW_ATE_signed)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !109, line: 5, baseType: !71, size: 128, align: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "Comment", file: !109, line: 5, baseType: !922, size: 64, align: 64, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "EndPos", file: !109, line: 5, baseType: !934, size: 64, align: 64, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "Unresolved", file: !109, line: 5, baseType: !1000, size: 192, align: 64, offset: 640)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Ident,int,int}", file: !38, size: 192, align: 8, elements: !1001)
!1001 = !{!1002, !91, !92}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "Comments", file: !109, line: 5, baseType: !1005, size: 192, align: 64, offset: 832)
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**CommentGroup,int,int}", file: !38, size: 192, align: 8, elements: !1006)
!1006 = !{!1007, !91, !92}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !38, line: 1, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!1009 = !DILocation(line: 103, column: 2, scope: !766)
!1010 = !DILocation(line: 104, column: 9, scope: !778)
!1011 = !DILocation(line: 105, column: 3, scope: !778)
!1012 = !DILocation(line: 107, column: 7, scope: !778)
!1013 = !DILocalVariable(name: "f", scope: !778, file: !109, line: 107, type: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !109, line: 107, size: 64, align: 8, elements: !1016)
!1016 = !{!1017}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !109, line: 107, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!1021}
!1021 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Value,error}", file: !38, size: 192, align: 8, elements: !1022)
!1022 = !{!1023, !1024}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 23, baseType: !852, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !38, line: 23, baseType: !192, size: 128, align: 64, offset: 64)
!1025 = !DILocation(line: 107, column: 2, scope: !766)
!1026 = !DILocalVariable(name: "ok", scope: !1027, file: !109, line: 111, type: !66)
!1027 = distinct !DILexicalBlock(scope: !778, file: !109, line: 111, column: 2)
!1028 = !DILocation(line: 111, column: 5, scope: !778)
!1029 = !DILocation(line: 111, column: 31, scope: !1027)
!1030 = !DILocation(line: 111, column: 15, scope: !1027)
!1031 = !DILocation(line: 111, column: 5, scope: !1027)
!1032 = !DILocation(line: 111, column: 41, scope: !1027)
!1033 = !DILocation(line: 112, column: 20, scope: !1027)
!1034 = !DILocation(line: 112, column: 31, scope: !1027)
!1035 = !DILocation(line: 112, column: 4, scope: !1027)
!1036 = !DILocation(line: 112, column: 29, scope: !1027)
!1037 = !DILocation(line: 114, column: 19, scope: !778)
!1038 = !DILocation(line: 114, column: 3, scope: !778)
!1039 = !DILocation(line: 114, column: 14, scope: !778)
!1040 = !DILocation(line: 114, column: 38, scope: !778)
!1041 = !DILocation(line: 115, column: 14, scope: !778)
!1042 = !DILocation(line: 116, column: 9, scope: !778)
!1043 = !DILocation(line: 117, column: 3, scope: !778)
!1044 = !DILocalVariable(name: "val", scope: !778, file: !109, line: 115, type: !852)
!1045 = !DILocation(line: 115, column: 2, scope: !766)
!1046 = !DILocation(line: 119, column: 9, scope: !778)
!1047 = !DILocation(line: 119, column: 2, scope: !778)
!1048 = distinct !DISubprogram(name: "assets.GetProperties..1command_line_arguments.Level", linkageName: "command_line_arguments.Level.GetProperties", scope: null, file: !109, line: 122, type: !1049, isLocal: false, isDefinition: true, scopeLine: 122, isOptimized: false, unit: !1, retainedNodes: !3)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!441, !210, !210, !71}
!1051 = !DILocalVariable(name: "l", arg: 1, scope: !1048, file: !109, line: 122, type: !210)
!1052 = !DILocation(line: 122, column: 1, scope: !1048)
!1053 = !DILocalVariable(name: "key", arg: 2, scope: !1048, file: !109, line: 122, type: !71)
!1054 = !DILocation(line: 122, column: 31, scope: !1048)
!1055 = !DILocalVariable(name: "$ret21", scope: !1048, file: !109, line: 122, type: !8)
!1056 = !DILocation(line: 122, column: 44, scope: !1048)
!1057 = !DILocalVariable(name: "$ret22", scope: !1048, file: !109, line: 122, type: !66)
!1058 = !DILocation(line: 122, column: 69, scope: !1048)
!1059 = !DILocalVariable(name: "val", scope: !1060, file: !109, line: 123, type: !8)
!1060 = distinct !DILexicalBlock(scope: !1048, file: !109, line: 123, column: 2)
!1061 = !DILocation(line: 123, column: 5, scope: !1048)
!1062 = !DILocalVariable(name: "ok", scope: !1060, file: !109, line: 123, type: !66)
!1063 = !DILocation(line: 123, column: 17, scope: !1060)
!1064 = !DILocation(line: 123, column: 5, scope: !1060)
!1065 = !DILocation(line: 123, column: 2, scope: !1060)
!1066 = !DILocation(line: 124, column: 3, scope: !1060)
!1067 = !DILocation(line: 126, column: 2, scope: !1048)
!1068 = distinct !DISubprogram(name: "assets.Root..1command_line_arguments.Level", linkageName: "command_line_arguments.Level.Root", scope: null, file: !109, line: 34, type: !1069, isLocal: false, isDefinition: true, scopeLine: 34, isOptimized: false, unit: !1, retainedNodes: !3)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!459, !210, !210}
!1071 = !DILocalVariable(name: "l", arg: 1, scope: !1068, file: !109, line: 34, type: !210)
!1072 = !DILocation(line: 34, column: 1, scope: !1068)
!1073 = !DILocalVariable(name: "$ret16", scope: !1068, file: !109, line: 34, type: !459)
!1074 = !DILocation(line: 34, column: 24, scope: !1068)
!1075 = !DILocation(line: 35, column: 10, scope: !1068)
!1076 = !DILocation(line: 35, column: 15, scope: !1068)
!1077 = !DILocation(line: 35, column: 2, scope: !1068)
