; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22eval\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22logging\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/ChrisRx/dungeonfs/pkg/logging\22"
module asm "\09.ascii \22 \5C\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./binop.go", directory: "/home/wangcong/go_path/src/github.com/ChrisRx/dungeonfs/pkg/eval")
!3 = !{}
!4 = !{!5, !9, !30, !96, !98, !100, !152, !154}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "command_line_arguments.types", linkageName: "command_line_arguments.types", scope: !1, file: !11, line: 9, type: !12, isLocal: true, isDefinition: true)
!11 = !DIFile(filename: "context.go", directory: ".")
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !14)
!14 = !{!15, !17, !19, !20, !22, !23, !26, !27, !29}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !16, size: 64, align: 64)
!16 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !18, size: 8, align: 8, offset: 64)
!18 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !18, size: 8, align: 8, offset: 72)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !21, size: 16, align: 16, offset: 80)
!21 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !24, size: 64, align: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIBasicType(name: "void")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !24, size: 64, align: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !28, size: 64, align: 64, offset: 256)
!28 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !24, size: 64, align: 64, offset: 320)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "command_line_arguments.False", linkageName: "command_line_arguments.False", scope: !1, file: !32, line: 11, type: !33, isLocal: false, isDefinition: true)
!32 = !DIFile(filename: "eval.go", directory: ".")
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !34, line: 6, size: 192, align: 8, elements: !35)
!34 = !DIFile(filename: "binop.go", directory: ".")
!35 = !{!36, !93, !94}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !34, line: 6, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.rtype", file: !34, line: 6, size: 576, align: 8, elements: !39)
!39 = !{!40, !41, !42, !43, !44, !46, !47, !48, !56, !65, !67, !73, !92}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !34, line: 6, baseType: !28, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !34, line: 6, baseType: !28, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !34, line: 6, baseType: !8, size: 32, align: 32, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !34, line: 6, baseType: !18, size: 8, align: 8, offset: 160)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !34, line: 6, baseType: !45, size: 8, align: 8, offset: 168)
!45 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !34, line: 6, baseType: !18, size: 8, align: 8, offset: 176)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_", file: !34, line: 6, baseType: !18, size: 8, align: 8, offset: 184)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !34, line: 6, baseType: !49, size: 64, align: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !34, line: 6, size: 64, align: 8, elements: !51)
!51 = !{!52}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !34, line: 6, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!28, !24, !28}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !34, line: 6, baseType: !57, size: 64, align: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !34, line: 6, size: 64, align: 8, elements: !59)
!59 = !{!60}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !34, line: 6, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !24, !24}
!64 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !34, line: 6, baseType: !66, size: 64, align: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !34, line: 6, baseType: !68, size: 64, align: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !70)
!70 = !{!71, !72}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !66, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !34, line: 6, baseType: !74, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.uncommonType", file: !34, line: 6, size: 320, align: 8, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !34, line: 6, baseType: !68, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !34, line: 6, baseType: !68, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !34, line: 6, baseType: !80, size: 192, align: 64, offset: 128)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.reflect.method,int,int}", file: !81, size: 192, align: 8, elements: !82)
!81 = !DIFile(filename: "", directory: "")
!82 = !{!83, !90, !91}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !81, line: 1, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: ".reflect.method", file: !34, line: 6, size: 320, align: 8, elements: !86)
!86 = !{!77, !78, !87, !88, !89}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !34, line: 6, baseType: !24, size: 64, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !34, line: 6, baseType: !24, size: 64, align: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !34, line: 6, baseType: !24, size: 64, align: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !81, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !81, line: 1, baseType: !16, size: 64, align: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !34, line: 6, baseType: !24, size: 64, align: 64, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", file: !34, line: 6, baseType: !24, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "flag", file: !34, line: 6, baseType: !95, size: 64, align: 64, offset: 128)
!95 = !DIBasicType(name: ".reflect.flag", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "command_line_arguments.True", linkageName: "command_line_arguments.True", scope: !1, file: !32, line: 12, type: !33, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "command_line_arguments.Nil", linkageName: "command_line_arguments.Nil", scope: !1, file: !32, line: 13, type: !33, isLocal: false, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "command_line_arguments.ErrInvalidValue", linkageName: "command_line_arguments.ErrInvalidValue", scope: !1, file: !32, line: 15, type: !102, isLocal: false, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !103)
!103 = !{!104, !151}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !81, size: 128, align: 8, elements: !107)
!107 = !{!108, !147}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !81, line: 1, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !111)
!111 = !{!112, !113, !114, !115, !116, !117, !118, !123, !128, !129, !130, !146}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !28, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !28, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !18, size: 8, align: 8, offset: 160)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !18, size: 8, align: 8, offset: 168)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !18, size: 8, align: 8, offset: 176)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !119, size: 64, align: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !121)
!121 = !{!122}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !53, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !124, size: 64, align: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !126)
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !61, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !66, size: 64, align: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !68, size: 64, align: 64, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !131, size: 64, align: 64, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !133)
!133 = !{!134, !135, !136}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !68, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !68, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !137, size: 192, align: 64, offset: 128)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !81, size: 192, align: 8, elements: !138)
!138 = !{!139, !90, !91}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !81, line: 1, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !142)
!142 = !{!134, !135, !143, !144, !145}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !24, size: 64, align: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !24, size: 64, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !24, size: 64, align: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !24, size: 64, align: 64, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !81, line: 1, baseType: !148, size: 64, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!69, !24}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !24, size: 64, align: 64, offset: 64)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "command_line_arguments.ErrReturnValue", linkageName: "command_line_arguments.ErrReturnValue", scope: !1, file: !32, line: 16, type: !102, isLocal: false, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "command_line_arguments.PkgLogger", linkageName: "command_line_arguments.PkgLogger", scope: !1, file: !156, line: 11, type: !157, isLocal: false, isDefinition: true)
!156 = !DIFile(filename: "logging.go", directory: ".")
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.logger", file: !156, line: 7, size: 128, align: 8, elements: !158)
!158 = !{!159, !175}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !156, line: 7, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*struct{*_type,*void},int,int})void}", file: !81, size: 128, align: 8, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !81, line: 7, baseType: !109, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Printf", file: !81, line: 7, baseType: !165, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!25, !24, !69, !168}
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*void},int,int}", file: !81, size: 192, align: 8, elements: !169)
!169 = !{!170, !90, !91}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !81, line: 1, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !81, size: 128, align: 8, elements: !173)
!173 = !{!108, !174}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !81, line: 1, baseType: !24, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !156, line: 1, baseType: !24, size: 64, align: 64, offset: 64)
!176 = distinct !DISubprogram(name: "eval.checkValues", scope: null, file: !32, line: 42, type: !177, isLocal: true, isDefinition: true, scopeLine: 42, isOptimized: false, unit: !1, retainedNodes: !3)
!177 = !DISubroutineType(types: !178)
!178 = !{!102, !179}
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Value,int,int}", file: !81, size: 192, align: 8, elements: !180)
!180 = !{!181, !90, !91}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !81, line: 1, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!184 = !DILocalVariable(name: "values", arg: 1, scope: !176, file: !32, line: 42, type: !179)
!185 = !DILocation(line: 42, column: 18, scope: !176)
!186 = !DILocalVariable(name: "v", scope: !187, file: !32, line: 43, type: !183)
!187 = distinct !DILexicalBlock(scope: !176, file: !32, line: 43, column: 2)
!188 = !DILocation(line: 43, column: 6, scope: !176)
!189 = !DILocation(line: 43, column: 2, scope: !187)
!190 = !DILocation(line: 44, column: 8, scope: !187)
!191 = !DILocation(line: 44, column: 6, scope: !187)
!192 = !DILocation(line: 44, column: 23, scope: !187)
!193 = !DILocation(line: 44, column: 31, scope: !187)
!194 = !DILocation(line: 44, column: 3, scope: !187)
!195 = !DILocation(line: 44, column: 50, scope: !187)
!196 = !DILocation(line: 45, column: 15, scope: !187)
!197 = !DILocation(line: 45, column: 4, scope: !187)
!198 = !DILocalVariable(name: "$ret15", scope: !176, file: !32, line: 42, type: !102)
!199 = !DILocation(line: 42, column: 44, scope: !176)
!200 = !DILocation(line: 48, column: 2, scope: !176)
!201 = distinct !DISubprogram(name: "eval.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !34, line: 1, type: !202, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!202 = !DISubroutineType(types: !203)
!203 = !{!25}
!204 = !DILocation(line: 1, column: 1, scope: !205)
!205 = !DILexicalBlockFile(scope: !201, file: !7, discriminator: 0)
!206 = !DILocation(line: 9, column: 13, scope: !207)
!207 = !DILexicalBlockFile(scope: !201, file: !11, discriminator: 0)
!208 = !DILocation(line: 9, column: 5, scope: !207)
!209 = !DILocation(line: 11, column: 26, scope: !210)
!210 = !DILexicalBlockFile(scope: !201, file: !32, discriminator: 0)
!211 = !DILocation(line: 11, column: 18, scope: !210)
!212 = !DILocation(line: 11, column: 2, scope: !210)
!213 = !DILocation(line: 12, column: 26, scope: !210)
!214 = !DILocation(line: 12, column: 18, scope: !210)
!215 = !DILocation(line: 12, column: 2, scope: !210)
!216 = !DILocation(line: 13, column: 18, scope: !210)
!217 = !DILocation(line: 13, column: 2, scope: !210)
!218 = !DILocation(line: 15, column: 27, scope: !210)
!219 = !DILocation(line: 15, column: 2, scope: !210)
!220 = !DILocation(line: 16, column: 27, scope: !210)
!221 = !DILocation(line: 16, column: 2, scope: !210)
!222 = !DILocation(line: 13, column: 1, scope: !223)
!223 = !DILexicalBlockFile(scope: !201, file: !156, discriminator: 0)
!224 = distinct !DISubprogram(name: "eval.Insert..1command_line_arguments.Scope", linkageName: "command_line_arguments.Scope.Insert", scope: null, file: !11, line: 24, type: !225, isLocal: false, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !1, retainedNodes: !3)
!225 = !DISubroutineType(types: !226)
!226 = !{!25, !227, !227, !69, !172}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scope", file: !11, line: 14, size: 64, align: 8, elements: !229)
!229 = !{!230}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Objects", file: !11, line: 15, baseType: !12, size: 64, align: 64)
!231 = !DILocalVariable(name: "s", arg: 1, scope: !224, file: !11, line: 24, type: !227)
!232 = !DILocation(line: 24, column: 1, scope: !224)
!233 = !DILocalVariable(name: "k", arg: 2, scope: !224, file: !11, line: 24, type: !69)
!234 = !DILocation(line: 24, column: 24, scope: !224)
!235 = !DILocalVariable(name: "v", arg: 3, scope: !224, file: !11, line: 24, type: !172)
!236 = !DILocation(line: 24, column: 34, scope: !224)
!237 = !DILocation(line: 25, column: 3, scope: !224)
!238 = !DILocation(line: 25, column: 15, scope: !224)
!239 = distinct !DISubprogram(name: "eval.Lookup..1command_line_arguments.Scope", linkageName: "command_line_arguments.Scope.Lookup", scope: null, file: !11, line: 28, type: !240, isLocal: false, isDefinition: true, scopeLine: 28, isOptimized: false, unit: !1, retainedNodes: !3)
!240 = !DISubroutineType(types: !241)
!241 = !{!172, !227, !227, !69}
!242 = !DILocalVariable(name: "s", arg: 1, scope: !239, file: !11, line: 28, type: !227)
!243 = !DILocation(line: 28, column: 1, scope: !239)
!244 = !DILocalVariable(name: "name", arg: 2, scope: !239, file: !11, line: 28, type: !69)
!245 = !DILocation(line: 28, column: 24, scope: !239)
!246 = !DILocalVariable(name: "ok", scope: !247, file: !11, line: 29, type: !64)
!247 = distinct !DILexicalBlock(scope: !239, file: !11, line: 29, column: 2)
!248 = !DILocation(line: 29, column: 5, scope: !239)
!249 = !DILocation(line: 29, column: 17, scope: !247)
!250 = !DILocation(line: 29, column: 5, scope: !247)
!251 = !DILocation(line: 29, column: 2, scope: !247)
!252 = !DILocalVariable(name: "val", scope: !247, file: !11, line: 29, type: !172)
!253 = !DILocalVariable(name: "$ret3", scope: !239, file: !11, line: 28, type: !172)
!254 = !DILocation(line: 28, column: 37, scope: !239)
!255 = !DILocation(line: 30, column: 3, scope: !247)
!256 = !DILocation(line: 32, column: 2, scope: !239)
!257 = distinct !DISubprogram(name: "eval.NewScope", linkageName: "command_line_arguments.NewScope", scope: null, file: !11, line: 18, type: !258, isLocal: false, isDefinition: true, scopeLine: 18, isOptimized: false, unit: !1, retainedNodes: !3)
!258 = !DISubroutineType(types: !259)
!259 = !{!227}
!260 = !DILocalVariable(name: "$ret2", scope: !257, file: !11, line: 18, type: !227)
!261 = !DILocation(line: 18, column: 17, scope: !257)
!262 = !DILocation(line: 20, column: 12, scope: !257)
!263 = !DILocation(line: 19, column: 9, scope: !257)
!264 = !DILocation(line: 19, column: 10, scope: !257)
!265 = !DILocation(line: 19, column: 2, scope: !257)
!266 = distinct !DISubprogram(name: "eval.Eval..1command_line_arguments.Context", linkageName: "command_line_arguments.Context.Eval", scope: null, file: !32, line: 19, type: !267, isLocal: false, isDefinition: true, scopeLine: 19, isOptimized: false, unit: !1, retainedNodes: !3)
!267 = !DISubroutineType(types: !268)
!268 = !{!269, !273, !273, !325}
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Value,error}", file: !81, size: 192, align: 8, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !81, line: 10, baseType: !183, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !81, line: 10, baseType: !102, size: 128, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !11, line: 35, size: 256, align: 8, elements: !275)
!275 = !{!276, !322, !323, !324}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "fset", file: !11, line: 36, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileSet", file: !11, line: 5, size: 512, align: 8, elements: !279)
!279 = !{!280, !293, !294, !321}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !11, line: 5, baseType: !281, size: 192, align: 32)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !11, line: 5, size: 192, align: 8, elements: !282)
!282 = !{!283, !289, !290, !291, !292}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !11, line: 5, baseType: !284, size: 64, align: 32)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !11, line: 5, size: 64, align: 8, elements: !285)
!285 = !{!286, !288}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !11, line: 5, baseType: !287, size: 32, align: 32)
!287 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !11, line: 5, baseType: !8, size: 32, align: 32, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !11, line: 5, baseType: !8, size: 32, align: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !11, line: 5, baseType: !8, size: 32, align: 32, offset: 96)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !11, line: 5, baseType: !287, size: 32, align: 32, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !11, line: 5, baseType: !287, size: 32, align: 32, offset: 160)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "base", file: !11, line: 5, baseType: !16, size: 64, align: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "files", file: !11, line: 5, baseType: !295, size: 192, align: 64, offset: 256)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**File,int,int}", file: !81, size: 192, align: 8, elements: !296)
!296 = !{!297, !90, !91}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !81, line: 1, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !11, line: 5, size: 768, align: 8, elements: !301)
!301 = !{!302, !303, !293, !304, !305, !306, !311}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "set", file: !11, line: 5, baseType: !24, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !11, line: 5, baseType: !69, size: 128, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !11, line: 5, baseType: !16, size: 64, align: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !11, line: 5, baseType: !284, size: 64, align: 32, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "lines", file: !11, line: 5, baseType: !307, size: 192, align: 64, offset: 384)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !81, size: 192, align: 8, elements: !308)
!308 = !{!309, !90, !91}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !81, line: 1, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "infos", file: !11, line: 5, baseType: !312, size: 192, align: 64, offset: 576)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.go/token.lineInfo,int,int}", file: !81, size: 192, align: 8, elements: !313)
!313 = !{!314, !90, !91}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !81, line: 1, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: ".go/token.lineInfo", file: !11, line: 5, size: 256, align: 8, elements: !317)
!317 = !{!318, !319, !320}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", file: !11, line: 5, baseType: !16, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Filename", file: !11, line: 5, baseType: !69, size: 128, align: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Line", file: !11, line: 5, baseType: !16, size: 64, align: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !11, line: 5, baseType: !299, size: 64, align: 64, offset: 448)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "identifiers", file: !11, line: 37, baseType: !12, size: 64, align: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "returnSet", file: !11, line: 38, baseType: !64, size: 8, align: 8, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "returnValue", file: !11, line: 39, baseType: !183, size: 64, align: 64, offset: 192)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !326, line: 5, size: 128, align: 8, elements: !327)
!326 = !DIFile(filename: "decl.go", directory: ".")
!327 = !{!328, !339}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !326, line: 5, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Pos,*func(*void)Pos}", file: !81, size: 192, align: 8, elements: !331)
!331 = !{!332, !333, !338}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !81, line: 5, baseType: !109, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "End", file: !81, line: 5, baseType: !334, size: 64, align: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!337, !24}
!337 = !DIBasicType(name: "Pos", size: 64, encoding: DW_ATE_signed)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Pos", file: !81, line: 5, baseType: !334, size: 64, align: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !326, line: 1, baseType: !24, size: 64, align: 64, offset: 64)
!340 = !DILocalVariable(name: "c", arg: 1, scope: !266, file: !32, line: 19, type: !273)
!341 = !DILocation(line: 19, column: 1, scope: !266)
!342 = !DILocalVariable(name: "node", arg: 2, scope: !266, file: !32, line: 19, type: !325)
!343 = !DILocation(line: 19, column: 24, scope: !266)
!344 = !DILocalVariable(name: "$ret12", scope: !266, file: !32, line: 19, type: !183)
!345 = !DILocation(line: 19, column: 40, scope: !266)
!346 = !DILocation(line: 20, column: 2, scope: !266)
!347 = !DILocation(line: 21, column: 2, scope: !266)
!348 = !DILocation(line: 20, column: 9, scope: !349)
!349 = distinct !DILexicalBlock(scope: !266, file: !32, line: 22, column: 3)
!350 = !DILocation(line: 23, column: 2, scope: !266)
!351 = !DILocation(line: 21, column: 2, scope: !349)
!352 = !DILocalVariable(name: "n", scope: !349, file: !32, line: 20, type: !353)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "Decl", file: !326, line: 5, size: 128, align: 8, elements: !354)
!354 = !{!355, !339}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !326, line: 5, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Pos,*func(*void)Pos,*func(*void)void}", file: !81, size: 256, align: 8, elements: !358)
!358 = !{!332, !333, !338, !359}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "declNode", file: !81, line: 5, baseType: !360, size: 64, align: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!25, !24}
!363 = !DILocation(line: 20, column: 9, scope: !266)
!364 = !DILocation(line: 22, column: 11, scope: !349)
!365 = !DILocation(line: 22, column: 3, scope: !349)
!366 = !DILocation(line: 20, column: 9, scope: !367)
!367 = distinct !DILexicalBlock(scope: !266, file: !32, line: 24, column: 3)
!368 = !DILocation(line: 25, column: 2, scope: !266)
!369 = !DILocation(line: 0, scope: !370)
!370 = distinct !DILexicalBlock(scope: !266, file: !32, line: 26, column: 3)
!371 = !DILocation(line: 23, column: 2, scope: !367)
!372 = !DILocalVariable(name: "n", scope: !367, file: !32, line: 20, type: !373)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "Expr", file: !326, line: 5, size: 128, align: 8, elements: !374)
!374 = !{!375, !339}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !326, line: 5, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Pos,*func(*void)Pos,*func(*void)void}", file: !81, size: 256, align: 8, elements: !378)
!378 = !{!332, !333, !338, !379}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "exprNode", file: !81, line: 5, baseType: !360, size: 64, align: 64, offset: 192)
!380 = !DILocation(line: 24, column: 11, scope: !367)
!381 = !DILocation(line: 24, column: 3, scope: !367)
!382 = !DILocalVariable(name: "n", scope: !383, file: !32, line: 20, type: !325)
!383 = distinct !DILexicalBlock(scope: !266, file: !32, line: 28, column: 3)
!384 = !DILocation(line: 25, column: 2, scope: !370)
!385 = !DILocalVariable(name: "n", scope: !370, file: !32, line: 20, type: !386)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stmt", file: !326, line: 5, size: 128, align: 8, elements: !387)
!387 = !{!388, !339}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !326, line: 5, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Pos,*func(*void)Pos,*func(*void)void}", file: !81, size: 256, align: 8, elements: !391)
!391 = !{!332, !333, !338, !392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "stmtNode", file: !81, line: 5, baseType: !360, size: 64, align: 64, offset: 192)
!393 = !DILocation(line: 26, column: 11, scope: !370)
!394 = !DILocation(line: 26, column: 3, scope: !370)
!395 = !DILocation(line: 20, column: 9, scope: !370)
!396 = !DILocation(line: 28, column: 63, scope: !383)
!397 = !DILocation(line: 28, column: 70, scope: !383)
!398 = !DILocation(line: 28, column: 13, scope: !383)
!399 = !DILocation(line: 28, column: 3, scope: !383)
!400 = distinct !DISubprogram(name: "eval.evalAssignStmt..1command_line_arguments.Context", linkageName: "command_line_arguments.Context.evalAssignStmt", scope: null, file: !401, line: 41, type: !402, isLocal: false, isDefinition: true, scopeLine: 41, isOptimized: false, unit: !1, retainedNodes: !3)
!401 = !DIFile(filename: "stmt.go", directory: ".")
!402 = !DISubroutineType(types: !403)
!403 = !{!269, !273, !273, !404}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "AssignStmt", file: !326, line: 5, size: 512, align: 8, elements: !406)
!406 = !{!407, !412, !413, !415}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Lhs", file: !326, line: 5, baseType: !408, size: 192, align: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Expr,int,int}", file: !81, size: 192, align: 8, elements: !409)
!409 = !{!410, !90, !91}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !81, line: 1, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "TokPos", file: !326, line: 5, baseType: !337, size: 64, align: 64, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Tok", file: !326, line: 5, baseType: !414, size: 64, align: 64, offset: 256)
!414 = !DIBasicType(name: "Token", size: 64, encoding: DW_ATE_signed)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Rhs", file: !326, line: 5, baseType: !408, size: 192, align: 64, offset: 320)
!416 = !DILocalVariable(name: "c", arg: 1, scope: !400, file: !401, line: 41, type: !273)
!417 = !DILocation(line: 41, column: 1, scope: !400)
!418 = !DILocalVariable(name: "e", arg: 2, scope: !400, file: !401, line: 41, type: !404)
!419 = !DILocation(line: 41, column: 34, scope: !400)
!420 = !DILocalVariable(name: "$ret32", scope: !400, file: !401, line: 41, type: !183)
!421 = !DILocation(line: 41, column: 54, scope: !400)
!422 = !DILocation(line: 42, column: 22, scope: !423)
!423 = distinct !DILexicalBlock(scope: !400, file: !401, line: 41, column: 1)
!424 = !DILocation(line: 42, column: 26, scope: !423)
!425 = !DILocation(line: 42, column: 15, scope: !423)
!426 = !DILocalVariable(name: "rhs", scope: !423, file: !401, line: 42, type: !183)
!427 = !DILocation(line: 42, column: 2, scope: !400)
!428 = !DILocalVariable(name: "err", scope: !423, file: !401, line: 42, type: !102)
!429 = !DILocation(line: 43, column: 9, scope: !423)
!430 = !DILocalVariable(name: "$ret33", scope: !400, file: !401, line: 41, type: !102)
!431 = !DILocation(line: 41, column: 70, scope: !400)
!432 = !DILocation(line: 44, column: 3, scope: !423)
!433 = !DILocation(line: 46, column: 15, scope: !423)
!434 = !DILocation(line: 46, column: 18, scope: !423)
!435 = !DILocation(line: 46, column: 31, scope: !423)
!436 = !DILocation(line: 47, column: 22, scope: !423)
!437 = !DILocation(line: 47, column: 3, scope: !423)
!438 = !DILocation(line: 48, column: 2, scope: !423)
!439 = distinct !DISubprogram(name: "eval.evalBinaryExpr..1command_line_arguments.Context", linkageName: "command_line_arguments.Context.evalBinaryExpr", scope: null, file: !440, line: 110, type: !441, isLocal: false, isDefinition: true, scopeLine: 110, isOptimized: false, unit: !1, retainedNodes: !3)
!440 = !DIFile(filename: "expr.go", directory: ".")
!441 = !DISubroutineType(types: !442)
!442 = !{!269, !273, !273, !443}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "BinaryExpr", file: !326, line: 5, size: 384, align: 8, elements: !445)
!445 = !{!446, !447, !448, !449}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "X", file: !326, line: 5, baseType: !373, size: 128, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "OpPos", file: !326, line: 5, baseType: !337, size: 64, align: 64, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Op", file: !326, line: 5, baseType: !414, size: 64, align: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Y", file: !326, line: 5, baseType: !373, size: 128, align: 64, offset: 256)
!450 = !DILocalVariable(name: "c", arg: 1, scope: !439, file: !440, line: 110, type: !273)
!451 = !DILocation(line: 110, column: 1, scope: !439)
!452 = !DILocalVariable(name: "e", arg: 2, scope: !439, file: !440, line: 110, type: !443)
!453 = !DILocation(line: 110, column: 34, scope: !439)
!454 = !DILocalVariable(name: "$ret24", scope: !439, file: !440, line: 110, type: !183)
!455 = !DILocation(line: 110, column: 54, scope: !439)
!456 = !DILocation(line: 111, column: 21, scope: !457)
!457 = distinct !DILexicalBlock(scope: !439, file: !440, line: 110, column: 1)
!458 = !DILocation(line: 111, column: 14, scope: !457)
!459 = !DILocalVariable(name: "v1", scope: !457, file: !440, line: 111, type: !183)
!460 = !DILocation(line: 111, column: 2, scope: !439)
!461 = !DILocalVariable(name: "err", scope: !457, file: !440, line: 111, type: !102)
!462 = !DILocation(line: 112, column: 9, scope: !457)
!463 = !DILocalVariable(name: "$ret25", scope: !439, file: !440, line: 110, type: !102)
!464 = !DILocation(line: 110, column: 70, scope: !439)
!465 = !DILocation(line: 113, column: 3, scope: !457)
!466 = !DILocation(line: 115, column: 10, scope: !457)
!467 = !DILocation(line: 128, column: 9, scope: !468)
!468 = distinct !DILexicalBlock(scope: !457, file: !440, line: 128, column: 3)
!469 = !DILocation(line: 128, column: 6, scope: !468)
!470 = !DILocation(line: 142, column: 9, scope: !471)
!471 = distinct !DILexicalBlock(scope: !457, file: !440, line: 142, column: 3)
!472 = !DILocation(line: 142, column: 6, scope: !471)
!473 = !DILocation(line: 117, column: 22, scope: !474)
!474 = distinct !DILexicalBlock(scope: !457, file: !440, line: 117, column: 3)
!475 = !DILocation(line: 117, column: 15, scope: !474)
!476 = !DILocalVariable(name: "err", scope: !474, file: !440, line: 117, type: !102)
!477 = !DILocation(line: 117, column: 3, scope: !457)
!478 = !DILocation(line: 118, column: 10, scope: !474)
!479 = !DILocation(line: 119, column: 4, scope: !474)
!480 = !DILocalVariable(name: "v2", scope: !474, file: !440, line: 117, type: !183)
!481 = !DILocation(line: 10, column: 14, scope: !482, inlinedAt: !485)
!482 = distinct !DISubprogram(name: "eval.compare", scope: null, file: !34, line: 10, type: !483, isLocal: true, isDefinition: true, scopeLine: 10, isOptimized: false, unit: !1, retainedNodes: !3)
!483 = !DISubroutineType(types: !484)
!484 = !{!269, !183, !183}
!485 = distinct !DILocation(line: 121, column: 13, scope: !474)
!486 = !DILocalVariable(name: "a", arg: 1, scope: !482, file: !34, line: 10, type: !183)
!487 = !DILocalVariable(name: "b", arg: 2, scope: !482, file: !34, line: 10, type: !183)
!488 = !DILocation(line: 10, column: 17, scope: !482, inlinedAt: !485)
!489 = !DILocalVariable(name: "$ret0", scope: !482, file: !34, line: 10, type: !183)
!490 = !DILocation(line: 10, column: 36, scope: !482, inlinedAt: !485)
!491 = !DILocation(line: 11, column: 12, scope: !492, inlinedAt: !485)
!492 = distinct !DILexicalBlock(scope: !493, file: !34, line: 11, column: 2)
!493 = distinct !DILexicalBlock(scope: !482, file: !34, line: 10, column: 1)
!494 = !DILocalVariable(name: "err", scope: !492, file: !34, line: 11, type: !102)
!495 = !DILocation(line: 11, column: 5, scope: !493, inlinedAt: !485)
!496 = !DILocation(line: 11, column: 35, scope: !492, inlinedAt: !485)
!497 = !DILocation(line: 14, column: 6, scope: !493, inlinedAt: !485)
!498 = !DILocation(line: 14, column: 18, scope: !493, inlinedAt: !485)
!499 = !DILocation(line: 14, column: 14, scope: !493, inlinedAt: !485)
!500 = !DILocation(line: 15, column: 65, scope: !493, inlinedAt: !485)
!501 = !DILocation(line: 15, column: 75, scope: !493, inlinedAt: !485)
!502 = !DILocalVariable(name: "v", scope: !493, file: !34, line: 17, type: !64)
!503 = !DILocation(line: 17, column: 6, scope: !482, inlinedAt: !485)
!504 = !DILocation(line: 18, column: 10, scope: !493, inlinedAt: !485)
!505 = !DILocation(line: 18, column: 2, scope: !493, inlinedAt: !485)
!506 = !DILocation(line: 19, column: 2, scope: !493, inlinedAt: !485)
!507 = !DILocation(line: 15, column: 13, scope: !493, inlinedAt: !485)
!508 = !DILocation(line: 15, column: 3, scope: !493, inlinedAt: !485)
!509 = !DILocation(line: 20, column: 21, scope: !493, inlinedAt: !485)
!510 = !DILocation(line: 20, column: 32, scope: !493, inlinedAt: !485)
!511 = !DILocation(line: 20, column: 12, scope: !493, inlinedAt: !485)
!512 = !DILocation(line: 23, column: 2, scope: !493, inlinedAt: !485)
!513 = !DILocation(line: 0, scope: !493, inlinedAt: !485)
!514 = !DILocation(line: 30, column: 2, scope: !493, inlinedAt: !485)
!515 = !DILocation(line: 30, column: 24, scope: !493, inlinedAt: !485)
!516 = !DILocation(line: 30, column: 16, scope: !493, inlinedAt: !485)
!517 = !DILocation(line: 24, column: 23, scope: !493, inlinedAt: !485)
!518 = !DILocation(line: 24, column: 35, scope: !493, inlinedAt: !485)
!519 = !DILocation(line: 24, column: 14, scope: !493, inlinedAt: !485)
!520 = !DILocation(line: 28, column: 51, scope: !493, inlinedAt: !485)
!521 = !DILocation(line: 28, column: 13, scope: !493, inlinedAt: !485)
!522 = !DILocation(line: 28, column: 3, scope: !493, inlinedAt: !485)
!523 = !DILocalVariable(name: "vv", scope: !493, file: !34, line: 30, type: !183)
!524 = !DILocation(line: 30, column: 2, scope: !482, inlinedAt: !485)
!525 = !DILocalVariable(name: "$ret1", scope: !482, file: !34, line: 10, type: !102)
!526 = !DILocation(line: 10, column: 52, scope: !482, inlinedAt: !485)
!527 = !DILocation(line: 31, column: 2, scope: !493, inlinedAt: !485)
!528 = !DILocalVariable(name: "r", scope: !474, file: !440, line: 121, type: !183)
!529 = !DILocation(line: 121, column: 3, scope: !457)
!530 = !DILocation(line: 125, column: 38, scope: !474)
!531 = !DILocation(line: 125, column: 12, scope: !474)
!532 = !DILocation(line: 126, column: 3, scope: !474)
!533 = !DILocation(line: 12, column: 3, scope: !492, inlinedAt: !485)
!534 = !DILocation(line: 121, column: 13, scope: !474)
!535 = !DILocation(line: 123, column: 4, scope: !474)
!536 = !DILocation(line: 133, column: 9, scope: !468)
!537 = !DILocation(line: 133, column: 6, scope: !468)
!538 = !DILocation(line: 129, column: 13, scope: !539)
!539 = distinct !DILexicalBlock(scope: !468, file: !440, line: 128, column: 20)
!540 = !DILocation(line: 130, column: 4, scope: !539)
!541 = !DILocation(line: 130, column: 26, scope: !539)
!542 = !DILocation(line: 130, column: 18, scope: !539)
!543 = !DILocalVariable(name: "vv", scope: !539, file: !440, line: 130, type: !183)
!544 = !DILocation(line: 130, column: 4, scope: !468)
!545 = !DILocation(line: 131, column: 4, scope: !539)
!546 = !DILocation(line: 134, column: 4, scope: !468)
!547 = !DILocation(line: 136, column: 22, scope: !468)
!548 = !DILocation(line: 136, column: 15, scope: !468)
!549 = !DILocalVariable(name: "err", scope: !468, file: !440, line: 136, type: !102)
!550 = !DILocation(line: 136, column: 3, scope: !457)
!551 = !DILocation(line: 137, column: 10, scope: !468)
!552 = !DILocation(line: 138, column: 4, scope: !468)
!553 = !DILocalVariable(name: "v2", scope: !468, file: !440, line: 136, type: !183)
!554 = !DILocation(line: 140, column: 3, scope: !468)
!555 = !DILocation(line: 147, column: 8, scope: !471)
!556 = !DILocation(line: 147, column: 3, scope: !471)
!557 = !DILocation(line: 143, column: 13, scope: !558)
!558 = distinct !DILexicalBlock(scope: !471, file: !440, line: 142, column: 20)
!559 = !DILocation(line: 144, column: 4, scope: !558)
!560 = !DILocation(line: 144, column: 26, scope: !558)
!561 = !DILocation(line: 144, column: 18, scope: !558)
!562 = !DILocalVariable(name: "vv", scope: !558, file: !440, line: 144, type: !183)
!563 = !DILocation(line: 144, column: 4, scope: !471)
!564 = !DILocation(line: 145, column: 4, scope: !558)
!565 = !DILocation(line: 148, column: 4, scope: !471)
!566 = !DILocation(line: 150, column: 22, scope: !471)
!567 = !DILocation(line: 150, column: 15, scope: !471)
!568 = !DILocalVariable(name: "err", scope: !471, file: !440, line: 150, type: !102)
!569 = !DILocation(line: 150, column: 3, scope: !457)
!570 = !DILocation(line: 151, column: 10, scope: !471)
!571 = !DILocation(line: 152, column: 4, scope: !471)
!572 = !DILocalVariable(name: "v2", scope: !471, file: !440, line: 150, type: !183)
!573 = !DILocation(line: 154, column: 3, scope: !471)
!574 = !DILocation(line: 156, column: 52, scope: !457)
!575 = !DILocation(line: 156, column: 44, scope: !457)
!576 = !DILocation(line: 156, column: 13, scope: !457)
!577 = !DILocation(line: 156, column: 3, scope: !457)
!578 = distinct !DISubprogram(name: "eval.evalBlockStmt..1command_line_arguments.Context", linkageName: "command_line_arguments.Context.evalBlockStmt", scope: null, file: !401, line: 80, type: !579, isLocal: false, isDefinition: true, scopeLine: 80, isOptimized: false, unit: !1, retainedNodes: !3)
!579 = !DISubroutineType(types: !580)
!580 = !{!269, !273, !273, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "BlockStmt", file: !326, line: 5, size: 320, align: 8, elements: !583)
!583 = !{!584, !585, !590}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Lbrace", file: !326, line: 5, baseType: !337, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "List", file: !326, line: 5, baseType: !586, size: 192, align: 64, offset: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Stmt,int,int}", file: !81, size: 192, align: 8, elements: !587)
!587 = !{!588, !90, !91}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !81, line: 1, baseType: !589, size: 64, align: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Rbrace", file: !326, line: 5, baseType: !337, size: 64, align: 64, offset: 256)
!591 = !DILocalVariable(name: "c", arg: 1, scope: !578, file: !401, line: 80, type: !273)
!592 = !DILocation(line: 80, column: 1, scope: !578)
!593 = !DILocalVariable(name: "e", arg: 2, scope: !578, file: !401, line: 80, type: !581)
!594 = !DILocation(line: 80, column: 33, scope: !578)
!595 = !DILocalVariable(name: "$ret38", scope: !578, file: !401, line: 80, type: !183)
!596 = !DILocation(line: 80, column: 52, scope: !578)
!597 = !DILocation(line: 81, column: 11, scope: !578)
!598 = !DILocalVariable(name: "i", scope: !599, file: !401, line: 82, type: !16)
!599 = distinct !DILexicalBlock(scope: !578, file: !401, line: 82, column: 2)
!600 = !DILocation(line: 82, column: 6, scope: !578)
!601 = !DILocation(line: 82, column: 24, scope: !599)
!602 = !DILocation(line: 82, column: 2, scope: !599)
!603 = !DILocalVariable(name: "stmt", scope: !599, file: !401, line: 82, type: !386)
!604 = !DILocation(line: 83, column: 20, scope: !605)
!605 = distinct !DILexicalBlock(scope: !599, file: !401, line: 82, column: 30)
!606 = !DILocation(line: 83, column: 14, scope: !605)
!607 = !DILocalVariable(name: "v", scope: !605, file: !401, line: 83, type: !183)
!608 = !DILocation(line: 83, column: 3, scope: !599)
!609 = !DILocalVariable(name: "err", scope: !605, file: !401, line: 83, type: !102)
!610 = !DILocation(line: 84, column: 10, scope: !605)
!611 = !DILocalVariable(name: "$ret39", scope: !578, file: !401, line: 80, type: !102)
!612 = !DILocation(line: 80, column: 68, scope: !578)
!613 = !DILocation(line: 85, column: 4, scope: !605)
!614 = !DILocation(line: 87, column: 12, scope: !605)
!615 = !DILocation(line: 88, column: 7, scope: !605)
!616 = !DILocation(line: 88, column: 3, scope: !605)
!617 = !DILocation(line: 89, column: 5, scope: !605)
!618 = !DILocation(line: 89, column: 18, scope: !605)
!619 = !DILocation(line: 90, column: 4, scope: !605)
!620 = !DILocation(line: 93, column: 2, scope: !578)
!621 = distinct !DISubprogram(name: "eval.evalCallExpr..1command_line_arguments.Context", linkageName: "command_line_arguments.Context.evalCallExpr", scope: null, file: !440, line: 46, type: !622, isLocal: false, isDefinition: true, scopeLine: 46, isOptimized: false, unit: !1, retainedNodes: !3)
!622 = !DISubroutineType(types: !623)
!623 = !{!269, !273, !273, !624}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "CallExpr", file: !326, line: 5, size: 512, align: 8, elements: !626)
!626 = !{!627, !628, !629, !630, !631}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Fun", file: !326, line: 5, baseType: !373, size: 128, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Lparen", file: !326, line: 5, baseType: !337, size: 64, align: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "Args", file: !326, line: 5, baseType: !408, size: 192, align: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "Ellipsis", file: !326, line: 5, baseType: !337, size: 64, align: 64, offset: 384)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "Rparen", file: !326, line: 5, baseType: !337, size: 64, align: 64, offset: 448)
!632 = !DILocalVariable(name: "c", arg: 1, scope: !621, file: !440, line: 46, type: !273)
!633 = !DILocation(line: 46, column: 1, scope: !621)
!634 = !DILocalVariable(name: "e", arg: 2, scope: !621, file: !440, line: 46, type: !624)
!635 = !DILocation(line: 46, column: 32, scope: !621)
!636 = !DILocalVariable(name: "$ret18", scope: !621, file: !440, line: 46, type: !183)
!637 = !DILocation(line: 46, column: 50, scope: !621)
!638 = !DILocation(line: 47, column: 21, scope: !639)
!639 = distinct !DILexicalBlock(scope: !621, file: !440, line: 46, column: 1)
!640 = !DILocation(line: 47, column: 14, scope: !639)
!641 = !DILocalVariable(name: "v1", scope: !639, file: !440, line: 47, type: !183)
!642 = !DILocation(line: 47, column: 2, scope: !621)
!643 = !DILocalVariable(name: "err", scope: !639, file: !440, line: 47, type: !102)
!644 = !DILocation(line: 48, column: 9, scope: !639)
!645 = !DILocation(line: 49, column: 3, scope: !639)
!646 = !DILocalVariable(name: "$ret19", scope: !621, file: !440, line: 46, type: !102)
!647 = !DILocation(line: 46, column: 66, scope: !621)
!648 = !DILocation(line: 51, column: 11, scope: !639)
!649 = !DILocation(line: 52, column: 10, scope: !639)
!650 = !DILocation(line: 53, column: 2, scope: !651)
!651 = distinct !DILexicalBlock(scope: !639, file: !440, line: 53, column: 2)
!652 = !DILocalVariable(name: "arg", scope: !651, file: !440, line: 53, type: !373)
!653 = !DILocation(line: 53, column: 6, scope: !639)
!654 = !DILocation(line: 54, column: 20, scope: !655)
!655 = distinct !DILexicalBlock(scope: !651, file: !440, line: 53, column: 29)
!656 = !DILocation(line: 54, column: 14, scope: !655)
!657 = !DILocalVariable(name: "v", scope: !655, file: !440, line: 54, type: !183)
!658 = !DILocation(line: 54, column: 3, scope: !651)
!659 = !DILocalVariable(name: "err", scope: !655, file: !440, line: 54, type: !102)
!660 = !DILocation(line: 55, column: 10, scope: !655)
!661 = !DILocation(line: 56, column: 4, scope: !655)
!662 = !DILocation(line: 58, column: 10, scope: !655)
!663 = !DILocation(line: 58, column: 23, scope: !655)
!664 = !DILocation(line: 58, column: 8, scope: !655)
!665 = !DILocation(line: 60, column: 12, scope: !666)
!666 = distinct !DILexicalBlock(scope: !639, file: !440, line: 60, column: 2)
!667 = !DILocalVariable(name: "err", scope: !666, file: !440, line: 60, type: !102)
!668 = !DILocation(line: 60, column: 5, scope: !639)
!669 = !DILocation(line: 60, column: 33, scope: !666)
!670 = !DILocation(line: 61, column: 12, scope: !666)
!671 = !DILocation(line: 62, column: 3, scope: !666)
!672 = !DILocalVariable(name: "args", scope: !639, file: !440, line: 52, type: !673)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Value,int,int}", file: !81, size: 192, align: 8, elements: !674)
!674 = !{!675, !90, !91}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !81, line: 1, baseType: !183, size: 64, align: 64)
!676 = !DILocation(line: 52, column: 2, scope: !621)
!677 = !DILocation(line: 64, column: 13, scope: !639)
!678 = !DILocalVariable(name: "value", scope: !639, file: !440, line: 64, type: !673)
!679 = !DILocation(line: 64, column: 2, scope: !621)
!680 = !DILocation(line: 65, column: 16, scope: !639)
!681 = !DILocation(line: 66, column: 3, scope: !682)
!682 = distinct !DILexicalBlock(scope: !639, file: !440, line: 65, column: 21)
!683 = !DILocation(line: 66, column: 25, scope: !682)
!684 = !DILocation(line: 66, column: 17, scope: !682)
!685 = !DILocation(line: 69, column: 54, scope: !639)
!686 = !DILocalVariable(name: "vv", scope: !682, file: !440, line: 66, type: !183)
!687 = !DILocation(line: 66, column: 3, scope: !639)
!688 = !DILocation(line: 67, column: 3, scope: !682)
!689 = !DILocation(line: 69, column: 11, scope: !639)
!690 = !DILocation(line: 70, column: 2, scope: !639)
!691 = distinct !DISubprogram(name: "eval.evalDecl..1command_line_arguments.Context", linkageName: "command_line_arguments.Context.evalDecl", scope: null, file: !326, line: 9, type: !692, isLocal: false, isDefinition: true, scopeLine: 9, isOptimized: false, unit: !1, retainedNodes: !3)
!692 = !DISubroutineType(types: !693)
!693 = !{!269, !273, !273, !353}
!694 = !DILocalVariable(name: "c", arg: 1, scope: !691, file: !326, line: 9, type: !273)
!695 = !DILocation(line: 9, column: 1, scope: !691)
!696 = !DILocalVariable(name: "decl", arg: 2, scope: !691, file: !326, line: 9, type: !353)
!697 = !DILocation(line: 9, column: 28, scope: !691)
!698 = !DILocalVariable(name: "$ret6", scope: !691, file: !326, line: 9, type: !183)
!699 = !DILocation(line: 9, column: 44, scope: !691)
!700 = !DILocation(line: 10, column: 2, scope: !691)
!701 = !DILocation(line: 11, column: 2, scope: !691)
!702 = !DILocation(line: 10, column: 9, scope: !703)
!703 = distinct !DILexicalBlock(scope: !691, file: !326, line: 12, column: 3)
!704 = !DILocation(line: 13, column: 2, scope: !691)
!705 = !DILocation(line: 0, scope: !706)
!706 = distinct !DILexicalBlock(scope: !691, file: !326, line: 14, column: 3)
!707 = !DILocation(line: 11, column: 2, scope: !703)
!708 = !DILocalVariable(name: "d", scope: !703, file: !326, line: 10, type: !709)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "FuncDecl", file: !326, line: 5, size: 320, align: 8, elements: !711)
!711 = !{!712, !726, !768, !769, !776}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Doc", file: !326, line: 5, baseType: !713, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "CommentGroup", file: !326, line: 5, size: 192, align: 8, elements: !715)
!715 = !{!716}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "List", file: !326, line: 5, baseType: !717, size: 192, align: 64)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Comment,int,int}", file: !81, size: 192, align: 8, elements: !718)
!718 = !{!719, !90, !91}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !81, line: 1, baseType: !720, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "Comment", file: !326, line: 5, size: 192, align: 8, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Slash", file: !326, line: 5, baseType: !337, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "Text", file: !326, line: 5, baseType: !69, size: 128, align: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Recv", file: !326, line: 5, baseType: !727, size: 64, align: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldList", file: !326, line: 5, size: 320, align: 8, elements: !729)
!729 = !{!730, !731, !767}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Opening", file: !326, line: 5, baseType: !337, size: 64, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "List", file: !326, line: 5, baseType: !732, size: 192, align: 64, offset: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Field,int,int}", file: !81, size: 192, align: 8, elements: !733)
!733 = !{!734, !90, !91}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !81, line: 1, baseType: !735, size: 64, align: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "Field", file: !326, line: 5, size: 512, align: 8, elements: !738)
!738 = !{!712, !739, !758, !759, !766}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !326, line: 5, baseType: !740, size: 192, align: 64, offset: 64)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Ident,int,int}", file: !81, size: 192, align: 8, elements: !741)
!741 = !{!742, !90, !91}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !81, line: 1, baseType: !743, size: 64, align: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident", file: !326, line: 5, size: 256, align: 8, elements: !746)
!746 = !{!747, !748, !749}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "NamePos", file: !326, line: 5, baseType: !337, size: 64, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !326, line: 5, baseType: !69, size: 128, align: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Obj", file: !326, line: 5, baseType: !750, size: 64, align: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !326, line: 5, size: 576, align: 8, elements: !752)
!752 = !{!753, !748, !755, !756, !757}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !326, line: 5, baseType: !754, size: 64, align: 64)
!754 = !DIBasicType(name: "ObjKind", size: 64, encoding: DW_ATE_signed)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Decl", file: !326, line: 5, baseType: !172, size: 128, align: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Data", file: !326, line: 5, baseType: !172, size: 128, align: 64, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !326, line: 5, baseType: !172, size: 128, align: 64, offset: 448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !326, line: 5, baseType: !373, size: 128, align: 64, offset: 256)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", file: !326, line: 5, baseType: !760, size: 64, align: 64, offset: 384)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "BasicLit", file: !326, line: 5, size: 256, align: 8, elements: !762)
!762 = !{!763, !764, !765}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ValuePos", file: !326, line: 5, baseType: !337, size: 64, align: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !326, line: 5, baseType: !414, size: 64, align: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !326, line: 5, baseType: !69, size: 128, align: 64, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Comment", file: !326, line: 5, baseType: !713, size: 64, align: 64, offset: 448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Closing", file: !326, line: 5, baseType: !337, size: 64, align: 64, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !326, line: 5, baseType: !744, size: 64, align: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !326, line: 5, baseType: !770, size: 64, align: 64, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "FuncType", file: !326, line: 5, size: 192, align: 8, elements: !772)
!772 = !{!773, !774, !775}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "Func", file: !326, line: 5, baseType: !337, size: 64, align: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "Params", file: !326, line: 5, baseType: !727, size: 64, align: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Results", file: !326, line: 5, baseType: !727, size: 64, align: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !326, line: 5, baseType: !581, size: 64, align: 64, offset: 256)
!777 = !DILocation(line: 10, column: 9, scope: !691)
!778 = !DILocation(line: 12, column: 3, scope: !703)
!779 = !DILocalVariable(name: "d", scope: !780, file: !326, line: 10, type: !353)
!780 = distinct !DILexicalBlock(scope: !691, file: !326, line: 16, column: 3)
!781 = !DILocation(line: 13, column: 2, scope: !706)
!782 = !DILocalVariable(name: "d", scope: !706, file: !326, line: 10, type: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenDecl", file: !326, line: 5, size: 512, align: 8, elements: !785)
!785 = !{!712, !786, !787, !788, !789, !631}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "TokPos", file: !326, line: 5, baseType: !337, size: 64, align: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "Tok", file: !326, line: 5, baseType: !414, size: 64, align: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "Lparen", file: !326, line: 5, baseType: !337, size: 64, align: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "Specs", file: !326, line: 5, baseType: !790, size: 192, align: 64, offset: 256)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Spec,int,int}", file: !81, size: 192, align: 8, elements: !791)
!791 = !{!792, !90, !91}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !81, line: 1, baseType: !793, size: 64, align: 64)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spec", file: !326, line: 5, size: 128, align: 8, elements: !795)
!795 = !{!796, !339}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !326, line: 5, baseType: !797, size: 64, align: 64)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Pos,*func(*void)Pos,*func(*void)void}", file: !81, size: 256, align: 8, elements: !799)
!799 = !{!332, !333, !338, !800}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "specNode", file: !81, line: 5, baseType: !360, size: 64, align: 64, offset: 192)
!801 = !DILocation(line: 14, column: 3, scope: !706)
!802 = !DILocation(line: 10, column: 9, scope: !706)
!803 = !DILocation(line: 16, column: 63, scope: !780)
!804 = !DILocation(line: 16, column: 70, scope: !780)
!805 = !DILocation(line: 16, column: 13, scope: !780)
!806 = !DILocation(line: 16, column: 3, scope: !780)
!807 = distinct !DISubprogram(name: "eval.evalExpr..1command_line_arguments.Context", linkageName: "command_line_arguments.Context.evalExpr", scope: null, file: !440, line: 11, type: !808, isLocal: false, isDefinition: true, scopeLine: 11, isOptimized: false, unit: !1, retainedNodes: !3)
!808 = !DISubroutineType(types: !809)
!809 = !{!269, !273, !273, !373}
!810 = !DILocalVariable(name: "c", arg: 1, scope: !807, file: !440, line: 11, type: !273)
!811 = !DILocation(line: 11, column: 1, scope: !807)
!812 = !DILocalVariable(name: "expr", arg: 2, scope: !807, file: !440, line: 11, type: !373)
!813 = !DILocation(line: 11, column: 28, scope: !807)
!814 = !DILocalVariable(name: "$ret16", scope: !807, file: !440, line: 11, type: !183)
!815 = !DILocation(line: 11, column: 44, scope: !807)
!816 = !DILocation(line: 12, column: 2, scope: !807)
!817 = !DILocation(line: 13, column: 2, scope: !807)
!818 = !DILocation(line: 12, column: 9, scope: !819)
!819 = distinct !DILexicalBlock(scope: !807, file: !440, line: 14, column: 3)
!820 = !DILocation(line: 15, column: 2, scope: !807)
!821 = !DILocation(line: 13, column: 2, scope: !819)
!822 = !DILocalVariable(name: "e", scope: !819, file: !440, line: 12, type: !443)
!823 = !DILocation(line: 12, column: 9, scope: !807)
!824 = !DILocation(line: 14, column: 11, scope: !819)
!825 = !DILocation(line: 14, column: 3, scope: !819)
!826 = !DILocation(line: 12, column: 9, scope: !827)
!827 = distinct !DILexicalBlock(scope: !807, file: !440, line: 16, column: 3)
!828 = !DILocation(line: 17, column: 2, scope: !807)
!829 = !DILocation(line: 15, column: 2, scope: !827)
!830 = !DILocalVariable(name: "e", scope: !827, file: !440, line: 12, type: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnaryExpr", file: !326, line: 5, size: 256, align: 8, elements: !833)
!833 = !{!834, !835, !836}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "OpPos", file: !326, line: 5, baseType: !337, size: 64, align: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "Op", file: !326, line: 5, baseType: !414, size: 64, align: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "X", file: !326, line: 5, baseType: !373, size: 128, align: 64, offset: 128)
!837 = !DILocation(line: 16, column: 11, scope: !827)
!838 = !DILocation(line: 16, column: 3, scope: !827)
!839 = !DILocation(line: 12, column: 9, scope: !840)
!840 = distinct !DILexicalBlock(scope: !807, file: !440, line: 18, column: 3)
!841 = !DILocation(line: 19, column: 2, scope: !807)
!842 = !DILocation(line: 17, column: 2, scope: !840)
!843 = !DILocalVariable(name: "e", scope: !840, file: !440, line: 12, type: !624)
!844 = !DILocation(line: 18, column: 11, scope: !840)
!845 = !DILocation(line: 18, column: 3, scope: !840)
!846 = !DILocation(line: 12, column: 9, scope: !847)
!847 = distinct !DILexicalBlock(scope: !807, file: !440, line: 20, column: 3)
!848 = !DILocation(line: 21, column: 2, scope: !807)
!849 = !DILocation(line: 19, column: 2, scope: !847)
!850 = !DILocalVariable(name: "e", scope: !847, file: !440, line: 12, type: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "SelectorExpr", file: !326, line: 5, size: 192, align: 8, elements: !853)
!853 = !{!446, !854}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Sel", file: !326, line: 5, baseType: !744, size: 64, align: 64, offset: 128)
!855 = !DILocation(line: 20, column: 11, scope: !847)
!856 = !DILocation(line: 20, column: 3, scope: !847)
!857 = !DILocation(line: 12, column: 9, scope: !858)
!858 = distinct !DILexicalBlock(scope: !807, file: !440, line: 22, column: 3)
!859 = !DILocation(line: 23, column: 2, scope: !807)
!860 = !DILocation(line: 0, scope: !861)
!861 = distinct !DILexicalBlock(scope: !807, file: !440, line: 24, column: 3)
!862 = !DILocation(line: 21, column: 2, scope: !858)
!863 = !DILocalVariable(name: "e", scope: !858, file: !440, line: 12, type: !744)
!864 = !DILocation(line: 22, column: 11, scope: !858)
!865 = !DILocation(line: 22, column: 3, scope: !858)
!866 = !DILocalVariable(name: "e", scope: !867, file: !440, line: 12, type: !373)
!867 = distinct !DILexicalBlock(scope: !807, file: !440, line: 42, column: 3)
!868 = !DILocation(line: 23, column: 2, scope: !861)
!869 = !DILocalVariable(name: "e", scope: !861, file: !440, line: 12, type: !760)
!870 = !DILocation(line: 24, column: 11, scope: !861)
!871 = !DILocation(line: 12, column: 9, scope: !861)
!872 = !DILocation(line: 26, column: 4, scope: !873)
!873 = distinct !DILexicalBlock(scope: !861, file: !440, line: 26, column: 4)
!874 = !DILocalVariable(name: "v", scope: !873, file: !440, line: 26, type: !183)
!875 = !DILocation(line: 26, column: 4, scope: !861)
!876 = !DILocation(line: 26, column: 26, scope: !873)
!877 = !DILocation(line: 26, column: 17, scope: !873)
!878 = !DILocation(line: 32, column: 31, scope: !879)
!879 = distinct !DILexicalBlock(scope: !861, file: !440, line: 32, column: 4)
!880 = !DILocation(line: 32, column: 22, scope: !879)
!881 = !DILocalVariable(name: "err", scope: !879, file: !440, line: 32, type: !102)
!882 = !DILocation(line: 32, column: 4, scope: !861)
!883 = !DILocation(line: 33, column: 11, scope: !879)
!884 = !DILocation(line: 27, column: 4, scope: !873)
!885 = !DILocation(line: 36, column: 4, scope: !879)
!886 = !DILocation(line: 36, column: 25, scope: !879)
!887 = !DILocation(line: 36, column: 17, scope: !879)
!888 = !DILocation(line: 34, column: 11, scope: !879)
!889 = !DILocation(line: 34, column: 5, scope: !879)
!890 = !DILocalVariable(name: "v", scope: !879, file: !440, line: 36, type: !183)
!891 = !DILocation(line: 36, column: 4, scope: !861)
!892 = !DILocation(line: 37, column: 4, scope: !879)
!893 = !DILocation(line: 39, column: 14, scope: !861)
!894 = !DILocation(line: 39, column: 4, scope: !861)
!895 = !DILocation(line: 42, column: 63, scope: !867)
!896 = !DILocation(line: 42, column: 70, scope: !867)
!897 = !DILocation(line: 42, column: 13, scope: !867)
!898 = !DILocation(line: 42, column: 3, scope: !867)
!899 = distinct !DISubprogram(name: "eval.evalExprStmt..1command_line_arguments.Context", linkageName: "command_line_arguments.Context.evalExprStmt", scope: null, file: !401, line: 33, type: !900, isLocal: false, isDefinition: true, scopeLine: 33, isOptimized: false, unit: !1, retainedNodes: !3)
!900 = !DISubroutineType(types: !901)
!901 = !{!269, !273, !273, !902}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExprStmt", file: !326, line: 5, size: 128, align: 8, elements: !904)
!904 = !{!446}
!905 = !DILocalVariable(name: "c", arg: 1, scope: !899, file: !401, line: 33, type: !273)
!906 = !DILocation(line: 33, column: 1, scope: !899)
!907 = !DILocalVariable(name: "e", arg: 2, scope: !899, file: !401, line: 33, type: !902)
!908 = !DILocation(line: 33, column: 32, scope: !899)
!909 = !DILocalVariable(name: "$ret30", scope: !899, file: !401, line: 33, type: !183)
!910 = !DILocation(line: 33, column: 50, scope: !899)
!911 = !DILocation(line: 34, column: 20, scope: !912)
!912 = distinct !DILexicalBlock(scope: !899, file: !401, line: 33, column: 1)
!913 = !DILocation(line: 34, column: 13, scope: !912)
!914 = !DILocalVariable(name: "err", scope: !912, file: !401, line: 34, type: !102)
!915 = !DILocation(line: 34, column: 2, scope: !899)
!916 = !DILocation(line: 35, column: 9, scope: !912)
!917 = !DILocalVariable(name: "$ret31", scope: !899, file: !401, line: 33, type: !102)
!918 = !DILocation(line: 33, column: 66, scope: !899)
!919 = !DILocation(line: 36, column: 3, scope: !912)
!920 = !DILocalVariable(name: "v", scope: !912, file: !401, line: 34, type: !183)
!921 = !DILocation(line: 38, column: 2, scope: !912)
!922 = distinct !DISubprogram(name: "eval.evalFuncDecl..1command_line_arguments.Context", linkageName: "command_line_arguments.Context.evalFuncDecl", scope: null, file: !326, line: 20, type: !692, isLocal: false, isDefinition: true, scopeLine: 20, isOptimized: false, unit: !1, retainedNodes: !3)
!923 = !DILocalVariable(name: "c", arg: 1, scope: !922, file: !326, line: 20, type: !273)
!924 = !DILocation(line: 20, column: 1, scope: !922)
!925 = !DILocalVariable(name: "decl", arg: 2, scope: !922, file: !326, line: 20, type: !353)
!926 = !DILocation(line: 20, column: 32, scope: !922)
!927 = !DILocalVariable(name: "$ret8", scope: !922, file: !326, line: 20, type: !183)
!928 = !DILocation(line: 20, column: 48, scope: !922)
!929 = !DILocation(line: 21, column: 2, scope: !922)
!930 = distinct !DISubprogram(name: "eval.evalGenDecl..1command_line_arguments.Context", linkageName: "command_line_arguments.Context.evalGenDecl", scope: null, file: !326, line: 24, type: !692, isLocal: false, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !1, retainedNodes: !3)
!931 = !DILocalVariable(name: "c", arg: 1, scope: !930, file: !326, line: 24, type: !273)
!932 = !DILocation(line: 24, column: 1, scope: !930)
!933 = !DILocalVariable(name: "decl", arg: 2, scope: !930, file: !326, line: 24, type: !353)
!934 = !DILocation(line: 24, column: 31, scope: !930)
!935 = !DILocalVariable(name: "$ret10", scope: !930, file: !326, line: 24, type: !183)
!936 = !DILocation(line: 24, column: 47, scope: !930)
!937 = !DILocation(line: 25, column: 2, scope: !930)
!938 = distinct !DISubprogram(name: "eval.evalIdent..1command_line_arguments.Context", linkageName: "command_line_arguments.Context.evalIdent", scope: null, file: !440, line: 73, type: !808, isLocal: false, isDefinition: true, scopeLine: 73, isOptimized: false, unit: !1, retainedNodes: !3)
!939 = !DILocalVariable(name: "c", arg: 1, scope: !938, file: !440, line: 73, type: !273)
!940 = !DILocation(line: 73, column: 1, scope: !938)
!941 = !DILocalVariable(name: "e", arg: 2, scope: !938, file: !440, line: 73, type: !373)
!942 = !DILocation(line: 73, column: 29, scope: !938)
!943 = !DILocalVariable(name: "$ret20", scope: !938, file: !440, line: 73, type: !183)
!944 = !DILocation(line: 73, column: 42, scope: !938)
!945 = !DILocalVariable(name: "k", scope: !946, file: !440, line: 74, type: !744)
!946 = distinct !DILexicalBlock(scope: !938, file: !440, line: 73, column: 1)
!947 = !DILocation(line: 74, column: 2, scope: !938)
!948 = !DILocalVariable(name: "ok", scope: !946, file: !440, line: 74, type: !64)
!949 = !DILocation(line: 74, column: 2, scope: !946)
!950 = !DILocation(line: 75, column: 5, scope: !946)
!951 = !DILocation(line: 76, column: 80, scope: !946)
!952 = !DILocalVariable(name: "ok", scope: !953, file: !440, line: 78, type: !64)
!953 = distinct !DILexicalBlock(scope: !946, file: !440, line: 78, column: 2)
!954 = !DILocation(line: 78, column: 5, scope: !946)
!955 = !DILocation(line: 78, column: 31, scope: !953)
!956 = !DILocation(line: 76, column: 73, scope: !946)
!957 = !DILocation(line: 76, column: 13, scope: !946)
!958 = !DILocation(line: 76, column: 3, scope: !946)
!959 = !DILocation(line: 78, column: 17, scope: !953)
!960 = !DILocation(line: 78, column: 5, scope: !953)
!961 = !DILocalVariable(name: "val", scope: !953, file: !440, line: 78, type: !172)
!962 = !DILocation(line: 78, column: 2, scope: !953)
!963 = !DILocation(line: 0, scope: !964)
!964 = distinct !DILexicalBlock(scope: !953, file: !440, line: 78, column: 42)
!965 = !DILocation(line: 79, column: 12, scope: !964)
!966 = !DILocation(line: 79, column: 60, scope: !964)
!967 = !DILocation(line: 83, column: 11, scope: !946)
!968 = !DILocation(line: 83, column: 39, scope: !946)
!969 = !DILocation(line: 80, column: 3, scope: !964)
!970 = !DILocation(line: 80, column: 16, scope: !964)
!971 = !DILocalVariable(name: "v", scope: !964, file: !440, line: 80, type: !183)
!972 = !DILocation(line: 80, column: 3, scope: !953)
!973 = !DILocalVariable(name: "$ret21", scope: !938, file: !440, line: 73, type: !102)
!974 = !DILocation(line: 73, column: 58, scope: !938)
!975 = !DILocation(line: 81, column: 3, scope: !964)
!976 = !DILocation(line: 84, column: 40, scope: !946)
!977 = !DILocation(line: 84, column: 11, scope: !946)
!978 = !DILocation(line: 85, column: 69, scope: !946)
!979 = !DILocation(line: 85, column: 2, scope: !946)
!980 = !DILocation(line: 85, column: 14, scope: !946)
!981 = !DILocation(line: 85, column: 57, scope: !946)
!982 = distinct !DISubprogram(name: "eval.evalIfStmt..1command_line_arguments.Context", linkageName: "command_line_arguments.Context.evalIfStmt", scope: null, file: !401, line: 65, type: !983, isLocal: false, isDefinition: true, scopeLine: 65, isOptimized: false, unit: !1, retainedNodes: !3)
!983 = !DISubroutineType(types: !984)
!984 = !{!269, !273, !273, !985}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "IfStmt", file: !326, line: 5, size: 512, align: 8, elements: !987)
!987 = !{!988, !989, !990, !991, !992}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "If", file: !326, line: 5, baseType: !337, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "Init", file: !326, line: 5, baseType: !386, size: 128, align: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "Cond", file: !326, line: 5, baseType: !373, size: 128, align: 64, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !326, line: 5, baseType: !581, size: 64, align: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "Else", file: !326, line: 5, baseType: !386, size: 128, align: 64, offset: 384)
!993 = !DILocalVariable(name: "c", arg: 1, scope: !982, file: !401, line: 65, type: !273)
!994 = !DILocation(line: 65, column: 1, scope: !982)
!995 = !DILocalVariable(name: "e", arg: 2, scope: !982, file: !401, line: 65, type: !985)
!996 = !DILocation(line: 65, column: 30, scope: !982)
!997 = !DILocalVariable(name: "$ret36", scope: !982, file: !401, line: 65, type: !183)
!998 = !DILocation(line: 65, column: 46, scope: !982)
!999 = !DILocation(line: 66, column: 23, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !982, file: !401, line: 65, column: 1)
!1001 = !DILocation(line: 66, column: 16, scope: !1000)
!1002 = !DILocalVariable(name: "err", scope: !1000, file: !401, line: 66, type: !102)
!1003 = !DILocation(line: 66, column: 2, scope: !982)
!1004 = !DILocation(line: 67, column: 9, scope: !1000)
!1005 = !DILocalVariable(name: "$ret37", scope: !982, file: !401, line: 65, type: !102)
!1006 = !DILocation(line: 65, column: 62, scope: !982)
!1007 = !DILocation(line: 68, column: 3, scope: !1000)
!1008 = !DILocalVariable(name: "cond", scope: !1000, file: !401, line: 66, type: !183)
!1009 = !DILocation(line: 70, column: 9, scope: !1000)
!1010 = !DILocation(line: 70, column: 2, scope: !1000)
!1011 = !DILocation(line: 77, column: 2, scope: !1000)
!1012 = !DILocation(line: 71, column: 21, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1000, file: !401, line: 70, column: 17)
!1014 = !DILocation(line: 71, column: 14, scope: !1013)
!1015 = !DILocalVariable(name: "err", scope: !1013, file: !401, line: 71, type: !102)
!1016 = !DILocation(line: 71, column: 3, scope: !1000)
!1017 = !DILocation(line: 72, column: 10, scope: !1013)
!1018 = !DILocation(line: 73, column: 4, scope: !1013)
!1019 = !DILocalVariable(name: "v", scope: !1013, file: !401, line: 71, type: !183)
!1020 = !DILocation(line: 75, column: 3, scope: !1013)
!1021 = distinct !DISubprogram(name: "eval.evalReturnStmt..1command_line_arguments.Context", linkageName: "command_line_arguments.Context.evalReturnStmt", scope: null, file: !401, line: 51, type: !1022, isLocal: false, isDefinition: true, scopeLine: 51, isOptimized: false, unit: !1, retainedNodes: !3)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!269, !273, !273, !1024}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReturnStmt", file: !326, line: 5, size: 256, align: 8, elements: !1026)
!1026 = !{!1027, !1028}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "Return", file: !326, line: 5, baseType: !337, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "Results", file: !326, line: 5, baseType: !408, size: 192, align: 64, offset: 64)
!1029 = !DILocalVariable(name: "c", arg: 1, scope: !1021, file: !401, line: 51, type: !273)
!1030 = !DILocation(line: 51, column: 1, scope: !1021)
!1031 = !DILocalVariable(name: "e", arg: 2, scope: !1021, file: !401, line: 51, type: !1024)
!1032 = !DILocation(line: 51, column: 34, scope: !1021)
!1033 = !DILocalVariable(name: "$ret34", scope: !1021, file: !401, line: 51, type: !183)
!1034 = !DILocation(line: 51, column: 54, scope: !1021)
!1035 = !DILocation(line: 52, column: 10, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1021, file: !401, line: 51, column: 1)
!1037 = !DILocation(line: 52, column: 20, scope: !1036)
!1038 = !DILocation(line: 53, column: 64, scope: !1036)
!1039 = !DILocation(line: 53, column: 3, scope: !1036)
!1040 = !DILocation(line: 53, column: 15, scope: !1036)
!1041 = !DILocalVariable(name: "$ret35", scope: !1021, file: !401, line: 51, type: !102)
!1042 = !DILocation(line: 51, column: 70, scope: !1021)
!1043 = !DILocation(line: 55, column: 53, scope: !1036)
!1044 = !DILocation(line: 55, column: 11, scope: !1036)
!1045 = !DILocation(line: 56, column: 33, scope: !1036)
!1046 = !DILocation(line: 56, column: 18, scope: !1036)
!1047 = !DILocalVariable(name: "result", scope: !1036, file: !401, line: 56, type: !183)
!1048 = !DILocation(line: 56, column: 2, scope: !1021)
!1049 = !DILocalVariable(name: "err", scope: !1036, file: !401, line: 56, type: !102)
!1050 = !DILocation(line: 57, column: 9, scope: !1036)
!1051 = !DILocation(line: 58, column: 3, scope: !1036)
!1052 = !DILocation(line: 60, column: 3, scope: !1036)
!1053 = !DILocation(line: 60, column: 14, scope: !1036)
!1054 = !DILocation(line: 61, column: 3, scope: !1036)
!1055 = !DILocation(line: 61, column: 16, scope: !1036)
!1056 = !DILocation(line: 62, column: 2, scope: !1036)
!1057 = distinct !DISubprogram(name: "eval.evalSelectorExpr..1command_line_arguments.Context", linkageName: "command_line_arguments.Context.evalSelectorExpr", scope: null, file: !440, line: 88, type: !1058, isLocal: false, isDefinition: true, scopeLine: 88, isOptimized: false, unit: !1, retainedNodes: !3)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!269, !273, !273, !851}
!1060 = !DILocalVariable(name: "c", arg: 1, scope: !1057, file: !440, line: 88, type: !273)
!1061 = !DILocation(line: 88, column: 1, scope: !1057)
!1062 = !DILocalVariable(name: "e", arg: 2, scope: !1057, file: !440, line: 88, type: !851)
!1063 = !DILocation(line: 88, column: 36, scope: !1057)
!1064 = !DILocalVariable(name: "$ret22", scope: !1057, file: !440, line: 88, type: !183)
!1065 = !DILocation(line: 88, column: 58, scope: !1057)
!1066 = !DILocation(line: 89, column: 22, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1057, file: !440, line: 88, column: 1)
!1068 = !DILocation(line: 89, column: 15, scope: !1067)
!1069 = !DILocalVariable(name: "val", scope: !1067, file: !440, line: 89, type: !183)
!1070 = !DILocation(line: 89, column: 2, scope: !1057)
!1071 = !DILocalVariable(name: "err", scope: !1067, file: !440, line: 89, type: !102)
!1072 = !DILocation(line: 90, column: 9, scope: !1067)
!1073 = !DILocalVariable(name: "$ret23", scope: !1057, file: !440, line: 88, type: !102)
!1074 = !DILocation(line: 88, column: 74, scope: !1057)
!1075 = !DILocation(line: 91, column: 3, scope: !1067)
!1076 = !DILocation(line: 93, column: 9, scope: !1067)
!1077 = !DILocation(line: 93, column: 5, scope: !1067)
!1078 = !DILocation(line: 94, column: 12, scope: !1067)
!1079 = !DILocation(line: 95, column: 68, scope: !1067)
!1080 = !DILocation(line: 95, column: 3, scope: !1067)
!1081 = !DILocation(line: 95, column: 15, scope: !1067)
!1082 = !DILocation(line: 98, column: 75, scope: !1067)
!1083 = !DILocation(line: 98, column: 88, scope: !1067)
!1084 = !DILocation(line: 98, column: 92, scope: !1067)
!1085 = !DILocation(line: 98, column: 11, scope: !1067)
!1086 = !DILocation(line: 99, column: 83, scope: !1067)
!1087 = !DILocation(line: 99, column: 98, scope: !1067)
!1088 = !DILocation(line: 99, column: 102, scope: !1067)
!1089 = !DILocation(line: 99, column: 11, scope: !1067)
!1090 = !DILocation(line: 100, column: 11, scope: !1067)
!1091 = !DILocation(line: 101, column: 2, scope: !1067)
!1092 = !DILocalVariable(name: "v", scope: !1067, file: !440, line: 101, type: !183)
!1093 = !DILocation(line: 101, column: 2, scope: !1057)
!1094 = !DILocation(line: 101, column: 25, scope: !1067)
!1095 = !DILocation(line: 101, column: 29, scope: !1067)
!1096 = !DILocation(line: 101, column: 10, scope: !1067)
!1097 = !DILocation(line: 102, column: 7, scope: !1067)
!1098 = !DILocation(line: 102, column: 5, scope: !1067)
!1099 = !DILocation(line: 107, column: 2, scope: !1067)
!1100 = !DILocation(line: 103, column: 64, scope: !1067)
!1101 = !DILocation(line: 103, column: 68, scope: !1067)
!1102 = !DILocation(line: 103, column: 12, scope: !1067)
!1103 = !DILocation(line: 104, column: 16, scope: !1067)
!1104 = !DILocalVariable(name: "v", arg: 1, scope: !1105, file: !1106, line: 18, type: !33)
!1105 = distinct !DISubprogram(name: "eval.printMethods", scope: null, file: !1106, line: 18, type: !1107, isLocal: true, isDefinition: true, scopeLine: 18, isOptimized: false, unit: !1, retainedNodes: !3)
!1106 = !DIFile(filename: "print.go", directory: ".")
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!25, !33}
!1109 = !DILocation(line: 18, column: 19, scope: !1105, inlinedAt: !1110)
!1110 = distinct !DILocation(line: 104, column: 3, scope: !1067)
!1111 = !DILocation(line: 20, column: 6, scope: !1105, inlinedAt: !1110)
!1112 = !DILocation(line: 20, column: 14, scope: !1105, inlinedAt: !1110)
!1113 = !DILocation(line: 21, column: 8, scope: !1105, inlinedAt: !1110)
!1114 = !DILocation(line: 21, column: 5, scope: !1105, inlinedAt: !1110)
!1115 = !DILocalVariable(name: "i", scope: !1116, file: !1106, line: 23, type: !16)
!1116 = distinct !DILexicalBlock(scope: !1105, file: !1106, line: 23, column: 2)
!1117 = !DILocation(line: 23, column: 6, scope: !1105, inlinedAt: !1110)
!1118 = !DILocation(line: 23, column: 19, scope: !1116, inlinedAt: !1110)
!1119 = !DILocation(line: 23, column: 16, scope: !1116, inlinedAt: !1110)
!1120 = !DILocation(line: 24, column: 9, scope: !1121, inlinedAt: !1110)
!1121 = distinct !DILexicalBlock(scope: !1116, file: !1106, line: 23, column: 37)
!1122 = !DILocation(line: 24, column: 16, scope: !1121, inlinedAt: !1110)
!1123 = !DILocation(line: 25, column: 12, scope: !1121, inlinedAt: !1110)
!1124 = !DILocation(line: 23, column: 33, scope: !1116, inlinedAt: !1110)
!1125 = !DILocation(line: 105, column: 105, scope: !1067)
!1126 = !DILocation(line: 105, column: 120, scope: !1067)
!1127 = !DILocation(line: 105, column: 124, scope: !1067)
!1128 = !DILocation(line: 105, column: 66, scope: !1067)
!1129 = !DILocation(line: 105, column: 3, scope: !1067)
!1130 = !DILocation(line: 105, column: 15, scope: !1067)
!1131 = distinct !DISubprogram(name: "eval.evalStmt..1command_line_arguments.Context", linkageName: "command_line_arguments.Context.evalStmt", scope: null, file: !401, line: 9, type: !1132, isLocal: false, isDefinition: true, scopeLine: 9, isOptimized: false, unit: !1, retainedNodes: !3)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!269, !273, !273, !386}
!1134 = !DILocalVariable(name: "c", arg: 1, scope: !1131, file: !401, line: 9, type: !273)
!1135 = !DILocation(line: 9, column: 1, scope: !1131)
!1136 = !DILocalVariable(name: "stmt", arg: 2, scope: !1131, file: !401, line: 9, type: !386)
!1137 = !DILocation(line: 9, column: 28, scope: !1131)
!1138 = !DILocalVariable(name: "$ret28", scope: !1131, file: !401, line: 9, type: !183)
!1139 = !DILocation(line: 9, column: 44, scope: !1131)
!1140 = !DILocation(line: 10, column: 6, scope: !1131)
!1141 = !DILocation(line: 10, column: 2, scope: !1131)
!1142 = !DILocation(line: 17, column: 2, scope: !1131)
!1143 = !DILocation(line: 18, column: 2, scope: !1131)
!1144 = !DILocation(line: 11, column: 15, scope: !1131)
!1145 = !DILocation(line: 12, column: 8, scope: !1131)
!1146 = !DILocation(line: 12, column: 20, scope: !1131)
!1147 = !DILocation(line: 12, column: 6, scope: !1131)
!1148 = !DILocation(line: 13, column: 13, scope: !1131)
!1149 = !DILocation(line: 13, column: 36, scope: !1131)
!1150 = !DILocation(line: 15, column: 11, scope: !1131)
!1151 = !DILocation(line: 15, column: 3, scope: !1131)
!1152 = !DILocation(line: 17, column: 9, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1131, file: !401, line: 19, column: 3)
!1154 = !DILocation(line: 20, column: 2, scope: !1131)
!1155 = !DILocation(line: 18, column: 2, scope: !1153)
!1156 = !DILocalVariable(name: "s", scope: !1153, file: !401, line: 17, type: !581)
!1157 = !DILocation(line: 17, column: 9, scope: !1131)
!1158 = !DILocation(line: 19, column: 11, scope: !1153)
!1159 = !DILocation(line: 19, column: 3, scope: !1153)
!1160 = !DILocation(line: 17, column: 9, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1131, file: !401, line: 21, column: 3)
!1162 = !DILocation(line: 22, column: 2, scope: !1131)
!1163 = !DILocation(line: 20, column: 2, scope: !1161)
!1164 = !DILocalVariable(name: "s", scope: !1161, file: !401, line: 17, type: !985)
!1165 = !DILocation(line: 21, column: 11, scope: !1161)
!1166 = !DILocation(line: 21, column: 3, scope: !1161)
!1167 = !DILocation(line: 17, column: 9, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1131, file: !401, line: 23, column: 3)
!1169 = !DILocation(line: 24, column: 2, scope: !1131)
!1170 = !DILocation(line: 22, column: 2, scope: !1168)
!1171 = !DILocalVariable(name: "s", scope: !1168, file: !401, line: 17, type: !1024)
!1172 = !DILocation(line: 23, column: 11, scope: !1168)
!1173 = !DILocation(line: 23, column: 3, scope: !1168)
!1174 = !DILocation(line: 17, column: 9, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1131, file: !401, line: 25, column: 3)
!1176 = !DILocation(line: 26, column: 2, scope: !1131)
!1177 = !DILocation(line: 0, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1131, file: !401, line: 27, column: 3)
!1179 = !DILocation(line: 24, column: 2, scope: !1175)
!1180 = !DILocalVariable(name: "s", scope: !1175, file: !401, line: 17, type: !404)
!1181 = !DILocation(line: 25, column: 11, scope: !1175)
!1182 = !DILocation(line: 25, column: 3, scope: !1175)
!1183 = !DILocalVariable(name: "s", scope: !1184, file: !401, line: 17, type: !386)
!1184 = distinct !DILexicalBlock(scope: !1131, file: !401, line: 29, column: 3)
!1185 = !DILocation(line: 26, column: 2, scope: !1178)
!1186 = !DILocalVariable(name: "s", scope: !1178, file: !401, line: 17, type: !902)
!1187 = !DILocation(line: 27, column: 11, scope: !1178)
!1188 = !DILocation(line: 27, column: 3, scope: !1178)
!1189 = !DILocation(line: 17, column: 9, scope: !1178)
!1190 = !DILocation(line: 29, column: 63, scope: !1184)
!1191 = !DILocation(line: 29, column: 70, scope: !1184)
!1192 = !DILocation(line: 29, column: 13, scope: !1184)
!1193 = !DILocation(line: 29, column: 3, scope: !1184)
!1194 = distinct !DISubprogram(name: "eval.evalUnaryExpr..1command_line_arguments.Context", linkageName: "command_line_arguments.Context.evalUnaryExpr", scope: null, file: !440, line: 160, type: !1195, isLocal: false, isDefinition: true, scopeLine: 160, isOptimized: false, unit: !1, retainedNodes: !3)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!269, !273, !273, !831}
!1197 = !DILocalVariable(name: "c", arg: 1, scope: !1194, file: !440, line: 160, type: !273)
!1198 = !DILocation(line: 160, column: 1, scope: !1194)
!1199 = !DILocalVariable(name: "e", arg: 2, scope: !1194, file: !440, line: 160, type: !831)
!1200 = !DILocation(line: 160, column: 33, scope: !1194)
!1201 = !DILocalVariable(name: "$ret26", scope: !1194, file: !440, line: 160, type: !183)
!1202 = !DILocation(line: 160, column: 52, scope: !1194)
!1203 = !DILocation(line: 161, column: 21, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1194, file: !440, line: 160, column: 1)
!1205 = !DILocation(line: 161, column: 14, scope: !1204)
!1206 = !DILocalVariable(name: "v1", scope: !1204, file: !440, line: 161, type: !183)
!1207 = !DILocation(line: 161, column: 2, scope: !1194)
!1208 = !DILocalVariable(name: "err", scope: !1204, file: !440, line: 161, type: !102)
!1209 = !DILocation(line: 162, column: 9, scope: !1204)
!1210 = !DILocalVariable(name: "$ret27", scope: !1194, file: !440, line: 160, type: !102)
!1211 = !DILocation(line: 160, column: 68, scope: !1194)
!1212 = !DILocation(line: 163, column: 3, scope: !1204)
!1213 = !DILocation(line: 165, column: 11, scope: !1204)
!1214 = !DILocation(line: 166, column: 10, scope: !1204)
!1215 = !DILocation(line: 168, column: 28, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1204, file: !440, line: 168, column: 3)
!1217 = !DILocation(line: 168, column: 25, scope: !1216)
!1218 = !DILocation(line: 168, column: 17, scope: !1216)
!1219 = !DILocation(line: 168, column: 3, scope: !1216)
!1220 = !DILocalVariable(name: "vv", scope: !1216, file: !440, line: 168, type: !183)
!1221 = !DILocation(line: 168, column: 3, scope: !1204)
!1222 = !DILocation(line: 169, column: 3, scope: !1216)
!1223 = !DILocation(line: 171, column: 13, scope: !1204)
!1224 = !DILocation(line: 171, column: 3, scope: !1204)
!1225 = distinct !DISubprogram(name: "eval.NewContext", linkageName: "command_line_arguments.NewContext", scope: null, file: !11, line: 42, type: !1226, isLocal: false, isDefinition: true, scopeLine: 42, isOptimized: false, unit: !1, retainedNodes: !3)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!1228, !12}
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Context,error}", file: !81, size: 192, align: 8, elements: !1229)
!1229 = !{!1230, !1231}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !81, line: 42, baseType: !273, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !81, line: 42, baseType: !102, size: 128, align: 64, offset: 64)
!1232 = !DILocalVariable(name: "identifiers", arg: 1, scope: !1225, file: !11, line: 42, type: !12)
!1233 = !DILocation(line: 42, column: 17, scope: !1225)
!1234 = !DILocalVariable(name: "$ret4", scope: !1225, file: !11, line: 42, type: !273)
!1235 = !DILocation(line: 42, column: 54, scope: !1225)
!1236 = !DILocation(line: 44, column: 22, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1225, file: !11, line: 42, column: 1)
!1238 = !DILocation(line: 43, column: 7, scope: !1237)
!1239 = !DILocation(line: 43, column: 8, scope: !1237)
!1240 = !DILocalVariable(name: "c", scope: !1237, file: !11, line: 43, type: !273)
!1241 = !DILocation(line: 43, column: 2, scope: !1225)
!1242 = !DILocation(line: 47, column: 2, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1237, file: !11, line: 47, column: 2)
!1244 = !DILocation(line: 48, column: 16, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1243, file: !11, line: 48, column: 3)
!1246 = !DILocation(line: 48, column: 6, scope: !1245)
!1247 = !DILocalVariable(name: "ok", scope: !1245, file: !11, line: 48, type: !64)
!1248 = !DILocation(line: 48, column: 6, scope: !1243)
!1249 = !DILocation(line: 48, column: 3, scope: !1245)
!1250 = !DILocation(line: 49, column: 8, scope: !1245)
!1251 = !DILocation(line: 52, column: 4, scope: !1243)
!1252 = !DILocation(line: 52, column: 20, scope: !1243)
!1253 = !DILocation(line: 54, column: 2, scope: !1237)
!1254 = distinct !DISubprogram(name: "eval.command_line_arguments.EvalError..hash", linkageName: "command_line_arguments.command_line_arguments.EvalError..hash", scope: null, file: !7, line: 1, type: !54, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
