; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22template\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22strings\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22strings\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22strings\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22poll\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_poll..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22testlog\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_testlog..import\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3)
!2 = !DIFile(filename: "./template.go", directory: "/home/wangcong/go_path/src/github.com/ChrisRx/dungeonfs/pkg/exec/template")
!3 = !{}
!4 = distinct !DISubprogram(name: "template.Escape", linkageName: "command_line_arguments.Escape", scope: null, file: !5, line: 8, type: !6, isLocal: false, isDefinition: true, scopeLine: 8, isOptimized: false, unit: !1, retainedNodes: !3)
!5 = !DIFile(filename: "template.go", directory: ".")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !8}
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !9, line: 1, size: 128, align: 8, elements: !10)
!9 = !DIFile(filename: "<built-in>", directory: "")
!10 = !{!11, !14}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !9, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !9, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!15 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!16 = !DILocalVariable(name: "s", arg: 1, scope: !4, file: !5, line: 8, type: !8)
!17 = !DILocation(line: 8, column: 13, scope: !4)
!18 = !DILocation(line: 9, column: 17, scope: !4)
!19 = !DILocation(line: 9, column: 2, scope: !4)
!20 = distinct !DISubprogram(name: "template.Echo", linkageName: "command_line_arguments.Echo", scope: null, file: !5, line: 12, type: !21, isLocal: false, isDefinition: true, scopeLine: 12, isOptimized: false, unit: !1, retainedNodes: !3)
!21 = !DISubroutineType(types: !22)
!22 = !{!8, !8, !23}
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*_type,*void},int,int}", file: !24, size: 192, align: 8, elements: !25)
!24 = !DIFile(filename: "", directory: "")
!25 = !{!26, !80, !81}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !24, size: 128, align: 8, elements: !29)
!29 = !{!30, !83}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !24, line: 1, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !9, line: 1, size: 576, align: 8, elements: !33)
!33 = !{!34, !36, !37, !39, !40, !41, !42, !52, !61, !62, !64, !82}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !9, line: 1, baseType: !35, size: 64, align: 64)
!35 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !9, line: 1, baseType: !35, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !9, line: 1, baseType: !38, size: 32, align: 32, offset: 128)
!38 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !9, line: 1, baseType: !13, size: 8, align: 8, offset: 160)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !9, line: 1, baseType: !13, size: 8, align: 8, offset: 168)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !9, line: 1, baseType: !13, size: 8, align: 8, offset: 176)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !9, line: 1, baseType: !43, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !9, line: 1, size: 64, align: 8, elements: !45)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !9, line: 1, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!35, !50, !35}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIBasicType(name: "void")
!52 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !9, line: 1, baseType: !53, size: 64, align: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !9, line: 1, size: 64, align: 8, elements: !55)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !9, line: 1, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!60, !50, !50}
!60 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !9, line: 1, baseType: !12, size: 64, align: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !9, line: 1, baseType: !63, size: 64, align: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !9, line: 1, baseType: !65, size: 64, align: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !9, line: 1, size: 320, align: 8, elements: !67)
!67 = !{!68, !69, !70}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !9, line: 1, baseType: !63, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !9, line: 1, baseType: !63, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !9, line: 1, baseType: !71, size: 192, align: 64, offset: 128)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !24, size: 192, align: 8, elements: !72)
!72 = !{!73, !80, !81}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !9, line: 1, size: 320, align: 8, elements: !76)
!76 = !{!68, !69, !77, !78, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !9, line: 1, baseType: !50, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !9, line: 1, baseType: !50, size: 64, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !9, line: 1, baseType: !50, size: 64, align: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !24, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !24, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !9, line: 1, baseType: !50, size: 64, align: 64, offset: 512)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !24, line: 1, baseType: !50, size: 64, align: 64, offset: 64)
!84 = !DILocalVariable(name: "a", arg: 2, scope: !20, file: !5, line: 12, type: !23)
!85 = !DILocation(line: 12, column: 26, scope: !20)
!86 = !DILocalVariable(name: "format", arg: 1, scope: !20, file: !5, line: 12, type: !8)
!87 = !DILocation(line: 12, column: 11, scope: !20)
!88 = !DILocation(line: 13, column: 11, scope: !89)
!89 = distinct !DILexicalBlock(scope: !20, file: !5, line: 12, column: 1)
!90 = !DILocalVariable(name: "s", scope: !89, file: !5, line: 13, type: !8)
!91 = !DILocation(line: 13, column: 2, scope: !20)
!92 = !DILocation(line: 14, column: 13, scope: !89)
!93 = !DILocation(line: 14, column: 2, scope: !89)
!94 = distinct !DISubprogram(name: "template.Command", linkageName: "command_line_arguments.Command", scope: null, file: !5, line: 17, type: !21, isLocal: false, isDefinition: true, scopeLine: 17, isOptimized: false, unit: !1, retainedNodes: !3)
!95 = !DILocalVariable(name: "a", arg: 2, scope: !94, file: !5, line: 17, type: !23)
!96 = !DILocation(line: 17, column: 29, scope: !94)
!97 = !DILocalVariable(name: "format", arg: 1, scope: !94, file: !5, line: 17, type: !8)
!98 = !DILocation(line: 17, column: 14, scope: !94)
!99 = !DILocation(line: 18, column: 11, scope: !100)
!100 = distinct !DILexicalBlock(scope: !94, file: !5, line: 17, column: 1)
!101 = !DILocalVariable(name: "s", scope: !100, file: !5, line: 18, type: !8)
!102 = !DILocation(line: 18, column: 2, scope: !94)
!103 = !DILocation(line: 19, column: 13, scope: !100)
!104 = !DILocation(line: 19, column: 2, scope: !100)
!105 = distinct !DISubprogram(name: "template.Script", linkageName: "command_line_arguments.Script", scope: null, file: !5, line: 22, type: !106, isLocal: false, isDefinition: true, scopeLine: 22, isOptimized: false, unit: !1, retainedNodes: !3)
!106 = !DISubroutineType(types: !107)
!107 = !{!108, !111}
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !24, size: 192, align: 8, elements: !109)
!109 = !{!110, !80, !81}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !12, size: 64, align: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !24, size: 192, align: 8, elements: !112)
!112 = !{!113, !80, !81}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !63, size: 64, align: 64)
!114 = !DILocalVariable(name: "commands", arg: 1, scope: !105, file: !5, line: 22, type: !111)
!115 = !DILocation(line: 22, column: 13, scope: !105)
!116 = !DILocation(line: 23, column: 13, scope: !117)
!117 = distinct !DILexicalBlock(scope: !105, file: !5, line: 22, column: 1)
!118 = !DILocalVariable(name: "b", scope: !117, file: !5, line: 23, type: !108)
!119 = !DILocation(line: 23, column: 2, scope: !105)
!120 = !DILocation(line: 24, column: 2, scope: !121)
!121 = distinct !DILexicalBlock(scope: !117, file: !5, line: 24, column: 2)
!122 = !DILocalVariable(name: "c", scope: !121, file: !5, line: 24, type: !8)
!123 = !DILocation(line: 24, column: 6, scope: !117)
!124 = !DILocation(line: 25, column: 23, scope: !121)
!125 = !DILocation(line: 25, column: 7, scope: !121)
!126 = !DILocation(line: 25, column: 5, scope: !121)
!127 = !DILocation(line: 0, scope: !121)
!128 = !DILocalVariable(name: "$ret3", scope: !105, file: !5, line: 22, type: !108)
!129 = !DILocation(line: 22, column: 33, scope: !105)
!130 = !DILocation(line: 27, column: 2, scope: !117)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "template"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "command-line-arguments"
	.ascii ";\n"
	.ascii "import "
	.ascii "fmt"
	.ascii " "
	.ascii "fmt"
	.ascii " \""
	.ascii "fmt"
	.ascii "\";\n"
	.ascii "import "
	.ascii "strings"
	.ascii " "
	.ascii "strings"
	.ascii " \""
	.ascii "strings"
	.ascii "\";\n"
	.ascii "init"
	.ascii " "
	.ascii "fmt"
