; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22core\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fuse\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bazil.org/fuse\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bazil.org/fuse\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fs\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bazil.org/fuse/fs\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bazil.org/fuse/fs\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fuseutil\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bazil.org/fuse/fuseutil\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bazil.org/fuse/fuseutil\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \5C\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./dir.go", directory: "/home/wangcong/go_path/src/github.com/ChrisRx/dungeonfs/pkg/game/fs/core")
!3 = !{}
!4 = !{!5, !16, !92, !355, !357, !359, !373, !375}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.currentPath", linkageName: "command_line_arguments.currentPath", scope: !1, file: !7, line: 15, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "dir.go", directory: ".")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !9, line: 1, size: 128, align: 8, elements: !10)
!9 = !DIFile(filename: "<built-in>", directory: "")
!10 = !{!11, !14}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !9, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !9, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!15 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "command_line_arguments.PkgLogger", linkageName: "command_line_arguments.PkgLogger", scope: !1, file: !18, line: 11, type: !19, isLocal: false, isDefinition: true)
!18 = !DIFile(filename: "logging.go", directory: ".")
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.logger", file: !18, line: 7, size: 128, align: 8, elements: !20)
!20 = !{!21, !91}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !18, line: 7, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string,struct{*Handle,int,int})void}", file: !24, size: 128, align: 8, elements: !25)
!24 = !DIFile(filename: "", directory: "")
!25 = !{!26, !79}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !24, line: 7, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !9, line: 1, size: 576, align: 8, elements: !29)
!29 = !{!30, !32, !33, !35, !36, !37, !38, !48, !57, !58, !60, !78}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !9, line: 1, baseType: !31, size: 64, align: 64)
!31 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !9, line: 1, baseType: !31, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !9, line: 1, baseType: !34, size: 32, align: 32, offset: 128)
!34 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !9, line: 1, baseType: !13, size: 8, align: 8, offset: 160)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !9, line: 1, baseType: !13, size: 8, align: 8, offset: 168)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !9, line: 1, baseType: !13, size: 8, align: 8, offset: 176)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !9, line: 1, baseType: !39, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !9, line: 1, size: 64, align: 8, elements: !41)
!41 = !{!42}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !9, line: 1, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!31, !46, !31}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIBasicType(name: "void")
!48 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !9, line: 1, baseType: !49, size: 64, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !9, line: 1, size: 64, align: 8, elements: !51)
!51 = !{!52}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !9, line: 1, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !46, !46}
!56 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !9, line: 1, baseType: !12, size: 64, align: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !9, line: 1, baseType: !59, size: 64, align: 64, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !9, line: 1, baseType: !61, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !9, line: 1, size: 320, align: 8, elements: !63)
!63 = !{!64, !65, !66}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !9, line: 1, baseType: !59, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !9, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !9, line: 1, baseType: !67, size: 192, align: 64, offset: 128)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !24, size: 192, align: 8, elements: !68)
!68 = !{!69, !76, !77}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !9, line: 1, size: 320, align: 8, elements: !72)
!72 = !{!64, !65, !73, !74, !75}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !9, line: 1, baseType: !46, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !9, line: 1, baseType: !46, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !9, line: 1, baseType: !46, size: 64, align: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !24, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !24, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !9, line: 1, baseType: !46, size: 64, align: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Printf", file: !24, line: 7, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!47, !46, !8, !83}
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Handle,int,int}", file: !24, size: 192, align: 8, elements: !84)
!84 = !{!85, !76, !77}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "Handle", file: !7, line: 8, size: 128, align: 8, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !7, line: 1, baseType: !27, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !46, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !18, line: 1, baseType: !46, size: 64, align: 64, offset: 64)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "command_line_arguments.GameEngine", linkageName: "command_line_arguments.GameEngine", scope: !1, file: !94, line: 20, type: !95, isLocal: false, isDefinition: true)
!94 = !DIFile(filename: "fs.go", directory: ".")
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Engine", file: !7, line: 11, size: 128, align: 8, elements: !96)
!96 = !{!97, !90}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 11, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Node)error,*func(*void,ActionType,string,Node)Node,*func(*void,Node)struct{struct{*Dirent,int,int},error}}", file: !24, size: 256, align: 8, elements: !100)
!100 = !{!101, !102, !338, !343}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !24, line: 11, baseType: !27, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Access", file: !24, line: 11, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!106, !46, !118}
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !9, line: 1, size: 128, align: 8, elements: !107)
!107 = !{!108, !117}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !9, line: 1, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !24, size: 128, align: 8, elements: !111)
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !24, line: 1, baseType: !27, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !24, line: 1, baseType: !114, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!8, !46}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !9, line: 1, baseType: !46, size: 64, align: 64, offset: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !7, line: 11, size: 128, align: 8, elements: !119)
!119 = !{!120, !90}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 11, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Context,*Attr)error,*func(*void)Nodes,*func(*void)struct{*uint8,int,int},*func(*void)bool,*func(*void)Dirent,*func(*void)bool,*func(*void)bool,*func(*void)NodeMetaData,*func(*void)string,*func(*void,NodeType,string)Node,*func(*void,struct{*Node,int,int})Node,*func(*void,struct{*string,int,int})string}", file: !24, size: 832, align: 8, elements: !123)
!123 = !{!101, !124, !211, !251, !258, !262, !272, !273, !274, !321, !322, !327, !331}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Attr", file: !24, line: 11, baseType: !125, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!106, !46, !128, !191}
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !7, line: 8, size: 128, align: 8, elements: !129)
!129 = !{!130, !90}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 8, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,Handle)Handle}", file: !24, size: 320, align: 8, elements: !133)
!133 = !{!134, !135, !177, !183, !187}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !24, line: 8, baseType: !27, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !24, line: 8, baseType: !136, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!139, !46}
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !24, size: 256, align: 8, elements: !140)
!140 = !{!141, !176}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !24, line: 8, baseType: !142, size: 192, align: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 4, size: 192, align: 8, elements: !143)
!143 = !{!144, !146, !148}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 4, baseType: !145, size: 64, align: 64)
!145 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 4, baseType: !147, size: 64, align: 64, offset: 64)
!147 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 4, baseType: !149, size: 64, align: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 4, size: 704, align: 8, elements: !151)
!151 = !{!152, !153, !162, !173, !174, !175}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 4, baseType: !8, size: 128, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 4, baseType: !154, size: 192, align: 64, offset: 128)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !24, size: 192, align: 8, elements: !155)
!155 = !{!156, !76, !77}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 4, size: 256, align: 8, elements: !159)
!159 = !{!152, !160, !161}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 4, baseType: !15, size: 64, align: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 4, baseType: !56, size: 8, align: 8, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 4, baseType: !163, size: 192, align: 64, offset: 320)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !24, size: 192, align: 8, elements: !164)
!164 = !{!165, !76, !77}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 4, size: 128, align: 8, elements: !168)
!168 = !{!169, !170, !171, !172}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 4, baseType: !147, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 4, baseType: !13, size: 8, align: 8, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 4, baseType: !56, size: 8, align: 8, offset: 72)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 4, baseType: !56, size: 8, align: 8, offset: 80)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 4, baseType: !147, size: 64, align: 64, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 4, baseType: !147, size: 64, align: 64, offset: 576)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 4, baseType: !157, size: 64, align: 64, offset: 640)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !24, line: 8, baseType: !56, size: 8, align: 8, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !24, line: 8, baseType: !178, size: 64, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!181, !46}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !9, line: 1, align: 8, elements: !3)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !24, line: 8, baseType: !184, size: 64, align: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!106, !46}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !24, line: 8, baseType: !188, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!87, !46, !87}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "Attr", file: !7, line: 7, size: 1280, align: 8, elements: !193)
!193 = !{!194, !196, !197, !198, !199, !200, !201, !202, !203, !205, !206, !207, !208, !209, !210}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", file: !7, line: 7, baseType: !195, size: 64, align: 64)
!195 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Inode", file: !7, line: 7, baseType: !145, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !7, line: 7, baseType: !145, size: 64, align: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Blocks", file: !7, line: 7, baseType: !145, size: 64, align: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Atime", file: !7, line: 7, baseType: !142, size: 192, align: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Mtime", file: !7, line: 7, baseType: !142, size: 192, align: 64, offset: 448)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Ctime", file: !7, line: 7, baseType: !142, size: 192, align: 64, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Crtime", file: !7, line: 7, baseType: !142, size: 192, align: 64, offset: 832)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", file: !7, line: 7, baseType: !204, size: 32, align: 32, offset: 1024)
!204 = !DIBasicType(name: "FileMode", size: 32, encoding: DW_ATE_unsigned)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Nlink", file: !7, line: 7, baseType: !34, size: 32, align: 32, offset: 1056)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Uid", file: !7, line: 7, baseType: !34, size: 32, align: 32, offset: 1088)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Gid", file: !7, line: 7, baseType: !34, size: 32, align: 32, offset: 1120)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Rdev", file: !7, line: 7, baseType: !34, size: 32, align: 32, offset: 1152)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !7, line: 7, baseType: !34, size: 32, align: 32, offset: 1184)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "BlockSize", file: !7, line: 7, baseType: !34, size: 32, align: 32, offset: 1216)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Children", file: !24, line: 11, baseType: !212, size: 64, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!215, !46}
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "Nodes", file: !7, line: 11, size: 128, align: 8, elements: !216)
!216 = !{!217, !90}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 11, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)void,*func(*void)struct{*Node,int,int},*func(*void,string)bool,*func(*void)struct{*Node,int,int},*func(*void,string)struct{Node,bool},*func(*void)struct{*Node,int,int},*func(*void,string,Node)void}", file: !24, size: 512, align: 8, elements: !220)
!220 = !{!101, !221, !225, !233, !237, !238, !246, !247}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Delete", file: !24, line: 11, baseType: !222, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!47, !46, !8}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Directories", file: !24, line: 11, baseType: !226, size: 64, align: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!229, !46}
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Node,int,int}", file: !24, size: 192, align: 8, elements: !230)
!230 = !{!231, !76, !77}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Exists", file: !24, line: 11, baseType: !234, size: 64, align: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!56, !46, !8}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Files", file: !24, line: 11, baseType: !226, size: 64, align: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !24, line: 11, baseType: !239, size: 64, align: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!242, !46, !8}
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Node,bool}", file: !24, size: 192, align: 8, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 11, baseType: !118, size: 128, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 11, baseType: !56, size: 8, align: 8, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Iter", file: !24, line: 11, baseType: !226, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Set", file: !24, line: 11, baseType: !248, size: 64, align: 64, offset: 448)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!47, !46, !8, !118}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Content", file: !24, line: 11, baseType: !252, size: 64, align: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!255, !46}
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !24, size: 192, align: 8, elements: !256)
!256 = !{!257, !76, !77}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !12, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Delete", file: !24, line: 11, baseType: !259, size: 64, align: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!56, !46}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Entry", file: !24, line: 11, baseType: !263, size: 64, align: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!266, !46}
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dirent", file: !7, line: 7, size: 256, align: 8, elements: !267)
!267 = !{!268, !269, !271}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Inode", file: !7, line: 7, baseType: !145, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !7, line: 7, baseType: !270, size: 32, align: 32, offset: 64)
!270 = !DIBasicType(name: "DirentType", size: 32, encoding: DW_ATE_unsigned)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !7, line: 7, baseType: !8, size: 128, align: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "IsDir", file: !24, line: 11, baseType: !259, size: 64, align: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "IsFile", file: !24, line: 11, baseType: !259, size: 64, align: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "MetaData", file: !24, line: 11, baseType: !275, size: 64, align: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!278, !46}
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "NodeMetaData", file: !7, line: 11, size: 128, align: 8, elements: !279)
!279 = !{!280, !90}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 11, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)struct{Handle,bool},*func(*void,string)bool,*func(*void,string)struct{*uint8,int,int},*func(*void,string)string,*func(*void).command-line-arguments.nodes,*func(*void,string,Handle)void}", file: !24, size: 448, align: 8, elements: !283)
!283 = !{!101, !284, !291, !292, !296, !300, !317}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !24, line: 11, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!288, !46, !8}
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Handle,bool}", file: !24, size: 192, align: 8, elements: !289)
!289 = !{!290, !245}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 11, baseType: !87, size: 128, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "GetBool", file: !24, line: 11, baseType: !234, size: 64, align: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "GetBytes", file: !24, line: 11, baseType: !293, size: 64, align: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!255, !46, !8}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "GetString", file: !24, line: 11, baseType: !297, size: 64, align: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!8, !46, !8}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Iter", file: !24, line: 11, baseType: !301, size: 64, align: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!304, !46}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !9, line: 1, size: 384, align: 8, elements: !306)
!306 = !{!307, !308, !309, !310, !312, !313, !314, !315, !316}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !9, line: 1, baseType: !15, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !9, line: 1, baseType: !13, size: 8, align: 8, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !9, line: 1, baseType: !13, size: 8, align: 8, offset: 72)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !9, line: 1, baseType: !311, size: 16, align: 16, offset: 80)
!311 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !9, line: 1, baseType: !34, size: 32, align: 32, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !9, line: 1, baseType: !46, size: 64, align: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !9, line: 1, baseType: !46, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !9, line: 1, baseType: !31, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !9, line: 1, baseType: !46, size: 64, align: 64, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Set", file: !24, line: 11, baseType: !318, size: 64, align: 64, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!47, !46, !8, !87}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !24, line: 11, baseType: !114, size: 64, align: 64, offset: 576)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "New", file: !24, line: 11, baseType: !323, size: 64, align: 64, offset: 640)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!118, !46, !326, !8}
!326 = !DIBasicType(name: "NodeType", size: 64, encoding: DW_ATE_signed)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Parent", file: !24, line: 11, baseType: !328, size: 64, align: 64, offset: 704)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!118, !46, !229}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !24, line: 11, baseType: !332, size: 64, align: 64, offset: 768)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!8, !46, !335}
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !24, size: 192, align: 8, elements: !336)
!336 = !{!337, !76, !77}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !59, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Actions", file: !24, line: 11, baseType: !339, size: 64, align: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!118, !46, !342, !8, !118}
!342 = !DIBasicType(name: "ActionType", size: 64, encoding: DW_ATE_signed)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Entities", file: !24, line: 11, baseType: !344, size: 64, align: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!347, !46, !118}
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*Dirent,int,int},error}", file: !24, size: 320, align: 8, elements: !348)
!348 = !{!349, !354}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 118, baseType: !350, size: 192, align: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Dirent,int,int}", file: !24, size: 192, align: 8, elements: !351)
!351 = !{!352, !76, !77}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 118, baseType: !106, size: 128, align: 64, offset: 192)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !9, line: 1, type: !34, isLocal: false, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "command_line_arguments.Name", linkageName: "command_line_arguments.Name", scope: !1, file: !94, line: 17, type: !8, isLocal: false, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "os.Interrupt", linkageName: "os.Interrupt", scope: !1, file: !7, line: 4, type: !361, isLocal: false, isDefinition: true)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "Signal", file: !7, line: 4, size: 128, align: 8, elements: !362)
!362 = !{!363, !90}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 4, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)string}", file: !24, size: 192, align: 8, elements: !366)
!366 = !{!367, !368, !372}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !24, line: 4, baseType: !27, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Signal", file: !24, line: 4, baseType: !369, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!47, !46}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !24, line: 4, baseType: !114, size: 64, align: 64, offset: 128)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "os.Kill", linkageName: "os.Kill", scope: !1, file: !7, line: 4, type: !361, isLocal: false, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "command_line_arguments.inode", linkageName: "command_line_arguments.inode", scope: !1, file: !377, line: 101, type: !145, isLocal: true, isDefinition: true)
!377 = !DIFile(filename: "node.go", directory: ".")
!378 = distinct !DISubprogram(name: "core.Directories..stub.command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.Directories..stub", scope: null, file: !377, line: 118, type: !379, isLocal: false, isDefinition: true, scopeLine: 118, isOptimized: false, unit: !1, retainedNodes: !3)
!379 = !DISubroutineType(types: !380)
!380 = !{!229, !381, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "Directory", file: !7, line: 17, size: 640, align: 8, elements: !383)
!383 = !{!384}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "node", file: !7, line: 18, baseType: !385, size: 640, align: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.node", file: !377, line: 15, size: 640, align: 8, elements: !386)
!386 = !{!387, !388, !389, !390, !391, !392, !393}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "inode", file: !377, line: 16, baseType: !145, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !377, line: 17, baseType: !8, size: 128, align: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mode", file: !377, line: 18, baseType: !204, size: 32, align: 32, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "path", file: !377, line: 19, baseType: !8, size: 128, align: 64, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", file: !377, line: 20, baseType: !304, size: 64, align: 64, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !377, line: 22, baseType: !118, size: 128, align: 64, offset: 448)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", file: !377, line: 23, baseType: !304, size: 64, align: 64, offset: 576)
!394 = !DILocalVariable(name: "$this31.pointer", arg: 1, scope: !378, file: !377, line: 118, type: !381)
!395 = !DILocation(line: 118, column: 27, scope: !378)
!396 = !DILocation(line: 17, column: 6, scope: !397)
!397 = !DILexicalBlockFile(scope: !378, file: !7, discriminator: 0)
!398 = distinct !DISubprogram(name: "core.Exists..stub.command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.Exists..stub", scope: null, file: !377, line: 128, type: !399, isLocal: false, isDefinition: true, scopeLine: 128, isOptimized: false, unit: !1, retainedNodes: !3)
!399 = !DISubroutineType(types: !400)
!400 = !{!56, !381, !381, !8}
!401 = !DILocalVariable(name: "$this19.pointer", arg: 1, scope: !398, file: !377, line: 128, type: !381)
!402 = !DILocation(line: 128, column: 22, scope: !398)
!403 = !DILocalVariable(name: "$p20", arg: 2, scope: !398, file: !377, line: 128, type: !8)
!404 = !DILocation(line: 128, column: 23, scope: !398)
!405 = !DILocalVariable(name: "$ret76", scope: !398, file: !377, line: 128, type: !56)
!406 = !DILocation(line: 128, column: 35, scope: !398)
!407 = !DILocation(line: 17, column: 6, scope: !408)
!408 = !DILexicalBlockFile(scope: !398, file: !7, discriminator: 0)
!409 = distinct !DISubprogram(name: "core.Files..stub.command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.Files..stub", scope: null, file: !377, line: 135, type: !379, isLocal: false, isDefinition: true, scopeLine: 135, isOptimized: false, unit: !1, retainedNodes: !3)
!410 = !DILocalVariable(name: "$this22.pointer", arg: 1, scope: !409, file: !377, line: 135, type: !381)
!411 = !DILocation(line: 135, column: 21, scope: !409)
!412 = !DILocation(line: 17, column: 6, scope: !413)
!413 = !DILexicalBlockFile(scope: !409, file: !7, discriminator: 0)
!414 = distinct !DISubprogram(name: "core.Get..stub.command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.Get..stub", scope: null, file: !377, line: 146, type: !415, isLocal: false, isDefinition: true, scopeLine: 146, isOptimized: false, unit: !1, retainedNodes: !3)
!415 = !DISubroutineType(types: !416)
!416 = !{!242, !381, !381, !8}
!417 = !DILocalVariable(name: "$this28.pointer", arg: 1, scope: !414, file: !377, line: 146, type: !381)
!418 = !DILocation(line: 146, column: 19, scope: !414)
!419 = !DILocalVariable(name: "$p29", arg: 2, scope: !414, file: !377, line: 146, type: !8)
!420 = !DILocation(line: 146, column: 20, scope: !414)
!421 = !DILocalVariable(name: "$ret82", scope: !414, file: !377, line: 146, type: !56)
!422 = !DILocation(line: 146, column: 42, scope: !414)
!423 = !DILocation(line: 17, column: 6, scope: !424)
!424 = !DILexicalBlockFile(scope: !414, file: !7, discriminator: 0)
!425 = distinct !DISubprogram(name: "core.Iter..stub.command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.Iter..stub", scope: null, file: !377, line: 110, type: !379, isLocal: false, isDefinition: true, scopeLine: 110, isOptimized: false, unit: !1, retainedNodes: !3)
!426 = !DILocalVariable(name: "$this24.pointer", arg: 1, scope: !425, file: !377, line: 110, type: !381)
!427 = !DILocation(line: 110, column: 20, scope: !425)
!428 = !DILocation(line: 17, column: 6, scope: !429)
!429 = !DILexicalBlockFile(scope: !425, file: !7, discriminator: 0)
!430 = distinct !DISubprogram(name: "core.Set..stub.command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.Set..stub", scope: null, file: !377, line: 157, type: !431, isLocal: false, isDefinition: true, scopeLine: 157, isOptimized: false, unit: !1, retainedNodes: !3)
!431 = !DISubroutineType(types: !432)
!432 = !{!47, !381, !381, !8, !118}
!433 = !DILocalVariable(name: "$this25.pointer", arg: 1, scope: !430, file: !377, line: 157, type: !381)
!434 = !DILocation(line: 157, column: 19, scope: !430)
!435 = !DILocalVariable(name: "$p26", arg: 2, scope: !430, file: !377, line: 157, type: !8)
!436 = !DILocation(line: 157, column: 20, scope: !430)
!437 = !DILocalVariable(name: "$p27", arg: 3, scope: !430, file: !377, line: 157, type: !118)
!438 = !DILocation(line: 157, column: 32, scope: !430)
!439 = !DILocation(line: 17, column: 6, scope: !440)
!440 = !DILexicalBlockFile(scope: !430, file: !7, discriminator: 0)
!441 = distinct !DISubprogram(name: "core.Access..1command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.Access", scope: null, file: !7, line: 63, type: !442, isLocal: false, isDefinition: true, scopeLine: 63, isOptimized: false, unit: !1, retainedNodes: !3)
!442 = !DISubroutineType(types: !443)
!443 = !{!106, !381, !381, !128, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccessRequest", file: !7, line: 7, size: 448, align: 8, elements: !446)
!446 = !{!447, !547}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !7, line: 7, baseType: !448, size: 384, align: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "Header", file: !7, line: 7, size: 384, align: 8, elements: !449)
!449 = !{!450, !524, !526, !528, !529, !530, !531}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "Conn", file: !7, line: 7, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !7, line: 7, size: 704, align: 8, elements: !453)
!453 = !{!454, !455, !456, !505, !518, !519}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Ready", file: !7, line: 7, baseType: !181, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "MountError", file: !7, line: 7, baseType: !106, size: 128, align: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "dev", file: !7, line: 7, baseType: !457, size: 64, align: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !7, line: 4, size: 64, align: 8, elements: !459)
!459 = !{!460}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !7, line: 4, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !7, line: 4, size: 640, align: 8, elements: !463)
!463 = !{!464, !494, !495, !503, !504}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !7, line: 4, baseType: !465, size: 384, align: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !7, line: 4, size: 384, align: 8, elements: !466)
!466 = !{!467, !473, !474, !478, !489, !490, !491, !492, !493}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !7, line: 4, baseType: !468, size: 128, align: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !7, line: 4, size: 128, align: 8, elements: !469)
!469 = !{!470, !471, !472}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 4, baseType: !145, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !7, line: 4, baseType: !34, size: 32, align: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !7, line: 4, baseType: !34, size: 32, align: 32, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !7, line: 4, baseType: !15, size: 64, align: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !7, line: 4, baseType: !475, size: 64, align: 64, offset: 192)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !7, line: 4, size: 64, align: 8, elements: !476)
!476 = !{!477}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !7, line: 4, baseType: !31, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !7, line: 4, baseType: !479, size: 64, align: 64, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !24, size: 192, align: 8, elements: !481)
!481 = !{!482, !76, !77}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !7, line: 4, size: 128, align: 8, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !7, line: 4, baseType: !12, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !7, line: 4, baseType: !488, size: 64, align: 64, offset: 64)
!488 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !7, line: 4, baseType: !34, size: 32, align: 32, offset: 320)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !7, line: 4, baseType: !56, size: 8, align: 8, offset: 352)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !7, line: 4, baseType: !56, size: 8, align: 8, offset: 360)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !7, line: 4, baseType: !56, size: 8, align: 8, offset: 368)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !7, line: 4, baseType: !56, size: 8, align: 8, offset: 376)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 4, baseType: !8, size: 128, align: 64, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !7, line: 4, baseType: !496, size: 64, align: 64, offset: 512)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !7, line: 4, size: 256, align: 8, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 4, baseType: !255, size: 192, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !7, line: 4, baseType: !501, size: 64, align: 64, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !7, line: 4, align: 8, elements: !3)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !7, line: 4, baseType: !56, size: 8, align: 8, offset: 576)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !7, line: 4, baseType: !56, size: 8, align: 8, offset: 584)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "wio", file: !7, line: 7, baseType: !506, size: 192, align: 32, offset: 256)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !7, line: 4, size: 192, align: 8, elements: !507)
!507 = !{!508, !514, !515, !516, !517}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !7, line: 4, baseType: !509, size: 64, align: 32)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 4, size: 64, align: 8, elements: !510)
!510 = !{!511, !513}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 4, baseType: !512, size: 32, align: 32)
!512 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 4, baseType: !34, size: 32, align: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !7, line: 4, baseType: !34, size: 32, align: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !7, line: 4, baseType: !34, size: 32, align: 32, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !7, line: 4, baseType: !512, size: 32, align: 32, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !7, line: 4, baseType: !512, size: 32, align: 32, offset: 160)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "rio", file: !7, line: 7, baseType: !506, size: 192, align: 32, offset: 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "proto", file: !7, line: 7, baseType: !520, size: 64, align: 32, offset: 640)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "Protocol", file: !7, line: 7, size: 64, align: 8, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Major", file: !7, line: 7, baseType: !34, size: 32, align: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Minor", file: !7, line: 7, baseType: !34, size: 32, align: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ID", file: !7, line: 7, baseType: !525, size: 64, align: 64, offset: 64)
!525 = !DIBasicType(name: "RequestID", size: 64, encoding: DW_ATE_unsigned)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Node", file: !7, line: 7, baseType: !527, size: 64, align: 64, offset: 128)
!527 = !DIBasicType(name: "NodeID", size: 64, encoding: DW_ATE_unsigned)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "Uid", file: !7, line: 7, baseType: !34, size: 32, align: 32, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Gid", file: !7, line: 7, baseType: !34, size: 32, align: 32, offset: 224)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Pid", file: !7, line: 7, baseType: !34, size: 32, align: 32, offset: 256)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "msg", file: !7, line: 7, baseType: !532, size: 64, align: 64, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: ".bazil.org/fuse.message", file: !7, line: 7, size: 384, align: 8, elements: !534)
!534 = !{!535, !536, !537, !546}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "conn", file: !7, line: 7, baseType: !451, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 7, baseType: !255, size: 192, align: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", file: !7, line: 7, baseType: !538, size: 64, align: 64, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: ".bazil.org/fuse.inHeader", file: !7, line: 7, size: 320, align: 8, elements: !540)
!540 = !{!541, !542, !543, !544, !528, !529, !530, !545}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !7, line: 7, baseType: !34, size: 32, align: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Opcode", file: !7, line: 7, baseType: !34, size: 32, align: 32, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Unique", file: !7, line: 7, baseType: !145, size: 64, align: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Nodeid", file: !7, line: 7, baseType: !145, size: 64, align: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_", file: !7, line: 7, baseType: !34, size: 32, align: 32, offset: 288)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "off", file: !7, line: 7, baseType: !15, size: 64, align: 64, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !7, line: 7, baseType: !34, size: 32, align: 32, offset: 384)
!548 = !DILocalVariable(name: "d", arg: 1, scope: !441, file: !7, line: 63, type: !381)
!549 = !DILocation(line: 63, column: 1, scope: !441)
!550 = !DILocalVariable(name: "ctx", arg: 2, scope: !441, file: !7, line: 63, type: !128)
!551 = !DILocation(line: 63, column: 28, scope: !441)
!552 = !DILocalVariable(name: "req", arg: 3, scope: !441, file: !7, line: 63, type: !444)
!553 = !DILocation(line: 63, column: 49, scope: !441)
!554 = !DILocation(line: 64, column: 62, scope: !441)
!555 = !DILocation(line: 64, column: 72, scope: !441)
!556 = !DILocation(line: 64, column: 11, scope: !441)
!557 = !DILocation(line: 65, column: 19, scope: !441)
!558 = !DILocation(line: 65, column: 27, scope: !441)
!559 = !DILocation(line: 65, column: 2, scope: !441)
!560 = distinct !DISubprogram(name: "core.Attr..1command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.Attr", scope: null, file: !7, line: 55, type: !561, isLocal: false, isDefinition: true, scopeLine: 55, isOptimized: false, unit: !1, retainedNodes: !3)
!561 = !DISubroutineType(types: !562)
!562 = !{!106, !381, !381, !128, !191}
!563 = !DILocalVariable(name: "d", arg: 1, scope: !560, file: !7, line: 55, type: !381)
!564 = !DILocation(line: 55, column: 1, scope: !560)
!565 = !DILocalVariable(name: "ctx", arg: 2, scope: !560, file: !7, line: 55, type: !128)
!566 = !DILocation(line: 55, column: 26, scope: !560)
!567 = !DILocalVariable(name: "a", arg: 3, scope: !560, file: !7, line: 55, type: !191)
!568 = !DILocation(line: 55, column: 47, scope: !560)
!569 = !DILocation(line: 56, column: 3, scope: !560)
!570 = !DILocation(line: 56, column: 13, scope: !560)
!571 = !DILocation(line: 56, column: 10, scope: !560)
!572 = !DILocation(line: 57, column: 20, scope: !560)
!573 = !DILocation(line: 57, column: 3, scope: !560)
!574 = !DILocation(line: 57, column: 10, scope: !560)
!575 = !DILocation(line: 57, column: 8, scope: !560)
!576 = !DILocation(line: 58, column: 20, scope: !560)
!577 = !DILocation(line: 58, column: 3, scope: !560)
!578 = !DILocation(line: 58, column: 10, scope: !560)
!579 = !DILocation(line: 58, column: 8, scope: !560)
!580 = !DILocation(line: 59, column: 3, scope: !560)
!581 = !DILocation(line: 59, column: 9, scope: !560)
!582 = !DILocalVariable(name: "$ret4", scope: !560, file: !7, line: 55, type: !106)
!583 = !DILocation(line: 55, column: 61, scope: !560)
!584 = !DILocation(line: 60, column: 2, scope: !560)
!585 = distinct !DISubprogram(name: "core.Children..stub..1command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.Children..stub", scope: null, file: !377, line: 81, type: !586, isLocal: false, isDefinition: true, scopeLine: 81, isOptimized: false, unit: !1, retainedNodes: !3)
!586 = !DISubroutineType(types: !587)
!587 = !{!215, !381, !381}
!588 = !DILocalVariable(name: "$this30", arg: 1, scope: !585, file: !377, line: 81, type: !381)
!589 = !DILocation(line: 81, column: 24, scope: !585)
!590 = !DILocation(line: 17, column: 6, scope: !591)
!591 = !DILexicalBlockFile(scope: !585, file: !7, discriminator: 0)
!592 = !DILocalVariable(name: "$ret83", scope: !585, file: !377, line: 81, type: !215)
!593 = !DILocation(line: 81, column: 27, scope: !585)
!594 = distinct !DISubprogram(name: "core.Content..stub..1command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.Content..stub", scope: null, file: !377, line: 54, type: !595, isLocal: false, isDefinition: true, scopeLine: 54, isOptimized: false, unit: !1, retainedNodes: !3)
!595 = !DISubroutineType(types: !596)
!596 = !{!255, !381, !381}
!597 = !DILocalVariable(name: "$this12", arg: 1, scope: !594, file: !377, line: 54, type: !381)
!598 = !DILocation(line: 54, column: 23, scope: !594)
!599 = !DILocation(line: 17, column: 6, scope: !600)
!600 = !DILexicalBlockFile(scope: !594, file: !7, discriminator: 0)
!601 = distinct !DISubprogram(name: "core.Create..1command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.Create", scope: null, file: !7, line: 81, type: !602, isLocal: false, isDefinition: true, scopeLine: 81, isOptimized: false, unit: !1, retainedNodes: !3)
!602 = !DISubroutineType(types: !603)
!603 = !{!604, !381, !381, !128, !616, !624}
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Node,Handle,error}", file: !24, size: 384, align: 8, elements: !605)
!605 = !{!606, !614, !615}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 81, baseType: !607, size: 128, align: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !7, line: 8, size: 128, align: 8, elements: !608)
!608 = !{!609, !90}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 8, baseType: !610, size: 64, align: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Context,*Attr)error}", file: !24, size: 128, align: 8, elements: !612)
!612 = !{!134, !613}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Attr", file: !24, line: 8, baseType: !125, size: 64, align: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 81, baseType: !87, size: 128, align: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 81, baseType: !106, size: 128, align: 64, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "CreateRequest", file: !7, line: 7, size: 640, align: 8, elements: !618)
!618 = !{!447, !619, !620, !622, !623}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !7, line: 7, baseType: !8, size: 128, align: 64, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !7, line: 7, baseType: !621, size: 32, align: 32, offset: 512)
!621 = !DIBasicType(name: "OpenFlags", size: 32, encoding: DW_ATE_unsigned)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", file: !7, line: 7, baseType: !204, size: 32, align: 32, offset: 544)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "Umask", file: !7, line: 7, baseType: !204, size: 32, align: 32, offset: 576)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "CreateResponse", file: !7, line: 7, size: 1600, align: 8, elements: !626)
!626 = !{!627, !634}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "LookupResponse", file: !7, line: 7, baseType: !628, size: 1472, align: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "LookupResponse", file: !7, line: 7, size: 1472, align: 8, elements: !629)
!629 = !{!630, !631, !632, !633}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "Node", file: !7, line: 7, baseType: !527, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "Generation", file: !7, line: 7, baseType: !145, size: 64, align: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "EntryValid", file: !7, line: 7, baseType: !195, size: 64, align: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "Attr", file: !7, line: 7, baseType: !192, size: 1280, align: 64, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "OpenResponse", file: !7, line: 7, baseType: !635, size: 128, align: 64, offset: 1472)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "OpenResponse", file: !7, line: 7, size: 128, align: 8, elements: !636)
!636 = !{!637, !639}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Handle", file: !7, line: 7, baseType: !638, size: 64, align: 64)
!638 = !DIBasicType(name: "HandleID", size: 64, encoding: DW_ATE_unsigned)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !7, line: 7, baseType: !640, size: 32, align: 32, offset: 64)
!640 = !DIBasicType(name: "OpenResponseFlags", size: 32, encoding: DW_ATE_unsigned)
!641 = !DILocalVariable(name: "d", arg: 1, scope: !601, file: !7, line: 81, type: !381)
!642 = !DILocation(line: 81, column: 1, scope: !601)
!643 = !DILocalVariable(name: "ctx", arg: 2, scope: !601, file: !7, line: 81, type: !128)
!644 = !DILocation(line: 81, column: 28, scope: !601)
!645 = !DILocalVariable(name: "req", arg: 3, scope: !601, file: !7, line: 81, type: !616)
!646 = !DILocation(line: 81, column: 49, scope: !601)
!647 = !DILocalVariable(name: "resp", arg: 4, scope: !601, file: !7, line: 81, type: !624)
!648 = !DILocation(line: 81, column: 74, scope: !601)
!649 = !DILocation(line: 82, column: 53, scope: !650)
!650 = distinct !DILexicalBlock(scope: !601, file: !7, line: 81, column: 1)
!651 = !DILocation(line: 82, column: 63, scope: !650)
!652 = !DILocation(line: 82, column: 11, scope: !650)
!653 = !DILocation(line: 83, column: 48, scope: !650)
!654 = !DILocation(line: 83, column: 17, scope: !650)
!655 = !DILocation(line: 83, column: 55, scope: !650)
!656 = !DILocalVariable(name: "f", scope: !650, file: !7, line: 83, type: !118)
!657 = !DILocation(line: 83, column: 2, scope: !601)
!658 = !DILocation(line: 84, column: 9, scope: !650)
!659 = !DILocation(line: 84, column: 2, scope: !650)
!660 = !DILocalVariable(name: "$ret8", scope: !601, file: !7, line: 81, type: !607)
!661 = !DILocation(line: 81, column: 102, scope: !601)
!662 = !DILocalVariable(name: "$ret9", scope: !601, file: !7, line: 81, type: !87)
!663 = !DILocation(line: 81, column: 115, scope: !601)
!664 = !DILocation(line: 84, column: 12, scope: !650)
!665 = distinct !DISubprogram(name: "core.Delete..stub..1command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.Delete..stub", scope: null, file: !377, line: 65, type: !666, isLocal: false, isDefinition: true, scopeLine: 65, isOptimized: false, unit: !1, retainedNodes: !3)
!666 = !DISubroutineType(types: !667)
!667 = !{!56, !381, !381}
!668 = !DILocalVariable(name: "$this15", arg: 1, scope: !665, file: !377, line: 65, type: !381)
!669 = !DILocation(line: 65, column: 22, scope: !665)
!670 = !DILocalVariable(name: "$ret72", scope: !665, file: !377, line: 65, type: !56)
!671 = !DILocation(line: 65, column: 25, scope: !665)
!672 = !DILocation(line: 17, column: 6, scope: !673)
!673 = !DILexicalBlockFile(scope: !665, file: !7, discriminator: 0)
!674 = distinct !DISubprogram(name: "core.Entry..stub..1command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.Entry..stub", scope: null, file: !377, line: 89, type: !675, isLocal: false, isDefinition: true, scopeLine: 89, isOptimized: false, unit: !1, retainedNodes: !3)
!675 = !DISubroutineType(types: !676)
!676 = !{!266, !381, !381}
!677 = !DILocalVariable(name: "$this21", arg: 1, scope: !674, file: !377, line: 89, type: !381)
!678 = !DILocation(line: 89, column: 21, scope: !674)
!679 = !DILocation(line: 17, column: 6, scope: !680)
!680 = !DILexicalBlockFile(scope: !674, file: !7, discriminator: 0)
!681 = distinct !DISubprogram(name: "core.Flush..1command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.Flush", scope: null, file: !7, line: 123, type: !682, isLocal: false, isDefinition: true, scopeLine: 123, isOptimized: false, unit: !1, retainedNodes: !3)
!682 = !DISubroutineType(types: !683)
!683 = !{!106, !381, !381, !128, !684}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "FlushRequest", file: !7, line: 7, size: 576, align: 8, elements: !686)
!686 = !{!447, !687, !688, !689}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Handle", file: !7, line: 7, baseType: !638, size: 64, align: 64, offset: 384)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !7, line: 7, baseType: !34, size: 32, align: 32, offset: 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "LockOwner", file: !7, line: 7, baseType: !145, size: 64, align: 64, offset: 512)
!690 = !DILocalVariable(name: "d", arg: 1, scope: !681, file: !7, line: 123, type: !381)
!691 = !DILocation(line: 123, column: 1, scope: !681)
!692 = !DILocalVariable(name: "ctx", arg: 2, scope: !681, file: !7, line: 123, type: !128)
!693 = !DILocation(line: 123, column: 27, scope: !681)
!694 = !DILocalVariable(name: "req", arg: 3, scope: !681, file: !7, line: 123, type: !684)
!695 = !DILocation(line: 123, column: 48, scope: !681)
!696 = !DILocation(line: 124, column: 11, scope: !681)
!697 = !DILocalVariable(name: "$ret18", scope: !681, file: !7, line: 123, type: !106)
!698 = !DILocation(line: 123, column: 72, scope: !681)
!699 = !DILocation(line: 125, column: 2, scope: !681)
!700 = distinct !DISubprogram(name: "core.IsDir..stub..1command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.IsDir..stub", scope: null, file: !377, line: 73, type: !666, isLocal: false, isDefinition: true, scopeLine: 73, isOptimized: false, unit: !1, retainedNodes: !3)
!701 = !DILocalVariable(name: "$this16", arg: 1, scope: !700, file: !377, line: 73, type: !381)
!702 = !DILocation(line: 73, column: 21, scope: !700)
!703 = !DILocalVariable(name: "$ret73", scope: !700, file: !377, line: 73, type: !56)
!704 = !DILocation(line: 73, column: 24, scope: !700)
!705 = !DILocation(line: 17, column: 6, scope: !706)
!706 = !DILexicalBlockFile(scope: !700, file: !7, discriminator: 0)
!707 = !DILocalVariable(name: "n", arg: 1, scope: !708, file: !377, line: 73, type: !711)
!708 = distinct !DISubprogram(name: "core.IsDir..1command_line_arguments.node", linkageName: "command_line_arguments.node.IsDir", scope: null, file: !377, line: 73, type: !709, isLocal: false, isDefinition: true, scopeLine: 73, isOptimized: false, unit: !1, retainedNodes: !3)
!709 = !DISubroutineType(types: !710)
!710 = !{!56, !711, !711}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!712 = !DILocation(line: 73, column: 1, scope: !708, inlinedAt: !713)
!713 = distinct !DILocation(line: 17, column: 6, scope: !706)
!714 = !DILocalVariable(name: "$ret46", scope: !708, file: !377, line: 73, type: !56)
!715 = !DILocation(line: 73, column: 24, scope: !708, inlinedAt: !713)
!716 = !DILocation(line: 74, column: 10, scope: !708, inlinedAt: !713)
!717 = !DILocation(line: 74, column: 27, scope: !708, inlinedAt: !713)
!718 = distinct !DISubprogram(name: "core.IsFile..stub..1command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.IsFile..stub", scope: null, file: !377, line: 77, type: !666, isLocal: false, isDefinition: true, scopeLine: 77, isOptimized: false, unit: !1, retainedNodes: !3)
!719 = !DILocalVariable(name: "$this23", arg: 1, scope: !718, file: !377, line: 77, type: !381)
!720 = !DILocation(line: 77, column: 22, scope: !718)
!721 = !DILocalVariable(name: "$ret79", scope: !718, file: !377, line: 77, type: !56)
!722 = !DILocation(line: 77, column: 25, scope: !718)
!723 = !DILocation(line: 17, column: 6, scope: !724)
!724 = !DILexicalBlockFile(scope: !718, file: !7, discriminator: 0)
!725 = !DILocalVariable(name: "n", arg: 1, scope: !726, file: !377, line: 77, type: !711)
!726 = distinct !DISubprogram(name: "core.IsFile..1command_line_arguments.node", linkageName: "command_line_arguments.node.IsFile", scope: null, file: !377, line: 77, type: !709, isLocal: false, isDefinition: true, scopeLine: 77, isOptimized: false, unit: !1, retainedNodes: !3)
!727 = !DILocation(line: 77, column: 1, scope: !726, inlinedAt: !728)
!728 = distinct !DILocation(line: 17, column: 6, scope: !724)
!729 = !DILocalVariable(name: "$ret47", scope: !726, file: !377, line: 77, type: !56)
!730 = !DILocation(line: 77, column: 25, scope: !726, inlinedAt: !728)
!731 = !DILocation(line: 78, column: 10, scope: !726, inlinedAt: !728)
!732 = !DILocation(line: 78, column: 27, scope: !726, inlinedAt: !728)
!733 = distinct !DISubprogram(name: "core.Lookup..1command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.Lookup", scope: null, file: !7, line: 68, type: !734, isLocal: false, isDefinition: true, scopeLine: 68, isOptimized: false, unit: !1, retainedNodes: !3)
!734 = !DISubroutineType(types: !735)
!735 = !{!736, !381, !381, !128, !740, !743}
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Node,error}", file: !24, size: 256, align: 8, elements: !737)
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 68, baseType: !607, size: 128, align: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 68, baseType: !106, size: 128, align: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "LookupRequest", file: !7, line: 7, size: 512, align: 8, elements: !742)
!742 = !{!447, !619}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!744 = !DILocalVariable(name: "d", arg: 1, scope: !733, file: !7, line: 68, type: !381)
!745 = !DILocation(line: 68, column: 1, scope: !733)
!746 = !DILocalVariable(name: "ctx", arg: 2, scope: !733, file: !7, line: 68, type: !128)
!747 = !DILocation(line: 68, column: 28, scope: !733)
!748 = !DILocalVariable(name: "req", arg: 3, scope: !733, file: !7, line: 68, type: !740)
!749 = !DILocation(line: 68, column: 49, scope: !733)
!750 = !DILocalVariable(name: "resp", arg: 4, scope: !733, file: !7, line: 68, type: !743)
!751 = !DILocation(line: 68, column: 74, scope: !733)
!752 = !DILocation(line: 69, column: 53, scope: !733)
!753 = !DILocation(line: 69, column: 63, scope: !733)
!754 = !DILocation(line: 69, column: 11, scope: !733)
!755 = !DILocation(line: 70, column: 11, scope: !733)
!756 = !DILocation(line: 71, column: 6, scope: !733)
!757 = !DILocation(line: 71, column: 18, scope: !733)
!758 = !DILocation(line: 72, column: 56, scope: !759)
!759 = distinct !DILexicalBlock(scope: !733, file: !7, line: 72, column: 2)
!760 = !DILocation(line: 72, column: 25, scope: !759)
!761 = !DILocation(line: 72, column: 63, scope: !759)
!762 = !DILocalVariable(name: "action", scope: !759, file: !7, line: 72, type: !118)
!763 = !DILocation(line: 72, column: 5, scope: !733)
!764 = !DILocation(line: 72, column: 74, scope: !759)
!765 = !DILocation(line: 73, column: 10, scope: !759)
!766 = !DILocation(line: 73, column: 3, scope: !759)
!767 = !DILocalVariable(name: "$ret6", scope: !733, file: !7, line: 68, type: !607)
!768 = !DILocation(line: 68, column: 102, scope: !733)
!769 = !DILocalVariable(name: "$ret7", scope: !733, file: !7, line: 68, type: !106)
!770 = !DILocation(line: 68, column: 115, scope: !733)
!771 = !DILocation(line: 75, column: 15, scope: !772)
!772 = distinct !DILexicalBlock(scope: !733, file: !7, line: 75, column: 2)
!773 = !DILocalVariable(name: "n", scope: !772, file: !7, line: 75, type: !118)
!774 = !DILocation(line: 75, column: 5, scope: !733)
!775 = !DILocalVariable(name: "ok", scope: !772, file: !7, line: 75, type: !56)
!776 = !DILocation(line: 75, column: 2, scope: !772)
!777 = !DILocation(line: 76, column: 10, scope: !772)
!778 = !DILocation(line: 78, column: 2, scope: !733)
!779 = !DILocation(line: 76, column: 3, scope: !772)
!780 = distinct !DISubprogram(name: "core.MetaData..stub..1command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.MetaData..stub", scope: null, file: !377, line: 85, type: !781, isLocal: false, isDefinition: true, scopeLine: 85, isOptimized: false, unit: !1, retainedNodes: !3)
!781 = !DISubroutineType(types: !782)
!782 = !{!278, !381, !381}
!783 = !DILocalVariable(name: "$this18", arg: 1, scope: !780, file: !377, line: 85, type: !381)
!784 = !DILocation(line: 85, column: 24, scope: !780)
!785 = !DILocation(line: 17, column: 6, scope: !786)
!786 = !DILexicalBlockFile(scope: !780, file: !7, discriminator: 0)
!787 = !DILocalVariable(name: "$ret75", scope: !780, file: !377, line: 85, type: !278)
!788 = !DILocation(line: 85, column: 27, scope: !780)
!789 = distinct !DISubprogram(name: "core.Mkdir..1command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.Mkdir", scope: null, file: !7, line: 108, type: !790, isLocal: false, isDefinition: true, scopeLine: 108, isOptimized: false, unit: !1, retainedNodes: !3)
!790 = !DISubroutineType(types: !791)
!791 = !{!736, !381, !381, !128, !792}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "MkdirRequest", file: !7, line: 7, size: 576, align: 8, elements: !794)
!794 = !{!447, !619, !795, !796}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", file: !7, line: 7, baseType: !204, size: 32, align: 32, offset: 512)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "Umask", file: !7, line: 7, baseType: !204, size: 32, align: 32, offset: 544)
!797 = !DILocalVariable(name: "d", arg: 1, scope: !789, file: !7, line: 108, type: !381)
!798 = !DILocation(line: 108, column: 1, scope: !789)
!799 = !DILocalVariable(name: "ctx", arg: 2, scope: !789, file: !7, line: 108, type: !128)
!800 = !DILocation(line: 108, column: 27, scope: !789)
!801 = !DILocalVariable(name: "req", arg: 3, scope: !789, file: !7, line: 108, type: !792)
!802 = !DILocation(line: 108, column: 48, scope: !789)
!803 = !DILocation(line: 109, column: 38, scope: !804)
!804 = distinct !DILexicalBlock(scope: !789, file: !7, line: 108, column: 1)
!805 = !DILocation(line: 109, column: 11, scope: !804)
!806 = !DILocation(line: 110, column: 17, scope: !807)
!807 = distinct !DILexicalBlock(scope: !804, file: !7, line: 110, column: 2)
!808 = !DILocalVariable(name: "ok", scope: !807, file: !7, line: 110, type: !56)
!809 = !DILocation(line: 110, column: 5, scope: !804)
!810 = !DILocation(line: 110, column: 36, scope: !807)
!811 = !DILocalVariable(name: "dir", scope: !807, file: !7, line: 110, type: !118)
!812 = !DILocation(line: 110, column: 42, scope: !807)
!813 = !DILocation(line: 110, column: 2, scope: !807)
!814 = !DILocation(line: 111, column: 3, scope: !807)
!815 = !DILocalVariable(name: "$ret14", scope: !789, file: !7, line: 108, type: !607)
!816 = !DILocation(line: 108, column: 73, scope: !789)
!817 = !DILocalVariable(name: "$ret15", scope: !789, file: !7, line: 108, type: !106)
!818 = !DILocation(line: 108, column: 86, scope: !789)
!819 = !DILocation(line: 113, column: 13, scope: !804)
!820 = !DILocalVariable(name: "newDir", scope: !804, file: !7, line: 113, type: !381)
!821 = !DILocation(line: 113, column: 2, scope: !789)
!822 = !DILocation(line: 114, column: 18, scope: !804)
!823 = !DILocation(line: 114, column: 3, scope: !804)
!824 = !DILocation(line: 115, column: 2, scope: !804)
!825 = distinct !DISubprogram(name: "core.Name..stub..1command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.Name..stub", scope: null, file: !377, line: 43, type: !826, isLocal: false, isDefinition: true, scopeLine: 43, isOptimized: false, unit: !1, retainedNodes: !3)
!826 = !DISubroutineType(types: !827)
!827 = !{!8, !381, !381}
!828 = !DILocalVariable(name: "$this17", arg: 1, scope: !825, file: !377, line: 43, type: !381)
!829 = !DILocation(line: 43, column: 20, scope: !825)
!830 = !DILocation(line: 17, column: 6, scope: !831)
!831 = !DILexicalBlockFile(scope: !825, file: !7, discriminator: 0)
!832 = !DILocalVariable(name: "n", arg: 1, scope: !833, file: !377, line: 43, type: !711)
!833 = distinct !DISubprogram(name: "core.Name..1command_line_arguments.node", linkageName: "command_line_arguments.node.Name", scope: null, file: !377, line: 43, type: !834, isLocal: false, isDefinition: true, scopeLine: 43, isOptimized: false, unit: !1, retainedNodes: !3)
!834 = !DISubroutineType(types: !835)
!835 = !{!8, !711, !711}
!836 = !DILocation(line: 43, column: 1, scope: !833, inlinedAt: !837)
!837 = distinct !DILocation(line: 17, column: 6, scope: !831)
!838 = !DILocation(line: 44, column: 2, scope: !833, inlinedAt: !837)
!839 = !DILocalVariable(name: "$ret41", scope: !833, file: !377, line: 43, type: !8)
!840 = !DILocation(line: 43, column: 23, scope: !833, inlinedAt: !837)
!841 = distinct !DISubprogram(name: "core.New..1command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.New", scope: null, file: !7, line: 30, type: !842, isLocal: false, isDefinition: true, scopeLine: 30, isOptimized: false, unit: !1, retainedNodes: !3)
!842 = !DISubroutineType(types: !843)
!843 = !{!118, !381, !381, !326, !8}
!844 = !DILocalVariable(name: "d", arg: 1, scope: !841, file: !7, line: 30, type: !381)
!845 = !DILocation(line: 30, column: 1, scope: !841)
!846 = !DILocalVariable(name: "t", arg: 2, scope: !841, file: !7, line: 30, type: !326)
!847 = !DILocation(line: 30, column: 25, scope: !841)
!848 = !DILocalVariable(name: "name", arg: 3, scope: !841, file: !7, line: 30, type: !8)
!849 = !DILocation(line: 30, column: 40, scope: !841)
!850 = !DILocation(line: 33, column: 11, scope: !841)
!851 = !DILocalVariable(name: "$ret1", scope: !841, file: !7, line: 30, type: !118)
!852 = !DILocation(line: 30, column: 53, scope: !841)
!853 = !DILocation(line: 33, column: 3, scope: !841)
!854 = !DILocation(line: 35, column: 11, scope: !841)
!855 = !DILocation(line: 35, column: 3, scope: !841)
!856 = !DILocation(line: 37, column: 24, scope: !841)
!857 = !DILocation(line: 37, column: 10, scope: !841)
!858 = !DILocation(line: 37, column: 3, scope: !841)
!859 = !DILocation(line: 39, column: 3, scope: !841)
!860 = distinct !DISubprogram(name: "core.NewDirectory..1command_line_arguments.Directory", linkageName: "command_line_arguments.Directory.NewDirectory", scope: null, file: !7, line: 43, type: !861, isLocal: false, isDefinition: true, scopeLine: 43, isOptimized: false, unit: !1, retainedNodes: !3)
!861 = !DISubroutineType(types: !862)
!862 = !{!381, !381, !381, !8}
!863 = !DILocalVariable(name: "d", arg: 1, scope: !860, file: !7, line: 43, type: !381)
!864 = !DILocation(line: 43, column: 1, scope: !860)
!865 = !DILocalVariable(name: "name", arg: 2, scope: !860, file: !7, line: 43, type: !8)
!866 = !DILocation(line: 43, column: 34, scope: !860)
!867 = !DILocalVariable(name: "$ret2", scope: !860, file: !7, line: 43, type: !381)
!868 = !DILocation(line: 43, column: 47, scope: !860)
!869 = !DILocation(line: 44, column: 31, scope: !870)
!870 = distinct !DILexicalBlock(scope: !860, file: !7, line: 43, column: 1)
!871 = !DILocation(line: 44, column: 12, scope: !870)
!872 = !DILocalVariable(name: "newDir", scope: !870, file: !7, line: 44, type: !381)
!873 = !DILocation(line: 44, column: 2, scope: !860)
!874 = !DILocation(line: 45, column: 14, scope: !870)
!875 = !DILocation(line: 45, column: 3, scope: !870)
!876 = !DILocation(line: 46, column: 2, scope: !870)
!877 = distinct !DISubprogram(name: "core.Attr..1command_line_arguments.File", linkageName: "command_line_arguments.File.Attr", scope: null, file: !878, line: 48, type: !879, isLocal: false, isDefinition: true, scopeLine: 48, isOptimized: false, unit: !1, retainedNodes: !3)
!878 = !DIFile(filename: "file.go", directory: ".")
!879 = !DISubroutineType(types: !880)
!880 = !{!106, !881, !881, !128, !191}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !878, line: 16, size: 640, align: 8, elements: !883)
!883 = !{!884}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "node", file: !878, line: 17, baseType: !385, size: 640, align: 64)
!885 = !DILocalVariable(name: "f", arg: 1, scope: !877, file: !878, line: 48, type: !881)
!886 = !DILocation(line: 48, column: 1, scope: !877)
!887 = !DILocalVariable(name: "ctx", arg: 2, scope: !877, file: !878, line: 48, type: !128)
!888 = !DILocation(line: 48, column: 21, scope: !877)
!889 = !DILocalVariable(name: "a", arg: 3, scope: !877, file: !878, line: 48, type: !191)
!890 = !DILocation(line: 48, column: 42, scope: !877)
!891 = !DILocation(line: 49, column: 43, scope: !877)
!892 = !DILocation(line: 49, column: 11, scope: !877)
!893 = !DILocation(line: 53, column: 3, scope: !877)
!894 = !DILocation(line: 53, column: 13, scope: !877)
!895 = !DILocation(line: 53, column: 10, scope: !877)
!896 = !DILocation(line: 54, column: 3, scope: !877)
!897 = !DILocation(line: 54, column: 9, scope: !877)
!898 = !DILocation(line: 55, column: 20, scope: !877)
!899 = !DILocation(line: 55, column: 3, scope: !877)
!900 = !DILocation(line: 55, column: 10, scope: !877)
!901 = !DILocation(line: 55, column: 8, scope: !877)
!902 = !DILocation(line: 56, column: 20, scope: !877)
!903 = !DILocation(line: 56, column: 3, scope: !877)
!904 = !DILocation(line: 56, column: 10, scope: !877)
!905 = !DILocation(line: 56, column: 8, scope: !877)
!906 = !DILocation(line: 57, column: 23, scope: !877)
!907 = !DILocation(line: 57, column: 3, scope: !877)
!908 = !DILocation(line: 57, column: 9, scope: !877)
!909 = !DILocation(line: 58, column: 17, scope: !877)
!910 = !DILocation(line: 58, column: 3, scope: !877)
!911 = !DILocation(line: 58, column: 10, scope: !877)
!912 = !DILocalVariable(name: "$ret28", scope: !877, file: !878, line: 48, type: !106)
!913 = !DILocation(line: 48, column: 56, scope: !877)
!914 = !DILocation(line: 59, column: 2, scope: !877)
!915 = distinct !DISubprogram(name: "core.Children..stub..1command_line_arguments.File", linkageName: "command_line_arguments.File.Children..stub", scope: null, file: !377, line: 81, type: !916, isLocal: false, isDefinition: true, scopeLine: 81, isOptimized: false, unit: !1, retainedNodes: !3)
!916 = !DISubroutineType(types: !917)
!917 = !{!215, !881, !881}
!918 = !DILocalVariable(name: "$this39", arg: 1, scope: !915, file: !377, line: 81, type: !881)
!919 = !DILocation(line: 81, column: 24, scope: !915)
!920 = !DILocation(line: 16, column: 6, scope: !921)
!921 = !DILexicalBlockFile(scope: !915, file: !878, discriminator: 0)
!922 = !DILocalVariable(name: "$ret91", scope: !915, file: !377, line: 81, type: !215)
!923 = !DILocation(line: 81, column: 27, scope: !915)
!924 = distinct !DISubprogram(name: "core.Content..1command_line_arguments.File", linkageName: "command_line_arguments.File.Content", scope: null, file: !878, line: 27, type: !925, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!925 = !DISubroutineType(types: !926)
!926 = !{!255, !881, !881}
!927 = !DILocalVariable(name: "f", arg: 1, scope: !924, file: !878, line: 27, type: !881)
!928 = !DILocation(line: 27, column: 1, scope: !924)
!929 = !DILocation(line: 28, column: 10, scope: !924)
!930 = !DILocation(line: 28, column: 21, scope: !924)
!931 = !DILocation(line: 28, column: 2, scope: !924)
!932 = distinct !DISubprogram(name: "core.Delete..stub..1command_line_arguments.File", linkageName: "command_line_arguments.File.Delete..stub", scope: null, file: !377, line: 65, type: !933, isLocal: false, isDefinition: true, scopeLine: 65, isOptimized: false, unit: !1, retainedNodes: !3)
!933 = !DISubroutineType(types: !934)
!934 = !{!56, !881, !881}
!935 = !DILocalVariable(name: "$this34", arg: 1, scope: !932, file: !377, line: 65, type: !881)
!936 = !DILocation(line: 65, column: 22, scope: !932)
!937 = !DILocalVariable(name: "$ret86", scope: !932, file: !377, line: 65, type: !56)
!938 = !DILocation(line: 65, column: 25, scope: !932)
!939 = !DILocation(line: 16, column: 6, scope: !940)
!940 = !DILexicalBlockFile(scope: !932, file: !878, discriminator: 0)
!941 = distinct !DISubprogram(name: "core.Directories..stub.command_line_arguments.File", linkageName: "command_line_arguments.File.Directories..stub", scope: null, file: !377, line: 118, type: !942, isLocal: false, isDefinition: true, scopeLine: 118, isOptimized: false, unit: !1, retainedNodes: !3)
!942 = !DISubroutineType(types: !943)
!943 = !{!229, !881, !881}
!944 = !DILocalVariable(name: "$this48.pointer", arg: 1, scope: !941, file: !377, line: 118, type: !881)
!945 = !DILocation(line: 118, column: 27, scope: !941)
!946 = !DILocation(line: 16, column: 6, scope: !947)
!947 = !DILexicalBlockFile(scope: !941, file: !878, discriminator: 0)
!948 = distinct !DISubprogram(name: "core.Entry..stub..1command_line_arguments.File", linkageName: "command_line_arguments.File.Entry..stub", scope: null, file: !377, line: 89, type: !949, isLocal: false, isDefinition: true, scopeLine: 89, isOptimized: false, unit: !1, retainedNodes: !3)
!949 = !DISubroutineType(types: !950)
!950 = !{!266, !881, !881}
!951 = !DILocalVariable(name: "$this52", arg: 1, scope: !948, file: !377, line: 89, type: !881)
!952 = !DILocation(line: 89, column: 21, scope: !948)
!953 = !DILocation(line: 16, column: 6, scope: !954)
!954 = !DILexicalBlockFile(scope: !948, file: !878, discriminator: 0)
!955 = distinct !DISubprogram(name: "core.Exists..stub.command_line_arguments.File", linkageName: "command_line_arguments.File.Exists..stub", scope: null, file: !377, line: 128, type: !956, isLocal: false, isDefinition: true, scopeLine: 128, isOptimized: false, unit: !1, retainedNodes: !3)
!956 = !DISubroutineType(types: !957)
!957 = !{!56, !881, !881, !8}
!958 = !DILocalVariable(name: "$this46.pointer", arg: 1, scope: !955, file: !377, line: 128, type: !881)
!959 = !DILocation(line: 128, column: 22, scope: !955)
!960 = !DILocalVariable(name: "$p47", arg: 2, scope: !955, file: !377, line: 128, type: !8)
!961 = !DILocation(line: 128, column: 23, scope: !955)
!962 = !DILocalVariable(name: "$ret94", scope: !955, file: !377, line: 128, type: !56)
!963 = !DILocation(line: 128, column: 35, scope: !955)
!964 = !DILocation(line: 16, column: 6, scope: !965)
!965 = !DILexicalBlockFile(scope: !955, file: !878, discriminator: 0)
!966 = distinct !DISubprogram(name: "core.Files..stub.command_line_arguments.File", linkageName: "command_line_arguments.File.Files..stub", scope: null, file: !377, line: 135, type: !942, isLocal: false, isDefinition: true, scopeLine: 135, isOptimized: false, unit: !1, retainedNodes: !3)
!967 = !DILocalVariable(name: "$this51.pointer", arg: 1, scope: !966, file: !377, line: 135, type: !881)
!968 = !DILocation(line: 135, column: 21, scope: !966)
!969 = !DILocation(line: 16, column: 6, scope: !970)
!970 = !DILexicalBlockFile(scope: !966, file: !878, discriminator: 0)
!971 = distinct !DISubprogram(name: "core.Fsync..1command_line_arguments.File", linkageName: "command_line_arguments.File.Fsync", scope: null, file: !878, line: 67, type: !972, isLocal: false, isDefinition: true, scopeLine: 67, isOptimized: false, unit: !1, retainedNodes: !3)
!972 = !DISubroutineType(types: !973)
!973 = !{!106, !881, !881, !128, !974}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DICompositeType(tag: DW_TAG_structure_type, name: "FsyncRequest", file: !7, line: 7, size: 512, align: 8, elements: !976)
!976 = !{!447, !687, !688, !977}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "Dir", file: !7, line: 7, baseType: !56, size: 8, align: 8, offset: 480)
!978 = !DILocalVariable(name: "f", arg: 1, scope: !971, file: !878, line: 67, type: !881)
!979 = !DILocation(line: 67, column: 1, scope: !971)
!980 = !DILocalVariable(name: "ctx", arg: 2, scope: !971, file: !878, line: 67, type: !128)
!981 = !DILocation(line: 67, column: 22, scope: !971)
!982 = !DILocalVariable(name: "req", arg: 3, scope: !971, file: !878, line: 67, type: !974)
!983 = !DILocation(line: 67, column: 43, scope: !971)
!984 = !DILocation(line: 68, column: 11, scope: !971)
!985 = !DILocalVariable(name: "$ret30", scope: !971, file: !878, line: 67, type: !106)
!986 = !DILocation(line: 67, column: 67, scope: !971)
!987 = !DILocation(line: 69, column: 2, scope: !971)
!988 = distinct !DISubprogram(name: "core.Get..stub.command_line_arguments.File", linkageName: "command_line_arguments.File.Get..stub", scope: null, file: !377, line: 146, type: !989, isLocal: false, isDefinition: true, scopeLine: 146, isOptimized: false, unit: !1, retainedNodes: !3)
!989 = !DISubroutineType(types: !990)
!990 = !{!242, !881, !881, !8}
!991 = !DILocalVariable(name: "$this37.pointer", arg: 1, scope: !988, file: !377, line: 146, type: !881)
!992 = !DILocation(line: 146, column: 19, scope: !988)
!993 = !DILocalVariable(name: "$p38", arg: 2, scope: !988, file: !377, line: 146, type: !8)
!994 = !DILocation(line: 146, column: 20, scope: !988)
!995 = !DILocalVariable(name: "$ret90", scope: !988, file: !377, line: 146, type: !56)
!996 = !DILocation(line: 146, column: 42, scope: !988)
!997 = !DILocation(line: 16, column: 6, scope: !998)
!998 = !DILexicalBlockFile(scope: !988, file: !878, discriminator: 0)
!999 = distinct !DISubprogram(name: "core.Getxattr..1command_line_arguments.File", linkageName: "command_line_arguments.File.Getxattr", scope: null, file: !878, line: 43, type: !1000, isLocal: false, isDefinition: true, scopeLine: 43, isOptimized: false, unit: !1, retainedNodes: !3)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!106, !881, !881, !128, !1002, !1008}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "GetxattrRequest", file: !7, line: 7, size: 640, align: 8, elements: !1004)
!1004 = !{!447, !1005, !1006, !1007}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !7, line: 7, baseType: !34, size: 32, align: 32, offset: 384)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !7, line: 7, baseType: !8, size: 128, align: 64, offset: 448)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "Position", file: !7, line: 7, baseType: !34, size: 32, align: 32, offset: 576)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DICompositeType(tag: DW_TAG_structure_type, name: "GetxattrResponse", file: !7, line: 7, size: 192, align: 8, elements: !1010)
!1010 = !{!1011}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "Xattr", file: !7, line: 7, baseType: !255, size: 192, align: 64)
!1012 = !DILocalVariable(name: "f", arg: 1, scope: !999, file: !878, line: 43, type: !881)
!1013 = !DILocation(line: 43, column: 1, scope: !999)
!1014 = !DILocalVariable(name: "ctx", arg: 2, scope: !999, file: !878, line: 43, type: !128)
!1015 = !DILocation(line: 43, column: 25, scope: !999)
!1016 = !DILocalVariable(name: "req", arg: 3, scope: !999, file: !878, line: 43, type: !1002)
!1017 = !DILocation(line: 43, column: 46, scope: !999)
!1018 = !DILocalVariable(name: "resp", arg: 4, scope: !999, file: !878, line: 43, type: !1008)
!1019 = !DILocation(line: 43, column: 73, scope: !999)
!1020 = !DILocation(line: 44, column: 11, scope: !999)
!1021 = !DILocalVariable(name: "$ret27", scope: !999, file: !878, line: 43, type: !106)
!1022 = !DILocation(line: 43, column: 102, scope: !999)
!1023 = !DILocation(line: 45, column: 2, scope: !999)
!1024 = distinct !DISubprogram(name: "core.IsDir..stub..1command_line_arguments.File", linkageName: "command_line_arguments.File.IsDir..stub", scope: null, file: !377, line: 73, type: !933, isLocal: false, isDefinition: true, scopeLine: 73, isOptimized: false, unit: !1, retainedNodes: !3)
!1025 = !DILocalVariable(name: "$this36", arg: 1, scope: !1024, file: !377, line: 73, type: !881)
!1026 = !DILocation(line: 73, column: 21, scope: !1024)
!1027 = !DILocalVariable(name: "$ret88", scope: !1024, file: !377, line: 73, type: !56)
!1028 = !DILocation(line: 73, column: 24, scope: !1024)
!1029 = !DILocation(line: 16, column: 6, scope: !1030)
!1030 = !DILexicalBlockFile(scope: !1024, file: !878, discriminator: 0)
!1031 = !DILocation(line: 73, column: 1, scope: !708, inlinedAt: !1032)
!1032 = distinct !DILocation(line: 16, column: 6, scope: !1030)
!1033 = !DILocation(line: 73, column: 24, scope: !708, inlinedAt: !1032)
!1034 = !DILocation(line: 74, column: 10, scope: !708, inlinedAt: !1032)
!1035 = !DILocation(line: 74, column: 27, scope: !708, inlinedAt: !1032)
!1036 = distinct !DISubprogram(name: "core.IsFile..stub..1command_line_arguments.File", linkageName: "command_line_arguments.File.IsFile..stub", scope: null, file: !377, line: 77, type: !933, isLocal: false, isDefinition: true, scopeLine: 77, isOptimized: false, unit: !1, retainedNodes: !3)
!1037 = !DILocalVariable(name: "$this35", arg: 1, scope: !1036, file: !377, line: 77, type: !881)
!1038 = !DILocation(line: 77, column: 22, scope: !1036)
!1039 = !DILocalVariable(name: "$ret87", scope: !1036, file: !377, line: 77, type: !56)
!1040 = !DILocation(line: 77, column: 25, scope: !1036)
!1041 = !DILocation(line: 16, column: 6, scope: !1042)
!1042 = !DILexicalBlockFile(scope: !1036, file: !878, discriminator: 0)
!1043 = !DILocation(line: 77, column: 1, scope: !726, inlinedAt: !1044)
!1044 = distinct !DILocation(line: 16, column: 6, scope: !1042)
!1045 = !DILocation(line: 77, column: 25, scope: !726, inlinedAt: !1044)
!1046 = !DILocation(line: 78, column: 10, scope: !726, inlinedAt: !1044)
!1047 = !DILocation(line: 78, column: 27, scope: !726, inlinedAt: !1044)
!1048 = distinct !DISubprogram(name: "core.Iter..stub.command_line_arguments.File", linkageName: "command_line_arguments.File.Iter..stub", scope: null, file: !377, line: 110, type: !942, isLocal: false, isDefinition: true, scopeLine: 110, isOptimized: false, unit: !1, retainedNodes: !3)
!1049 = !DILocalVariable(name: "$this42.pointer", arg: 1, scope: !1048, file: !377, line: 110, type: !881)
!1050 = !DILocation(line: 110, column: 20, scope: !1048)
!1051 = !DILocation(line: 16, column: 6, scope: !1052)
!1052 = !DILexicalBlockFile(scope: !1048, file: !878, discriminator: 0)
!1053 = distinct !DISubprogram(name: "core.MetaData..stub..1command_line_arguments.File", linkageName: "command_line_arguments.File.MetaData..stub", scope: null, file: !377, line: 85, type: !1054, isLocal: false, isDefinition: true, scopeLine: 85, isOptimized: false, unit: !1, retainedNodes: !3)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!278, !881, !881}
!1056 = !DILocalVariable(name: "$this50", arg: 1, scope: !1053, file: !377, line: 85, type: !881)
!1057 = !DILocation(line: 85, column: 24, scope: !1053)
!1058 = !DILocation(line: 16, column: 6, scope: !1059)
!1059 = !DILexicalBlockFile(scope: !1053, file: !878, discriminator: 0)
!1060 = !DILocalVariable(name: "$ret97", scope: !1053, file: !377, line: 85, type: !278)
!1061 = !DILocation(line: 85, column: 27, scope: !1053)
!1062 = distinct !DISubprogram(name: "core.Name..stub..1command_line_arguments.File", linkageName: "command_line_arguments.File.Name..stub", scope: null, file: !377, line: 43, type: !1063, isLocal: false, isDefinition: true, scopeLine: 43, isOptimized: false, unit: !1, retainedNodes: !3)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!8, !881, !881}
!1065 = !DILocalVariable(name: "$this49", arg: 1, scope: !1062, file: !377, line: 43, type: !881)
!1066 = !DILocation(line: 43, column: 20, scope: !1062)
!1067 = !DILocation(line: 16, column: 6, scope: !1068)
!1068 = !DILexicalBlockFile(scope: !1062, file: !878, discriminator: 0)
!1069 = !DILocation(line: 43, column: 1, scope: !833, inlinedAt: !1070)
!1070 = distinct !DILocation(line: 16, column: 6, scope: !1068)
!1071 = !DILocation(line: 44, column: 2, scope: !833, inlinedAt: !1070)
!1072 = !DILocation(line: 43, column: 23, scope: !833, inlinedAt: !1070)
!1073 = distinct !DISubprogram(name: "core.New..1command_line_arguments.File", linkageName: "command_line_arguments.File.New", scope: null, file: !878, line: 33, type: !1074, isLocal: false, isDefinition: true, scopeLine: 33, isOptimized: false, unit: !1, retainedNodes: !3)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!118, !881, !881, !326, !8}
!1076 = !DILocalVariable(name: "f", arg: 1, scope: !1073, file: !878, line: 33, type: !881)
!1077 = !DILocation(line: 33, column: 1, scope: !1073)
!1078 = !DILocalVariable(name: "t", arg: 2, scope: !1073, file: !878, line: 33, type: !326)
!1079 = !DILocation(line: 33, column: 20, scope: !1073)
!1080 = !DILocalVariable(name: "name", arg: 3, scope: !1073, file: !878, line: 33, type: !8)
!1081 = !DILocation(line: 33, column: 35, scope: !1073)
!1082 = !DILocalVariable(name: "$ret24", scope: !1073, file: !878, line: 33, type: !118)
!1083 = !DILocation(line: 33, column: 48, scope: !1073)
!1084 = !DILocation(line: 34, column: 2, scope: !1073)
!1085 = distinct !DISubprogram(name: "core.Open..1command_line_arguments.File", linkageName: "command_line_arguments.File.Open", scope: null, file: !878, line: 37, type: !1086, isLocal: false, isDefinition: true, scopeLine: 37, isOptimized: false, unit: !1, retainedNodes: !3)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!1088, !881, !881, !128, !1092, !1097}
!1088 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Handle,error}", file: !24, size: 256, align: 8, elements: !1089)
!1089 = !{!1090, !1091}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 37, baseType: !87, size: 128, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !24, line: 37, baseType: !106, size: 128, align: 64, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DICompositeType(tag: DW_TAG_structure_type, name: "OpenRequest", file: !7, line: 7, size: 448, align: 8, elements: !1094)
!1094 = !{!447, !1095, !1096}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "Dir", file: !7, line: 7, baseType: !56, size: 8, align: 8, offset: 384)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !7, line: 7, baseType: !621, size: 32, align: 32, offset: 416)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!1098 = !DILocalVariable(name: "f", arg: 1, scope: !1085, file: !878, line: 37, type: !881)
!1099 = !DILocation(line: 37, column: 1, scope: !1085)
!1100 = !DILocalVariable(name: "ctx", arg: 2, scope: !1085, file: !878, line: 37, type: !128)
!1101 = !DILocation(line: 37, column: 21, scope: !1085)
!1102 = !DILocalVariable(name: "req", arg: 3, scope: !1085, file: !878, line: 37, type: !1092)
!1103 = !DILocation(line: 37, column: 42, scope: !1085)
!1104 = !DILocalVariable(name: "resp", arg: 4, scope: !1085, file: !878, line: 37, type: !1097)
!1105 = !DILocation(line: 37, column: 65, scope: !1085)
!1106 = !DILocation(line: 38, column: 43, scope: !1085)
!1107 = !DILocation(line: 38, column: 11, scope: !1085)
!1108 = !DILocalVariable(name: "$ret25", scope: !1085, file: !878, line: 37, type: !87)
!1109 = !DILocation(line: 37, column: 91, scope: !1085)
!1110 = !DILocation(line: 40, column: 2, scope: !1085)
!1111 = distinct !DISubprogram(name: "core.Parent..stub..1command_line_arguments.File", linkageName: "command_line_arguments.File.Parent..stub", scope: null, file: !377, line: 58, type: !1112, isLocal: false, isDefinition: true, scopeLine: 58, isOptimized: false, unit: !1, retainedNodes: !3)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!118, !881, !881, !229}
!1114 = !DILocalVariable(name: "$p41", arg: 2, scope: !1111, file: !377, line: 58, type: !229)
!1115 = !DILocation(line: 58, column: 23, scope: !1111)
!1116 = !DILocalVariable(name: "$this40", arg: 1, scope: !1111, file: !377, line: 58, type: !881)
!1117 = !DILocation(line: 58, column: 22, scope: !1111)
!1118 = !DILocation(line: 16, column: 6, scope: !1119)
!1119 = !DILexicalBlockFile(scope: !1111, file: !878, discriminator: 0)
!1120 = distinct !DISubprogram(name: "core.Path..stub..1command_line_arguments.File", linkageName: "command_line_arguments.File.Path..stub", scope: null, file: !377, line: 47, type: !1121, isLocal: false, isDefinition: true, scopeLine: 47, isOptimized: false, unit: !1, retainedNodes: !3)
!1121 = !DISubroutineType(types: !1122)
