; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22endpoint\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22netutils\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/vulcan/netutils\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/mailgun/vulcan/netutils\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22url\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22net/url\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22net/url\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio..import\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3)
!2 = !DIFile(filename: "./endpoint.go", directory: "/home/wangcong/go_path/src/github.com/vulcand/vulcan/endpoint")
!3 = !{}
!4 = distinct !DISubprogram(name: "endpoint.command_line_arguments.HttpEndpoint..hash", linkageName: "command_line_arguments.command_line_arguments.HttpEndpoint..hash", scope: null, file: !5, line: 1, type: !6, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!5 = !DIFile(filename: "<built-in>", directory: "")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !9, !8}
!8 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "void")
!11 = !DILocalVariable(name: "key", arg: 1, scope: !4, file: !5, line: 1, type: !9)
!12 = !DILocation(line: 1, column: 1, scope: !4)
!13 = !DILocalVariable(name: "seed", arg: 2, scope: !4, file: !5, line: 1, type: !8)
!14 = !DILocalVariable(name: "$ret8", scope: !4, file: !5, line: 1, type: !8)
!15 = distinct !DISubprogram(name: "endpoint.command_line_arguments.HttpEndpoint..eq", linkageName: "command_line_arguments.command_line_arguments.HttpEndpoint..eq", scope: null, file: !5, line: 1, type: !16, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !9, !9}
!18 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!19 = !DILocalVariable(name: "key1", arg: 1, scope: !15, file: !5, line: 1, type: !9)
!20 = !DILocation(line: 1, column: 1, scope: !15)
!21 = !DILocalVariable(name: "key2", arg: 2, scope: !15, file: !5, line: 1, type: !9)
!22 = !DILocalVariable(name: "$ret9", scope: !15, file: !5, line: 1, type: !18)
!23 = distinct !DISubprogram(name: "endpoint.GetId..1command_line_arguments.HttpEndpoint", linkageName: "command_line_arguments.HttpEndpoint.GetId", scope: null, file: !24, line: 51, type: !25, isLocal: false, isDefinition: true, scopeLine: 51, isOptimized: false, unit: !1, retainedNodes: !3)
!24 = !DIFile(filename: "endpoint.go", directory: ".")
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !34, !34}
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !5, line: 1, size: 128, align: 8, elements: !28)
!28 = !{!29, !32}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !5, line: 1, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !5, line: 1, baseType: !33, size: 64, align: 64, offset: 64)
!33 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "HttpEndpoint", file: !24, line: 17, size: 192, align: 8, elements: !36)
!36 = !{!37, !56}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "url", file: !24, line: 18, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !24, line: 7, size: 1024, align: 8, elements: !40)
!40 = !{!41, !42, !43, !50, !51, !52, !53, !54, !55}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !24, line: 7, baseType: !27, size: 128, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !24, line: 7, baseType: !27, size: 128, align: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !24, line: 7, baseType: !44, size: 64, align: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !24, line: 7, size: 320, align: 8, elements: !46)
!46 = !{!47, !48, !49}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !24, line: 7, baseType: !27, size: 128, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !24, line: 7, baseType: !27, size: 128, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !24, line: 7, baseType: !18, size: 8, align: 8, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !24, line: 7, baseType: !27, size: 128, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !24, line: 7, baseType: !27, size: 128, align: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !24, line: 7, baseType: !27, size: 128, align: 64, offset: 576)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !24, line: 7, baseType: !18, size: 8, align: 8, offset: 704)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !24, line: 7, baseType: !27, size: 128, align: 64, offset: 768)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !24, line: 7, baseType: !27, size: 128, align: 64, offset: 896)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !24, line: 19, baseType: !27, size: 128, align: 64, offset: 64)
!57 = !DILocalVariable(name: "e", arg: 1, scope: !23, file: !24, line: 51, type: !34)
!58 = !DILocation(line: 51, column: 1, scope: !23)
!59 = !DILocation(line: 52, column: 10, scope: !23)
!60 = !DILocation(line: 52, column: 2, scope: !23)
!61 = !DILocalVariable(name: "$ret6", scope: !23, file: !24, line: 51, type: !27)
!62 = !DILocation(line: 51, column: 32, scope: !23)
!63 = distinct !DISubprogram(name: "endpoint.GetUrl..1command_line_arguments.HttpEndpoint", linkageName: "command_line_arguments.HttpEndpoint.GetUrl", scope: null, file: !24, line: 55, type: !64, isLocal: false, isDefinition: true, scopeLine: 55, isOptimized: false, unit: !1, retainedNodes: !3)
!64 = !DISubroutineType(types: !65)
!65 = !{!38, !34, !34}
!66 = !DILocalVariable(name: "e", arg: 1, scope: !63, file: !24, line: 55, type: !34)
!67 = !DILocation(line: 55, column: 1, scope: !63)
!68 = !DILocalVariable(name: "$ret7", scope: !63, file: !24, line: 55, type: !38)
!69 = !DILocation(line: 55, column: 33, scope: !63)
!70 = !DILocation(line: 56, column: 10, scope: !63)
!71 = !DILocation(line: 56, column: 2, scope: !63)
!72 = distinct !DISubprogram(name: "endpoint.String..1command_line_arguments.HttpEndpoint", linkageName: "command_line_arguments.HttpEndpoint.String", scope: null, file: !24, line: 47, type: !25, isLocal: false, isDefinition: true, scopeLine: 47, isOptimized: false, unit: !1, retainedNodes: !3)
!73 = !DILocalVariable(name: "e", arg: 1, scope: !72, file: !24, line: 47, type: !34)
!74 = !DILocation(line: 47, column: 1, scope: !72)
!75 = !DILocation(line: 48, column: 10, scope: !72)
!76 = !DILocation(line: 48, column: 14, scope: !72)
!77 = !DILocation(line: 48, column: 2, scope: !72)
!78 = distinct !DISubprogram(name: "endpoint.ParseUrl", linkageName: "command_line_arguments.ParseUrl", scope: null, file: !24, line: 22, type: !79, isLocal: false, isDefinition: true, scopeLine: 22, isOptimized: false, unit: !1, retainedNodes: !3)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !27}
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*HttpEndpoint,error}", file: !82, size: 192, align: 8, elements: !83)
!82 = !DIFile(filename: "", directory: "")
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !82, line: 22, baseType: !34, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !82, line: 22, baseType: !86, size: 128, align: 64, offset: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !5, line: 1, size: 128, align: 8, elements: !87)
!87 = !{!88, !141}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 1, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !82, size: 128, align: 8, elements: !91)
!91 = !{!92, !137}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !82, line: 1, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !5, line: 1, size: 576, align: 8, elements: !95)
!95 = !{!96, !97, !98, !100, !101, !102, !103, !109, !115, !116, !118, !136}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !5, line: 1, baseType: !8, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !5, line: 1, baseType: !8, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !5, line: 1, baseType: !99, size: 32, align: 32, offset: 128)
!99 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !5, line: 1, baseType: !31, size: 8, align: 8, offset: 160)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !5, line: 1, baseType: !31, size: 8, align: 8, offset: 168)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !5, line: 1, baseType: !31, size: 8, align: 8, offset: 176)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !5, line: 1, baseType: !104, size: 64, align: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 1, size: 64, align: 8, elements: !106)
!106 = !{!107}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 1, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !5, line: 1, baseType: !110, size: 64, align: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 1, size: 64, align: 8, elements: !112)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 1, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !5, line: 1, baseType: !30, size: 64, align: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !5, line: 1, baseType: !117, size: 64, align: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !5, line: 1, baseType: !119, size: 64, align: 64, offset: 448)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !5, line: 1, size: 320, align: 8, elements: !121)
!121 = !{!122, !123, !124}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !5, line: 1, baseType: !117, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !5, line: 1, baseType: !117, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !5, line: 1, baseType: !125, size: 192, align: 64, offset: 128)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !82, size: 192, align: 8, elements: !126)
!126 = !{!127, !134, !135}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !82, line: 1, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !5, line: 1, size: 320, align: 8, elements: !130)
!130 = !{!122, !123, !131, !132, !133}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !82, line: 1, baseType: !33, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !82, line: 1, baseType: !33, size: 64, align: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 512)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !82, line: 1, baseType: !138, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!27, !9}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 64)
!142 = !DILocalVariable(name: "in", arg: 1, scope: !78, file: !24, line: 22, type: !27)
!143 = !DILocation(line: 22, column: 15, scope: !78)
!144 = !DILocalVariable(name: "$ret0", scope: !78, file: !24, line: 22, type: !34)
!145 = !DILocation(line: 22, column: 27, scope: !78)
!146 = !DILocation(line: 23, column: 23, scope: !147)
!147 = distinct !DILexicalBlock(scope: !78, file: !24, line: 22, column: 1)
!148 = !DILocalVariable(name: "url", scope: !147, file: !24, line: 23, type: !38)
!149 = !DILocation(line: 23, column: 2, scope: !78)
!150 = !DILocalVariable(name: "err", scope: !147, file: !24, line: 23, type: !86)
!151 = !DILocation(line: 24, column: 9, scope: !147)
!152 = !DILocalVariable(name: "$ret1", scope: !78, file: !24, line: 22, type: !86)
!153 = !DILocation(line: 22, column: 42, scope: !78)
!154 = !DILocation(line: 25, column: 3, scope: !147)
!155 = !DILocation(line: 27, column: 63, scope: !147)
!156 = !DILocation(line: 27, column: 75, scope: !147)
!157 = !DILocation(line: 27, column: 41, scope: !147)
!158 = !DILocation(line: 27, column: 9, scope: !147)
!159 = !DILocation(line: 27, column: 10, scope: !147)
!160 = !DILocation(line: 27, column: 2, scope: !147)
!161 = distinct !DISubprogram(name: "endpoint.MustParseUrl", linkageName: "command_line_arguments.MustParseUrl", scope: null, file: !24, line: 30, type: !162, isLocal: false, isDefinition: true, scopeLine: 30, isOptimized: false, unit: !1, retainedNodes: !3)
!162 = !DISubroutineType(types: !163)
!163 = !{!34, !27}
!164 = !DILocalVariable(name: "in", arg: 1, scope: !161, file: !24, line: 30, type: !27)
!165 = !DILocation(line: 30, column: 19, scope: !161)
!166 = !DILocalVariable(name: "$ret2", scope: !161, file: !24, line: 30, type: !34)
!167 = !DILocation(line: 30, column: 30, scope: !161)
!168 = !DILocation(line: 31, column: 12, scope: !169)
!169 = distinct !DILexicalBlock(scope: !161, file: !24, line: 30, column: 1)
!170 = !DILocalVariable(name: "err", scope: !169, file: !24, line: 31, type: !86)
!171 = !DILocation(line: 31, column: 2, scope: !161)
!172 = !DILocation(line: 32, column: 9, scope: !169)
!173 = !DILocalVariable(name: "u", scope: !169, file: !24, line: 31, type: !34)
!174 = !DILocation(line: 35, column: 2, scope: !169)
!175 = !DILocation(line: 33, column: 9, scope: !169)
!176 = !DILocation(line: 33, column: 3, scope: !169)
!177 = distinct !DISubprogram(name: "endpoint.NewHttpEndpoint", linkageName: "command_line_arguments.NewHttpEndpoint", scope: null, file: !24, line: 38, type: !178, isLocal: false, isDefinition: true, scopeLine: 38, isOptimized: false, unit: !1, retainedNodes: !3)
!178 = !DISubroutineType(types: !179)
!179 = !{!81, !38}
!180 = !DILocalVariable(name: "in", arg: 1, scope: !177, file: !24, line: 38, type: !38)
!181 = !DILocation(line: 38, column: 22, scope: !177)
!182 = !DILocalVariable(name: "$ret3", scope: !177, file: !24, line: 38, type: !34)
!183 = !DILocation(line: 38, column: 36, scope: !177)
!184 = !DILocation(line: 39, column: 8, scope: !177)
!185 = !DILocation(line: 40, column: 19, scope: !177)
!186 = !DILocalVariable(name: "$ret4", scope: !177, file: !24, line: 38, type: !86)
!187 = !DILocation(line: 38, column: 51, scope: !177)
!188 = !DILocation(line: 40, column: 3, scope: !177)
!189 = !DILocation(line: 43, column: 17, scope: !177)
!190 = !DILocation(line: 44, column: 44, scope: !177)
!191 = !DILocation(line: 44, column: 12, scope: !177)
!192 = !DILocation(line: 42, column: 9, scope: !177)
!193 = !DILocation(line: 42, column: 10, scope: !177)
!194 = !DILocation(line: 42, column: 2, scope: !177)
!195 = distinct !DISubprogram(name: "endpoint.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !24, line: 3, type: !196, isLocal: false, isDefinition: true, scopeLine: 3, isOptimized: false, unit: !1, retainedNodes: !3)
!196 = !DISubroutineType(types: !197)
!197 = !{!10}
