; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/log\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/mailgun/log\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22http\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22net/http\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22net/http\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3)
!2 = !DIFile(filename: "./error.go", directory: "/home/wangcong/go_path/src/github.com/vulcand/vulcan/errors")
!3 = !{}
!4 = distinct !DISubprogram(name: "errors.Format..1command_line_arguments.JsonFormatter", linkageName: "command_line_arguments.JsonFormatter.Format", scope: null, file: !5, line: 30, type: !6, isLocal: false, isDefinition: true, scopeLine: 30, isOptimized: false, unit: !1, retainedNodes: !3)
!5 = !DIFile(filename: "error.go", directory: ".")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !27, !27, !29}
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,struct{*uint8,int,int},string}", file: !9, size: 384, align: 8, elements: !10)
!9 = !DIFile(filename: "", directory: "")
!10 = !{!11, !13, !21}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 30, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 30, baseType: !14, size: 192, align: 64, offset: 64)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !9, size: 192, align: 8, elements: !15)
!15 = !{!16, !19, !20}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !9, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !9, line: 1, baseType: !12, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 30, baseType: !22, size: 128, align: 64, offset: 256)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !23, line: 1, size: 128, align: 8, elements: !24)
!23 = !DIFile(filename: "<built-in>", directory: "")
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !23, line: 1, baseType: !17, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !23, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "JsonFormatter", file: !5, line: 27, align: 8, elements: !3)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProxyError", file: !5, line: 17, size: 128, align: 8, elements: !30)
!30 = !{!31, !111}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 17, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)int,*func(*void)Header}", file: !9, size: 256, align: 8, elements: !34)
!34 = !{!35, !86, !90, !94}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 17, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !23, line: 1, size: 576, align: 8, elements: !38)
!38 = !{!39, !41, !42, !44, !45, !46, !47, !57, !66, !67, !69, !85}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !23, line: 1, baseType: !40, size: 64, align: 64)
!40 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !23, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !23, line: 1, baseType: !43, size: 32, align: 32, offset: 128)
!43 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !23, line: 1, baseType: !18, size: 8, align: 8, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !23, line: 1, baseType: !18, size: 8, align: 8, offset: 168)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !23, line: 1, baseType: !18, size: 8, align: 8, offset: 176)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !23, line: 1, baseType: !48, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !23, line: 1, size: 64, align: 8, elements: !50)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !23, line: 1, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!40, !55, !40}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIBasicType(name: "void")
!57 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !23, line: 1, baseType: !58, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !23, line: 1, size: 64, align: 8, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !23, line: 1, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !55, !55}
!65 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !23, line: 1, baseType: !17, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !23, line: 1, baseType: !68, size: 64, align: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !23, line: 1, baseType: !70, size: 64, align: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !23, line: 1, size: 320, align: 8, elements: !72)
!72 = !{!73, !74, !75}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !23, line: 1, baseType: !68, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !23, line: 1, baseType: !68, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !23, line: 1, baseType: !76, size: 192, align: 64, offset: 128)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !9, size: 192, align: 8, elements: !77)
!77 = !{!78, !19, !20}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !23, line: 1, size: 320, align: 8, elements: !81)
!81 = !{!73, !74, !82, !83, !84}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !23, line: 1, baseType: !55, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !23, line: 1, baseType: !55, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !23, line: 1, baseType: !55, size: 64, align: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !23, line: 1, baseType: !55, size: 64, align: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !9, line: 17, baseType: !87, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!22, !55}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "GetStatusCode", file: !9, line: 17, baseType: !91, size: 64, align: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!12, !55}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Headers", file: !9, line: 17, baseType: !95, size: 64, align: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !55}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !23, line: 1, size: 384, align: 8, elements: !100)
!100 = !{!101, !102, !103, !104, !106, !107, !108, !109, !110}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !23, line: 1, baseType: !12, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !23, line: 1, baseType: !18, size: 8, align: 8, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !23, line: 1, baseType: !18, size: 8, align: 8, offset: 72)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !23, line: 1, baseType: !105, size: 16, align: 16, offset: 80)
!105 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !23, line: 1, baseType: !43, size: 32, align: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !23, line: 1, baseType: !55, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !23, line: 1, baseType: !55, size: 64, align: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !23, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !23, line: 1, baseType: !55, size: 64, align: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !5, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!112 = !DILocalVariable(name: "f", arg: 1, scope: !4, file: !5, line: 30, type: !27)
!113 = !DILocation(line: 30, column: 1, scope: !4)
!114 = !DILocalVariable(name: "err", arg: 2, scope: !4, file: !5, line: 30, type: !29)
!115 = !DILocation(line: 30, column: 32, scope: !4)
!116 = !DILocalVariable(name: "$ret0", scope: !4, file: !5, line: 30, type: !12)
!117 = !DILocation(line: 30, column: 49, scope: !4)
!118 = !DILocation(line: 32, column: 22, scope: !119)
!119 = distinct !DILexicalBlock(scope: !4, file: !5, line: 30, column: 1)
!120 = !DILocation(line: 31, column: 34, scope: !119)
!121 = !DILocation(line: 31, column: 26, scope: !119)
!122 = !DILocalVariable(name: "encodedError", scope: !119, file: !5, line: 31, type: !14)
!123 = !DILocation(line: 31, column: 2, scope: !4)
!124 = !DILocalVariable(name: "e", scope: !119, file: !5, line: 31, type: !125)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !23, line: 1, size: 128, align: 8, elements: !126)
!126 = !{!127, !133}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !23, line: 1, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !9, size: 128, align: 8, elements: !130)
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 1, baseType: !36, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !9, line: 1, baseType: !87, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !23, line: 1, baseType: !55, size: 64, align: 64, offset: 64)
!134 = !DILocation(line: 34, column: 7, scope: !119)
!135 = !DILocation(line: 35, column: 7, scope: !119)
!136 = !DILocation(line: 35, column: 41, scope: !119)
!137 = !DILocation(line: 36, column: 24, scope: !119)
!138 = !DILocation(line: 38, column: 12, scope: !119)
!139 = !DILocalVariable(name: "$ret1", scope: !4, file: !5, line: 30, type: !14)
!140 = !DILocation(line: 30, column: 54, scope: !4)
!141 = !DILocation(line: 38, column: 2, scope: !119)
!142 = distinct !DISubprogram(name: "errors.command_line_arguments.HttpError..hash", linkageName: "command_line_arguments.command_line_arguments.HttpError..hash", scope: null, file: !23, line: 1, type: !53, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!143 = !DILocalVariable(name: "key", arg: 1, scope: !142, file: !23, line: 1, type: !55)
!144 = !DILocation(line: 1, column: 1, scope: !142)
!145 = !DILocalVariable(name: "seed", arg: 2, scope: !142, file: !23, line: 1, type: !40)
!146 = !DILocalVariable(name: "$ret10", scope: !142, file: !23, line: 1, type: !40)
!147 = distinct !DISubprogram(name: "errors.command_line_arguments.HttpError..eq", linkageName: "command_line_arguments.command_line_arguments.HttpError..eq", scope: null, file: !23, line: 1, type: !63, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!148 = !DILocalVariable(name: "key1", arg: 1, scope: !147, file: !23, line: 1, type: !55)
!149 = !DILocation(line: 1, column: 1, scope: !147)
!150 = !DILocalVariable(name: "key2", arg: 2, scope: !147, file: !23, line: 1, type: !55)
!151 = !DILocalVariable(name: "$ret11", scope: !147, file: !23, line: 1, type: !65)
!152 = distinct !DISubprogram(name: "errors.Error..1command_line_arguments.HttpError", linkageName: "command_line_arguments.HttpError.Error", scope: null, file: !5, line: 54, type: !153, isLocal: false, isDefinition: true, scopeLine: 54, isOptimized: false, unit: !1, retainedNodes: !3)
!153 = !DISubroutineType(types: !154)
!154 = !{!22, !155, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "HttpError", file: !5, line: 41, size: 192, align: 8, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "StatusCode", file: !5, line: 42, baseType: !12, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !5, line: 43, baseType: !22, size: 128, align: 64, offset: 64)
!160 = !DILocalVariable(name: "r", arg: 1, scope: !152, file: !5, line: 54, type: !155)
!161 = !DILocation(line: 54, column: 1, scope: !152)
!162 = !DILocation(line: 55, column: 10, scope: !152)
!163 = !DILocation(line: 55, column: 2, scope: !152)
!164 = !DILocalVariable(name: "$ret5", scope: !152, file: !5, line: 54, type: !22)
!165 = !DILocation(line: 54, column: 29, scope: !152)
!166 = distinct !DISubprogram(name: "errors.GetStatusCode..1command_line_arguments.HttpError", linkageName: "command_line_arguments.HttpError.GetStatusCode", scope: null, file: !5, line: 58, type: !167, isLocal: false, isDefinition: true, scopeLine: 58, isOptimized: false, unit: !1, retainedNodes: !3)
!167 = !DISubroutineType(types: !168)
!168 = !{!12, !155, !155}
!169 = !DILocalVariable(name: "r", arg: 1, scope: !166, file: !5, line: 58, type: !155)
!170 = !DILocation(line: 58, column: 1, scope: !166)
!171 = !DILocalVariable(name: "$ret6", scope: !166, file: !5, line: 58, type: !12)
!172 = !DILocation(line: 58, column: 37, scope: !166)
!173 = !DILocation(line: 59, column: 10, scope: !166)
!174 = !DILocation(line: 59, column: 2, scope: !166)
!175 = distinct !DISubprogram(name: "errors.Headers..1command_line_arguments.HttpError", linkageName: "command_line_arguments.HttpError.Headers", scope: null, file: !5, line: 50, type: !176, isLocal: false, isDefinition: true, scopeLine: 50, isOptimized: false, unit: !1, retainedNodes: !3)
!176 = !DISubroutineType(types: !177)
!177 = !{!98, !155, !155}
!178 = !DILocalVariable(name: "r", arg: 1, scope: !175, file: !5, line: 50, type: !155)
!179 = !DILocation(line: 50, column: 1, scope: !175)
!180 = !DILocalVariable(name: "$ret4", scope: !175, file: !5, line: 50, type: !98)
!181 = !DILocation(line: 50, column: 31, scope: !175)
!182 = !DILocation(line: 51, column: 2, scope: !175)
!183 = distinct !DISubprogram(name: "errors.FromStatus", linkageName: "command_line_arguments.FromStatus", scope: null, file: !5, line: 46, type: !184, isLocal: false, isDefinition: true, scopeLine: 46, isOptimized: false, unit: !1, retainedNodes: !3)
!184 = !DISubroutineType(types: !185)
!185 = !{!155, !12}
!186 = !DILocalVariable(name: "statusCode", arg: 1, scope: !183, file: !5, line: 46, type: !12)
!187 = !DILocation(line: 46, column: 17, scope: !183)
!188 = !DILocalVariable(name: "$ret3", scope: !183, file: !5, line: 46, type: !155)
!189 = !DILocation(line: 46, column: 33, scope: !183)
!190 = !DILocation(line: 47, column: 37, scope: !183)
!191 = !DILocation(line: 47, column: 9, scope: !183)
!192 = !DILocation(line: 47, column: 10, scope: !183)
!193 = !DILocation(line: 47, column: 2, scope: !183)
!194 = distinct !DISubprogram(name: "errors.Error..1command_line_arguments.RedirectError", linkageName: "command_line_arguments.RedirectError.Error", scope: null, file: !5, line: 66, type: !195, isLocal: false, isDefinition: true, scopeLine: 66, isOptimized: false, unit: !1, retainedNodes: !3)
!195 = !DISubroutineType(types: !196)
!196 = !{!22, !197, !197}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "RedirectError", file: !5, line: 62, size: 64, align: 8, elements: !199)
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !5, line: 63, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !5, line: 7, size: 1024, align: 8, elements: !203)
!203 = !{!204, !205, !206, !213, !214, !215, !216, !217, !218}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !5, line: 7, baseType: !22, size: 128, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !5, line: 7, baseType: !22, size: 128, align: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !5, line: 7, baseType: !207, size: 64, align: 64, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !5, line: 7, size: 320, align: 8, elements: !209)
!209 = !{!210, !211, !212}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !5, line: 7, baseType: !22, size: 128, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !5, line: 7, baseType: !22, size: 128, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !5, line: 7, baseType: !65, size: 8, align: 8, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !5, line: 7, baseType: !22, size: 128, align: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !5, line: 7, baseType: !22, size: 128, align: 64, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !5, line: 7, baseType: !22, size: 128, align: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !5, line: 7, baseType: !65, size: 8, align: 8, offset: 704)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !5, line: 7, baseType: !22, size: 128, align: 64, offset: 768)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !5, line: 7, baseType: !22, size: 128, align: 64, offset: 896)
!219 = !DILocalVariable(name: "r", arg: 1, scope: !194, file: !5, line: 66, type: !197)
!220 = !DILocation(line: 66, column: 1, scope: !194)
!221 = !DILocation(line: 67, column: 42, scope: !194)
!222 = !DILocation(line: 67, column: 13, scope: !194)
!223 = !DILocation(line: 67, column: 2, scope: !194)
!224 = distinct !DISubprogram(name: "errors.GetStatusCode..1command_line_arguments.RedirectError", linkageName: "command_line_arguments.RedirectError.GetStatusCode", scope: null, file: !5, line: 70, type: !225, isLocal: false, isDefinition: true, scopeLine: 70, isOptimized: false, unit: !1, retainedNodes: !3)
!225 = !DISubroutineType(types: !226)
!226 = !{!12, !197, !197}
!227 = !DILocalVariable(name: "r", arg: 1, scope: !224, file: !5, line: 70, type: !197)
!228 = !DILocation(line: 70, column: 1, scope: !224)
!229 = !DILocalVariable(name: "$ret8", scope: !224, file: !5, line: 70, type: !12)
!230 = !DILocation(line: 70, column: 41, scope: !224)
!231 = !DILocation(line: 71, column: 2, scope: !224)
!232 = distinct !DISubprogram(name: "errors.Headers..1command_line_arguments.RedirectError", linkageName: "command_line_arguments.RedirectError.Headers", scope: null, file: !5, line: 74, type: !233, isLocal: false, isDefinition: true, scopeLine: 74, isOptimized: false, unit: !1, retainedNodes: !3)
!233 = !DISubroutineType(types: !234)
!234 = !{!98, !197, !197}
!235 = !DILocalVariable(name: "r", arg: 1, scope: !232, file: !5, line: 74, type: !197)
!236 = !DILocation(line: 74, column: 1, scope: !232)
!237 = !DILocalVariable(name: "$ret9", scope: !232, file: !5, line: 74, type: !98)
!238 = !DILocation(line: 74, column: 35, scope: !232)
!239 = !DILocation(line: 75, column: 7, scope: !240)
!240 = distinct !DILexicalBlock(scope: !232, file: !5, line: 74, column: 1)
!241 = !DILocalVariable(name: "h", scope: !240, file: !5, line: 75, type: !98)
!242 = !DILocation(line: 75, column: 2, scope: !232)
!243 = !DILocation(line: 76, column: 21, scope: !240)
!244 = !DILocation(line: 76, column: 25, scope: !240)
!245 = !DILocation(line: 76, column: 3, scope: !240)
!246 = !DILocation(line: 77, column: 9, scope: !240)
!247 = !DILocation(line: 77, column: 2, scope: !240)
!248 = distinct !DISubprogram(name: "errors.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !5, line: 2, type: !249, isLocal: false, isDefinition: true, scopeLine: 2, isOptimized: false, unit: !1, retainedNodes: !3)
!249 = !DISubroutineType(types: !250)
!250 = !{!56}
!251 = !DILocation(line: 1, column: 1, scope: !252)
!252 = !DILexicalBlockFile(scope: !248, file: !23, discriminator: 0)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "errors"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "command-line-arguments"
	.ascii ";\n"
	.ascii "import "
	.ascii "json"
	.ascii " "
	.ascii "encoding/json"
	.ascii " \""
	.ascii "encoding/json"
	.ascii "\";\n"
	.ascii "import "
	.ascii "fmt"
	.ascii " "
	.ascii "fmt"
	.ascii " \""
	.ascii "fmt"
	.ascii "\";\n"
	.ascii "import "
	.ascii "log"
	.ascii " "
	.ascii "github.com/mailgun/log"
	.ascii " \""
	.ascii "github.com/mailgun/log"
	.ascii "\";\n"
	.ascii "import "
	.ascii "http"
	.ascii " "
	.ascii "net/http"
	.ascii " \""
	.ascii "net/http"
	.ascii "\";\n"
	.ascii "import "
	.ascii "url"
	.ascii " "
	.ascii "net/url"
	.ascii " \""
	.ascii "net/url"
	.ascii "\";\n"
	.ascii "init"
	.ascii " "
	.ascii "bufio"
	.ascii " "
	.ascii "bufio..import"
	.ascii " "
	.ascii "bytes"
	.ascii " "
	.ascii "bytes..import"
	.ascii " "
	.ascii "flate"
	.ascii " "
	.ascii "compress_flate..import"
	.ascii " "
	.ascii "gzip"
	.ascii " "
	.ascii "compress_gzip..import"
	.ascii " "
	.ascii "context"
	.ascii " "
	.ascii "context..import"
	.ascii " "
	.ascii "crypto"
	.ascii " "
	.ascii "crypto..import"
	.ascii " "
	.ascii "cipher"
	.ascii " "
	.ascii "crypto_cipher..import"
