; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22connlimit\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/vulcan/errors\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/mailgun/vulcan/errors\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22limit\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/vulcan/limit\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/mailgun/vulcan/limit\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22netutils\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3)
!2 = !DIFile(filename: "./connlimiter.go", directory: "/home/wangcong/go_path/src/github.com/vulcand/vulcan/limit/connlimit")
!3 = !{}
!4 = distinct !DISubprogram(name: "connlimit.GetConnectionCount..1command_line_arguments.ConnectionLimiter", linkageName: "command_line_arguments.ConnectionLimiter.GetConnectionCount", scope: null, file: !5, line: 82, type: !6, isLocal: false, isDefinition: true, scopeLine: 82, isOptimized: false, unit: !1, retainedNodes: !3)
!5 = !DIFile(filename: "connlimiter.go", directory: ".")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !9, !9}
!8 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionLimiter", file: !5, line: 16, size: 320, align: 8, elements: !11)
!11 = !{!12, !20, !554, !555, !556}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !5, line: 17, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !5, line: 9, size: 64, align: 8, elements: !15)
!15 = !{!16, !18}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !5, line: 9, baseType: !17, size: 32, align: 32)
!17 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !5, line: 9, baseType: !19, size: 32, align: 32, offset: 32)
!19 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "mapper", file: !5, line: 18, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 7, size: 64, align: 8, elements: !23)
!23 = !{!24}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 7, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !105}
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,int64,error}", file: !29, size: 320, align: 8, elements: !30)
!29 = !DIFile(filename: "", directory: "")
!30 = !{!31, !40, !41}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "token", file: !29, line: 7, baseType: !32, size: 128, align: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !33, line: 1, size: 128, align: 8, elements: !34)
!33 = !DIFile(filename: "<built-in>", directory: "")
!34 = !{!35, !38}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !33, line: 1, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !33, line: 1, baseType: !39, size: 64, align: 64, offset: 64)
!39 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "amount", file: !29, line: 7, baseType: !8, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !29, line: 7, baseType: !42, size: 128, align: 64, offset: 192)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !33, line: 1, size: 128, align: 8, elements: !43)
!43 = !{!44, !104}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !33, line: 1, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !29, size: 128, align: 8, elements: !47)
!47 = !{!48, !100}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !29, line: 1, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !33, line: 1, size: 576, align: 8, elements: !51)
!51 = !{!52, !54, !55, !56, !57, !58, !59, !69, !78, !79, !81, !99}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !33, line: 1, baseType: !53, size: 64, align: 64)
!53 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !33, line: 1, baseType: !53, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !33, line: 1, baseType: !19, size: 32, align: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !33, line: 1, baseType: !37, size: 8, align: 8, offset: 160)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !33, line: 1, baseType: !37, size: 8, align: 8, offset: 168)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !33, line: 1, baseType: !37, size: 8, align: 8, offset: 176)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !33, line: 1, baseType: !60, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !33, line: 1, size: 64, align: 8, elements: !62)
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !33, line: 1, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!53, !67, !53}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIBasicType(name: "void")
!69 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !33, line: 1, baseType: !70, size: 64, align: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !33, line: 1, size: 64, align: 8, elements: !72)
!72 = !{!73}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !33, line: 1, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !67, !67}
!77 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !33, line: 1, baseType: !36, size: 64, align: 64, offset: 320)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !33, line: 1, baseType: !80, size: 64, align: 64, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !33, line: 1, baseType: !82, size: 64, align: 64, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !33, line: 1, size: 320, align: 8, elements: !84)
!84 = !{!85, !86, !87}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !33, line: 1, baseType: !80, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !33, line: 1, baseType: !80, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !33, line: 1, baseType: !88, size: 192, align: 64, offset: 128)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !29, size: 192, align: 8, elements: !89)
!89 = !{!90, !97, !98}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !33, line: 1, size: 320, align: 8, elements: !93)
!93 = !{!85, !86, !94, !95, !96}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !33, line: 1, baseType: !67, size: 64, align: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !33, line: 1, baseType: !67, size: 64, align: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !33, line: 1, baseType: !67, size: 64, align: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !29, line: 1, baseType: !39, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !29, line: 1, baseType: !39, size: 64, align: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !33, line: 1, baseType: !67, size: 64, align: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !29, line: 1, baseType: !101, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!32, !67}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !33, line: 1, baseType: !67, size: 64, align: 64, offset: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !5, line: 7, size: 128, align: 8, elements: !106)
!106 = !{!107, !161}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 7, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Attempt)void,*func(*void,string)void,*func(*void)struct{*Attempt,int,int},*func(*void)MultiReader,*func(*void)*Request,*func(*void)int64,*func(*void)Attempt,*func(*void,string)struct{PrivateKey,bool},*func(*void,MultiReader)void,*func(*void,*Request)void,*func(*void,string,PrivateKey)void,*func(*void)string}", file: !29, size: 832, align: 8, elements: !110)
!110 = !{!111, !112, !471, !475, !483, !521, !525, !529, !533, !541, !545, !549, !553}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !29, line: 7, baseType: !49, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "AddAttempt", file: !29, line: 7, baseType: !113, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!68, !67, !116}
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "Attempt", file: !5, line: 7, size: 128, align: 8, elements: !117)
!117 = !{!118, !161}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 7, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Duration,*func(*void)Endpoint,*func(*void)error,*func(*void)*Response}", file: !29, size: 320, align: 8, elements: !121)
!121 = !{!111, !122, !127, !162, !166}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "GetDuration", file: !29, line: 7, baseType: !123, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!126, !67}
!126 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "GetEndpoint", file: !29, line: 7, baseType: !128, size: 64, align: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !67}
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "Endpoint", file: !5, line: 7, size: 128, align: 8, elements: !132)
!132 = !{!133, !161}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 7, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)*URL,*func(*void)string}", file: !29, size: 256, align: 8, elements: !136)
!136 = !{!111, !137, !138, !160}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "GetId", file: !29, line: 7, baseType: !101, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "GetUrl", file: !29, line: 7, baseType: !139, size: 64, align: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!142, !67}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !5, line: 6, size: 1024, align: 8, elements: !144)
!144 = !{!145, !146, !147, !154, !155, !156, !157, !158, !159}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !5, line: 6, baseType: !32, size: 128, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !5, line: 6, baseType: !32, size: 128, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !5, line: 6, baseType: !148, size: 64, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !5, line: 6, size: 320, align: 8, elements: !150)
!150 = !{!151, !152, !153}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !5, line: 6, baseType: !32, size: 128, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !5, line: 6, baseType: !32, size: 128, align: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !5, line: 6, baseType: !77, size: 8, align: 8, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !5, line: 6, baseType: !32, size: 128, align: 64, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !5, line: 6, baseType: !32, size: 128, align: 64, offset: 448)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !5, line: 6, baseType: !32, size: 128, align: 64, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !5, line: 6, baseType: !77, size: 8, align: 8, offset: 704)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !5, line: 6, baseType: !32, size: 128, align: 64, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !5, line: 6, baseType: !32, size: 128, align: 64, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !29, line: 7, baseType: !101, size: 64, align: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !5, line: 1, baseType: !67, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "GetError", file: !29, line: 7, baseType: !163, size: 64, align: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!42, !67}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "GetResponse", file: !29, line: 7, baseType: !167, size: 64, align: 64, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !67}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !5, line: 7, size: 1152, align: 8, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !178, !192, !211, !212, !216, !217, !218, !219, !470}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !5, line: 7, baseType: !32, size: 128, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "StatusCode", file: !5, line: 7, baseType: !39, size: 64, align: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Proto", file: !5, line: 7, baseType: !32, size: 128, align: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMajor", file: !5, line: 7, baseType: !39, size: 64, align: 64, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMinor", file: !5, line: 7, baseType: !39, size: 64, align: 64, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !5, line: 7, baseType: !179, size: 64, align: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !33, line: 1, size: 384, align: 8, elements: !181)
!181 = !{!182, !183, !184, !185, !187, !188, !189, !190, !191}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !33, line: 1, baseType: !39, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !33, line: 1, baseType: !37, size: 8, align: 8, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !33, line: 1, baseType: !37, size: 8, align: 8, offset: 72)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !33, line: 1, baseType: !186, size: 16, align: 16, offset: 80)
!186 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !33, line: 1, baseType: !19, size: 32, align: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !33, line: 1, baseType: !67, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !33, line: 1, baseType: !67, size: 64, align: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !33, line: 1, baseType: !53, size: 64, align: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !33, line: 1, baseType: !67, size: 64, align: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !5, line: 7, baseType: !193, size: 128, align: 64, offset: 512)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !5, line: 7, size: 128, align: 8, elements: !194)
!194 = !{!195, !161}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 7, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !29, size: 192, align: 8, elements: !198)
!198 = !{!111, !199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !29, line: 7, baseType: !163, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !29, line: 7, baseType: !201, size: 64, align: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!204, !67, !208}
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !29, size: 192, align: 8, elements: !205)
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !29, line: 5, baseType: !39, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !29, line: 5, baseType: !42, size: 128, align: 64, offset: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !29, size: 192, align: 8, elements: !209)
!209 = !{!210, !97, !98}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !36, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !5, line: 7, baseType: !8, size: 64, align: 64, offset: 640)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !5, line: 7, baseType: !213, size: 192, align: 64, offset: 704)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !29, size: 192, align: 8, elements: !214)
!214 = !{!215, !97, !98}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !80, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !5, line: 7, baseType: !77, size: 8, align: 8, offset: 896)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Uncompressed", file: !5, line: 7, baseType: !77, size: 8, align: 8, offset: 904)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !5, line: 7, baseType: !179, size: 64, align: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Request", file: !5, line: 7, baseType: !220, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !5, line: 7, size: 1984, align: 8, elements: !222)
!222 = !{!223, !224, !175, !176, !177, !178, !192, !225, !237, !238, !239, !240, !241, !242, !243, !249, !250, !251, !252, !442, !445, !446}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !5, line: 7, baseType: !32, size: 128, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !5, line: 7, baseType: !142, size: 64, align: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !5, line: 7, baseType: !226, size: 64, align: 64, offset: 640)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 7, size: 64, align: 8, elements: !228)
!228 = !{!229}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 7, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!233}
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !29, size: 256, align: 8, elements: !234)
!234 = !{!235, !236}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !29, line: 7, baseType: !193, size: 128, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !29, line: 7, baseType: !42, size: 128, align: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !5, line: 7, baseType: !8, size: 64, align: 64, offset: 704)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !5, line: 7, baseType: !213, size: 192, align: 64, offset: 768)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !5, line: 7, baseType: !77, size: 8, align: 8, offset: 960)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !5, line: 7, baseType: !32, size: 128, align: 64, offset: 1024)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Form", file: !5, line: 7, baseType: !179, size: 64, align: 64, offset: 1152)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "PostForm", file: !5, line: 7, baseType: !179, size: 64, align: 64, offset: 1216)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "MultipartForm", file: !5, line: 7, baseType: !244, size: 64, align: 64, offset: 1280)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", file: !5, line: 7, size: 128, align: 8, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !5, line: 7, baseType: !179, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !5, line: 7, baseType: !179, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !5, line: 7, baseType: !179, size: 64, align: 64, offset: 1344)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !5, line: 7, baseType: !32, size: 128, align: 64, offset: 1408)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "RequestURI", file: !5, line: 7, baseType: !32, size: 128, align: 64, offset: 1536)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !5, line: 7, baseType: !253, size: 64, align: 64, offset: 1664)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionState", file: !5, line: 7, size: 1344, align: 8, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !430, !435, !440, !441}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !5, line: 7, baseType: !186, size: 16, align: 16)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "HandshakeComplete", file: !5, line: 7, baseType: !77, size: 8, align: 8, offset: 16)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "DidResume", file: !5, line: 7, baseType: !77, size: 8, align: 8, offset: 24)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuite", file: !5, line: 7, baseType: !186, size: 16, align: 16, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocol", file: !5, line: 7, baseType: !32, size: 128, align: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocolIsMutual", file: !5, line: 7, baseType: !77, size: 8, align: 8, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !5, line: 7, baseType: !32, size: 128, align: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "PeerCertificates", file: !5, line: 7, baseType: !264, size: 192, align: 64, offset: 384)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !29, size: 192, align: 8, elements: !265)
!265 = !{!266, !97, !98}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !5, line: 7, size: 10624, align: 8, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !276, !277, !279, !281, !285, !286, !299, !325, !326, !360, !361, !363, !373, !374, !379, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !404, !409, !410, !411, !412, !423, !424, !425, !426, !427, !428, !429}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !5, line: 7, baseType: !208, size: 192, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !5, line: 7, baseType: !208, size: 192, align: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !5, line: 7, baseType: !208, size: 192, align: 64, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !5, line: 7, baseType: !208, size: 192, align: 64, offset: 576)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !5, line: 7, baseType: !208, size: 192, align: 64, offset: 768)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !5, line: 7, baseType: !208, size: 192, align: 64, offset: 960)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !5, line: 7, baseType: !278, size: 64, align: 64, offset: 1152)
!278 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !5, line: 7, baseType: !280, size: 64, align: 64, offset: 1216)
!280 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !5, line: 7, baseType: !282, size: 128, align: 64, offset: 1280)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !5, line: 10, size: 128, align: 8, elements: !283)
!283 = !{!284, !161}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !5, line: 1, baseType: !49, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !5, line: 7, baseType: !39, size: 64, align: 64, offset: 1408)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !5, line: 7, baseType: !287, size: 64, align: 64, offset: 1472)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !5, line: 7, size: 256, align: 8, elements: !289)
!289 = !{!290, !291}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !5, line: 7, baseType: !77, size: 8, align: 8)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !5, line: 7, baseType: !292, size: 192, align: 64, offset: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !5, line: 7, size: 192, align: 8, elements: !293)
!293 = !{!294, !297, !298}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !5, line: 1, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !5, line: 1, baseType: !39, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !5, line: 1, baseType: !39, size: 64, align: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !5, line: 7, baseType: !300, size: 1984, align: 64, offset: 1536)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !5, line: 7, size: 1984, align: 8, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !324}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !5, line: 7, baseType: !213, size: 192, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !5, line: 7, baseType: !213, size: 192, align: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !5, line: 7, baseType: !213, size: 192, align: 64, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !5, line: 7, baseType: !213, size: 192, align: 64, offset: 576)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !5, line: 7, baseType: !213, size: 192, align: 64, offset: 768)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !5, line: 7, baseType: !213, size: 192, align: 64, offset: 960)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !5, line: 7, baseType: !213, size: 192, align: 64, offset: 1152)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !5, line: 7, baseType: !32, size: 128, align: 64, offset: 1344)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !5, line: 7, baseType: !32, size: 128, align: 64, offset: 1472)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !5, line: 7, baseType: !312, size: 192, align: 64, offset: 1600)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !29, size: 192, align: 8, elements: !313)
!313 = !{!314, !97, !98}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !5, line: 7, size: 320, align: 8, elements: !317)
!317 = !{!318, !323}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !5, line: 7, baseType: !319, size: 192, align: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !5, line: 7, size: 192, align: 8, elements: !320)
!320 = !{!321, !297, !298}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !5, line: 1, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !5, line: 7, baseType: !282, size: 128, align: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !5, line: 7, baseType: !312, size: 192, align: 64, offset: 1792)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !5, line: 7, baseType: !300, size: 1984, align: 64, offset: 3520)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !5, line: 7, baseType: !327, size: 192, align: 64, offset: 5504)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !5, line: 7, size: 192, align: 8, elements: !328)
!328 = !{!329, !331, !332}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !5, line: 7, baseType: !330, size: 64, align: 64)
!330 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !5, line: 7, baseType: !8, size: 64, align: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !5, line: 7, baseType: !333, size: 64, align: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !5, line: 7, size: 704, align: 8, elements: !335)
!335 = !{!336, !337, !346, !357, !358, !359}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !5, line: 7, baseType: !32, size: 128, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !5, line: 7, baseType: !338, size: 192, align: 64, offset: 128)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !29, size: 192, align: 8, elements: !339)
!339 = !{!340, !97, !98}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !5, line: 7, size: 256, align: 8, elements: !343)
!343 = !{!336, !344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !5, line: 7, baseType: !39, size: 64, align: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !5, line: 7, baseType: !77, size: 8, align: 8, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !5, line: 7, baseType: !347, size: 192, align: 64, offset: 320)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !29, size: 192, align: 8, elements: !348)
!348 = !{!349, !97, !98}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !5, line: 7, size: 128, align: 8, elements: !352)
!352 = !{!353, !354, !355, !356}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !5, line: 7, baseType: !8, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !5, line: 7, baseType: !37, size: 8, align: 8, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !5, line: 7, baseType: !77, size: 8, align: 8, offset: 72)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !5, line: 7, baseType: !77, size: 8, align: 8, offset: 80)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !5, line: 7, baseType: !8, size: 64, align: 64, offset: 512)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !5, line: 7, baseType: !8, size: 64, align: 64, offset: 576)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !5, line: 7, baseType: !341, size: 64, align: 64, offset: 640)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !5, line: 7, baseType: !327, size: 192, align: 64, offset: 5696)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !5, line: 7, baseType: !362, size: 64, align: 64, offset: 5888)
!362 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !5, line: 7, baseType: !364, size: 192, align: 64, offset: 5952)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !29, size: 192, align: 8, elements: !365)
!365 = !{!366, !97, !98}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !5, line: 7, size: 448, align: 8, elements: !369)
!369 = !{!370, !371, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !5, line: 7, baseType: !319, size: 192, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !5, line: 7, baseType: !77, size: 8, align: 8, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !5, line: 7, baseType: !208, size: 192, align: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !5, line: 7, baseType: !364, size: 192, align: 64, offset: 6144)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !5, line: 7, baseType: !375, size: 192, align: 64, offset: 6336)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !29, size: 192, align: 8, elements: !376)
!376 = !{!377, !97, !98}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !5, line: 7, baseType: !380, size: 192, align: 64, offset: 6528)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !29, size: 192, align: 8, elements: !381)
!381 = !{!382, !97, !98}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !5, line: 7, baseType: !375, size: 192, align: 64, offset: 6720)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !5, line: 7, baseType: !77, size: 8, align: 8, offset: 6912)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !5, line: 7, baseType: !77, size: 8, align: 8, offset: 6920)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !5, line: 7, baseType: !39, size: 64, align: 64, offset: 6976)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !5, line: 7, baseType: !77, size: 8, align: 8, offset: 7040)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !5, line: 7, baseType: !208, size: 192, align: 64, offset: 7104)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !5, line: 7, baseType: !208, size: 192, align: 64, offset: 7296)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !5, line: 7, baseType: !213, size: 192, align: 64, offset: 7488)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !5, line: 7, baseType: !213, size: 192, align: 64, offset: 7680)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !5, line: 7, baseType: !213, size: 192, align: 64, offset: 7872)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !5, line: 7, baseType: !213, size: 192, align: 64, offset: 8064)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !5, line: 7, baseType: !397, size: 192, align: 64, offset: 8256)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !29, size: 192, align: 8, elements: !398)
!398 = !{!399, !97, !98}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !5, line: 7, size: 192, align: 8, elements: !402)
!402 = !{!403, !297, !298}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !5, line: 1, baseType: !36, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !5, line: 7, baseType: !405, size: 192, align: 64, offset: 8448)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !29, size: 192, align: 8, elements: !406)
!406 = !{!407, !97, !98}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !5, line: 7, baseType: !77, size: 8, align: 8, offset: 8640)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !5, line: 7, baseType: !213, size: 192, align: 64, offset: 8704)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !5, line: 7, baseType: !213, size: 192, align: 64, offset: 8896)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !5, line: 7, baseType: !413, size: 192, align: 64, offset: 9088)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !29, size: 192, align: 8, elements: !414)
!414 = !{!415, !97, !98}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !416, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !5, line: 7, size: 384, align: 8, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !5, line: 7, baseType: !401, size: 192, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !5, line: 7, baseType: !422, size: 192, align: 64, offset: 192)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !5, line: 7, size: 192, align: 8, elements: !402)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !5, line: 7, baseType: !413, size: 192, align: 64, offset: 9280)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !5, line: 7, baseType: !213, size: 192, align: 64, offset: 9472)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !5, line: 7, baseType: !213, size: 192, align: 64, offset: 9664)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !5, line: 7, baseType: !213, size: 192, align: 64, offset: 9856)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !5, line: 7, baseType: !213, size: 192, align: 64, offset: 10048)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !5, line: 7, baseType: !213, size: 192, align: 64, offset: 10240)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !5, line: 7, baseType: !375, size: 192, align: 64, offset: 10432)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "VerifiedChains", file: !5, line: 7, baseType: !431, size: 192, align: 64, offset: 576)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !29, size: 192, align: 8, elements: !432)
!432 = !{!433, !97, !98}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !5, line: 7, baseType: !436, size: 192, align: 64, offset: 768)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !29, size: 192, align: 8, elements: !437)
!437 = !{!438, !97, !98}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPResponse", file: !5, line: 7, baseType: !208, size: 192, align: 64, offset: 960)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "TLSUnique", file: !5, line: 7, baseType: !208, size: 192, align: 64, offset: 1152)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", file: !5, line: 7, baseType: !443, size: 64, align: 64, offset: 1728)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !33, line: 1, align: 8, elements: !3)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !5, line: 7, baseType: !67, size: 64, align: 64, offset: 1792)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !5, line: 7, baseType: !447, size: 128, align: 64, offset: 1856)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !5, line: 7, size: 128, align: 8, elements: !448)
!448 = !{!449, !161}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 7, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,PrivateKey)PrivateKey}", file: !29, size: 320, align: 8, elements: !452)
!452 = !{!111, !453, !461, !465, !466}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !29, line: 7, baseType: !454, size: 64, align: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!457, !67}
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !29, size: 256, align: 8, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !29, line: 7, baseType: !327, size: 192, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !29, line: 7, baseType: !77, size: 8, align: 8, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !29, line: 7, baseType: !462, size: 64, align: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!443, !67}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !29, line: 7, baseType: !163, size: 64, align: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !29, line: 7, baseType: !467, size: 64, align: 64, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!282, !67, !282}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !5, line: 7, baseType: !253, size: 64, align: 64, offset: 1088)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteUserData", file: !29, line: 7, baseType: !472, size: 64, align: 64, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!68, !67, !32}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "GetAttempts", file: !29, line: 7, baseType: !476, size: 64, align: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!479, !67}
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Attempt,int,int}", file: !29, size: 192, align: 8, elements: !480)
!480 = !{!481, !97, !98}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !29, line: 1, baseType: !482, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !29, line: 7, baseType: !484, size: 64, align: 64, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!487, !67}
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiReader", file: !5, line: 7, size: 128, align: 8, elements: !488)
!488 = !{!489, !161}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 7, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,int64,int)struct{int64,error},*func(*void)struct{int64,error},*func(*void,Writer)struct{int64,error}}", file: !29, size: 384, align: 8, elements: !492)
!492 = !{!111, !199, !200, !493, !501, !505}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "Seek", file: !29, line: 7, baseType: !494, size: 64, align: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!497, !67, !8, !39}
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !29, size: 192, align: 8, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !29, line: 7, baseType: !8, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !29, line: 7, baseType: !42, size: 128, align: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "TotalSize", file: !29, line: 7, baseType: !502, size: 64, align: 64, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!497, !67}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "WriteTo", file: !29, line: 7, baseType: !506, size: 64, align: 64, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!509, !67, !513}
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !29, size: 192, align: 8, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !29, line: 7, baseType: !8, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !29, line: 7, baseType: !42, size: 128, align: 64, offset: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !5, line: 5, size: 128, align: 8, elements: !514)
!514 = !{!515, !161}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 5, baseType: !516, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !29, size: 128, align: 8, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !29, line: 5, baseType: !49, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !29, line: 5, baseType: !201, size: 64, align: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "GetHttpRequest", file: !29, line: 7, baseType: !522, size: 64, align: 64, offset: 320)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!220, !67}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "GetId", file: !29, line: 7, baseType: !526, size: 64, align: 64, offset: 384)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!8, !67}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "GetLastAttempt", file: !29, line: 7, baseType: !530, size: 64, align: 64, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!116, !67}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserData", file: !29, line: 7, baseType: !534, size: 64, align: 64, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!537, !67, !32}
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{PrivateKey,bool}", file: !29, size: 192, align: 8, elements: !538)
!538 = !{!539, !540}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !29, line: 7, baseType: !282, size: 128, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !29, line: 7, baseType: !77, size: 8, align: 8, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "SetBody", file: !29, line: 7, baseType: !542, size: 64, align: 64, offset: 576)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!68, !67, !487}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "SetHttpRequest", file: !29, line: 7, baseType: !546, size: 64, align: 64, offset: 640)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!68, !67, !220}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "SetUserData", file: !29, line: 7, baseType: !550, size: 64, align: 64, offset: 704)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!68, !67, !32, !282}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !29, line: 7, baseType: !101, size: 64, align: 64, offset: 768)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "connections", file: !5, line: 19, baseType: !179, size: 64, align: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "maxConnections", file: !5, line: 20, baseType: !8, size: 64, align: 64, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "totalConnections", file: !5, line: 21, baseType: !8, size: 64, align: 64, offset: 256)
!557 = !DILocalVariable(name: "cl", arg: 1, scope: !4, file: !5, line: 82, type: !9)
!558 = !DILocation(line: 82, column: 1, scope: !4)
!559 = !DILocalVariable(name: "$ret6", scope: !4, file: !5, line: 82, type: !8)
!560 = !DILocation(line: 82, column: 51, scope: !4)
!561 = !DILocation(line: 83, column: 4, scope: !4)
!562 = !DILocation(line: 86, column: 1, scope: !4)
!563 = !DILocation(line: 83, column: 10, scope: !4)
!564 = !DILocation(line: 84, column: 10, scope: !4)
!565 = !DILocation(line: 84, column: 2, scope: !4)
!566 = !DILocation(line: 85, column: 11, scope: !4)
!567 = !DILocation(line: 85, column: 2, scope: !4)
!568 = distinct !DISubprogram(name: "connlimit.GetMaxConnections..1command_line_arguments.ConnectionLimiter", linkageName: "command_line_arguments.ConnectionLimiter.GetMaxConnections", scope: null, file: !5, line: 88, type: !6, isLocal: false, isDefinition: true, scopeLine: 88, isOptimized: false, unit: !1, retainedNodes: !3)
!569 = !DILocalVariable(name: "cl", arg: 1, scope: !568, file: !5, line: 88, type: !9)
!570 = !DILocation(line: 88, column: 1, scope: !568)
!571 = !DILocalVariable(name: "$ret7", scope: !568, file: !5, line: 88, type: !8)
!572 = !DILocation(line: 88, column: 50, scope: !568)
!573 = !DILocation(line: 89, column: 11, scope: !568)
!574 = !DILocation(line: 89, column: 2, scope: !568)
!575 = distinct !DISubprogram(name: "connlimit.ProcessRequest..1command_line_arguments.ConnectionLimiter", linkageName: "command_line_arguments.ConnectionLimiter.ProcessRequest", scope: null, file: !5, line: 43, type: !576, isLocal: false, isDefinition: true, scopeLine: 43, isOptimized: false, unit: !1, retainedNodes: !3)
!576 = !DISubroutineType(types: !577)
!577 = !{!578, !9, !9, !105}
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Response,error}", file: !29, size: 192, align: 8, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !29, line: 43, baseType: !170, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !29, line: 43, baseType: !42, size: 128, align: 64, offset: 64)
!582 = !DILocalVariable(name: "cl", arg: 1, scope: !575, file: !5, line: 43, type: !9)
!583 = !DILocation(line: 43, column: 1, scope: !575)
!584 = !DILocalVariable(name: "r", arg: 2, scope: !575, file: !5, line: 43, type: !105)
!585 = !DILocation(line: 43, column: 45, scope: !575)
!586 = !DILocalVariable(name: "$ret4", scope: !575, file: !5, line: 43, type: !170)
!587 = !DILocation(line: 43, column: 65, scope: !575)
!588 = !DILocalVariable(name: "$ret5", scope: !575, file: !5, line: 43, type: !42)
!589 = !DILocation(line: 43, column: 81, scope: !575)
!590 = !DILocation(line: 44, column: 4, scope: !591)
!591 = distinct !DILexicalBlock(scope: !575, file: !5, line: 43, column: 1)
!592 = !DILocation(line: 63, column: 1, scope: !575)
!593 = !DILocation(line: 44, column: 10, scope: !591)
!594 = !DILocation(line: 45, column: 10, scope: !591)
!595 = !DILocation(line: 45, column: 2, scope: !591)
!596 = !DILocation(line: 47, column: 26, scope: !591)
!597 = !DILocalVariable(name: "amount", scope: !591, file: !5, line: 47, type: !8)
!598 = !DILocation(line: 47, column: 2, scope: !575)
!599 = !DILocalVariable(name: "err", scope: !591, file: !5, line: 47, type: !42)
!600 = !DILocation(line: 48, column: 9, scope: !591)
!601 = !DILocation(line: 52, column: 19, scope: !591)
!602 = !DILocation(line: 52, column: 31, scope: !591)
!603 = !DILocalVariable(name: "connections", scope: !591, file: !5, line: 52, type: !8)
!604 = !DILocation(line: 52, column: 2, scope: !575)
!605 = !DILocation(line: 53, column: 22, scope: !591)
!606 = !DILocation(line: 53, column: 17, scope: !591)
!607 = !DILocation(line: 55, column: 5, scope: !591)
!608 = !DILocation(line: 57, column: 69, scope: !591)
!609 = !DILocation(line: 57, column: 8, scope: !591)
!610 = !DILocation(line: 54, column: 19, scope: !591)
!611 = !DILocation(line: 60, column: 4, scope: !591)
!612 = !DILocation(line: 60, column: 16, scope: !591)
!613 = !DILocation(line: 60, column: 24, scope: !591)
!614 = !DILocation(line: 61, column: 4, scope: !591)
!615 = !DILocation(line: 61, column: 22, scope: !591)
!616 = !DILocation(line: 49, column: 3, scope: !575)
!617 = distinct !DISubprogram(name: "connlimit.ProcessResponse..1command_line_arguments.ConnectionLimiter", linkageName: "command_line_arguments.ConnectionLimiter.ProcessResponse", scope: null, file: !5, line: 65, type: !618, isLocal: false, isDefinition: true, scopeLine: 65, isOptimized: false, unit: !1, retainedNodes: !3)
!618 = !DISubroutineType(types: !619)
!619 = !{!68, !9, !9, !105, !116}
!620 = !DILocalVariable(name: "cl", arg: 1, scope: !617, file: !5, line: 65, type: !9)
!621 = !DILocation(line: 65, column: 1, scope: !617)
!622 = !DILocalVariable(name: "r", arg: 2, scope: !617, file: !5, line: 65, type: !105)
!623 = !DILocation(line: 65, column: 46, scope: !617)
!624 = !DILocalVariable(name: "a", arg: 3, scope: !617, file: !5, line: 65, type: !116)
!625 = !DILocation(line: 65, column: 65, scope: !617)
!626 = !DILocation(line: 66, column: 4, scope: !627)
!627 = distinct !DILexicalBlock(scope: !617, file: !5, line: 65, column: 1)
!628 = !DILocation(line: 80, column: 1, scope: !617)
!629 = !DILocation(line: 66, column: 10, scope: !627)
!630 = !DILocation(line: 67, column: 10, scope: !627)
!631 = !DILocation(line: 67, column: 2, scope: !627)
!632 = !DILocation(line: 69, column: 26, scope: !627)
!633 = !DILocalVariable(name: "amount", scope: !627, file: !5, line: 69, type: !8)
!634 = !DILocation(line: 69, column: 2, scope: !617)
!635 = !DILocalVariable(name: "err", scope: !627, file: !5, line: 69, type: !42)
!636 = !DILocation(line: 70, column: 9, scope: !627)
!637 = !DILocation(line: 73, column: 4, scope: !627)
!638 = !DILocation(line: 73, column: 16, scope: !627)
!639 = !DILocation(line: 73, column: 24, scope: !627)
!640 = !DILocation(line: 74, column: 4, scope: !627)
!641 = !DILocation(line: 74, column: 22, scope: !627)
!642 = !DILocation(line: 77, column: 7, scope: !627)
!643 = !DILocation(line: 77, column: 19, scope: !627)
!644 = !DILocation(line: 77, column: 27, scope: !627)
!645 = !DILocation(line: 78, column: 12, scope: !627)
!646 = !DILocation(line: 78, column: 3, scope: !627)
!647 = !DILocation(line: 71, column: 3, scope: !617)
!648 = distinct !DISubprogram(name: "connlimit.SetMaxConnections..1command_line_arguments.ConnectionLimiter", linkageName: "command_line_arguments.ConnectionLimiter.SetMaxConnections", scope: null, file: !5, line: 92, type: !649, isLocal: false, isDefinition: true, scopeLine: 92, isOptimized: false, unit: !1, retainedNodes: !3)
!649 = !DISubroutineType(types: !650)
!650 = !{!68, !9, !9, !8}
!651 = !DILocalVariable(name: "cl", arg: 1, scope: !648, file: !5, line: 92, type: !9)
!652 = !DILocation(line: 92, column: 1, scope: !648)
!653 = !DILocalVariable(name: "max", arg: 2, scope: !648, file: !5, line: 92, type: !8)
!654 = !DILocation(line: 92, column: 48, scope: !648)
!655 = !DILocation(line: 93, column: 4, scope: !648)
!656 = !DILocation(line: 93, column: 20, scope: !648)
!657 = distinct !DISubprogram(name: "connlimit.NewClientIpLimiter", linkageName: "command_line_arguments.NewClientIpLimiter", scope: null, file: !5, line: 24, type: !658, isLocal: false, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !1, retainedNodes: !3)
!658 = !DISubroutineType(types: !659)
!659 = !{!660, !8}
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ConnectionLimiter,error}", file: !29, size: 192, align: 8, elements: !661)
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !29, line: 24, baseType: !9, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !29, line: 24, baseType: !42, size: 128, align: 64, offset: 64)
!664 = !DILocalVariable(name: "maxConnections", arg: 1, scope: !657, file: !5, line: 24, type: !8)
!665 = !DILocation(line: 24, column: 25, scope: !657)
!666 = !DILocalVariable(name: "$ret0", scope: !657, file: !5, line: 24, type: !9)
!667 = !DILocation(line: 24, column: 48, scope: !657)
!668 = !DILocation(line: 25, column: 9, scope: !657)
!669 = !DILocation(line: 25, column: 2, scope: !657)
!670 = distinct !DISubprogram(name: "connlimit.NewConnectionLimiter", linkageName: "command_line_arguments.NewConnectionLimiter", scope: null, file: !5, line: 28, type: !671, isLocal: false, isDefinition: true, scopeLine: 28, isOptimized: false, unit: !1, retainedNodes: !3)
!671 = !DISubroutineType(types: !672)
!672 = !{!660, !21, !8}
!673 = !DILocalVariable(name: "mapper", arg: 1, scope: !670, file: !5, line: 28, type: !21)
!674 = !DILocation(line: 28, column: 27, scope: !670)
!675 = !DILocalVariable(name: "maxConnections", arg: 2, scope: !670, file: !5, line: 28, type: !8)
!676 = !DILocation(line: 28, column: 50, scope: !670)
!677 = !DILocalVariable(name: "$ret2", scope: !670, file: !5, line: 28, type: !9)
!678 = !DILocation(line: 28, column: 73, scope: !670)
!679 = !DILocation(line: 29, column: 12, scope: !670)
!680 = !DILocation(line: 30, column: 19, scope: !670)
!681 = !DILocalVariable(name: "$ret3", scope: !670, file: !5, line: 28, type: !42)
!682 = !DILocation(line: 28, column: 93, scope: !670)
!683 = !DILocation(line: 30, column: 3, scope: !670)
!684 = !DILocation(line: 32, column: 20, scope: !670)
!685 = !DILocation(line: 33, column: 19, scope: !670)
!686 = !DILocation(line: 33, column: 3, scope: !670)
!687 = !DILocation(line: 36, column: 19, scope: !670)
!688 = !DILocation(line: 39, column: 19, scope: !670)
!689 = !DILocation(line: 35, column: 9, scope: !670)
!690 = !DILocation(line: 35, column: 10, scope: !670)
!691 = !DILocation(line: 35, column: 2, scope: !670)
!692 = distinct !DISubprogram(name: "connlimit.command_line_arguments..thunk0", scope: null, file: !5, line: 45, type: !693, isLocal: true, isDefinition: true, scopeLine: 45, isOptimized: false, unit: !1, retainedNodes: !3)
!693 = !DISubroutineType(types: !694)
!694 = !{!77, !695}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Mutex}", file: !29, size: 64, align: 8, elements: !697)
!697 = !{!698}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !29, line: 45, baseType: !13, size: 64, align: 64)
!699 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !692, file: !5, line: 45, type: !695)
!700 = !DILocation(line: 45, column: 2, scope: !692)
!701 = !DILocalVariable(name: "$ret8", scope: !692, file: !5, line: 45, type: !77)
!702 = distinct !DISubprogram(name: "connlimit.command_line_arguments..thunk1", scope: null, file: !5, line: 67, type: !693, isLocal: true, isDefinition: true, scopeLine: 67, isOptimized: false, unit: !1, retainedNodes: !3)
!703 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !702, file: !5, line: 67, type: !695)
!704 = !DILocation(line: 67, column: 2, scope: !702)
!705 = !DILocalVariable(name: "$ret9", scope: !702, file: !5, line: 67, type: !77)
!706 = distinct !DISubprogram(name: "connlimit.command_line_arguments..thunk2", scope: null, file: !5, line: 84, type: !693, isLocal: true, isDefinition: true, scopeLine: 84, isOptimized: false, unit: !1, retainedNodes: !3)
!707 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !706, file: !5, line: 84, type: !695)
!708 = !DILocation(line: 84, column: 2, scope: !706)
!709 = !DILocalVariable(name: "$ret10", scope: !706, file: !5, line: 84, type: !77)
