; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22limit\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22middleware\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/vulcan/middleware\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/mailgun/vulcan/middleware\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22request\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/vulcan/request\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/mailgun/vulcan/request\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22strings\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3)
!2 = !DIFile(filename: "./limiter.go", directory: "/home/wangcong/go_path/src/github.com/vulcand/vulcan/limit")
!3 = !{}
!4 = distinct !DISubprogram(name: "limit.MapClientIp", linkageName: "command_line_arguments.MapClientIp", scope: null, file: !5, line: 35, type: !6, isLocal: false, isDefinition: true, scopeLine: 35, isOptimized: false, unit: !1, retainedNodes: !3)
!5 = !DIFile(filename: "limiter.go", directory: ".")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !87}
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,int64,error}", file: !9, size: 320, align: 8, elements: !10)
!9 = !DIFile(filename: "", directory: "")
!10 = !{!11, !20, !22}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 35, baseType: !12, size: 128, align: 64)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !13, line: 1, size: 128, align: 8, elements: !14)
!13 = !DIFile(filename: "<built-in>", directory: "")
!14 = !{!15, !18}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !13, line: 1, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !13, line: 1, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 35, baseType: !21, size: 64, align: 64, offset: 128)
!21 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 35, baseType: !23, size: 128, align: 64, offset: 192)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !13, line: 1, size: 128, align: 8, elements: !24)
!24 = !{!25, !86}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !13, line: 1, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !9, size: 128, align: 8, elements: !28)
!28 = !{!29, !82}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 1, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !13, line: 1, size: 576, align: 8, elements: !32)
!32 = !{!33, !35, !36, !38, !39, !40, !41, !51, !60, !61, !63, !81}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !13, line: 1, baseType: !34, size: 64, align: 64)
!34 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !13, line: 1, baseType: !34, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !13, line: 1, baseType: !37, size: 32, align: 32, offset: 128)
!37 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !13, line: 1, baseType: !17, size: 8, align: 8, offset: 160)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !13, line: 1, baseType: !17, size: 8, align: 8, offset: 168)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !13, line: 1, baseType: !17, size: 8, align: 8, offset: 176)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !13, line: 1, baseType: !42, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !13, line: 1, size: 64, align: 8, elements: !44)
!44 = !{!45}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !13, line: 1, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!34, !49, !34}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIBasicType(name: "void")
!51 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !13, line: 1, baseType: !52, size: 64, align: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !13, line: 1, size: 64, align: 8, elements: !54)
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !13, line: 1, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !49, !49}
!59 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !13, line: 1, baseType: !16, size: 64, align: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !13, line: 1, baseType: !62, size: 64, align: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !13, line: 1, baseType: !64, size: 64, align: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !13, line: 1, size: 320, align: 8, elements: !66)
!66 = !{!67, !68, !69}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !13, line: 1, baseType: !62, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !13, line: 1, baseType: !62, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !13, line: 1, baseType: !70, size: 192, align: 64, offset: 128)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !9, size: 192, align: 8, elements: !71)
!71 = !{!72, !79, !80}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !13, line: 1, size: 320, align: 8, elements: !75)
!75 = !{!67, !68, !76, !77, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !13, line: 1, baseType: !49, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !13, line: 1, baseType: !49, size: 64, align: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !13, line: 1, baseType: !49, size: 64, align: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !9, line: 1, baseType: !19, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !9, line: 1, baseType: !19, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !13, line: 1, baseType: !49, size: 64, align: 64, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !9, line: 1, baseType: !83, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!12, !49}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !13, line: 1, baseType: !49, size: 64, align: 64, offset: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !5, line: 6, size: 128, align: 8, elements: !88)
!88 = !{!89, !143}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 6, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Attempt)void,*func(*void,string)void,*func(*void)struct{*Attempt,int,int},*func(*void)MultiReader,*func(*void)*Request,*func(*void)int64,*func(*void)Attempt,*func(*void,string)struct{struct{*_type,*void},bool},*func(*void,MultiReader)void,*func(*void,*Request)void,*func(*void,string,struct{*_type,*void})void,*func(*void)string}", file: !9, size: 832, align: 8, elements: !92)
!92 = !{!93, !94, !453, !457, !465, !503, !507, !511, !515, !523, !527, !531, !535}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 6, baseType: !30, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "AddAttempt", file: !9, line: 6, baseType: !95, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!50, !49, !98}
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "Attempt", file: !5, line: 6, size: 128, align: 8, elements: !99)
!99 = !{!100, !143}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 6, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Duration,*func(*void)Endpoint,*func(*void)error,*func(*void)*Response}", file: !9, size: 320, align: 8, elements: !103)
!103 = !{!93, !104, !109, !144, !148}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "GetDuration", file: !9, line: 6, baseType: !105, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!108, !49}
!108 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "GetEndpoint", file: !9, line: 6, baseType: !110, size: 64, align: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!113, !49}
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "Endpoint", file: !5, line: 6, size: 128, align: 8, elements: !114)
!114 = !{!115, !143}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 6, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)*URL,*func(*void)string}", file: !9, size: 256, align: 8, elements: !118)
!118 = !{!93, !119, !120, !142}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "GetId", file: !9, line: 6, baseType: !83, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "GetUrl", file: !9, line: 6, baseType: !121, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !49}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !5, line: 6, size: 1024, align: 8, elements: !126)
!126 = !{!127, !128, !129, !136, !137, !138, !139, !140, !141}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !5, line: 6, baseType: !12, size: 128, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !5, line: 6, baseType: !12, size: 128, align: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !5, line: 6, baseType: !130, size: 64, align: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !5, line: 6, size: 320, align: 8, elements: !132)
!132 = !{!133, !134, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !5, line: 6, baseType: !12, size: 128, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !5, line: 6, baseType: !12, size: 128, align: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !5, line: 6, baseType: !59, size: 8, align: 8, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !5, line: 6, baseType: !12, size: 128, align: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !5, line: 6, baseType: !12, size: 128, align: 64, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !5, line: 6, baseType: !12, size: 128, align: 64, offset: 576)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !5, line: 6, baseType: !59, size: 8, align: 8, offset: 704)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !5, line: 6, baseType: !12, size: 128, align: 64, offset: 768)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !5, line: 6, baseType: !12, size: 128, align: 64, offset: 896)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !9, line: 6, baseType: !83, size: 64, align: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !5, line: 1, baseType: !49, size: 64, align: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "GetError", file: !9, line: 6, baseType: !145, size: 64, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!23, !49}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "GetResponse", file: !9, line: 6, baseType: !149, size: 64, align: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!152, !49}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !5, line: 6, size: 1152, align: 8, elements: !154)
!154 = !{!155, !156, !157, !158, !159, !160, !174, !193, !194, !198, !199, !200, !201, !452}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !5, line: 6, baseType: !12, size: 128, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "StatusCode", file: !5, line: 6, baseType: !19, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Proto", file: !5, line: 6, baseType: !12, size: 128, align: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMajor", file: !5, line: 6, baseType: !19, size: 64, align: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMinor", file: !5, line: 6, baseType: !19, size: 64, align: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !5, line: 6, baseType: !161, size: 64, align: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !13, line: 1, size: 384, align: 8, elements: !163)
!163 = !{!164, !165, !166, !167, !169, !170, !171, !172, !173}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !13, line: 1, baseType: !19, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !13, line: 1, baseType: !17, size: 8, align: 8, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !13, line: 1, baseType: !17, size: 8, align: 8, offset: 72)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !13, line: 1, baseType: !168, size: 16, align: 16, offset: 80)
!168 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !13, line: 1, baseType: !37, size: 32, align: 32, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !13, line: 1, baseType: !49, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !13, line: 1, baseType: !49, size: 64, align: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !13, line: 1, baseType: !34, size: 64, align: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !13, line: 1, baseType: !49, size: 64, align: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !5, line: 6, baseType: !175, size: 128, align: 64, offset: 512)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !5, line: 6, size: 128, align: 8, elements: !176)
!176 = !{!177, !143}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 6, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !9, size: 192, align: 8, elements: !180)
!180 = !{!93, !181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !9, line: 6, baseType: !145, size: 64, align: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !9, line: 6, baseType: !183, size: 64, align: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!186, !49, !190}
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !9, size: 192, align: 8, elements: !187)
!187 = !{!188, !189}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !9, line: 5, baseType: !19, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !9, line: 5, baseType: !23, size: 128, align: 64, offset: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !9, size: 192, align: 8, elements: !191)
!191 = !{!192, !79, !80}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !16, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !5, line: 6, baseType: !21, size: 64, align: 64, offset: 640)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !5, line: 6, baseType: !195, size: 192, align: 64, offset: 704)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !9, size: 192, align: 8, elements: !196)
!196 = !{!197, !79, !80}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !62, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !5, line: 6, baseType: !59, size: 8, align: 8, offset: 896)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Uncompressed", file: !5, line: 6, baseType: !59, size: 8, align: 8, offset: 904)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !5, line: 6, baseType: !161, size: 64, align: 64, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Request", file: !5, line: 6, baseType: !202, size: 64, align: 64, offset: 1024)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !5, line: 6, size: 1984, align: 8, elements: !204)
!204 = !{!205, !206, !157, !158, !159, !160, !174, !207, !219, !220, !221, !222, !223, !224, !225, !231, !232, !233, !234, !424, !427, !428}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !5, line: 6, baseType: !12, size: 128, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !5, line: 6, baseType: !124, size: 64, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !5, line: 6, baseType: !208, size: 64, align: 64, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 6, size: 64, align: 8, elements: !210)
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 6, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!215}
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !9, size: 256, align: 8, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 6, baseType: !175, size: 128, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 6, baseType: !23, size: 128, align: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !5, line: 6, baseType: !21, size: 64, align: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !5, line: 6, baseType: !195, size: 192, align: 64, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !5, line: 6, baseType: !59, size: 8, align: 8, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !5, line: 6, baseType: !12, size: 128, align: 64, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Form", file: !5, line: 6, baseType: !161, size: 64, align: 64, offset: 1152)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "PostForm", file: !5, line: 6, baseType: !161, size: 64, align: 64, offset: 1216)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "MultipartForm", file: !5, line: 6, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", file: !5, line: 6, size: 128, align: 8, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !5, line: 6, baseType: !161, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !5, line: 6, baseType: !161, size: 64, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !5, line: 6, baseType: !161, size: 64, align: 64, offset: 1344)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !5, line: 6, baseType: !12, size: 128, align: 64, offset: 1408)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "RequestURI", file: !5, line: 6, baseType: !12, size: 128, align: 64, offset: 1536)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !5, line: 6, baseType: !235, size: 64, align: 64, offset: 1664)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionState", file: !5, line: 6, size: 1344, align: 8, elements: !237)
!237 = !{!238, !239, !240, !241, !242, !243, !244, !245, !412, !417, !422, !423}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !5, line: 6, baseType: !168, size: 16, align: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "HandshakeComplete", file: !5, line: 6, baseType: !59, size: 8, align: 8, offset: 16)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "DidResume", file: !5, line: 6, baseType: !59, size: 8, align: 8, offset: 24)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuite", file: !5, line: 6, baseType: !168, size: 16, align: 16, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocol", file: !5, line: 6, baseType: !12, size: 128, align: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocolIsMutual", file: !5, line: 6, baseType: !59, size: 8, align: 8, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !5, line: 6, baseType: !12, size: 128, align: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "PeerCertificates", file: !5, line: 6, baseType: !246, size: 192, align: 64, offset: 384)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !9, size: 192, align: 8, elements: !247)
!247 = !{!248, !79, !80}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !5, line: 6, size: 10624, align: 8, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !261, !263, !267, !268, !281, !307, !308, !342, !343, !345, !355, !356, !361, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !386, !391, !392, !393, !394, !405, !406, !407, !408, !409, !410, !411}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !5, line: 6, baseType: !190, size: 192, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !5, line: 6, baseType: !190, size: 192, align: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !5, line: 6, baseType: !190, size: 192, align: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !5, line: 6, baseType: !190, size: 192, align: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !5, line: 6, baseType: !190, size: 192, align: 64, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !5, line: 6, baseType: !190, size: 192, align: 64, offset: 960)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !5, line: 6, baseType: !260, size: 64, align: 64, offset: 1152)
!260 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !5, line: 6, baseType: !262, size: 64, align: 64, offset: 1216)
!262 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !5, line: 6, baseType: !264, size: 128, align: 64, offset: 1280)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !9, size: 128, align: 8, elements: !265)
!265 = !{!29, !266}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !9, line: 1, baseType: !49, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !5, line: 6, baseType: !19, size: 64, align: 64, offset: 1408)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !5, line: 6, baseType: !269, size: 64, align: 64, offset: 1472)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !5, line: 6, size: 256, align: 8, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !5, line: 6, baseType: !59, size: 8, align: 8)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !5, line: 6, baseType: !274, size: 192, align: 64, offset: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !5, line: 6, size: 192, align: 8, elements: !275)
!275 = !{!276, !279, !280}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !5, line: 1, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !5, line: 1, baseType: !19, size: 64, align: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !5, line: 1, baseType: !19, size: 64, align: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !5, line: 6, baseType: !282, size: 1984, align: 64, offset: 1536)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !5, line: 6, size: 1984, align: 8, elements: !283)
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !306}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !5, line: 6, baseType: !195, size: 192, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !5, line: 6, baseType: !195, size: 192, align: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !5, line: 6, baseType: !195, size: 192, align: 64, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !5, line: 6, baseType: !195, size: 192, align: 64, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !5, line: 6, baseType: !195, size: 192, align: 64, offset: 768)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !5, line: 6, baseType: !195, size: 192, align: 64, offset: 960)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !5, line: 6, baseType: !195, size: 192, align: 64, offset: 1152)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !5, line: 6, baseType: !12, size: 128, align: 64, offset: 1344)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !5, line: 6, baseType: !12, size: 128, align: 64, offset: 1472)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !5, line: 6, baseType: !294, size: 192, align: 64, offset: 1600)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !9, size: 192, align: 8, elements: !295)
!295 = !{!296, !79, !80}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !297, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !5, line: 6, size: 320, align: 8, elements: !299)
!299 = !{!300, !305}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !5, line: 6, baseType: !301, size: 192, align: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !5, line: 6, size: 192, align: 8, elements: !302)
!302 = !{!303, !279, !280}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !5, line: 1, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !5, line: 6, baseType: !264, size: 128, align: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !5, line: 6, baseType: !294, size: 192, align: 64, offset: 1792)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !5, line: 6, baseType: !282, size: 1984, align: 64, offset: 3520)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !5, line: 6, baseType: !309, size: 192, align: 64, offset: 5504)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !5, line: 6, size: 192, align: 8, elements: !310)
!310 = !{!311, !313, !314}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !5, line: 6, baseType: !312, size: 64, align: 64)
!312 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !5, line: 6, baseType: !21, size: 64, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !5, line: 6, baseType: !315, size: 64, align: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !5, line: 6, size: 704, align: 8, elements: !317)
!317 = !{!318, !319, !328, !339, !340, !341}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !5, line: 6, baseType: !12, size: 128, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !5, line: 6, baseType: !320, size: 192, align: 64, offset: 128)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !9, size: 192, align: 8, elements: !321)
!321 = !{!322, !79, !80}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !323, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !5, line: 6, size: 256, align: 8, elements: !325)
!325 = !{!318, !326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !5, line: 6, baseType: !19, size: 64, align: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !5, line: 6, baseType: !59, size: 8, align: 8, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !5, line: 6, baseType: !329, size: 192, align: 64, offset: 320)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !9, size: 192, align: 8, elements: !330)
!330 = !{!331, !79, !80}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !5, line: 6, size: 128, align: 8, elements: !334)
!334 = !{!335, !336, !337, !338}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !5, line: 6, baseType: !21, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !5, line: 6, baseType: !17, size: 8, align: 8, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !5, line: 6, baseType: !59, size: 8, align: 8, offset: 72)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !5, line: 6, baseType: !59, size: 8, align: 8, offset: 80)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !5, line: 6, baseType: !21, size: 64, align: 64, offset: 512)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !5, line: 6, baseType: !21, size: 64, align: 64, offset: 576)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !5, line: 6, baseType: !323, size: 64, align: 64, offset: 640)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !5, line: 6, baseType: !309, size: 192, align: 64, offset: 5696)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !5, line: 6, baseType: !344, size: 64, align: 64, offset: 5888)
!344 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !5, line: 6, baseType: !346, size: 192, align: 64, offset: 5952)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !9, size: 192, align: 8, elements: !347)
!347 = !{!348, !79, !80}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !5, line: 6, size: 448, align: 8, elements: !351)
!351 = !{!352, !353, !354}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !5, line: 6, baseType: !301, size: 192, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !5, line: 6, baseType: !59, size: 8, align: 8, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !5, line: 6, baseType: !190, size: 192, align: 64, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !5, line: 6, baseType: !346, size: 192, align: 64, offset: 6144)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !5, line: 6, baseType: !357, size: 192, align: 64, offset: 6336)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !9, size: 192, align: 8, elements: !358)
!358 = !{!359, !79, !80}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !5, line: 6, baseType: !362, size: 192, align: 64, offset: 6528)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !9, size: 192, align: 8, elements: !363)
!363 = !{!364, !79, !80}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !5, line: 6, baseType: !357, size: 192, align: 64, offset: 6720)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !5, line: 6, baseType: !59, size: 8, align: 8, offset: 6912)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !5, line: 6, baseType: !59, size: 8, align: 8, offset: 6920)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !5, line: 6, baseType: !19, size: 64, align: 64, offset: 6976)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !5, line: 6, baseType: !59, size: 8, align: 8, offset: 7040)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !5, line: 6, baseType: !190, size: 192, align: 64, offset: 7104)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !5, line: 6, baseType: !190, size: 192, align: 64, offset: 7296)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !5, line: 6, baseType: !195, size: 192, align: 64, offset: 7488)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !5, line: 6, baseType: !195, size: 192, align: 64, offset: 7680)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !5, line: 6, baseType: !195, size: 192, align: 64, offset: 7872)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !5, line: 6, baseType: !195, size: 192, align: 64, offset: 8064)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !5, line: 6, baseType: !379, size: 192, align: 64, offset: 8256)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !9, size: 192, align: 8, elements: !380)
!380 = !{!381, !79, !80}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !5, line: 6, size: 192, align: 8, elements: !384)
!384 = !{!385, !279, !280}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !5, line: 1, baseType: !16, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !5, line: 6, baseType: !387, size: 192, align: 64, offset: 8448)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !9, size: 192, align: 8, elements: !388)
!388 = !{!389, !79, !80}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !5, line: 6, baseType: !59, size: 8, align: 8, offset: 8640)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !5, line: 6, baseType: !195, size: 192, align: 64, offset: 8704)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !5, line: 6, baseType: !195, size: 192, align: 64, offset: 8896)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !5, line: 6, baseType: !395, size: 192, align: 64, offset: 9088)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !9, size: 192, align: 8, elements: !396)
!396 = !{!397, !79, !80}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !5, line: 6, size: 384, align: 8, elements: !401)
!401 = !{!402, !403}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !5, line: 6, baseType: !383, size: 192, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !5, line: 6, baseType: !404, size: 192, align: 64, offset: 192)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !5, line: 6, size: 192, align: 8, elements: !384)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !5, line: 6, baseType: !395, size: 192, align: 64, offset: 9280)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !5, line: 6, baseType: !195, size: 192, align: 64, offset: 9472)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !5, line: 6, baseType: !195, size: 192, align: 64, offset: 9664)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !5, line: 6, baseType: !195, size: 192, align: 64, offset: 9856)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !5, line: 6, baseType: !195, size: 192, align: 64, offset: 10048)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !5, line: 6, baseType: !195, size: 192, align: 64, offset: 10240)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !5, line: 6, baseType: !357, size: 192, align: 64, offset: 10432)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "VerifiedChains", file: !5, line: 6, baseType: !413, size: 192, align: 64, offset: 576)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !9, size: 192, align: 8, elements: !414)
!414 = !{!415, !79, !80}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !416, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !5, line: 6, baseType: !418, size: 192, align: 64, offset: 768)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !9, size: 192, align: 8, elements: !419)
!419 = !{!420, !79, !80}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPResponse", file: !5, line: 6, baseType: !190, size: 192, align: 64, offset: 960)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "TLSUnique", file: !5, line: 6, baseType: !190, size: 192, align: 64, offset: 1152)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", file: !5, line: 6, baseType: !425, size: 64, align: 64, offset: 1728)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !13, line: 1, align: 8, elements: !3)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !5, line: 6, baseType: !49, size: 64, align: 64, offset: 1792)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !5, line: 6, baseType: !429, size: 128, align: 64, offset: 1856)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !5, line: 6, size: 128, align: 8, elements: !430)
!430 = !{!431, !143}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 6, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,struct{*_type,*void})struct{*_type,*void}}", file: !9, size: 320, align: 8, elements: !434)
!434 = !{!93, !435, !443, !447, !448}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !9, line: 6, baseType: !436, size: 64, align: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!439, !49}
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !9, size: 256, align: 8, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !9, line: 6, baseType: !309, size: 192, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !9, line: 6, baseType: !59, size: 8, align: 8, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !9, line: 6, baseType: !444, size: 64, align: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!425, !49}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !9, line: 6, baseType: !145, size: 64, align: 64, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !9, line: 6, baseType: !449, size: 64, align: 64, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!264, !49, !264}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !5, line: 6, baseType: !235, size: 64, align: 64, offset: 1088)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteUserData", file: !9, line: 6, baseType: !454, size: 64, align: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!50, !49, !12}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "GetAttempts", file: !9, line: 6, baseType: !458, size: 64, align: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!461, !49}
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Attempt,int,int}", file: !9, size: 192, align: 8, elements: !462)
!462 = !{!463, !79, !80}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !464, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !9, line: 6, baseType: !466, size: 64, align: 64, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!469, !49}
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiReader", file: !5, line: 6, size: 128, align: 8, elements: !470)
!470 = !{!471, !143}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 6, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,int64,int)struct{int64,error},*func(*void)struct{int64,error},*func(*void,Writer)struct{int64,error}}", file: !9, size: 384, align: 8, elements: !474)
!474 = !{!93, !181, !182, !475, !483, !487}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "Seek", file: !9, line: 6, baseType: !476, size: 64, align: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!479, !49, !21, !19}
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !9, size: 192, align: 8, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 6, baseType: !21, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 6, baseType: !23, size: 128, align: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "TotalSize", file: !9, line: 6, baseType: !484, size: 64, align: 64, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!479, !49}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "WriteTo", file: !9, line: 6, baseType: !488, size: 64, align: 64, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!491, !49, !495}
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !9, size: 192, align: 8, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !9, line: 6, baseType: !21, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !9, line: 6, baseType: !23, size: 128, align: 64, offset: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !5, line: 5, size: 128, align: 8, elements: !496)
!496 = !{!497, !143}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 5, baseType: !498, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !9, size: 128, align: 8, elements: !500)
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 5, baseType: !30, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !9, line: 5, baseType: !183, size: 64, align: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "GetHttpRequest", file: !9, line: 6, baseType: !504, size: 64, align: 64, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!202, !49}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "GetId", file: !9, line: 6, baseType: !508, size: 64, align: 64, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!21, !49}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "GetLastAttempt", file: !9, line: 6, baseType: !512, size: 64, align: 64, offset: 448)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!98, !49}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserData", file: !9, line: 6, baseType: !516, size: 64, align: 64, offset: 512)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!519, !49, !12}
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*_type,*void},bool}", file: !9, size: 192, align: 8, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 6, baseType: !264, size: 128, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 6, baseType: !59, size: 8, align: 8, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "SetBody", file: !9, line: 6, baseType: !524, size: 64, align: 64, offset: 576)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!50, !49, !469}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "SetHttpRequest", file: !9, line: 6, baseType: !528, size: 64, align: 64, offset: 640)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!50, !49, !202}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "SetUserData", file: !9, line: 6, baseType: !532, size: 64, align: 64, offset: 704)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!50, !49, !12, !264}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !9, line: 6, baseType: !83, size: 64, align: 64, offset: 768)
!536 = !DILocalVariable(name: "req", arg: 1, scope: !4, file: !5, line: 35, type: !87)
!537 = !DILocation(line: 35, column: 18, scope: !4)
!538 = !DILocalVariable(name: "$ret1", scope: !4, file: !5, line: 35, type: !21)
!539 = !DILocation(line: 35, column: 48, scope: !4)
!540 = !DILocation(line: 36, column: 12, scope: !541)
!541 = distinct !DILexicalBlock(scope: !4, file: !5, line: 35, column: 1)
!542 = !DILocation(line: 37, column: 2, scope: !541)
!543 = distinct !DISubprogram(name: "limit.RequestToClientIp", linkageName: "command_line_arguments.RequestToClientIp", scope: null, file: !5, line: 73, type: !544, isLocal: false, isDefinition: true, scopeLine: 73, isOptimized: false, unit: !1, retainedNodes: !3)
!544 = !DISubroutineType(types: !545)
!545 = !{!546, !87}
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !9, size: 256, align: 8, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 73, baseType: !12, size: 128, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 73, baseType: !23, size: 128, align: 64, offset: 128)
!550 = !DILocalVariable(name: "req", arg: 1, scope: !543, file: !5, line: 73, type: !87)
!551 = !DILocation(line: 73, column: 24, scope: !543)
!552 = !DILocation(line: 74, column: 28, scope: !553)
!553 = distinct !DILexicalBlock(scope: !543, file: !5, line: 73, column: 1)
!554 = !DILocation(line: 74, column: 45, scope: !553)
!555 = !DILocation(line: 74, column: 18, scope: !553)
!556 = !DILocalVariable(name: "vals", scope: !553, file: !5, line: 74, type: !195)
!557 = !DILocation(line: 74, column: 2, scope: !543)
!558 = !DILocation(line: 75, column: 13, scope: !553)
!559 = !DILocation(line: 75, column: 5, scope: !553)
!560 = !DILocation(line: 75, column: 18, scope: !553)
!561 = !DILocation(line: 76, column: 18, scope: !553)
!562 = !DILocalVariable(name: "$ret14", scope: !543, file: !5, line: 73, type: !23)
!563 = !DILocation(line: 73, column: 54, scope: !543)
!564 = !DILocation(line: 76, column: 3, scope: !553)
!565 = !DILocation(line: 78, column: 2, scope: !553)
!566 = distinct !DISubprogram(name: "limit.MapRequestHost", linkageName: "command_line_arguments.MapRequestHost", scope: null, file: !5, line: 40, type: !6, isLocal: false, isDefinition: true, scopeLine: 40, isOptimized: false, unit: !1, retainedNodes: !3)
!567 = !DILocalVariable(name: "req", arg: 1, scope: !566, file: !5, line: 40, type: !87)
!568 = !DILocation(line: 40, column: 21, scope: !566)
!569 = !DILocalVariable(name: "$ret4", scope: !566, file: !5, line: 40, type: !21)
!570 = !DILocation(line: 40, column: 51, scope: !566)
!571 = !DILocation(line: 41, column: 12, scope: !572)
!572 = distinct !DILexicalBlock(scope: !566, file: !5, line: 40, column: 1)
!573 = !DILocation(line: 42, column: 2, scope: !572)
!574 = distinct !DISubprogram(name: "limit.RequestToHost", linkageName: "command_line_arguments.RequestToHost", scope: null, file: !5, line: 82, type: !544, isLocal: false, isDefinition: true, scopeLine: 82, isOptimized: false, unit: !1, retainedNodes: !3)
!575 = !DILocalVariable(name: "req", arg: 1, scope: !574, file: !5, line: 82, type: !87)
!576 = !DILocation(line: 82, column: 20, scope: !574)
!577 = !DILocation(line: 83, column: 12, scope: !574)
!578 = !DILocation(line: 83, column: 29, scope: !574)
!579 = !DILocation(line: 83, column: 2, scope: !574)
!580 = distinct !DISubprogram(name: "limit.MakeMapRequestHeader", linkageName: "command_line_arguments.MakeMapRequestHeader", scope: null, file: !5, line: 45, type: !581, isLocal: false, isDefinition: true, scopeLine: 45, isOptimized: false, unit: !1, retainedNodes: !3)
!581 = !DISubroutineType(types: !582)
!582 = !{!583, !12}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 26, size: 64, align: 8, elements: !585)
!585 = !{!586}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 26, baseType: !587, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!590, !87}
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,int64,error}", file: !9, size: 320, align: 8, elements: !591)
!591 = !{!592, !593, !594}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "token", file: !9, line: 26, baseType: !12, size: 128, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "amount", file: !9, line: 26, baseType: !21, size: 64, align: 64, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !9, line: 26, baseType: !23, size: 128, align: 64, offset: 192)
!595 = !DILocalVariable(name: "header", arg: 1, scope: !580, file: !5, line: 45, type: !12)
!596 = !DILocation(line: 45, column: 27, scope: !580)
!597 = !DILocalVariable(name: "$ret6", scope: !580, file: !5, line: 45, type: !583)
!598 = !DILocation(line: 45, column: 42, scope: !580)
!599 = !DILocation(line: 46, column: 20, scope: !580)
!600 = !DILocation(line: 46, column: 9, scope: !580)
!601 = !DILocation(line: 46, column: 2, scope: !580)
!602 = distinct !DISubprogram(name: "limit.MakeRequestToHeader", linkageName: "command_line_arguments.MakeRequestToHeader", scope: null, file: !5, line: 97, type: !603, isLocal: false, isDefinition: true, scopeLine: 97, isOptimized: false, unit: !1, retainedNodes: !3)
!603 = !DISubroutineType(types: !604)
!604 = !{!605, !12}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 29, size: 64, align: 8, elements: !607)
!607 = !{!608}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 29, baseType: !609, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!612, !87}
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !9, size: 256, align: 8, elements: !613)
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "token", file: !9, line: 29, baseType: !12, size: 128, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !9, line: 29, baseType: !23, size: 128, align: 64, offset: 128)
!616 = !DILocalVariable(name: "param", arg: 1, scope: !602, file: !5, line: 97, type: !12)
!617 = !DILocation(line: 97, column: 26, scope: !602)
!618 = !DILocalVariable(name: "header", scope: !602, file: !5, line: 97, type: !62)
!619 = !DILocalVariable(name: "$ret21", scope: !602, file: !5, line: 97, type: !605)
!620 = !DILocation(line: 97, column: 41, scope: !602)
!621 = !DILocation(line: 98, column: 9, scope: !602)
!622 = !DILocation(line: 98, column: 2, scope: !602)
!623 = distinct !DISubprogram(name: "limit.RequestToCount", linkageName: "command_line_arguments.RequestToCount", scope: null, file: !5, line: 87, type: !624, isLocal: false, isDefinition: true, scopeLine: 87, isOptimized: false, unit: !1, retainedNodes: !3)
!624 = !DISubroutineType(types: !625)
!625 = !{!479, !87}
!626 = !DILocalVariable(name: "req", arg: 1, scope: !623, file: !5, line: 87, type: !87)
!627 = !DILocation(line: 87, column: 21, scope: !623)
!628 = !DILocalVariable(name: "$ret17", scope: !623, file: !5, line: 87, type: !21)
!629 = !DILocation(line: 87, column: 43, scope: !623)
!630 = !DILocation(line: 88, column: 2, scope: !623)
!631 = distinct !DISubprogram(name: "limit.MakeMapper", linkageName: "command_line_arguments.MakeMapper", scope: null, file: !5, line: 58, type: !632, isLocal: false, isDefinition: true, scopeLine: 58, isOptimized: false, unit: !1, retainedNodes: !3)
!632 = !DISubroutineType(types: !633)
!633 = !{!583, !605, !634}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 32, size: 64, align: 8, elements: !636)
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 32, baseType: !638, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!641, !87}
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !9, size: 192, align: 8, elements: !642)
!642 = !{!643, !644}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "amount", file: !9, line: 32, baseType: !21, size: 64, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !9, line: 32, baseType: !23, size: 128, align: 64, offset: 64)
!645 = !DILocalVariable(name: "param", arg: 1, scope: !631, file: !5, line: 58, type: !605)
!646 = !DILocation(line: 58, column: 17, scope: !631)
!647 = !DILocalVariable(name: "param", arg: 2, scope: !631, file: !5, line: 58, type: !634)
!648 = !DILocation(line: 58, column: 34, scope: !631)
!649 = !DILocalVariable(name: "t", scope: !631, file: !5, line: 58, type: !650)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!651 = !DILocalVariable(name: "a", scope: !631, file: !5, line: 58, type: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!653 = !DILocalVariable(name: "$ret9", scope: !631, file: !5, line: 58, type: !583)
!654 = !DILocation(line: 58, column: 52, scope: !631)
!655 = !DILocation(line: 59, column: 9, scope: !631)
!656 = !DILocation(line: 59, column: 2, scope: !631)
!657 = distinct !DISubprogram(name: "limit.VariableToMapper", linkageName: "command_line_arguments.VariableToMapper", scope: null, file: !5, line: 49, type: !658, isLocal: false, isDefinition: true, scopeLine: 49, isOptimized: false, unit: !1, retainedNodes: !3)
!658 = !DISubroutineType(types: !659)
!659 = !{!660, !12}
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{MapperFn,error}", file: !9, size: 192, align: 8, elements: !661)
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 49, baseType: !583, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 49, baseType: !23, size: 128, align: 64, offset: 64)
!664 = !DILocalVariable(name: "variable", arg: 1, scope: !657, file: !5, line: 49, type: !12)
!665 = !DILocation(line: 49, column: 23, scope: !657)
!666 = !DILocalVariable(name: "$ret7", scope: !657, file: !5, line: 49, type: !583)
!667 = !DILocation(line: 49, column: 41, scope: !657)
!668 = !DILocation(line: 50, column: 22, scope: !669)
!669 = distinct !DILexicalBlock(scope: !657, file: !5, line: 49, column: 1)
!670 = !DILocalVariable(name: "err", scope: !669, file: !5, line: 50, type: !23)
!671 = !DILocation(line: 50, column: 2, scope: !657)
!672 = !DILocation(line: 51, column: 9, scope: !669)
!673 = !DILocalVariable(name: "$ret8", scope: !657, file: !5, line: 49, type: !23)
!674 = !DILocation(line: 49, column: 51, scope: !657)
!675 = !DILocation(line: 52, column: 3, scope: !669)
!676 = !DILocalVariable(name: "tokenMapper", scope: !669, file: !5, line: 50, type: !605)
!677 = !DILocation(line: 54, column: 9, scope: !669)
!678 = !DILocation(line: 54, column: 2, scope: !669)
!679 = distinct !DISubprogram(name: "limit.MakeTokenMapperFromVariable", linkageName: "command_line_arguments.MakeTokenMapperFromVariable", scope: null, file: !5, line: 104, type: !680, isLocal: false, isDefinition: true, scopeLine: 104, isOptimized: false, unit: !1, retainedNodes: !3)
!680 = !DISubroutineType(types: !681)
!681 = !{!682, !12}
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{TokenMapperFn,error}", file: !9, size: 192, align: 8, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 104, baseType: !605, size: 64, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !9, line: 104, baseType: !23, size: 128, align: 64, offset: 64)
!686 = !DILocalVariable(name: "variable", arg: 1, scope: !679, file: !5, line: 104, type: !12)
!687 = !DILocation(line: 104, column: 34, scope: !679)
!688 = !DILocalVariable(name: "$ret24", scope: !679, file: !5, line: 104, type: !605)
!689 = !DILocation(line: 104, column: 52, scope: !679)
!690 = !DILocation(line: 105, column: 14, scope: !679)
!691 = !DILocalVariable(name: "$ret25", scope: !679, file: !5, line: 104, type: !23)
!692 = !DILocation(line: 104, column: 67, scope: !679)
!693 = !DILocation(line: 106, column: 3, scope: !679)
!694 = !DILocation(line: 108, column: 14, scope: !679)
!695 = !DILocation(line: 109, column: 3, scope: !679)
!696 = !DILocation(line: 111, column: 13, scope: !679)
!697 = !DILocation(line: 111, column: 2, scope: !679)
!698 = !DILocation(line: 112, column: 21, scope: !699)
!699 = distinct !DILexicalBlock(scope: !679, file: !5, line: 111, column: 52)
!700 = !DILocalVariable(name: "header", scope: !699, file: !5, line: 112, type: !12)
!701 = !DILocation(line: 112, column: 3, scope: !679)
!702 = !DILocation(line: 113, column: 18, scope: !699)
!703 = !DILocation(line: 118, column: 18, scope: !679)
!704 = !DILocation(line: 118, column: 2, scope: !679)
!705 = !DILocation(line: 114, column: 20, scope: !699)
!706 = !DILocation(line: 114, column: 4, scope: !699)
!707 = !DILocation(line: 116, column: 10, scope: !699)
!708 = !DILocation(line: 116, column: 3, scope: !699)
!709 = distinct !DISubprogram(name: "limit.MakeMapper..func1", scope: null, file: !5, line: 59, type: !6, isLocal: true, isDefinition: true, scopeLine: 59, isOptimized: false, unit: !1, retainedNodes: !3)
!710 = !DILocalVariable(name: "r", arg: 1, scope: !709, file: !5, line: 59, type: !87)
!711 = !DILocation(line: 59, column: 14, scope: !709)
!712 = !DILocalVariable(name: "$ret11", scope: !709, file: !5, line: 59, type: !21)
!713 = !DILocation(line: 59, column: 42, scope: !709)
!714 = !DILocation(line: 60, column: 17, scope: !715)
!715 = distinct !DILexicalBlock(scope: !709, file: !5, line: 59, column: 9)
!716 = !DILocalVariable(name: "err", scope: !715, file: !5, line: 60, type: !23)
!717 = !DILocation(line: 60, column: 3, scope: !709)
!718 = !DILocation(line: 61, column: 10, scope: !715)
!719 = !DILocalVariable(name: "$ret12", scope: !709, file: !5, line: 59, type: !23)
!720 = !DILocation(line: 59, column: 49, scope: !709)
!721 = !DILocation(line: 62, column: 4, scope: !715)
!722 = !DILocation(line: 64, column: 18, scope: !715)
!723 = !DILocation(line: 65, column: 10, scope: !715)
!724 = !DILocation(line: 66, column: 4, scope: !715)
!725 = !DILocalVariable(name: "amount", scope: !715, file: !5, line: 64, type: !21)
!726 = !DILocation(line: 64, column: 3, scope: !709)
!727 = !DILocation(line: 68, column: 3, scope: !715)
!728 = distinct !DISubprogram(name: "limit.RequestToBytes", linkageName: "command_line_arguments.RequestToBytes", scope: null, file: !5, line: 92, type: !624, isLocal: false, isDefinition: true, scopeLine: 92, isOptimized: false, unit: !1, retainedNodes: !3)
!729 = !DILocalVariable(name: "req", arg: 1, scope: !728, file: !5, line: 92, type: !87)
!730 = !DILocation(line: 92, column: 21, scope: !728)
!731 = !DILocalVariable(name: "$ret19", scope: !728, file: !5, line: 92, type: !21)
!732 = !DILocation(line: 92, column: 43, scope: !728)
!733 = !DILocation(line: 93, column: 12, scope: !728)
!734 = !DILocation(line: 93, column: 22, scope: !728)
!735 = !DILocation(line: 93, column: 2, scope: !728)
!736 = distinct !DISubprogram(name: "limit.MakeRequestToHeader..func1", scope: null, file: !5, line: 98, type: !544, isLocal: true, isDefinition: true, scopeLine: 98, isOptimized: false, unit: !1, retainedNodes: !3)
!737 = !DILocalVariable(name: "req", arg: 1, scope: !736, file: !5, line: 98, type: !87)
!738 = !DILocation(line: 98, column: 14, scope: !736)
!739 = !DILocation(line: 99, column: 13, scope: !736)
