; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22location\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22netutils\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/vulcan/netutils\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/mailgun/vulcan/netutils\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22request\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/vulcan/request\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/mailgun/vulcan/request\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22http\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22net/http\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22net/http\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./location.go", directory: "/home/wangcong/go_path/src/github.com/vulcand/vulcan/location")
!3 = !{}
!4 = !{!5, !9}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "net_http.DefaultTransport", linkageName: "net_http.DefaultTransport", scope: !1, file: !11, line: 7, type: !12, isLocal: false, isDefinition: true)
!11 = !DIFile(filename: "location.go", directory: ".")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "RoundTripper", file: !11, line: 7, size: 128, align: 8, elements: !13)
!13 = !{!14, !142}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 7, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*Request)struct{*Response,error}}", file: !17, size: 128, align: 8, elements: !18)
!17 = !DIFile(filename: "", directory: "")
!18 = !{!19, !78}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 7, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !22)
!22 = !{!23, !25, !26, !27, !29, !30, !31, !41, !50, !52, !59, !77}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !24, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 160)
!28 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 168)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 176)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !32, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !34)
!34 = !{!35}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!24, !39, !24}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIBasicType(name: "void")
!41 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !42, size: 64, align: 64, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !44)
!44 = !{!45}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !39, !39}
!49 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !51, size: 64, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !53, size: 64, align: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !55)
!55 = !{!56, !57}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !51, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !60, size: 64, align: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !62)
!62 = !{!63, !64, !65}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !53, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !53, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !66, size: 192, align: 64, offset: 128)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !17, size: 192, align: 8, elements: !67)
!67 = !{!68, !75, !76}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !71)
!71 = !{!63, !64, !72, !73, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !17, line: 1, baseType: !58, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !17, line: 1, baseType: !58, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "RoundTrip", file: !17, line: 7, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!82, !39, !153}
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Response,error}", file: !17, size: 192, align: 8, elements: !83)
!83 = !{!84, !422}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 15, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !11, line: 5, size: 1152, align: 8, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93, !107, !143, !145, !149, !150, !151, !152, !421}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !11, line: 5, baseType: !54, size: 128, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "StatusCode", file: !11, line: 5, baseType: !58, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Proto", file: !11, line: 5, baseType: !54, size: 128, align: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMajor", file: !11, line: 5, baseType: !58, size: 64, align: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMinor", file: !11, line: 5, baseType: !58, size: 64, align: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !11, line: 5, baseType: !94, size: 64, align: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !96)
!96 = !{!97, !98, !99, !100, !102, !103, !104, !105, !106}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !58, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 72)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !101, size: 16, align: 16, offset: 80)
!101 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !24, size: 64, align: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !11, line: 5, baseType: !108, size: 128, align: 64, offset: 512)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !11, line: 5, size: 128, align: 8, elements: !109)
!109 = !{!110, !142}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 5, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !17, size: 192, align: 8, elements: !113)
!113 = !{!114, !115, !131}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 5, baseType: !20, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !17, line: 5, baseType: !116, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !39}
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !120)
!120 = !{!121, !130}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !17, size: 128, align: 8, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 1, baseType: !20, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !17, line: 1, baseType: !127, size: 64, align: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!54, !39}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !17, line: 5, baseType: !132, size: 64, align: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!135, !39, !139}
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !17, size: 192, align: 8, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !17, line: 5, baseType: !58, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !17, line: 5, baseType: !119, size: 128, align: 64, offset: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !17, size: 192, align: 8, elements: !140)
!140 = !{!141, !75, !76}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !51, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !11, line: 1, baseType: !39, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !11, line: 5, baseType: !144, size: 64, align: 64, offset: 640)
!144 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !11, line: 5, baseType: !146, size: 192, align: 64, offset: 704)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !17, size: 192, align: 8, elements: !147)
!147 = !{!148, !75, !76}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !53, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 896)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Uncompressed", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 904)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !11, line: 5, baseType: !94, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Request", file: !11, line: 5, baseType: !153, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !11, line: 5, size: 1984, align: 8, elements: !155)
!155 = !{!156, !157, !90, !91, !92, !93, !107, !176, !188, !189, !190, !191, !192, !193, !194, !200, !201, !202, !203, !393, !396, !397}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !11, line: 5, baseType: !54, size: 128, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !11, line: 5, baseType: !158, size: 64, align: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !11, line: 5, size: 1024, align: 8, elements: !160)
!160 = !{!161, !162, !163, !170, !171, !172, !173, !174, !175}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !11, line: 5, baseType: !54, size: 128, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !11, line: 5, baseType: !54, size: 128, align: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !11, line: 5, baseType: !164, size: 64, align: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !11, line: 5, size: 320, align: 8, elements: !166)
!166 = !{!167, !168, !169}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !11, line: 5, baseType: !54, size: 128, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !11, line: 5, baseType: !54, size: 128, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !11, line: 5, baseType: !54, size: 128, align: 64, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !11, line: 5, baseType: !54, size: 128, align: 64, offset: 448)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !11, line: 5, baseType: !54, size: 128, align: 64, offset: 576)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !11, line: 5, baseType: !54, size: 128, align: 64, offset: 768)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !11, line: 5, baseType: !54, size: 128, align: 64, offset: 896)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !11, line: 5, baseType: !177, size: 64, align: 64, offset: 640)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !11, line: 5, size: 64, align: 8, elements: !179)
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !11, line: 5, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!184}
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !17, size: 256, align: 8, elements: !185)
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 5, baseType: !108, size: 128, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 5, baseType: !119, size: 128, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !11, line: 5, baseType: !144, size: 64, align: 64, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !11, line: 5, baseType: !146, size: 192, align: 64, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 960)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !11, line: 5, baseType: !54, size: 128, align: 64, offset: 1024)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Form", file: !11, line: 5, baseType: !94, size: 64, align: 64, offset: 1152)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "PostForm", file: !11, line: 5, baseType: !94, size: 64, align: 64, offset: 1216)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "MultipartForm", file: !11, line: 5, baseType: !195, size: 64, align: 64, offset: 1280)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", file: !11, line: 5, size: 128, align: 8, elements: !197)
!197 = !{!198, !199}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !11, line: 5, baseType: !94, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !11, line: 5, baseType: !94, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !11, line: 5, baseType: !94, size: 64, align: 64, offset: 1344)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !11, line: 5, baseType: !54, size: 128, align: 64, offset: 1408)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "RequestURI", file: !11, line: 5, baseType: !54, size: 128, align: 64, offset: 1536)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !11, line: 5, baseType: !204, size: 64, align: 64, offset: 1664)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionState", file: !11, line: 5, size: 1344, align: 8, elements: !206)
!206 = !{!207, !208, !209, !210, !211, !212, !213, !214, !381, !386, !391, !392}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !11, line: 5, baseType: !101, size: 16, align: 16)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "HandshakeComplete", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 16)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "DidResume", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 24)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuite", file: !11, line: 5, baseType: !101, size: 16, align: 16, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocol", file: !11, line: 5, baseType: !54, size: 128, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocolIsMutual", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !11, line: 5, baseType: !54, size: 128, align: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "PeerCertificates", file: !11, line: 5, baseType: !215, size: 192, align: 64, offset: 384)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !17, size: 192, align: 8, elements: !216)
!216 = !{!217, !75, !76}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !11, line: 5, size: 10624, align: 8, elements: !221)
!221 = !{!222, !223, !224, !225, !226, !227, !228, !230, !232, !236, !237, !250, !276, !277, !311, !312, !314, !324, !325, !330, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !355, !360, !361, !362, !363, !374, !375, !376, !377, !378, !379, !380}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !11, line: 5, baseType: !139, size: 192, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !11, line: 5, baseType: !139, size: 192, align: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !11, line: 5, baseType: !139, size: 192, align: 64, offset: 384)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !11, line: 5, baseType: !139, size: 192, align: 64, offset: 576)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !11, line: 5, baseType: !139, size: 192, align: 64, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !11, line: 5, baseType: !139, size: 192, align: 64, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !11, line: 5, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !11, line: 5, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !11, line: 5, baseType: !233, size: 128, align: 64, offset: 1280)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !11, line: 7, size: 128, align: 8, elements: !234)
!234 = !{!235, !142}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 1, baseType: !20, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !11, line: 5, baseType: !58, size: 64, align: 64, offset: 1408)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !11, line: 5, baseType: !238, size: 64, align: 64, offset: 1472)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !11, line: 5, size: 256, align: 8, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !11, line: 5, baseType: !49, size: 8, align: 8)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !11, line: 5, baseType: !243, size: 192, align: 64, offset: 64)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !11, line: 5, size: 192, align: 8, elements: !244)
!244 = !{!245, !248, !249}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !11, line: 1, baseType: !58, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !11, line: 1, baseType: !58, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !11, line: 5, baseType: !251, size: 1984, align: 64, offset: 1536)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !11, line: 5, size: 1984, align: 8, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !275}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !11, line: 5, baseType: !146, size: 192, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !11, line: 5, baseType: !146, size: 192, align: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !11, line: 5, baseType: !146, size: 192, align: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !11, line: 5, baseType: !146, size: 192, align: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !11, line: 5, baseType: !146, size: 192, align: 64, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !11, line: 5, baseType: !146, size: 192, align: 64, offset: 960)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !11, line: 5, baseType: !146, size: 192, align: 64, offset: 1152)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !11, line: 5, baseType: !54, size: 128, align: 64, offset: 1344)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !11, line: 5, baseType: !54, size: 128, align: 64, offset: 1472)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !11, line: 5, baseType: !263, size: 192, align: 64, offset: 1600)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !17, size: 192, align: 8, elements: !264)
!264 = !{!265, !75, !76}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !11, line: 5, size: 320, align: 8, elements: !268)
!268 = !{!269, !274}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !11, line: 5, baseType: !270, size: 192, align: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !11, line: 5, size: 192, align: 8, elements: !271)
!271 = !{!272, !248, !249}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !11, line: 5, baseType: !233, size: 128, align: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !11, line: 5, baseType: !263, size: 192, align: 64, offset: 1792)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !11, line: 5, baseType: !251, size: 1984, align: 64, offset: 3520)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !11, line: 5, baseType: !278, size: 192, align: 64, offset: 5504)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !11, line: 5, size: 192, align: 8, elements: !279)
!279 = !{!280, !282, !283}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !11, line: 5, baseType: !281, size: 64, align: 64)
!281 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !11, line: 5, baseType: !144, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !11, line: 5, baseType: !284, size: 64, align: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !11, line: 5, size: 704, align: 8, elements: !286)
!286 = !{!287, !288, !297, !308, !309, !310}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !11, line: 5, baseType: !54, size: 128, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !11, line: 5, baseType: !289, size: 192, align: 64, offset: 128)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !17, size: 192, align: 8, elements: !290)
!290 = !{!291, !75, !76}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !11, line: 5, size: 256, align: 8, elements: !294)
!294 = !{!287, !295, !296}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !11, line: 5, baseType: !58, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !11, line: 5, baseType: !298, size: 192, align: 64, offset: 320)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !17, size: 192, align: 8, elements: !299)
!299 = !{!300, !75, !76}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !11, line: 5, size: 128, align: 8, elements: !303)
!303 = !{!304, !305, !306, !307}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !11, line: 5, baseType: !144, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !11, line: 5, baseType: !28, size: 8, align: 8, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 72)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 80)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !11, line: 5, baseType: !144, size: 64, align: 64, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !11, line: 5, baseType: !144, size: 64, align: 64, offset: 576)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !11, line: 5, baseType: !292, size: 64, align: 64, offset: 640)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !11, line: 5, baseType: !278, size: 192, align: 64, offset: 5696)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !11, line: 5, baseType: !313, size: 64, align: 64, offset: 5888)
!313 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !11, line: 5, baseType: !315, size: 192, align: 64, offset: 5952)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !17, size: 192, align: 8, elements: !316)
!316 = !{!317, !75, !76}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !11, line: 5, size: 448, align: 8, elements: !320)
!320 = !{!321, !322, !323}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !11, line: 5, baseType: !270, size: 192, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !11, line: 5, baseType: !139, size: 192, align: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !11, line: 5, baseType: !315, size: 192, align: 64, offset: 6144)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !11, line: 5, baseType: !326, size: 192, align: 64, offset: 6336)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !17, size: 192, align: 8, elements: !327)
!327 = !{!328, !75, !76}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !11, line: 5, baseType: !331, size: 192, align: 64, offset: 6528)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !17, size: 192, align: 8, elements: !332)
!332 = !{!333, !75, !76}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !11, line: 5, baseType: !326, size: 192, align: 64, offset: 6720)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 6912)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 6920)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !11, line: 5, baseType: !58, size: 64, align: 64, offset: 6976)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 7040)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !11, line: 5, baseType: !139, size: 192, align: 64, offset: 7104)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !11, line: 5, baseType: !139, size: 192, align: 64, offset: 7296)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !11, line: 5, baseType: !146, size: 192, align: 64, offset: 7488)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !11, line: 5, baseType: !146, size: 192, align: 64, offset: 7680)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !11, line: 5, baseType: !146, size: 192, align: 64, offset: 7872)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !11, line: 5, baseType: !146, size: 192, align: 64, offset: 8064)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !11, line: 5, baseType: !348, size: 192, align: 64, offset: 8256)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !17, size: 192, align: 8, elements: !349)
!349 = !{!350, !75, !76}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !11, line: 5, size: 192, align: 8, elements: !353)
!353 = !{!354, !248, !249}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !51, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !11, line: 5, baseType: !356, size: 192, align: 64, offset: 8448)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !17, size: 192, align: 8, elements: !357)
!357 = !{!358, !75, !76}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !11, line: 5, baseType: !49, size: 8, align: 8, offset: 8640)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !11, line: 5, baseType: !146, size: 192, align: 64, offset: 8704)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !11, line: 5, baseType: !146, size: 192, align: 64, offset: 8896)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !11, line: 5, baseType: !364, size: 192, align: 64, offset: 9088)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !17, size: 192, align: 8, elements: !365)
!365 = !{!366, !75, !76}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !11, line: 5, size: 384, align: 8, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !11, line: 5, baseType: !352, size: 192, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !11, line: 5, baseType: !373, size: 192, align: 64, offset: 192)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !11, line: 5, size: 192, align: 8, elements: !353)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !11, line: 5, baseType: !364, size: 192, align: 64, offset: 9280)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !11, line: 5, baseType: !146, size: 192, align: 64, offset: 9472)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !11, line: 5, baseType: !146, size: 192, align: 64, offset: 9664)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !11, line: 5, baseType: !146, size: 192, align: 64, offset: 9856)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !11, line: 5, baseType: !146, size: 192, align: 64, offset: 10048)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !11, line: 5, baseType: !146, size: 192, align: 64, offset: 10240)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !11, line: 5, baseType: !326, size: 192, align: 64, offset: 10432)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "VerifiedChains", file: !11, line: 5, baseType: !382, size: 192, align: 64, offset: 576)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !17, size: 192, align: 8, elements: !383)
!383 = !{!384, !75, !76}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !11, line: 5, baseType: !387, size: 192, align: 64, offset: 768)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !17, size: 192, align: 8, elements: !388)
!388 = !{!389, !75, !76}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPResponse", file: !11, line: 5, baseType: !139, size: 192, align: 64, offset: 960)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "TLSUnique", file: !11, line: 5, baseType: !139, size: 192, align: 64, offset: 1152)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", file: !11, line: 5, baseType: !394, size: 64, align: 64, offset: 1728)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !7, line: 1, align: 8, elements: !3)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !11, line: 5, baseType: !39, size: 64, align: 64, offset: 1792)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !11, line: 5, baseType: !398, size: 128, align: 64, offset: 1856)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !11, line: 5, size: 128, align: 8, elements: !399)
!399 = !{!400, !142}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 5, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,PrivateKey)PrivateKey}", file: !17, size: 320, align: 8, elements: !403)
!403 = !{!114, !404, !412, !416, !417}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !17, line: 5, baseType: !405, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!408, !39}
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !17, size: 256, align: 8, elements: !409)
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !17, line: 5, baseType: !278, size: 192, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !17, line: 5, baseType: !49, size: 8, align: 8, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !17, line: 5, baseType: !413, size: 64, align: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!394, !39}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !17, line: 5, baseType: !116, size: 64, align: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !17, line: 5, baseType: !418, size: 64, align: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!233, !39, !233}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !11, line: 5, baseType: !204, size: 64, align: 64, offset: 1088)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 15, baseType: !119, size: 128, align: 64, offset: 64)
!423 = distinct !DISubprogram(name: "location.command_line_arguments.Loc..hash", linkageName: "command_line_arguments.command_line_arguments.Loc..hash", scope: null, file: !7, line: 1, type: !37, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!424 = !DILocalVariable(name: "key", arg: 1, scope: !423, file: !7, line: 1, type: !39)
!425 = !DILocation(line: 1, column: 1, scope: !423)
!426 = !DILocalVariable(name: "seed", arg: 2, scope: !423, file: !7, line: 1, type: !24)
!427 = !DILocalVariable(name: "$ret6", scope: !423, file: !7, line: 1, type: !24)
!428 = distinct !DISubprogram(name: "location.command_line_arguments.Loc..eq", linkageName: "command_line_arguments.command_line_arguments.Loc..eq", scope: null, file: !7, line: 1, type: !47, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!429 = !DILocalVariable(name: "key1", arg: 1, scope: !428, file: !7, line: 1, type: !39)
!430 = !DILocation(line: 1, column: 1, scope: !428)
!431 = !DILocalVariable(name: "key2", arg: 2, scope: !428, file: !7, line: 1, type: !39)
!432 = !DILocalVariable(name: "$ret7", scope: !428, file: !7, line: 1, type: !49)
!433 = distinct !DISubprogram(name: "location.GetId..1command_line_arguments.Loc", linkageName: "command_line_arguments.Loc.GetId", scope: null, file: !11, line: 28, type: !434, isLocal: false, isDefinition: true, scopeLine: 28, isOptimized: false, unit: !1, retainedNodes: !3)
!434 = !DISubroutineType(types: !435)
!435 = !{!54, !436, !436}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "Loc", file: !11, line: 19, size: 256, align: 8, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !11, line: 20, baseType: !54, size: 128, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !11, line: 21, baseType: !54, size: 128, align: 64, offset: 128)
!441 = !DILocalVariable(name: "l", arg: 1, scope: !433, file: !11, line: 28, type: !436)
!442 = !DILocation(line: 28, column: 1, scope: !433)
!443 = !DILocation(line: 29, column: 10, scope: !433)
!444 = !DILocation(line: 29, column: 2, scope: !433)
!445 = !DILocalVariable(name: "$ret2", scope: !433, file: !11, line: 28, type: !54)
!446 = !DILocation(line: 28, column: 23, scope: !433)
!447 = distinct !DISubprogram(name: "location.RoundTrip..1command_line_arguments.Loc", linkageName: "command_line_arguments.Loc.RoundTrip", scope: null, file: !11, line: 24, type: !448, isLocal: false, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !1, retainedNodes: !3)
!448 = !DISubroutineType(types: !449)
!449 = !{!82, !436, !436, !450}
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !11, line: 6, size: 128, align: 8, elements: !451)
!451 = !{!452, !142}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 6, baseType: !453, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Attempt)void,*func(*void,string)void,*func(*void)struct{*Attempt,int,int},*func(*void)MultiReader,*func(*void)*Request,*func(*void)int64,*func(*void)Attempt,*func(*void,string)struct{PrivateKey,bool},*func(*void,MultiReader)void,*func(*void,*Request)void,*func(*void,string,PrivateKey)void,*func(*void)string}", file: !17, size: 832, align: 8, elements: !455)
!455 = !{!456, !457, !493, !497, !505, !541, !545, !549, !553, !561, !565, !569, !573}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 6, baseType: !20, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "AddAttempt", file: !17, line: 6, baseType: !458, size: 64, align: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!40, !39, !461}
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "Attempt", file: !11, line: 6, size: 128, align: 8, elements: !462)
!462 = !{!463, !142}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 6, baseType: !464, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Duration,*func(*void)Endpoint,*func(*void)error,*func(*void)*Response}", file: !17, size: 320, align: 8, elements: !466)
!466 = !{!456, !467, !472, !488, !489}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "GetDuration", file: !17, line: 6, baseType: !468, size: 64, align: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!471, !39}
!471 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "GetEndpoint", file: !17, line: 6, baseType: !473, size: 64, align: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!476, !39}
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "Endpoint", file: !11, line: 6, size: 128, align: 8, elements: !477)
!477 = !{!478, !142}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 6, baseType: !479, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)*URL,*func(*void)string}", file: !17, size: 256, align: 8, elements: !481)
!481 = !{!456, !482, !483, !487}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "GetId", file: !17, line: 6, baseType: !127, size: 64, align: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "GetUrl", file: !17, line: 6, baseType: !484, size: 64, align: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!158, !39}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !17, line: 6, baseType: !127, size: 64, align: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "GetError", file: !17, line: 6, baseType: !116, size: 64, align: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "GetResponse", file: !17, line: 6, baseType: !490, size: 64, align: 64, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!85, !39}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteUserData", file: !17, line: 6, baseType: !494, size: 64, align: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!40, !39, !54}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "GetAttempts", file: !17, line: 6, baseType: !498, size: 64, align: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!501, !39}
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Attempt,int,int}", file: !17, size: 192, align: 8, elements: !502)
!502 = !{!503, !75, !76}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !17, line: 6, baseType: !506, size: 64, align: 64, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!509, !39}
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiReader", file: !11, line: 5, size: 128, align: 8, elements: !510)
!510 = !{!511, !142}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 5, baseType: !512, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,int64,int)struct{int64,error},*func(*void)struct{int64,error},*func(*void,Writer)struct{int64,error}}", file: !17, size: 384, align: 8, elements: !514)
!514 = !{!114, !115, !131, !515, !523, !527}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Seek", file: !17, line: 5, baseType: !516, size: 64, align: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!519, !39, !144, !58}
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !17, size: 192, align: 8, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 5, baseType: !144, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 5, baseType: !119, size: 128, align: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "TotalSize", file: !17, line: 5, baseType: !524, size: 64, align: 64, offset: 256)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!519, !39}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "WriteTo", file: !17, line: 5, baseType: !528, size: 64, align: 64, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!531, !39, !534}
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !17, size: 192, align: 8, elements: !532)
!532 = !{!533, !138}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !17, line: 5, baseType: !144, size: 64, align: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !11, line: 5, size: 128, align: 8, elements: !535)
!535 = !{!536, !142}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 5, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !17, size: 128, align: 8, elements: !539)
!539 = !{!114, !540}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !17, line: 5, baseType: !132, size: 64, align: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "GetHttpRequest", file: !17, line: 6, baseType: !542, size: 64, align: 64, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!153, !39}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "GetId", file: !17, line: 6, baseType: !546, size: 64, align: 64, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!144, !39}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "GetLastAttempt", file: !17, line: 6, baseType: !550, size: 64, align: 64, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!461, !39}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserData", file: !17, line: 6, baseType: !554, size: 64, align: 64, offset: 512)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!557, !39, !54}
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{PrivateKey,bool}", file: !17, size: 192, align: 8, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 6, baseType: !233, size: 128, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 6, baseType: !49, size: 8, align: 8, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "SetBody", file: !17, line: 6, baseType: !562, size: 64, align: 64, offset: 576)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!40, !39, !509}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "SetHttpRequest", file: !17, line: 6, baseType: !566, size: 64, align: 64, offset: 640)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!40, !39, !153}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "SetUserData", file: !17, line: 6, baseType: !570, size: 64, align: 64, offset: 704)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!40, !39, !54, !233}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !17, line: 6, baseType: !127, size: 64, align: 64, offset: 768)
!574 = !DILocalVariable(name: "r.0", arg: 1, scope: !447, file: !11, line: 24, type: !436)
!575 = !DILocation(line: 24, column: 1, scope: !447)
!576 = !DILocalVariable(name: "p.0", arg: 2, scope: !447, file: !11, line: 24, type: !450)
!577 = !DILocation(line: 24, column: 23, scope: !447)
!578 = !DILocalVariable(name: "$ret0", scope: !447, file: !11, line: 24, type: !85)
!579 = !DILocation(line: 24, column: 41, scope: !447)
!580 = !DILocation(line: 25, column: 2, scope: !447)
!581 = distinct !DISubprogram(name: "location.command_line_arguments.ConstHttpLocation..hash", linkageName: "command_line_arguments.command_line_arguments.ConstHttpLocation..hash", scope: null, file: !7, line: 1, type: !37, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!582 = !DILocalVariable(name: "key", arg: 1, scope: !581, file: !7, line: 1, type: !39)
!583 = !DILocation(line: 1, column: 1, scope: !581)
!584 = !DILocalVariable(name: "seed", arg: 2, scope: !581, file: !7, line: 1, type: !24)
!585 = !DILocalVariable(name: "$ret8", scope: !581, file: !7, line: 1, type: !24)
!586 = distinct !DISubprogram(name: "location.command_line_arguments.ConstHttpLocation..eq", linkageName: "command_line_arguments.command_line_arguments.ConstHttpLocation..eq", scope: null, file: !7, line: 1, type: !47, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!587 = !DILocalVariable(name: "key1", arg: 1, scope: !586, file: !7, line: 1, type: !39)
!588 = !DILocation(line: 1, column: 1, scope: !586)
!589 = !DILocalVariable(name: "key2", arg: 2, scope: !586, file: !7, line: 1, type: !39)
!590 = !DILocalVariable(name: "$ret9", scope: !586, file: !7, line: 1, type: !49)
!591 = distinct !DISubprogram(name: "location.GetId..1command_line_arguments.ConstHttpLocation", linkageName: "command_line_arguments.ConstHttpLocation.GetId", scope: null, file: !11, line: 44, type: !592, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!592 = !DISubroutineType(types: !593)
!593 = !{!54, !594, !594}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstHttpLocation", file: !11, line: 34, size: 128, align: 8, elements: !596)
!596 = !{!597}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Url", file: !11, line: 35, baseType: !54, size: 128, align: 64)
!598 = !DILocalVariable(name: "l", arg: 1, scope: !591, file: !11, line: 44, type: !594)
!599 = !DILocation(line: 44, column: 1, scope: !591)
!600 = !DILocation(line: 45, column: 10, scope: !591)
!601 = !DILocation(line: 45, column: 2, scope: !591)
!602 = !DILocalVariable(name: "$ret5", scope: !591, file: !11, line: 44, type: !54)
!603 = !DILocation(line: 44, column: 37, scope: !591)
!604 = distinct !DISubprogram(name: "location.RoundTrip..1command_line_arguments.ConstHttpLocation", linkageName: "command_line_arguments.ConstHttpLocation.RoundTrip", scope: null, file: !11, line: 38, type: !605, isLocal: false, isDefinition: true, scopeLine: 38, isOptimized: false, unit: !1, retainedNodes: !3)
!605 = !DISubroutineType(types: !606)
!606 = !{!82, !594, !594, !450}
!607 = !DILocalVariable(name: "l", arg: 1, scope: !604, file: !11, line: 38, type: !594)
!608 = !DILocation(line: 38, column: 1, scope: !604)
!609 = !DILocalVariable(name: "r", arg: 2, scope: !604, file: !11, line: 38, type: !450)
!610 = !DILocation(line: 38, column: 39, scope: !604)
!611 = !DILocalVariable(name: "$ret3", scope: !604, file: !11, line: 38, type: !85)
!612 = !DILocation(line: 38, column: 59, scope: !604)
!613 = !DILocation(line: 39, column: 10, scope: !614)
!614 = distinct !DILexicalBlock(scope: !604, file: !11, line: 38, column: 1)
!615 = !DILocalVariable(name: "req", scope: !614, file: !11, line: 39, type: !153)
