; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22middleware\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22request\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/vulcan/request\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/mailgun/vulcan/request\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22http\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22net/http\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22net/http\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22sort\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22sort\22"
module asm "\09.ascii \22 \5C\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./chain.go", directory: "/home/wangcong/go_path/src/github.com/vulcand/vulcan/middleware")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "middleware.Add..1command_line_arguments.MiddlewareChain", linkageName: "command_line_arguments.MiddlewareChain.Add", scope: null, file: !10, line: 22, type: !11, isLocal: false, isDefinition: true, scopeLine: 22, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DIFile(filename: "chain.go", directory: ".")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !84, !84, !55, !59, !141}
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !14)
!14 = !{!15, !83}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !18, size: 128, align: 8, elements: !19)
!18 = !DIFile(filename: "", directory: "")
!19 = !{!20, !79}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 1, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !23)
!23 = !{!24, !26, !27, !28, !30, !31, !32, !42, !51, !53, !60, !78}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 160)
!29 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 168)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 176)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !33, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !35)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!25, !40, !25}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "void")
!42 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !43, size: 64, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !45)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !40, !40}
!50 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !52, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !54, size: 64, align: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !52, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !61, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !63)
!63 = !{!64, !65, !66}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !54, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !54, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !67, size: 192, align: 64, offset: 128)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !18, size: 192, align: 8, elements: !68)
!68 = !{!69, !76, !77}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !72)
!72 = !{!64, !65, !73, !74, !75}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !18, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !18, line: 1, baseType: !59, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !18, line: 1, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!55, !40}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "MiddlewareChain", file: !10, line: 12, size: 64, align: 8, elements: !86)
!86 = !{!87}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "chain", file: !10, line: 13, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.chain", file: !10, line: 122, size: 384, align: 8, elements: !90)
!90 = !{!91, !105, !121, !135}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !10, line: 123, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !10, line: 5, size: 192, align: 8, elements: !94)
!94 = !{!95, !101, !102, !103, !104}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !10, line: 5, baseType: !96, size: 64, align: 32)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !10, line: 5, size: 64, align: 8, elements: !97)
!97 = !{!98, !100}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !10, line: 5, baseType: !99, size: 32, align: 32)
!99 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !10, line: 5, baseType: !8, size: 32, align: 32, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !10, line: 5, baseType: !8, size: 32, align: 32, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !10, line: 5, baseType: !8, size: 32, align: 32, offset: 96)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !10, line: 5, baseType: !99, size: 32, align: 32, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !10, line: 5, baseType: !99, size: 32, align: 32, offset: 160)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", file: !10, line: 124, baseType: !106, size: 192, align: 64, offset: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**.command-line-arguments.callback,int,int}", file: !18, size: 192, align: 8, elements: !107)
!107 = !{!108, !76, !77}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.callback", file: !10, line: 129, size: 320, align: 8, elements: !112)
!112 = !{!113, !114, !115}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !10, line: 130, baseType: !55, size: 128, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "priority", file: !10, line: 131, baseType: !59, size: 64, align: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "cb", file: !10, line: 132, baseType: !116, size: 128, align: 64, offset: 192)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !117, line: 6, size: 128, align: 8, elements: !118)
!117 = !DIFile(filename: "middleware.go", directory: ".")
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !117, line: 1, baseType: !21, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !117, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "indexes", file: !10, line: 125, baseType: !122, size: 64, align: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !124)
!124 = !{!125, !126, !127, !128, !130, !131, !132, !133, !134}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !59, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 72)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !129, size: 16, align: 16, offset: 80)
!129 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !25, size: 64, align: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "iter", file: !10, line: 126, baseType: !136, size: 64, align: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.iter", file: !10, line: 250, size: 256, align: 8, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !10, line: 251, baseType: !59, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", file: !10, line: 252, baseType: !106, size: 192, align: 64, offset: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "Middleware", file: !117, line: 10, size: 128, align: 8, elements: !142)
!142 = !{!143, !120}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !117, line: 10, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Request)struct{*Response,error},*func(*void,Request,Attempt)void}", file: !18, size: 192, align: 8, elements: !146)
!146 = !{!147, !148, !590}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 10, baseType: !21, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessRequest", file: !18, line: 10, baseType: !149, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!152, !40, !465}
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Response,error}", file: !18, size: 192, align: 8, elements: !153)
!153 = !{!154, !464}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 33, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !10, line: 5, size: 1152, align: 8, elements: !157)
!157 = !{!158, !159, !160, !161, !162, !163, !164, !188, !190, !194, !195, !196, !197, !463}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !10, line: 5, baseType: !55, size: 128, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "StatusCode", file: !10, line: 5, baseType: !59, size: 64, align: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Proto", file: !10, line: 5, baseType: !55, size: 128, align: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMajor", file: !10, line: 5, baseType: !59, size: 64, align: 64, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMinor", file: !10, line: 5, baseType: !59, size: 64, align: 64, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !10, line: 5, baseType: !122, size: 64, align: 64, offset: 448)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !10, line: 5, baseType: !165, size: 128, align: 64, offset: 512)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !10, line: 5, size: 128, align: 8, elements: !166)
!166 = !{!167, !187}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 5, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !18, size: 192, align: 8, elements: !170)
!170 = !{!171, !172, !176}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 5, baseType: !21, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !18, line: 5, baseType: !173, size: 64, align: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!13, !40}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !18, line: 5, baseType: !177, size: 64, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!180, !40, !184}
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !18, size: 192, align: 8, elements: !181)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !18, line: 4, baseType: !59, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !18, line: 4, baseType: !13, size: 128, align: 64, offset: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !18, size: 192, align: 8, elements: !185)
!185 = !{!186, !76, !77}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !52, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !10, line: 5, baseType: !189, size: 64, align: 64, offset: 640)
!189 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !10, line: 5, baseType: !191, size: 192, align: 64, offset: 704)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !18, size: 192, align: 8, elements: !192)
!192 = !{!193, !76, !77}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !54, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !10, line: 5, baseType: !50, size: 8, align: 8, offset: 896)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Uncompressed", file: !10, line: 5, baseType: !50, size: 8, align: 8, offset: 904)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !10, line: 5, baseType: !122, size: 64, align: 64, offset: 960)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Request", file: !10, line: 5, baseType: !198, size: 64, align: 64, offset: 1024)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !10, line: 5, size: 1984, align: 8, elements: !200)
!200 = !{!201, !202, !160, !161, !162, !163, !164, !221, !233, !234, !235, !236, !237, !238, !239, !245, !246, !247, !248, !435, !438, !439}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !10, line: 5, baseType: !55, size: 128, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !10, line: 5, baseType: !203, size: 64, align: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !10, line: 5, size: 1024, align: 8, elements: !205)
!205 = !{!206, !207, !208, !215, !216, !217, !218, !219, !220}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !10, line: 5, baseType: !55, size: 128, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !10, line: 5, baseType: !55, size: 128, align: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !10, line: 5, baseType: !209, size: 64, align: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !10, line: 5, size: 320, align: 8, elements: !211)
!211 = !{!212, !213, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !10, line: 5, baseType: !55, size: 128, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !10, line: 5, baseType: !55, size: 128, align: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !10, line: 5, baseType: !50, size: 8, align: 8, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !10, line: 5, baseType: !55, size: 128, align: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !10, line: 5, baseType: !55, size: 128, align: 64, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !10, line: 5, baseType: !55, size: 128, align: 64, offset: 576)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !10, line: 5, baseType: !50, size: 8, align: 8, offset: 704)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !10, line: 5, baseType: !55, size: 128, align: 64, offset: 768)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !10, line: 5, baseType: !55, size: 128, align: 64, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !10, line: 5, baseType: !222, size: 64, align: 64, offset: 640)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 5, size: 64, align: 8, elements: !224)
!224 = !{!225}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 5, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!229}
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !18, size: 256, align: 8, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 5, baseType: !165, size: 128, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 5, baseType: !13, size: 128, align: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !10, line: 5, baseType: !189, size: 64, align: 64, offset: 704)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !10, line: 5, baseType: !191, size: 192, align: 64, offset: 768)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !10, line: 5, baseType: !50, size: 8, align: 8, offset: 960)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !10, line: 5, baseType: !55, size: 128, align: 64, offset: 1024)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Form", file: !10, line: 5, baseType: !122, size: 64, align: 64, offset: 1152)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "PostForm", file: !10, line: 5, baseType: !122, size: 64, align: 64, offset: 1216)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "MultipartForm", file: !10, line: 5, baseType: !240, size: 64, align: 64, offset: 1280)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", file: !10, line: 5, size: 128, align: 8, elements: !242)
!242 = !{!243, !244}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !10, line: 5, baseType: !122, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !10, line: 5, baseType: !122, size: 64, align: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !10, line: 5, baseType: !122, size: 64, align: 64, offset: 1344)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !10, line: 5, baseType: !55, size: 128, align: 64, offset: 1408)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "RequestURI", file: !10, line: 5, baseType: !55, size: 128, align: 64, offset: 1536)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !10, line: 5, baseType: !249, size: 64, align: 64, offset: 1664)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionState", file: !10, line: 5, size: 1344, align: 8, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !423, !428, !433, !434}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !10, line: 5, baseType: !129, size: 16, align: 16)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "HandshakeComplete", file: !10, line: 5, baseType: !50, size: 8, align: 8, offset: 16)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "DidResume", file: !10, line: 5, baseType: !50, size: 8, align: 8, offset: 24)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuite", file: !10, line: 5, baseType: !129, size: 16, align: 16, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocol", file: !10, line: 5, baseType: !55, size: 128, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocolIsMutual", file: !10, line: 5, baseType: !50, size: 8, align: 8, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !10, line: 5, baseType: !55, size: 128, align: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "PeerCertificates", file: !10, line: 5, baseType: !260, size: 192, align: 64, offset: 384)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !18, size: 192, align: 8, elements: !261)
!261 = !{!262, !76, !77}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !10, line: 5, size: 10624, align: 8, elements: !266)
!266 = !{!267, !268, !269, !270, !271, !272, !273, !275, !277, !278, !279, !292, !318, !319, !353, !354, !356, !366, !367, !372, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !397, !402, !403, !404, !405, !416, !417, !418, !419, !420, !421, !422}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !10, line: 5, baseType: !184, size: 192, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !10, line: 5, baseType: !184, size: 192, align: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !10, line: 5, baseType: !184, size: 192, align: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !10, line: 5, baseType: !184, size: 192, align: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !10, line: 5, baseType: !184, size: 192, align: 64, offset: 768)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !10, line: 5, baseType: !184, size: 192, align: 64, offset: 960)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !10, line: 5, baseType: !274, size: 64, align: 64, offset: 1152)
!274 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !10, line: 5, baseType: !276, size: 64, align: 64, offset: 1216)
!276 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !10, line: 5, baseType: !116, size: 128, align: 64, offset: 1280)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !10, line: 5, baseType: !59, size: 64, align: 64, offset: 1408)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !10, line: 5, baseType: !280, size: 64, align: 64, offset: 1472)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !10, line: 5, size: 256, align: 8, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !10, line: 5, baseType: !50, size: 8, align: 8)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !10, line: 5, baseType: !285, size: 192, align: 64, offset: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !10, line: 5, size: 192, align: 8, elements: !286)
!286 = !{!287, !290, !291}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !59, size: 64, align: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !10, line: 5, baseType: !293, size: 1984, align: 64, offset: 1536)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !10, line: 5, size: 1984, align: 8, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !317}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !10, line: 5, baseType: !191, size: 192, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !10, line: 5, baseType: !191, size: 192, align: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !10, line: 5, baseType: !191, size: 192, align: 64, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !10, line: 5, baseType: !191, size: 192, align: 64, offset: 576)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !10, line: 5, baseType: !191, size: 192, align: 64, offset: 768)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !10, line: 5, baseType: !191, size: 192, align: 64, offset: 960)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !10, line: 5, baseType: !191, size: 192, align: 64, offset: 1152)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !10, line: 5, baseType: !55, size: 128, align: 64, offset: 1344)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !10, line: 5, baseType: !55, size: 128, align: 64, offset: 1472)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !10, line: 5, baseType: !305, size: 192, align: 64, offset: 1600)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !18, size: 192, align: 8, elements: !306)
!306 = !{!307, !76, !77}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !10, line: 5, size: 320, align: 8, elements: !310)
!310 = !{!311, !316}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !10, line: 5, baseType: !312, size: 192, align: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !10, line: 5, size: 192, align: 8, elements: !313)
!313 = !{!314, !290, !291}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !10, line: 5, baseType: !116, size: 128, align: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !10, line: 5, baseType: !305, size: 192, align: 64, offset: 1792)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !10, line: 5, baseType: !293, size: 1984, align: 64, offset: 3520)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !10, line: 5, baseType: !320, size: 192, align: 64, offset: 5504)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !10, line: 5, size: 192, align: 8, elements: !321)
!321 = !{!322, !324, !325}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !10, line: 5, baseType: !323, size: 64, align: 64)
!323 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !10, line: 5, baseType: !189, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !10, line: 5, baseType: !326, size: 64, align: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !10, line: 5, size: 704, align: 8, elements: !328)
!328 = !{!329, !330, !339, !350, !351, !352}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !10, line: 5, baseType: !55, size: 128, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !10, line: 5, baseType: !331, size: 192, align: 64, offset: 128)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !18, size: 192, align: 8, elements: !332)
!332 = !{!333, !76, !77}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !10, line: 5, size: 256, align: 8, elements: !336)
!336 = !{!329, !337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !10, line: 5, baseType: !59, size: 64, align: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !10, line: 5, baseType: !50, size: 8, align: 8, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !10, line: 5, baseType: !340, size: 192, align: 64, offset: 320)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !18, size: 192, align: 8, elements: !341)
!341 = !{!342, !76, !77}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !10, line: 5, size: 128, align: 8, elements: !345)
!345 = !{!346, !347, !348, !349}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !10, line: 5, baseType: !189, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !10, line: 5, baseType: !29, size: 8, align: 8, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !10, line: 5, baseType: !50, size: 8, align: 8, offset: 72)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !10, line: 5, baseType: !50, size: 8, align: 8, offset: 80)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !10, line: 5, baseType: !189, size: 64, align: 64, offset: 512)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !10, line: 5, baseType: !189, size: 64, align: 64, offset: 576)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !10, line: 5, baseType: !334, size: 64, align: 64, offset: 640)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !10, line: 5, baseType: !320, size: 192, align: 64, offset: 5696)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !10, line: 5, baseType: !355, size: 64, align: 64, offset: 5888)
!355 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !10, line: 5, baseType: !357, size: 192, align: 64, offset: 5952)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !18, size: 192, align: 8, elements: !358)
!358 = !{!359, !76, !77}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !10, line: 5, size: 448, align: 8, elements: !362)
!362 = !{!363, !364, !365}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !10, line: 5, baseType: !312, size: 192, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !10, line: 5, baseType: !50, size: 8, align: 8, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !10, line: 5, baseType: !184, size: 192, align: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !10, line: 5, baseType: !357, size: 192, align: 64, offset: 6144)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !10, line: 5, baseType: !368, size: 192, align: 64, offset: 6336)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !18, size: 192, align: 8, elements: !369)
!369 = !{!370, !76, !77}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !10, line: 5, baseType: !373, size: 192, align: 64, offset: 6528)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !18, size: 192, align: 8, elements: !374)
!374 = !{!375, !76, !77}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !10, line: 5, baseType: !368, size: 192, align: 64, offset: 6720)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !10, line: 5, baseType: !50, size: 8, align: 8, offset: 6912)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !10, line: 5, baseType: !50, size: 8, align: 8, offset: 6920)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !10, line: 5, baseType: !59, size: 64, align: 64, offset: 6976)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !10, line: 5, baseType: !50, size: 8, align: 8, offset: 7040)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !10, line: 5, baseType: !184, size: 192, align: 64, offset: 7104)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !10, line: 5, baseType: !184, size: 192, align: 64, offset: 7296)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !10, line: 5, baseType: !191, size: 192, align: 64, offset: 7488)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !10, line: 5, baseType: !191, size: 192, align: 64, offset: 7680)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !10, line: 5, baseType: !191, size: 192, align: 64, offset: 7872)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !10, line: 5, baseType: !191, size: 192, align: 64, offset: 8064)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !10, line: 5, baseType: !390, size: 192, align: 64, offset: 8256)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !18, size: 192, align: 8, elements: !391)
!391 = !{!392, !76, !77}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !10, line: 5, size: 192, align: 8, elements: !395)
!395 = !{!396, !290, !291}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !52, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !10, line: 5, baseType: !398, size: 192, align: 64, offset: 8448)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !18, size: 192, align: 8, elements: !399)
!399 = !{!400, !76, !77}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !10, line: 5, baseType: !50, size: 8, align: 8, offset: 8640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !10, line: 5, baseType: !191, size: 192, align: 64, offset: 8704)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !10, line: 5, baseType: !191, size: 192, align: 64, offset: 8896)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !10, line: 5, baseType: !406, size: 192, align: 64, offset: 9088)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !18, size: 192, align: 8, elements: !407)
!407 = !{!408, !76, !77}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !10, line: 5, size: 384, align: 8, elements: !412)
!412 = !{!413, !414}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !10, line: 5, baseType: !394, size: 192, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !10, line: 5, baseType: !415, size: 192, align: 64, offset: 192)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !10, line: 5, size: 192, align: 8, elements: !395)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !10, line: 5, baseType: !406, size: 192, align: 64, offset: 9280)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !10, line: 5, baseType: !191, size: 192, align: 64, offset: 9472)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !10, line: 5, baseType: !191, size: 192, align: 64, offset: 9664)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !10, line: 5, baseType: !191, size: 192, align: 64, offset: 9856)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !10, line: 5, baseType: !191, size: 192, align: 64, offset: 10048)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !10, line: 5, baseType: !191, size: 192, align: 64, offset: 10240)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !10, line: 5, baseType: !368, size: 192, align: 64, offset: 10432)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "VerifiedChains", file: !10, line: 5, baseType: !424, size: 192, align: 64, offset: 576)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !18, size: 192, align: 8, elements: !425)
!425 = !{!426, !76, !77}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !10, line: 5, baseType: !429, size: 192, align: 64, offset: 768)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !18, size: 192, align: 8, elements: !430)
!430 = !{!431, !76, !77}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPResponse", file: !10, line: 5, baseType: !184, size: 192, align: 64, offset: 960)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "TLSUnique", file: !10, line: 5, baseType: !184, size: 192, align: 64, offset: 1152)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", file: !10, line: 5, baseType: !436, size: 64, align: 64, offset: 1728)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !7, line: 1, align: 8, elements: !3)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !10, line: 5, baseType: !40, size: 64, align: 64, offset: 1792)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !10, line: 5, baseType: !440, size: 128, align: 64, offset: 1856)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !10, line: 5, size: 128, align: 8, elements: !441)
!441 = !{!442, !187}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 5, baseType: !443, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,PrivateKey)PrivateKey}", file: !18, size: 320, align: 8, elements: !445)
!445 = !{!171, !446, !454, !458, !459}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !18, line: 5, baseType: !447, size: 64, align: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!450, !40}
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !18, size: 256, align: 8, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !18, line: 5, baseType: !320, size: 192, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !18, line: 5, baseType: !50, size: 8, align: 8, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !18, line: 5, baseType: !455, size: 64, align: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!436, !40}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !18, line: 5, baseType: !173, size: 64, align: 64, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !18, line: 5, baseType: !460, size: 64, align: 64, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!116, !40, !116}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !10, line: 5, baseType: !249, size: 64, align: 64, offset: 1088)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 33, baseType: !13, size: 128, align: 64, offset: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !10, line: 5, size: 128, align: 8, elements: !466)
!466 = !{!467, !187}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 5, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Attempt)void,*func(*void,string)void,*func(*void)struct{*Attempt,int,int},*func(*void)MultiReader,*func(*void)*Request,*func(*void)int64,*func(*void)Attempt,*func(*void,string)struct{PrivateKey,bool},*func(*void,MultiReader)void,*func(*void,*Request)void,*func(*void,string,PrivateKey)void,*func(*void)string}", file: !18, size: 832, align: 8, elements: !470)
!470 = !{!171, !471, !507, !511, !519, !557, !561, !565, !569, !577, !581, !585, !589}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "AddAttempt", file: !18, line: 5, baseType: !472, size: 64, align: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!41, !40, !475}
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "Attempt", file: !10, line: 5, size: 128, align: 8, elements: !476)
!476 = !{!477, !187}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 5, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Duration,*func(*void)Endpoint,*func(*void)error,*func(*void)*Response}", file: !18, size: 320, align: 8, elements: !480)
!480 = !{!171, !481, !486, !502, !503}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "GetDuration", file: !18, line: 5, baseType: !482, size: 64, align: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!485, !40}
!485 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "GetEndpoint", file: !18, line: 5, baseType: !487, size: 64, align: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!490, !40}
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "Endpoint", file: !10, line: 5, size: 128, align: 8, elements: !491)
!491 = !{!492, !187}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 5, baseType: !493, size: 64, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)*URL,*func(*void)string}", file: !18, size: 256, align: 8, elements: !495)
!495 = !{!171, !496, !497, !501}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "GetId", file: !18, line: 5, baseType: !80, size: 64, align: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "GetUrl", file: !18, line: 5, baseType: !498, size: 64, align: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!203, !40}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !18, line: 5, baseType: !80, size: 64, align: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "GetError", file: !18, line: 5, baseType: !173, size: 64, align: 64, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "GetResponse", file: !18, line: 5, baseType: !504, size: 64, align: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!155, !40}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteUserData", file: !18, line: 5, baseType: !508, size: 64, align: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!41, !40, !55}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "GetAttempts", file: !18, line: 5, baseType: !512, size: 64, align: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!515, !40}
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Attempt,int,int}", file: !18, size: 192, align: 8, elements: !516)
!516 = !{!517, !76, !77}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !18, line: 5, baseType: !520, size: 64, align: 64, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!523, !40}
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiReader", file: !10, line: 5, size: 128, align: 8, elements: !524)
!524 = !{!525, !187}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 5, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,int64,int)struct{int64,error},*func(*void)struct{int64,error},*func(*void,Writer)struct{int64,error}}", file: !18, size: 384, align: 8, elements: !528)
!528 = !{!171, !172, !176, !529, !537, !541}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Seek", file: !18, line: 5, baseType: !530, size: 64, align: 64, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!533, !40, !189, !59}
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !18, size: 192, align: 8, elements: !534)
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 5, baseType: !189, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 5, baseType: !13, size: 128, align: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "TotalSize", file: !18, line: 5, baseType: !538, size: 64, align: 64, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!533, !40}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "WriteTo", file: !18, line: 5, baseType: !542, size: 64, align: 64, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!545, !40, !549}
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !18, size: 192, align: 8, elements: !546)
!546 = !{!547, !548}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !18, line: 5, baseType: !189, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !18, line: 5, baseType: !13, size: 128, align: 64, offset: 64)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !10, line: 4, size: 128, align: 8, elements: !550)
!550 = !{!551, !187}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !18, size: 128, align: 8, elements: !554)
!554 = !{!555, !556}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 4, baseType: !21, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !18, line: 4, baseType: !177, size: 64, align: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "GetHttpRequest", file: !18, line: 5, baseType: !558, size: 64, align: 64, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!198, !40}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "GetId", file: !18, line: 5, baseType: !562, size: 64, align: 64, offset: 384)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!189, !40}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "GetLastAttempt", file: !18, line: 5, baseType: !566, size: 64, align: 64, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!475, !40}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserData", file: !18, line: 5, baseType: !570, size: 64, align: 64, offset: 512)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!573, !40, !55}
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{PrivateKey,bool}", file: !18, size: 192, align: 8, elements: !574)
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 5, baseType: !116, size: 128, align: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 5, baseType: !50, size: 8, align: 8, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "SetBody", file: !18, line: 5, baseType: !578, size: 64, align: 64, offset: 576)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!41, !40, !523}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "SetHttpRequest", file: !18, line: 5, baseType: !582, size: 64, align: 64, offset: 640)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!41, !40, !198}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "SetUserData", file: !18, line: 5, baseType: !586, size: 64, align: 64, offset: 704)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!41, !40, !55, !116}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !18, line: 5, baseType: !80, size: 64, align: 64, offset: 768)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessResponse", file: !18, line: 10, baseType: !591, size: 64, align: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!41, !40, !465, !475}
!594 = !DILocalVariable(name: "c", arg: 1, scope: !9, file: !10, line: 22, type: !84)
!595 = !DILocation(line: 22, column: 1, scope: !9)
!596 = !DILocalVariable(name: "id", arg: 2, scope: !9, file: !10, line: 22, type: !55)
!597 = !DILocation(line: 22, column: 31, scope: !9)
!598 = !DILocalVariable(name: "priority", arg: 3, scope: !9, file: !10, line: 22, type: !59)
!599 = !DILocation(line: 22, column: 42, scope: !9)
!600 = !DILocalVariable(name: "m", arg: 4, scope: !9, file: !10, line: 22, type: !141)
!601 = !DILocation(line: 22, column: 56, scope: !9)
!602 = !DILocation(line: 23, column: 10, scope: !9)
!603 = !DILocation(line: 23, column: 38, scope: !9)
!604 = !DILocation(line: 23, column: 16, scope: !9)
!605 = !DILocation(line: 23, column: 2, scope: !9)
!606 = distinct !DISubprogram(name: "middleware.Get..1command_line_arguments.MiddlewareChain", linkageName: "command_line_arguments.MiddlewareChain.Get", scope: null, file: !10, line: 38, type: !607, isLocal: false, isDefinition: true, scopeLine: 38, isOptimized: false, unit: !1, retainedNodes: !3)
!607 = !DISubroutineType(types: !608)
!608 = !{!141, !84, !84, !55}
!609 = !DILocalVariable(name: "c", arg: 1, scope: !606, file: !10, line: 38, type: !84)
!610 = !DILocation(line: 38, column: 1, scope: !606)
!611 = !DILocalVariable(name: "id", arg: 2, scope: !606, file: !10, line: 38, type: !55)
!612 = !DILocation(line: 38, column: 31, scope: !606)
!613 = !DILocation(line: 39, column: 8, scope: !614)
!614 = distinct !DILexicalBlock(scope: !606, file: !10, line: 38, column: 1)
!615 = !DILocation(line: 39, column: 14, scope: !614)
!616 = !DILocalVariable(name: "m", scope: !614, file: !10, line: 39, type: !116)
!617 = !DILocation(line: 39, column: 2, scope: !606)
!618 = !DILocation(line: 40, column: 7, scope: !614)
!619 = !DILocation(line: 41, column: 11, scope: !614)
!620 = !DILocalVariable(name: "$ret4", scope: !606, file: !10, line: 38, type: !141)
!621 = !DILocation(line: 38, column: 42, scope: !606)
!622 = !DILocation(line: 41, column: 3, scope: !614)
!623 = !DILocation(line: 43, column: 2, scope: !614)
!624 = distinct !DISubprogram(name: "middleware.Next..1command_line_arguments.MiddlewareIter", linkageName: "command_line_arguments.MiddlewareIter.Next", scope: null, file: !10, line: 56, type: !625, isLocal: false, isDefinition: true, scopeLine: 56, isOptimized: false, unit: !1, retainedNodes: !3)
!625 = !DISubroutineType(types: !626)
!626 = !{!141, !627, !627}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "MiddlewareIter", file: !10, line: 52, size: 64, align: 8, elements: !629)
!629 = !{!630}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "iter", file: !10, line: 53, baseType: !136, size: 64, align: 64)
!631 = !DILocalVariable(name: "m", arg: 1, scope: !624, file: !10, line: 56, type: !627)
!632 = !DILocation(line: 56, column: 1, scope: !624)
!633 = !DILocation(line: 57, column: 10, scope: !634)
!634 = distinct !DILexicalBlock(scope: !624, file: !10, line: 56, column: 1)
!635 = !DILocation(line: 57, column: 15, scope: !634)
!636 = !DILocalVariable(name: "val", scope: !634, file: !10, line: 57, type: !116)
!637 = !DILocation(line: 57, column: 2, scope: !624)
!638 = !DILocation(line: 58, column: 9, scope: !634)
!639 = !DILocalVariable(name: "$ret6", scope: !624, file: !10, line: 56, type: !141)
!640 = !DILocation(line: 56, column: 33, scope: !624)
!641 = !DILocation(line: 59, column: 3, scope: !634)
!642 = !DILocation(line: 61, column: 12, scope: !634)
!643 = !DILocation(line: 61, column: 2, scope: !634)
!644 = distinct !DISubprogram(name: "middleware.Prev..1command_line_arguments.MiddlewareIter", linkageName: "command_line_arguments.MiddlewareIter.Prev", scope: null, file: !10, line: 64, type: !625, isLocal: false, isDefinition: true, scopeLine: 64, isOptimized: false, unit: !1, retainedNodes: !3)
!645 = !DILocalVariable(name: "m", arg: 1, scope: !644, file: !10, line: 64, type: !627)
!646 = !DILocation(line: 64, column: 1, scope: !644)
!647 = !DILocation(line: 65, column: 10, scope: !648)
!648 = distinct !DILexicalBlock(scope: !644, file: !10, line: 64, column: 1)
!649 = !DILocation(line: 65, column: 15, scope: !648)
!650 = !DILocalVariable(name: "val", scope: !648, file: !10, line: 65, type: !116)
!651 = !DILocation(line: 65, column: 2, scope: !644)
!652 = !DILocation(line: 66, column: 9, scope: !648)
!653 = !DILocalVariable(name: "$ret7", scope: !644, file: !10, line: 64, type: !141)
!654 = !DILocation(line: 64, column: 33, scope: !644)
!655 = !DILocation(line: 67, column: 3, scope: !648)
!656 = !DILocation(line: 69, column: 12, scope: !648)
!657 = !DILocation(line: 69, column: 2, scope: !648)
!658 = distinct !DISubprogram(name: "middleware.next..1command_line_arguments.iter", linkageName: "command_line_arguments.iter.next", scope: null, file: !10, line: 255, type: !659, isLocal: false, isDefinition: true, scopeLine: 255, isOptimized: false, unit: !1, retainedNodes: !3)
!659 = !DISubroutineType(types: !660)
!660 = !{!116, !136, !136}
!661 = !DILocalVariable(name: "it", arg: 1, scope: !658, file: !10, line: 255, type: !136)
!662 = !DILocation(line: 255, column: 1, scope: !658)
!663 = !DILocation(line: 256, column: 7, scope: !658)
!664 = !DILocation(line: 256, column: 23, scope: !658)
!665 = !DILocation(line: 256, column: 14, scope: !658)
!666 = !DILocalVariable(name: "$ret25", scope: !658, file: !10, line: 255, type: !116)
!667 = !DILocation(line: 255, column: 24, scope: !658)
!668 = !DILocation(line: 257, column: 3, scope: !658)
!669 = !DILocation(line: 259, column: 11, scope: !658)
!670 = !DILocation(line: 260, column: 14, scope: !658)
!671 = !DILocation(line: 263, column: 21, scope: !658)
!672 = !DILocation(line: 263, column: 31, scope: !658)
!673 = !DILocation(line: 263, column: 2, scope: !658)
!674 = distinct !DISubprogram(name: "middleware.prev..1command_line_arguments.iter", linkageName: "command_line_arguments.iter.prev", scope: null, file: !10, line: 266, type: !659, isLocal: false, isDefinition: true, scopeLine: 266, isOptimized: false, unit: !1, retainedNodes: !3)
!675 = !DILocalVariable(name: "it", arg: 1, scope: !674, file: !10, line: 266, type: !136)
!676 = !DILocation(line: 266, column: 1, scope: !674)
!677 = !DILocation(line: 267, column: 7, scope: !674)
!678 = !DILocation(line: 267, column: 14, scope: !674)
!679 = !DILocalVariable(name: "$ret26", scope: !674, file: !10, line: 266, type: !116)
!680 = !DILocation(line: 266, column: 24, scope: !674)
!681 = !DILocation(line: 268, column: 3, scope: !674)
!682 = !DILocation(line: 270, column: 11, scope: !674)
!683 = !DILocation(line: 271, column: 14, scope: !674)
!684 = !DILocation(line: 274, column: 21, scope: !674)
!685 = !DILocation(line: 274, column: 31, scope: !674)
!686 = !DILocation(line: 274, column: 2, scope: !674)
!687 = distinct !DISubprogram(name: "middleware.command_line_arguments.callback..hash", linkageName: "command_line_arguments.command_line_arguments.callback..hash", scope: null, file: !7, line: 1, type: !38, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!688 = !DILocalVariable(name: "key", arg: 1, scope: !687, file: !7, line: 1, type: !40)
!689 = !DILocation(line: 1, column: 1, scope: !687)
!690 = !DILocalVariable(name: "seed", arg: 2, scope: !687, file: !7, line: 1, type: !25)
!691 = !DILocalVariable(name: "$ret37", scope: !687, file: !7, line: 1, type: !25)
!692 = distinct !DISubprogram(name: "middleware.command_line_arguments.callback..eq", linkageName: "command_line_arguments.command_line_arguments.callback..eq", scope: null, file: !7, line: 1, type: !48, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!693 = !DILocalVariable(name: "key1", arg: 1, scope: !692, file: !7, line: 1, type: !40)
!694 = !DILocation(line: 1, column: 1, scope: !692)
!695 = !DILocalVariable(name: "key2", arg: 2, scope: !692, file: !7, line: 1, type: !40)
!696 = !DILocalVariable(name: "$ret38", scope: !692, file: !7, line: 1, type: !50)
!697 = distinct !DISubprogram(name: "middleware.GetIter..1command_line_arguments.MiddlewareChain", linkageName: "command_line_arguments.MiddlewareChain.GetIter", scope: null, file: !10, line: 46, type: !698, isLocal: false, isDefinition: true, scopeLine: 46, isOptimized: false, unit: !1, retainedNodes: !3)
!698 = !DISubroutineType(types: !699)
!699 = !{!627, !84, !84}
!700 = !DILocalVariable(name: "c", arg: 1, scope: !697, file: !10, line: 46, type: !84)
!701 = !DILocation(line: 46, column: 1, scope: !697)
!702 = !DILocalVariable(name: "$ret5", scope: !697, file: !10, line: 46, type: !627)
!703 = !DILocation(line: 46, column: 37, scope: !697)
!704 = !DILocation(line: 48, column: 10, scope: !697)
!705 = !DILocation(line: 48, column: 16, scope: !697)
!706 = !DILocation(line: 47, column: 9, scope: !697)
!707 = !DILocation(line: 47, column: 10, scope: !697)
!708 = !DILocation(line: 47, column: 2, scope: !697)
!709 = distinct !DISubprogram(name: "middleware.Remove..1command_line_arguments.MiddlewareChain", linkageName: "command_line_arguments.MiddlewareChain.Remove", scope: null, file: !10, line: 30, type: !710, isLocal: false, isDefinition: true, scopeLine: 30, isOptimized: false, unit: !1, retainedNodes: !3)
!710 = !DISubroutineType(types: !711)
!711 = !{!13, !84, !84, !55}
!712 = !DILocalVariable(name: "c", arg: 1, scope: !709, file: !10, line: 30, type: !84)
!713 = !DILocation(line: 30, column: 1, scope: !709)
!714 = !DILocalVariable(name: "id", arg: 2, scope: !709, file: !10, line: 30, type: !55)
!715 = !DILocation(line: 30, column: 34, scope: !709)
!716 = !DILocation(line: 31, column: 10, scope: !709)
!717 = !DILocation(line: 31, column: 16, scope: !709)
!718 = !DILocation(line: 31, column: 2, scope: !709)
!719 = distinct !DISubprogram(name: "middleware.Update..1command_line_arguments.MiddlewareChain", linkageName: "command_line_arguments.MiddlewareChain.Update", scope: null, file: !10, line: 34, type: !11, isLocal: false, isDefinition: true, scopeLine: 34, isOptimized: false, unit: !1, retainedNodes: !3)
!720 = !DILocalVariable(name: "c", arg: 1, scope: !719, file: !10, line: 34, type: !84)
!721 = !DILocation(line: 34, column: 1, scope: !719)
!722 = !DILocalVariable(name: "id", arg: 2, scope: !719, file: !10, line: 34, type: !55)
!723 = !DILocation(line: 34, column: 34, scope: !719)
!724 = !DILocalVariable(name: "priority", arg: 3, scope: !719, file: !10, line: 34, type: !59)
!725 = !DILocation(line: 34, column: 45, scope: !719)
!726 = !DILocalVariable(name: "m", arg: 4, scope: !719, file: !10, line: 34, type: !141)
!727 = !DILocation(line: 34, column: 59, scope: !719)
!728 = !DILocation(line: 35, column: 10, scope: !719)
!729 = !DILocation(line: 35, column: 38, scope: !719)
!730 = !DILocation(line: 35, column: 16, scope: !719)
!731 = !DILocation(line: 35, column: 2, scope: !719)
!732 = distinct !DISubprogram(name: "middleware.Upsert..1command_line_arguments.MiddlewareChain", linkageName: "command_line_arguments.MiddlewareChain.Upsert", scope: null, file: !10, line: 26, type: !733, isLocal: false, isDefinition: true, scopeLine: 26, isOptimized: false, unit: !1, retainedNodes: !3)
!733 = !DISubroutineType(types: !734)
!734 = !{!41, !84, !84, !55, !59, !141}
!735 = !DILocalVariable(name: "c", arg: 1, scope: !732, file: !10, line: 26, type: !84)
!736 = !DILocation(line: 26, column: 1, scope: !732)
!737 = !DILocalVariable(name: "id", arg: 2, scope: !732, file: !10, line: 26, type: !55)
!738 = !DILocation(line: 26, column: 34, scope: !732)
!739 = !DILocalVariable(name: "priority", arg: 3, scope: !732, file: !10, line: 26, type: !59)
!740 = !DILocation(line: 26, column: 45, scope: !732)
!741 = !DILocalVariable(name: "m", arg: 4, scope: !732, file: !10, line: 26, type: !141)
!742 = !DILocation(line: 26, column: 59, scope: !732)
!743 = !DILocation(line: 27, column: 3, scope: !732)
!744 = !DILocation(line: 27, column: 31, scope: !732)
!745 = !DILocation(line: 27, column: 9, scope: !732)
!746 = distinct !DISubprogram(name: "middleware.append..1command_line_arguments.chain", linkageName: "command_line_arguments.chain.append", scope: null, file: !10, line: 156, type: !747, isLocal: false, isDefinition: true, scopeLine: 156, isOptimized: false, unit: !1, retainedNodes: !3)
!747 = !DISubroutineType(types: !748)
!748 = !{!13, !88, !88, !55, !59, !116}
!749 = !DILocalVariable(name: "c", arg: 1, scope: !746, file: !10, line: 156, type: !88)
!750 = !DILocation(line: 156, column: 1, scope: !746)
!751 = !DILocalVariable(name: "id", arg: 2, scope: !746, file: !10, line: 156, type: !55)
!752 = !DILocation(line: 156, column: 24, scope: !746)
!753 = !DILocalVariable(name: "priority", arg: 3, scope: !746, file: !10, line: 156, type: !59)
!754 = !DILocation(line: 156, column: 35, scope: !746)
!755 = !DILocalVariable(name: "cb", arg: 4, scope: !746, file: !10, line: 156, type: !116)
!756 = !DILocation(line: 156, column: 49, scope: !746)
!757 = !DILocalVariable(name: "$ret16", scope: !746, file: !10, line: 156, type: !13)
!758 = !DILocation(line: 156, column: 65, scope: !746)
!759 = !DILocation(line: 157, column: 3, scope: !746)
!760 = !DILocation(line: 166, column: 1, scope: !746)
!761 = !DILocation(line: 157, column: 9, scope: !746)
!762 = !DILocation(line: 158, column: 9, scope: !746)
!763 = !DILocation(line: 158, column: 2, scope: !746)
!764 = !DILocation(line: 160, column: 14, scope: !765)
!765 = distinct !DILexicalBlock(scope: !746, file: !10, line: 160, column: 2)
!766 = !DILocalVariable(name: "p", scope: !765, file: !10, line: 160, type: !110)
!767 = !DILocation(line: 160, column: 5, scope: !746)
!768 = !DILocation(line: 160, column: 27, scope: !765)
!769 = !DILocation(line: 161, column: 14, scope: !765)
!770 = !DILocation(line: 163, column: 3, scope: !746)
!771 = !DILocation(line: 163, column: 16, scope: !746)
!772 = !DILocation(line: 163, column: 36, scope: !746)
!773 = !DILocation(line: 163, column: 37, scope: !746)
!774 = !DILocation(line: 163, column: 14, scope: !746)
!775 = !DILocation(line: 164, column: 25, scope: !746)
!776 = !DILocation(line: 164, column: 7, scope: !746)
!777 = !DILocation(line: 161, column: 3, scope: !746)
!778 = distinct !DISubprogram(name: "middleware.find..1command_line_arguments.chain", linkageName: "command_line_arguments.chain.find", scope: null, file: !10, line: 168, type: !779, isLocal: false, isDefinition: true, scopeLine: 168, isOptimized: false, unit: !1, retainedNodes: !3)
!779 = !DISubroutineType(types: !780)
!780 = !{!781, !88, !88, !55}
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.command-line-arguments.callback,int}", file: !18, size: 128, align: 8, elements: !782)
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 168, baseType: !110, size: 64, align: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 168, baseType: !59, size: 64, align: 64, offset: 64)
!785 = !DILocalVariable(name: "c", arg: 1, scope: !778, file: !10, line: 168, type: !88)
!786 = !DILocation(line: 168, column: 1, scope: !778)
!787 = !DILocalVariable(name: "id", arg: 2, scope: !778, file: !10, line: 168, type: !55)
!788 = !DILocation(line: 168, column: 22, scope: !778)
!789 = !DILocalVariable(name: "$ret17", scope: !778, file: !10, line: 168, type: !110)
!790 = !DILocation(line: 168, column: 34, scope: !778)
!791 = !DILocalVariable(name: "$ret18", scope: !778, file: !10, line: 168, type: !59)
!792 = !DILocation(line: 168, column: 45, scope: !778)
!793 = !DILocalVariable(name: "i", scope: !794, file: !10, line: 169, type: !59)
!794 = distinct !DILexicalBlock(scope: !778, file: !10, line: 169, column: 2)
!795 = !DILocation(line: 169, column: 6, scope: !778)
!796 = !DILocalVariable(name: "c", scope: !794, file: !10, line: 169, type: !110)
!797 = !DILocation(line: 169, column: 21, scope: !794)
!798 = !DILocation(line: 169, column: 2, scope: !794)
!799 = !DILocation(line: 170, column: 7, scope: !794)
!800 = !DILocation(line: 170, column: 11, scope: !794)
!801 = !DILocation(line: 171, column: 4, scope: !794)
!802 = !DILocation(line: 174, column: 2, scope: !778)
!803 = distinct !DISubprogram(name: "middleware.get..1command_line_arguments.chain", linkageName: "command_line_arguments.chain.get", scope: null, file: !10, line: 205, type: !804, isLocal: false, isDefinition: true, scopeLine: 205, isOptimized: false, unit: !1, retainedNodes: !3)
!804 = !DISubroutineType(types: !805)
!805 = !{!116, !88, !88, !55}
!806 = !DILocalVariable(name: "c", arg: 1, scope: !803, file: !10, line: 205, type: !88)
!807 = !DILocation(line: 205, column: 1, scope: !803)
!808 = !DILocalVariable(name: "id", arg: 2, scope: !803, file: !10, line: 205, type: !55)
!809 = !DILocation(line: 205, column: 21, scope: !803)
!810 = !DILocalVariable(name: "$ret20", scope: !803, file: !10, line: 205, type: !116)
!811 = !DILocation(line: 205, column: 32, scope: !803)
!812 = !DILocation(line: 206, column: 3, scope: !813)
!813 = distinct !DILexicalBlock(scope: !803, file: !10, line: 205, column: 1)
!814 = !DILocation(line: 215, column: 1, scope: !803)
!815 = !DILocation(line: 206, column: 9, scope: !813)
!816 = !DILocation(line: 207, column: 9, scope: !813)
!817 = !DILocation(line: 207, column: 2, scope: !813)
!818 = !DILocation(line: 209, column: 11, scope: !813)
!819 = !DILocalVariable(name: "p", scope: !813, file: !10, line: 209, type: !110)
!820 = !DILocation(line: 209, column: 2, scope: !803)
!821 = !DILocation(line: 210, column: 7, scope: !813)
!822 = !DILocation(line: 213, column: 3, scope: !813)
!823 = !DILocation(line: 211, column: 3, scope: !803)
!824 = distinct !DISubprogram(name: "middleware.getIter..1command_line_arguments.chain", linkageName: "command_line_arguments.chain.getIter", scope: null, file: !10, line: 231, type: !825, isLocal: false, isDefinition: true, scopeLine: 231, isOptimized: false, unit: !1, retainedNodes: !3)
!825 = !DISubroutineType(types: !826)
!826 = !{!136, !88, !88}
!827 = !DILocalVariable(name: "c", arg: 1, scope: !824, file: !10, line: 231, type: !88)
!828 = !DILocation(line: 231, column: 1, scope: !824)
!829 = !DILocalVariable(name: "$ret22", scope: !824, file: !10, line: 231, type: !136)
!830 = !DILocation(line: 231, column: 27, scope: !824)
!831 = !DILocation(line: 232, column: 3, scope: !824)
!832 = !DILocation(line: 235, column: 1, scope: !824)
!833 = !DILocation(line: 232, column: 9, scope: !824)
!834 = !DILocation(line: 233, column: 9, scope: !824)
!835 = !DILocation(line: 233, column: 2, scope: !824)
!836 = !DILocation(line: 234, column: 18, scope: !824)
!837 = !DILocation(line: 243, column: 14, scope: !838, inlinedAt: !841)
!838 = distinct !DISubprogram(name: "middleware.newIter", scope: null, file: !10, line: 243, type: !839, isLocal: true, isDefinition: true, scopeLine: 243, isOptimized: false, unit: !1, retainedNodes: !3)
!839 = !DISubroutineType(types: !840)
!840 = !{!136, !106}
!841 = distinct !DILocation(line: 234, column: 9, scope: !824)
!842 = !DILocalVariable(name: "$ret24", scope: !838, file: !10, line: 243, type: !136)
!843 = !DILocation(line: 243, column: 37, scope: !838, inlinedAt: !841)
!844 = !DILocation(line: 244, column: 9, scope: !838, inlinedAt: !841)
!845 = !DILocation(line: 244, column: 10, scope: !838, inlinedAt: !841)
!846 = !DILocation(line: 244, column: 2, scope: !838, inlinedAt: !841)
!847 = !DILocation(line: 234, column: 2, scope: !824)
!848 = distinct !DISubprogram(name: "middleware.next..1command_line_arguments.reverseIter", linkageName: "command_line_arguments.reverseIter.next", scope: null, file: !10, line: 282, type: !849, isLocal: false, isDefinition: true, scopeLine: 282, isOptimized: false, unit: !1, retainedNodes: !3)
!849 = !DISubroutineType(types: !850)
!850 = !{!116, !851, !851}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.reverseIter", file: !10, line: 277, size: 256, align: 8, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !10, line: 278, baseType: !59, size: 64, align: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", file: !10, line: 279, baseType: !106, size: 192, align: 64, offset: 64)
!856 = !DILocalVariable(name: "it", arg: 1, scope: !848, file: !10, line: 282, type: !851)
!857 = !DILocation(line: 282, column: 1, scope: !848)
!858 = !DILocation(line: 283, column: 7, scope: !859)
!859 = distinct !DILexicalBlock(scope: !848, file: !10, line: 282, column: 1)
!860 = !DILocation(line: 283, column: 23, scope: !859)
!861 = !DILocation(line: 283, column: 14, scope: !859)
!862 = !DILocalVariable(name: "$ret27", scope: !848, file: !10, line: 282, type: !116)
!863 = !DILocation(line: 282, column: 31, scope: !848)
!864 = !DILocation(line: 284, column: 3, scope: !859)
!865 = !DILocation(line: 286, column: 48, scope: !859)
!866 = !DILocation(line: 286, column: 21, scope: !859)
!867 = !DILocation(line: 286, column: 51, scope: !859)
!868 = !DILocalVariable(name: "val", scope: !859, file: !10, line: 286, type: !116)
!869 = !DILocation(line: 286, column: 2, scope: !848)
!870 = !DILocation(line: 287, column: 11, scope: !859)
!871 = !DILocation(line: 288, column: 2, scope: !859)
!872 = distinct !DISubprogram(name: "middleware.getReverseIter..1command_line_arguments.chain", linkageName: "command_line_arguments.chain.getReverseIter", scope: null, file: !10, line: 237, type: !873, isLocal: false, isDefinition: true, scopeLine: 237, isOptimized: false, unit: !1, retainedNodes: !3)
!873 = !DISubroutineType(types: !874)
!874 = !{!851, !88, !88}
!875 = !DILocalVariable(name: "c", arg: 1, scope: !872, file: !10, line: 237, type: !88)
!876 = !DILocation(line: 237, column: 1, scope: !872)
!877 = !DILocalVariable(name: "$ret23", scope: !872, file: !10, line: 237, type: !851)
!878 = !DILocation(line: 237, column: 34, scope: !872)
!879 = !DILocation(line: 238, column: 3, scope: !872)
!880 = !DILocation(line: 241, column: 1, scope: !872)
!881 = !DILocation(line: 238, column: 9, scope: !872)
!882 = !DILocation(line: 239, column: 9, scope: !872)
!883 = !DILocation(line: 239, column: 2, scope: !872)
!884 = !DILocation(line: 240, column: 34, scope: !872)
!885 = !DILocation(line: 240, column: 9, scope: !872)
!886 = !DILocation(line: 240, column: 10, scope: !872)
!887 = !DILocation(line: 240, column: 2, scope: !872)
!888 = distinct !DISubprogram(name: "middleware.remove..1command_line_arguments.chain", linkageName: "command_line_arguments.chain.remove", scope: null, file: !10, line: 217, type: !889, isLocal: false, isDefinition: true, scopeLine: 217, isOptimized: false, unit: !1, retainedNodes: !3)
!889 = !DISubroutineType(types: !890)
!890 = !{!13, !88, !88, !55}
!891 = !DILocalVariable(name: "c", arg: 1, scope: !888, file: !10, line: 217, type: !88)
!892 = !DILocation(line: 217, column: 1, scope: !888)
!893 = !DILocalVariable(name: "id", arg: 2, scope: !888, file: !10, line: 217, type: !55)
!894 = !DILocation(line: 217, column: 24, scope: !888)
!895 = !DILocalVariable(name: "$ret21", scope: !888, file: !10, line: 217, type: !13)
!896 = !DILocation(line: 217, column: 35, scope: !888)
!897 = !DILocation(line: 218, column: 3, scope: !898)
!898 = distinct !DILexicalBlock(scope: !888, file: !10, line: 217, column: 1)
!899 = !DILocation(line: 228, column: 1, scope: !888)
!900 = !DILocation(line: 218, column: 9, scope: !898)
!901 = !DILocation(line: 219, column: 9, scope: !898)
!902 = !DILocation(line: 219, column: 2, scope: !898)
!903 = !DILocation(line: 221, column: 11, scope: !898)
!904 = !DILocalVariable(name: "p", scope: !898, file: !10, line: 221, type: !110)
!905 = !DILocation(line: 221, column: 2, scope: !888)
!906 = !DILocalVariable(name: "i", scope: !898, file: !10, line: 221, type: !59)
!907 = !DILocation(line: 222, column: 7, scope: !898)
!908 = !DILocation(line: 223, column: 14, scope: !898)
!909 = !DILocation(line: 225, column: 3, scope: !898)
!910 = !DILocation(line: 225, column: 53, scope: !898)
!911 = !DILocation(line: 225, column: 34, scope: !898)
!912 = !DILocation(line: 225, column: 51, scope: !898)
!913 = !DILocation(line: 225, column: 16, scope: !898)
!914 = !DILocation(line: 225, column: 14, scope: !898)
!915 = !DILocation(line: 226, column: 25, scope: !898)
!916 = !DILocation(line: 226, column: 7, scope: !898)
!917 = !DILocation(line: 223, column: 3, scope: !888)
!918 = distinct !DISubprogram(name: "middleware.update..1command_line_arguments.chain", linkageName: "command_line_arguments.chain.update", scope: null, file: !10, line: 177, type: !747, isLocal: false, isDefinition: true, scopeLine: 177, isOptimized: false, unit: !1, retainedNodes: !3)
!919 = !DILocalVariable(name: "c", arg: 1, scope: !918, file: !10, line: 177, type: !88)
!920 = !DILocation(line: 177, column: 1, scope: !918)
!921 = !DILocalVariable(name: "id", arg: 2, scope: !918, file: !10, line: 177, type: !55)
!922 = !DILocation(line: 177, column: 24, scope: !918)
!923 = !DILocalVariable(name: "priority", arg: 3, scope: !918, file: !10, line: 177, type: !59)
!924 = !DILocation(line: 177, column: 35, scope: !918)
!925 = !DILocalVariable(name: "cb", arg: 4, scope: !918, file: !10, line: 177, type: !116)
!926 = !DILocation(line: 177, column: 49, scope: !918)
!927 = !DILocalVariable(name: "$ret19", scope: !918, file: !10, line: 177, type: !13)
!928 = !DILocation(line: 177, column: 65, scope: !918)
!929 = !DILocation(line: 178, column: 3, scope: !930)
!930 = distinct !DILexicalBlock(scope: !918, file: !10, line: 177, column: 1)
!931 = !DILocation(line: 189, column: 1, scope: !918)
!932 = !DILocation(line: 178, column: 9, scope: !930)
!933 = !DILocation(line: 179, column: 9, scope: !930)
!934 = !DILocation(line: 179, column: 2, scope: !930)
!935 = !DILocation(line: 181, column: 11, scope: !930)
!936 = !DILocalVariable(name: "p", scope: !930, file: !10, line: 181, type: !110)
!937 = !DILocation(line: 181, column: 2, scope: !918)
!938 = !DILocation(line: 182, column: 7, scope: !930)
!939 = !DILocation(line: 183, column: 14, scope: !930)
!940 = !DILocation(line: 185, column: 3, scope: !930)
!941 = !DILocation(line: 185, column: 7, scope: !930)
!942 = !DILocation(line: 186, column: 3, scope: !930)
!943 = !DILocation(line: 186, column: 13, scope: !930)
!944 = !DILocation(line: 187, column: 27, scope: !930)
!945 = !DILocation(line: 187, column: 25, scope: !930)
!946 = !DILocation(line: 187, column: 7, scope: !930)
!947 = !DILocation(line: 183, column: 3, scope: !918)
!948 = distinct !DISubprogram(name: "middleware.upsert..1command_line_arguments.chain", linkageName: "command_line_arguments.chain.upsert", scope: null, file: !10, line: 191, type: !949, isLocal: false, isDefinition: true, scopeLine: 191, isOptimized: false, unit: !1, retainedNodes: !3)
!949 = !DISubroutineType(types: !950)
!950 = !{!41, !88, !88, !55, !59, !116}
!951 = !DILocalVariable(name: "c", arg: 1, scope: !948, file: !10, line: 191, type: !88)
!952 = !DILocation(line: 191, column: 1, scope: !948)
!953 = !DILocalVariable(name: "id", arg: 2, scope: !948, file: !10, line: 191, type: !55)
!954 = !DILocation(line: 191, column: 24, scope: !948)
!955 = !DILocalVariable(name: "priority", arg: 3, scope: !948, file: !10, line: 191, type: !59)
!956 = !DILocation(line: 191, column: 35, scope: !948)
!957 = !DILocalVariable(name: "cb", arg: 4, scope: !948, file: !10, line: 191, type: !116)
!958 = !DILocation(line: 191, column: 49, scope: !948)
!959 = !DILocation(line: 192, column: 3, scope: !960)
!960 = distinct !DILexicalBlock(scope: !948, file: !10, line: 191, column: 1)
!961 = !DILocation(line: 203, column: 1, scope: !948)
!962 = !DILocation(line: 192, column: 9, scope: !960)
!963 = !DILocation(line: 193, column: 9, scope: !960)
!964 = !DILocation(line: 193, column: 2, scope: !960)
!965 = !DILocation(line: 195, column: 11, scope: !960)
!966 = !DILocalVariable(name: "p", scope: !960, file: !10, line: 195, type: !110)
!967 = !DILocation(line: 195, column: 2, scope: !948)
!968 = !DILocation(line: 196, column: 7, scope: !960)
!969 = !DILocation(line: 197, column: 4, scope: !960)
!970 = !DILocation(line: 197, column: 17, scope: !960)
!971 = !DILocation(line: 197, column: 37, scope: !960)
!972 = !DILocation(line: 197, column: 38, scope: !960)
!973 = !DILocation(line: 197, column: 15, scope: !960)
!974 = !DILocation(line: 199, column: 4, scope: !960)
!975 = !DILocation(line: 199, column: 8, scope: !960)
!976 = !DILocation(line: 200, column: 4, scope: !960)
!977 = !DILocation(line: 200, column: 14, scope: !960)
!978 = !DILocation(line: 202, column: 27, scope: !960)
!979 = !DILocation(line: 202, column: 25, scope: !960)
!980 = !DILocation(line: 202, column: 7, scope: !960)
!981 = distinct !DISubprogram(name: "middleware.NewMiddlewareChain", linkageName: "command_line_arguments.NewMiddlewareChain", scope: null, file: !10, line: 16, type: !982, isLocal: false, isDefinition: true, scopeLine: 16, isOptimized: false, unit: !1, retainedNodes: !3)
!982 = !DISubroutineType(types: !983)
!983 = !{!84}
!984 = !DILocalVariable(name: "$ret0", scope: !981, file: !10, line: 16, type: !84)
!985 = !DILocation(line: 16, column: 27, scope: !981)
!986 = !DILocation(line: 18, column: 10, scope: !981)
!987 = !DILocation(line: 17, column: 9, scope: !981)
!988 = !DILocation(line: 17, column: 10, scope: !981)
!989 = !DILocation(line: 17, column: 2, scope: !981)
!990 = distinct !DISubprogram(name: "middleware.newChain", scope: null, file: !10, line: 149, type: !991, isLocal: true, isDefinition: true, scopeLine: 149, isOptimized: false, unit: !1, retainedNodes: !3)
!991 = !DISubroutineType(types: !992)
!992 = !{!88}
!993 = !DILocalVariable(name: "$ret15", scope: !990, file: !10, line: 149, type: !88)
!994 = !DILocation(line: 149, column: 17, scope: !990)
!995 = !DILocation(line: 151, column: 14, scope: !990)
!996 = !DILocation(line: 152, column: 14, scope: !990)
!997 = !DILocation(line: 150, column: 9, scope: !990)
!998 = !DILocation(line: 150, column: 10, scope: !990)
!999 = !DILocation(line: 150, column: 2, scope: !990)
!1000 = distinct !DISubprogram(name: "middleware.Add..1command_line_arguments.ObserverChain", linkageName: "command_line_arguments.ObserverChain.Add", scope: null, file: !10, line: 82, type: !1001, isLocal: false, isDefinition: true, scopeLine: 82, isOptimized: false, unit: !1, retainedNodes: !3)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!13, !1003, !1003, !55, !1007}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObserverChain", file: !10, line: 72, size: 64, align: 8, elements: !1005)
!1005 = !{!1006}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "chain", file: !10, line: 73, baseType: !88, size: 64, align: 64)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "Observer", file: !117, line: 25, size: 128, align: 8, elements: !1008)
!1008 = !{!1009, !120}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !117, line: 25, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Request)void,*func(*void,Request,Attempt)void}", file: !18, size: 192, align: 8, elements: !1012)
!1012 = !{!1013, !1014, !1018}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 25, baseType: !21, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "ObserveRequest", file: !18, line: 25, baseType: !1015, size: 64, align: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!41, !40, !465}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ObserveResponse", file: !18, line: 25, baseType: !591, size: 64, align: 64, offset: 128)
!1019 = !DILocalVariable(name: "c", arg: 1, scope: !1000, file: !10, line: 82, type: !1003)
!1020 = !DILocation(line: 82, column: 1, scope: !1000)
!1021 = !DILocalVariable(name: "id", arg: 2, scope: !1000, file: !10, line: 82, type: !55)
!1022 = !DILocation(line: 82, column: 29, scope: !1000)
!1023 = !DILocalVariable(name: "o", arg: 3, scope: !1000, file: !10, line: 82, type: !1007)
!1024 = !DILocation(line: 82, column: 40, scope: !1000)
!1025 = !DILocation(line: 83, column: 10, scope: !1000)
!1026 = !DILocation(line: 83, column: 31, scope: !1000)
!1027 = !DILocation(line: 83, column: 16, scope: !1000)
!1028 = !DILocation(line: 83, column: 2, scope: !1000)
!1029 = distinct !DISubprogram(name: "middleware.Get..1command_line_arguments.ObserverChain", linkageName: "command_line_arguments.ObserverChain.Get", scope: null, file: !10, line: 98, type: !1030, isLocal: false, isDefinition: true, scopeLine: 98, isOptimized: false, unit: !1, retainedNodes: !3)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!1007, !1003, !1003, !55}
!1032 = !DILocalVariable(name: "c", arg: 1, scope: !1029, file: !10, line: 98, type: !1003)
!1033 = !DILocation(line: 98, column: 1, scope: !1029)
!1034 = !DILocalVariable(name: "id", arg: 2, scope: !1029, file: !10, line: 98, type: !55)
!1035 = !DILocation(line: 98, column: 29, scope: !1029)
!1036 = !DILocation(line: 99, column: 8, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1029, file: !10, line: 98, column: 1)
!1038 = !DILocation(line: 99, column: 14, scope: !1037)
!1039 = !DILocalVariable(name: "o", scope: !1037, file: !10, line: 99, type: !116)
!1040 = !DILocation(line: 99, column: 2, scope: !1029)
!1041 = !DILocation(line: 100, column: 7, scope: !1037)
!1042 = !DILocation(line: 101, column: 11, scope: !1037)
!1043 = !DILocalVariable(name: "$ret12", scope: !1029, file: !10, line: 98, type: !1007)
!1044 = !DILocation(line: 98, column: 40, scope: !1029)
!1045 = !DILocation(line: 101, column: 3, scope: !1037)
!1046 = !DILocation(line: 103, column: 2, scope: !1037)
!1047 = distinct !DISubprogram(name: "middleware.ObserveRequest..1command_line_arguments.ObserverChain", linkageName: "command_line_arguments.ObserverChain.ObserveRequest", scope: null, file: !10, line: 106, type: !1048, isLocal: false, isDefinition: true, scopeLine: 106, isOptimized: false, unit: !1, retainedNodes: !3)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!41, !1003, !1003, !465}
!1050 = !DILocalVariable(name: "c", arg: 1, scope: !1047, file: !10, line: 106, type: !1003)
!1051 = !DILocation(line: 106, column: 1, scope: !1047)
!1052 = !DILocalVariable(name: "r", arg: 2, scope: !1047, file: !10, line: 106, type: !465)
!1053 = !DILocation(line: 106, column: 40, scope: !1047)
!1054 = !DILocation(line: 107, column: 9, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1047, file: !10, line: 106, column: 1)
!1056 = !DILocation(line: 107, column: 15, scope: !1055)
!1057 = !DILocalVariable(name: "it", scope: !1055, file: !10, line: 107, type: !136)
!1058 = !DILocation(line: 107, column: 2, scope: !1047)
!1059 = !DILocation(line: 108, column: 13, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1055, file: !10, line: 108, column: 2)
!1061 = !DILocalVariable(name: "v", scope: !1060, file: !10, line: 108, type: !116)
!1062 = !DILocation(line: 108, column: 6, scope: !1055)
!1063 = !DILocation(line: 108, column: 24, scope: !1060)
!1064 = !DILocation(line: 109, column: 4, scope: !1060)
!1065 = !DILocation(line: 109, column: 15, scope: !1060)
!1066 = !DILocation(line: 108, column: 38, scope: !1060)
!1067 = distinct !DISubprogram(name: "middleware.ObserveResponse..1command_line_arguments.ObserverChain", linkageName: "command_line_arguments.ObserverChain.ObserveResponse", scope: null, file: !10, line: 113, type: !1068, isLocal: false, isDefinition: true, scopeLine: 113, isOptimized: false, unit: !1, retainedNodes: !3)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!41, !1003, !1003, !465, !475}
!1070 = !DILocalVariable(name: "c", arg: 1, scope: !1067, file: !10, line: 113, type: !1003)
!1071 = !DILocation(line: 113, column: 1, scope: !1067)
!1072 = !DILocalVariable(name: "r", arg: 2, scope: !1067, file: !10, line: 113, type: !465)
!1073 = !DILocation(line: 113, column: 41, scope: !1067)
!1074 = !DILocalVariable(name: "a", arg: 3, scope: !1067, file: !10, line: 113, type: !475)
!1075 = !DILocation(line: 113, column: 52, scope: !1067)
!1076 = !DILocation(line: 114, column: 9, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1067, file: !10, line: 113, column: 1)
!1078 = !DILocation(line: 114, column: 15, scope: !1077)
!1079 = !DILocalVariable(name: "it", scope: !1077, file: !10, line: 114, type: !851)
!1080 = !DILocation(line: 114, column: 2, scope: !1067)
!1081 = !DILocation(line: 115, column: 13, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1077, file: !10, line: 115, column: 2)
!1083 = !DILocalVariable(name: "v", scope: !1082, file: !10, line: 115, type: !116)
!1084 = !DILocation(line: 115, column: 6, scope: !1077)
!1085 = !DILocation(line: 115, column: 24, scope: !1082)
!1086 = !DILocation(line: 116, column: 4, scope: !1082)
!1087 = !DILocation(line: 116, column: 15, scope: !1082)
!1088 = !DILocation(line: 115, column: 38, scope: !1082)
!1089 = distinct !DISubprogram(name: "middleware.Remove..1command_line_arguments.ObserverChain", linkageName: "command_line_arguments.ObserverChain.Remove", scope: null, file: !10, line: 90, type: !1090, isLocal: false, isDefinition: true, scopeLine: 90, isOptimized: false, unit: !1, retainedNodes: !3)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!13, !1003, !1003, !55}
!1092 = !DILocalVariable(name: "c", arg: 1, scope: !1089, file: !10, line: 90, type: !1003)
!1093 = !DILocation(line: 90, column: 1, scope: !1089)
!1094 = !DILocalVariable(name: "id", arg: 2, scope: !1089, file: !10, line: 90, type: !55)
!1095 = !DILocation(line: 90, column: 32, scope: !1089)
!1096 = !DILocation(line: 91, column: 10, scope: !1089)
!1097 = !DILocation(line: 91, column: 16, scope: !1089)
!1098 = !DILocation(line: 91, column: 2, scope: !1089)
!1099 = distinct !DISubprogram(name: "middleware.Update..1command_line_arguments.ObserverChain", linkageName: "command_line_arguments.ObserverChain.Update", scope: null, file: !10, line: 94, type: !1001, isLocal: false, isDefinition: true, scopeLine: 94, isOptimized: false, unit: !1, retainedNodes: !3)
!1100 = !DILocalVariable(name: "c", arg: 1, scope: !1099, file: !10, line: 94, type: !1003)
!1101 = !DILocation(line: 94, column: 1, scope: !1099)
!1102 = !DILocalVariable(name: "id", arg: 2, scope: !1099, file: !10, line: 94, type: !55)
!1103 = !DILocation(line: 94, column: 32, scope: !1099)
!1104 = !DILocalVariable(name: "o", arg: 3, scope: !1099, file: !10, line: 94, type: !1007)
!1105 = !DILocation(line: 94, column: 43, scope: !1099)
!1106 = !DILocation(line: 95, column: 10, scope: !1099)
!1107 = !DILocation(line: 95, column: 31, scope: !1099)
!1108 = !DILocation(line: 95, column: 16, scope: !1099)
!1109 = !DILocation(line: 95, column: 2, scope: !1099)
!1110 = distinct !DISubprogram(name: "middleware.Upsert..1command_line_arguments.ObserverChain", linkageName: "command_line_arguments.ObserverChain.Upsert", scope: null, file: !10, line: 86, type: !1111, isLocal: false, isDefinition: true, scopeLine: 86, isOptimized: false, unit: !1, retainedNodes: !3)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!41, !1003, !1003, !55, !1007}
!1113 = !DILocalVariable(name: "c", arg: 1, scope: !1110, file: !10, line: 86, type: !1003)
!1114 = !DILocation(line: 86, column: 1, scope: !1110)
!1115 = !DILocalVariable(name: "id", arg: 2, scope: !1110, file: !10, line: 86, type: !55)
!1116 = !DILocation(line: 86, column: 32, scope: !1110)
!1117 = !DILocalVariable(name: "o", arg: 3, scope: !1110, file: !10, line: 86, type: !1007)
!1118 = !DILocation(line: 86, column: 43, scope: !1110)
!1119 = !DILocation(line: 87, column: 3, scope: !1110)
!1120 = !DILocation(line: 87, column: 24, scope: !1110)
!1121 = !DILocation(line: 87, column: 9, scope: !1110)
!1122 = distinct !DISubprogram(name: "middleware.NewObserverChain", linkageName: "command_line_arguments.NewObserverChain", scope: null, file: !10, line: 76, type: !1123, isLocal: false, isDefinition: true, scopeLine: 76, isOptimized: false, unit: !1, retainedNodes: !3)
