; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22netutils\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22base64\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./buffer.go", directory: "/home/wangcong/go_path/src/github.com/vulcand/vulcan/netutils")
!3 = !{}
!4 = !{!5, !9, !83}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "io.EOF", linkageName: "io.EOF", scope: !1, file: !11, line: 6, type: !12, isLocal: false, isDefinition: true)
!11 = !DIFile(filename: "buffer.go", directory: ".")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !13)
!13 = !{!14, !82}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !17, size: 128, align: 8, elements: !18)
!17 = !DIFile(filename: "", directory: "")
!18 = !{!19, !78}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 1, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !22)
!22 = !{!23, !25, !26, !27, !29, !30, !31, !41, !50, !52, !59, !77}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !24, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 160)
!28 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 168)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 176)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !32, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !34)
!34 = !{!35}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!24, !39, !24}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIBasicType(name: "void")
!41 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !42, size: 64, align: 64, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !44)
!44 = !{!45}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !39, !39}
!49 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !51, size: 64, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !53, size: 64, align: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !55)
!55 = !{!56, !57}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !51, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !60, size: 64, align: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !62)
!62 = !{!63, !64, !65}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !53, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !53, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !66, size: 192, align: 64, offset: 128)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !17, size: 192, align: 8, elements: !67)
!67 = !{!68, !75, !76}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !71)
!71 = !{!63, !64, !72, !73, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !17, line: 1, baseType: !58, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !17, line: 1, baseType: !58, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !17, line: 1, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!54, !39}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 64)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "encoding_base64.StdEncoding", linkageName: "encoding_base64.StdEncoding", scope: !1, file: !85, line: 5, type: !86, isLocal: false, isDefinition: true)
!85 = !DIFile(filename: "netutils.go", directory: ".")
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "Encoding", file: !85, line: 5, size: 2624, align: 8, elements: !88)
!88 = !{!89, !93, !97, !99}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "encode", file: !85, line: 5, baseType: !90, size: 512, align: 8)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 512, align: 1, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "decodeMap", file: !85, line: 5, baseType: !94, size: 2048, align: 8, offset: 512)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 2048, align: 1, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "padChar", file: !85, line: 5, baseType: !98, size: 32, align: 32, offset: 2560)
!98 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "strict", file: !85, line: 5, baseType: !49, size: 8, align: 8, offset: 2592)
!100 = distinct !DISubprogram(name: "netutils.Close..1command_line_arguments.multiReaderSeek", linkageName: "command_line_arguments.multiReaderSeek.Close", scope: null, file: !11, line: 58, type: !101, isLocal: false, isDefinition: true, scopeLine: 58, isOptimized: false, unit: !1, retainedNodes: !3)
!101 = !DISubroutineType(types: !102)
!102 = !{!12, !103, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.multiReaderSeek", file: !11, line: 34, size: 448, align: 8, elements: !105)
!105 = !{!106, !108, !140, !149}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "length", file: !11, line: 35, baseType: !107, size: 64, align: 64)
!107 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "readers", file: !11, line: 36, baseType: !109, size: 192, align: 64, offset: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ReadSeeker,int,int}", file: !17, size: 192, align: 8, elements: !110)
!110 = !{!111, !75, !76}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadSeeker", file: !11, line: 6, size: 128, align: 8, elements: !114)
!114 = !{!115, !139}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 6, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,int64,int)struct{int64,error}}", file: !17, size: 192, align: 8, elements: !118)
!118 = !{!119, !120, !131}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 6, baseType: !20, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !17, line: 6, baseType: !121, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !39, !128}
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !17, size: 192, align: 8, elements: !125)
!125 = !{!126, !127}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !17, line: 4, baseType: !58, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !17, line: 4, baseType: !12, size: 128, align: 64, offset: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !17, size: 192, align: 8, elements: !129)
!129 = !{!130, !75, !76}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !51, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Seek", file: !17, line: 6, baseType: !132, size: 64, align: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!135, !39, !107, !58}
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !17, size: 192, align: 8, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 6, baseType: !107, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 6, baseType: !12, size: 128, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !11, line: 1, baseType: !39, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mr", file: !11, line: 37, baseType: !141, size: 128, align: 64, offset: 256)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !11, line: 4, size: 128, align: 8, elements: !142)
!142 = !{!143, !139}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 4, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !17, size: 128, align: 8, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 4, baseType: !20, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !17, line: 4, baseType: !121, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", file: !11, line: 38, baseType: !150, size: 64, align: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !11, line: 41, size: 64, align: 8, elements: !152)
!152 = !{!153}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !11, line: 41, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!12}
!157 = !DILocalVariable(name: "mr", arg: 1, scope: !100, file: !11, line: 58, type: !103)
!158 = !DILocation(line: 58, column: 1, scope: !100)
!159 = !DILocation(line: 59, column: 7, scope: !100)
!160 = !DILocation(line: 59, column: 16, scope: !100)
!161 = !DILocalVariable(name: "err", scope: !100, file: !11, line: 58, type: !12)
!162 = !DILocation(line: 58, column: 37, scope: !100)
!163 = !DILocation(line: 62, column: 2, scope: !100)
!164 = !DILocation(line: 60, column: 12, scope: !100)
!165 = !DILocation(line: 60, column: 3, scope: !100)
!166 = distinct !DISubprogram(name: "netutils.Read..1command_line_arguments.multiReaderSeek", linkageName: "command_line_arguments.multiReaderSeek.Read", scope: null, file: !11, line: 88, type: !167, isLocal: false, isDefinition: true, scopeLine: 88, isOptimized: false, unit: !1, retainedNodes: !3)
!167 = !DISubroutineType(types: !168)
!168 = !{!169, !103, !103, !128}
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !17, size: 192, align: 8, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !17, line: 88, baseType: !58, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !17, line: 88, baseType: !12, size: 128, align: 64, offset: 64)
!173 = !DILocalVariable(name: "p", arg: 2, scope: !166, file: !11, line: 88, type: !128)
!174 = !DILocation(line: 88, column: 33, scope: !166)
!175 = !DILocalVariable(name: "mr", arg: 1, scope: !166, file: !11, line: 88, type: !103)
!176 = !DILocation(line: 88, column: 1, scope: !166)
!177 = !DILocalVariable(name: "n", scope: !166, file: !11, line: 88, type: !58)
!178 = !DILocation(line: 88, column: 44, scope: !166)
!179 = !DILocation(line: 89, column: 11, scope: !166)
!180 = !DILocation(line: 89, column: 14, scope: !166)
!181 = !DILocation(line: 89, column: 2, scope: !166)
!182 = distinct !DISubprogram(name: "netutils.Seek..1command_line_arguments.multiReaderSeek", linkageName: "command_line_arguments.multiReaderSeek.Seek", scope: null, file: !11, line: 96, type: !183, isLocal: false, isDefinition: true, scopeLine: 96, isOptimized: false, unit: !1, retainedNodes: !3)
!183 = !DISubroutineType(types: !184)
!184 = !{!135, !103, !103, !107, !58}
!185 = !DILocalVariable(name: "mr", arg: 1, scope: !182, file: !11, line: 96, type: !103)
!186 = !DILocation(line: 96, column: 1, scope: !182)
!187 = !DILocalVariable(name: "offset", arg: 2, scope: !182, file: !11, line: 96, type: !107)
!188 = !DILocation(line: 96, column: 33, scope: !182)
!189 = !DILocalVariable(name: "whence", arg: 3, scope: !182, file: !11, line: 96, type: !58)
!190 = !DILocation(line: 96, column: 47, scope: !182)
!191 = !DILocalVariable(name: "$ret5", scope: !182, file: !11, line: 96, type: !107)
!192 = !DILocation(line: 96, column: 60, scope: !182)
!193 = !DILocation(line: 100, column: 12, scope: !194)
!194 = distinct !DILexicalBlock(scope: !182, file: !11, line: 96, column: 1)
!195 = !DILocation(line: 101, column: 17, scope: !194)
!196 = !DILocalVariable(name: "$ret6", scope: !182, file: !11, line: 96, type: !12)
!197 = !DILocation(line: 96, column: 67, scope: !182)
!198 = !DILocation(line: 101, column: 3, scope: !194)
!199 = !DILocation(line: 104, column: 12, scope: !194)
!200 = !DILocation(line: 105, column: 17, scope: !194)
!201 = !DILocation(line: 105, column: 3, scope: !194)
!202 = !DILocation(line: 108, column: 27, scope: !203)
!203 = distinct !DILexicalBlock(scope: !194, file: !11, line: 108, column: 2)
!204 = !DILocation(line: 108, column: 2, scope: !203)
!205 = !DILocalVariable(name: "seeker", scope: !203, file: !11, line: 108, type: !113)
!206 = !DILocation(line: 108, column: 6, scope: !194)
!207 = !DILocation(line: 109, column: 9, scope: !203)
!208 = !DILocation(line: 112, column: 33, scope: !194)
!209 = !DILocation(line: 112, column: 9, scope: !194)
!210 = !DILocalVariable(name: "i", scope: !211, file: !11, line: 113, type: !58)
!211 = distinct !DILexicalBlock(scope: !194, file: !11, line: 113, column: 2)
!212 = !DILocation(line: 113, column: 6, scope: !194)
!213 = !DILocation(line: 113, column: 2, scope: !211)
!214 = !DILocalVariable(name: "arg", scope: !211, file: !11, line: 113, type: !113)
!215 = !DILocation(line: 114, column: 3, scope: !211)
!216 = !DILocation(line: 114, column: 6, scope: !211)
!217 = !DILocation(line: 114, column: 12, scope: !211)
!218 = !DILocation(line: 114, column: 15, scope: !211)
!219 = !DILocation(line: 114, column: 10, scope: !211)
!220 = !DILocalVariable(name: "ior", scope: !194, file: !11, line: 112, type: !221)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Reader,int,int}", file: !17, size: 192, align: 8, elements: !222)
!222 = !{!223, !75, !76}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!225 = !DILocation(line: 112, column: 2, scope: !182)
!226 = !DILocation(line: 116, column: 13, scope: !194)
!227 = !DILocation(line: 116, column: 4, scope: !194)
!228 = !DILocation(line: 116, column: 8, scope: !194)
!229 = !DILocation(line: 118, column: 2, scope: !194)
!230 = distinct !DISubprogram(name: "netutils.TotalSize..1command_line_arguments.multiReaderSeek", linkageName: "command_line_arguments.multiReaderSeek.TotalSize", scope: null, file: !11, line: 92, type: !231, isLocal: false, isDefinition: true, scopeLine: 92, isOptimized: false, unit: !1, retainedNodes: !3)
!231 = !DISubroutineType(types: !232)
!232 = !{!135, !103, !103}
!233 = !DILocalVariable(name: "mr", arg: 1, scope: !230, file: !11, line: 92, type: !103)
!234 = !DILocation(line: 92, column: 1, scope: !230)
!235 = !DILocalVariable(name: "$ret3", scope: !230, file: !11, line: 92, type: !107)
!236 = !DILocation(line: 92, column: 41, scope: !230)
!237 = !DILocation(line: 93, column: 11, scope: !230)
!238 = !DILocation(line: 93, column: 2, scope: !230)
!239 = distinct !DISubprogram(name: "netutils.WriteTo..1command_line_arguments.multiReaderSeek", linkageName: "command_line_arguments.multiReaderSeek.WriteTo", scope: null, file: !11, line: 65, type: !240, isLocal: false, isDefinition: true, scopeLine: 65, isOptimized: false, unit: !1, retainedNodes: !3)
!240 = !DISubroutineType(types: !241)
!241 = !{!135, !103, !103, !242}
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !11, line: 4, size: 128, align: 8, elements: !243)
!243 = !{!244, !139}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 4, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !17, size: 128, align: 8, elements: !247)
!247 = !{!147, !248}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !17, line: 4, baseType: !121, size: 64, align: 64, offset: 64)
!249 = !DILocalVariable(name: "mr", arg: 1, scope: !239, file: !11, line: 65, type: !103)
!250 = !DILocation(line: 65, column: 1, scope: !239)
!251 = !DILocalVariable(name: "w", arg: 2, scope: !239, file: !11, line: 65, type: !242)
!252 = !DILocation(line: 65, column: 36, scope: !239)
!253 = !DILocalVariable(name: "$ret1", scope: !239, file: !11, line: 65, type: !107)
!254 = !DILocation(line: 65, column: 50, scope: !239)
!255 = !DILocation(line: 66, column: 7, scope: !256)
!256 = distinct !DILexicalBlock(scope: !239, file: !11, line: 65, column: 1)
!257 = !DILocalVariable(name: "total", scope: !256, file: !11, line: 67, type: !107)
!258 = !DILocation(line: 67, column: 6, scope: !239)
!259 = !DILocation(line: 69, column: 18, scope: !260)
!260 = distinct !DILexicalBlock(scope: !256, file: !11, line: 68, column: 6)
!261 = !DILocalVariable(name: "b", scope: !256, file: !11, line: 66, type: !128)
!262 = !DILocation(line: 66, column: 2, scope: !239)
!263 = !DILocalVariable(name: "n", scope: !260, file: !11, line: 69, type: !58)
!264 = !DILocation(line: 69, column: 3, scope: !256)
!265 = !DILocalVariable(name: "err", scope: !260, file: !11, line: 69, type: !12)
!266 = !DILocation(line: 71, column: 8, scope: !260)
!267 = !DILocation(line: 69, column: 15, scope: !260)
!268 = !DILocation(line: 72, column: 24, scope: !269)
!269 = distinct !DILexicalBlock(scope: !260, file: !11, line: 71, column: 12)
!270 = !DILocation(line: 72, column: 25, scope: !269)
!271 = !DILocation(line: 79, column: 10, scope: !260)
!272 = !DILocation(line: 72, column: 17, scope: !269)
!273 = !DILocalVariable(name: "nw", scope: !269, file: !11, line: 72, type: !58)
!274 = !DILocation(line: 72, column: 4, scope: !260)
!275 = !DILocalVariable(name: "errw", scope: !269, file: !11, line: 72, type: !12)
!276 = !DILocation(line: 73, column: 10, scope: !269)
!277 = !DILocation(line: 75, column: 10, scope: !269)
!278 = !DILocation(line: 75, column: 23, scope: !269)
!279 = !DILocation(line: 76, column: 5, scope: !269)
!280 = !DILocalVariable(name: "$ret2", scope: !239, file: !11, line: 65, type: !12)
!281 = !DILocation(line: 65, column: 57, scope: !239)
!282 = !DILocation(line: 80, column: 11, scope: !260)
!283 = !DILocation(line: 0, scope: !260)
!284 = !DILocation(line: 81, column: 5, scope: !260)
!285 = !DILocation(line: 83, column: 4, scope: !260)
!286 = distinct !DISubprogram(name: "netutils.NewMultiReaderSeeker", linkageName: "command_line_arguments.NewMultiReaderSeeker", scope: null, file: !11, line: 43, type: !287, isLocal: false, isDefinition: true, scopeLine: 43, isOptimized: false, unit: !1, retainedNodes: !3)
!287 = !DISubroutineType(types: !288)
!288 = !{!103, !107, !150, !109}
!289 = !DILocalVariable(name: "readers", arg: 3, scope: !286, file: !11, line: 43, type: !109)
!290 = !DILocation(line: 43, column: 62, scope: !286)
!291 = !DILocalVariable(name: "length", arg: 1, scope: !286, file: !11, line: 43, type: !107)
!292 = !DILocation(line: 43, column: 27, scope: !286)
!293 = !DILocalVariable(name: "cleanup", arg: 2, scope: !286, file: !11, line: 43, type: !150)
!294 = !DILocation(line: 43, column: 41, scope: !286)
!295 = !DILocalVariable(name: "$ret0", scope: !286, file: !11, line: 43, type: !103)
!296 = !DILocation(line: 43, column: 88, scope: !286)
!297 = !DILocation(line: 44, column: 37, scope: !298)
!298 = distinct !DILexicalBlock(scope: !286, file: !11, line: 43, column: 1)
!299 = !DILocation(line: 44, column: 15, scope: !298)
!300 = !DILocalVariable(name: "i", scope: !301, file: !11, line: 45, type: !58)
!301 = distinct !DILexicalBlock(scope: !298, file: !11, line: 45, column: 2)
!302 = !DILocation(line: 45, column: 6, scope: !298)
!303 = !DILocation(line: 45, column: 2, scope: !301)
!304 = !DILocalVariable(name: "r", scope: !301, file: !11, line: 45, type: !113)
!305 = !DILocation(line: 47, column: 3, scope: !301)
!306 = !DILocation(line: 47, column: 12, scope: !301)
!307 = !DILocation(line: 47, column: 18, scope: !301)
!308 = !DILocation(line: 47, column: 19, scope: !301)
!309 = !DILocation(line: 47, column: 16, scope: !301)
!310 = !DILocalVariable(name: "converted", scope: !298, file: !11, line: 44, type: !221)
!311 = !DILocation(line: 44, column: 2, scope: !286)
!312 = !DILocation(line: 53, column: 15, scope: !298)
!313 = !DILocation(line: 50, column: 9, scope: !298)
!314 = !DILocation(line: 50, column: 10, scope: !298)
!315 = !DILocation(line: 50, column: 2, scope: !298)
!316 = distinct !DISubprogram(name: "netutils.NewBodyBuffer", linkageName: "command_line_arguments.NewBodyBuffer", scope: null, file: !11, line: 129, type: !317, isLocal: false, isDefinition: true, scopeLine: 129, isOptimized: false, unit: !1, retainedNodes: !3)
!317 = !DISubroutineType(types: !318)
!318 = !{!319, !141}
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{MultiReader,error}", file: !17, size: 256, align: 8, elements: !320)
!320 = !{!321, !347}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 129, baseType: !322, size: 128, align: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiReader", file: !11, line: 13, size: 128, align: 8, elements: !323)
!323 = !{!324, !139}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 13, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,int64,int)struct{int64,error},*func(*void)struct{int64,error},*func(*void,Writer)struct{int64,error}}", file: !17, size: 384, align: 8, elements: !327)
!327 = !{!328, !329, !333, !334, !335, !339}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 13, baseType: !20, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !17, line: 13, baseType: !330, size: 64, align: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!12, !39}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !17, line: 13, baseType: !121, size: 64, align: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Seek", file: !17, line: 13, baseType: !132, size: 64, align: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "TotalSize", file: !17, line: 13, baseType: !336, size: 64, align: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!135, !39}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "WriteTo", file: !17, line: 13, baseType: !340, size: 64, align: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!343, !39, !242}
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !17, size: 192, align: 8, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !17, line: 6, baseType: !107, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !17, line: 6, baseType: !12, size: 128, align: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 129, baseType: !12, size: 128, align: 64, offset: 128)
!348 = !DILocalVariable(name: "input", arg: 1, scope: !316, file: !11, line: 129, type: !141)
!349 = !DILocation(line: 129, column: 20, scope: !316)
!350 = !DILocation(line: 130, column: 9, scope: !316)
!351 = !DILocation(line: 130, column: 2, scope: !316)
!352 = distinct !DISubprogram(name: "netutils.NewBodyBufferWithOptions", linkageName: "command_line_arguments.NewBodyBufferWithOptions", scope: null, file: !11, line: 137, type: !353, isLocal: false, isDefinition: true, scopeLine: 137, isOptimized: false, unit: !1, retainedNodes: !3)
!353 = !DISubroutineType(types: !354)
!354 = !{!319, !141, !355}
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "BodyBufferOptions", file: !11, line: 121, size: 128, align: 8, elements: !356)
!356 = !{!357, !358}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "MemBufferBytes", file: !11, line: 124, baseType: !107, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "MaxSizeBytes", file: !11, line: 126, baseType: !107, size: 64, align: 64, offset: 64)
!359 = !DILocalVariable(name: "input", arg: 1, scope: !352, file: !11, line: 137, type: !141)
!360 = !DILocation(line: 137, column: 31, scope: !352)
!361 = !DILocalVariable(name: "o", arg: 2, scope: !352, file: !11, line: 137, type: !355)
!362 = !DILocation(line: 137, column: 48, scope: !352)
!363 = !DILocation(line: 138, column: 15, scope: !364)
!364 = distinct !DILexicalBlock(scope: !352, file: !11, line: 137, column: 1)
!365 = !DILocation(line: 138, column: 19, scope: !364)
!366 = !DILocalVariable(name: "memReader", scope: !364, file: !11, line: 138, type: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "LimitedReader", file: !11, line: 6, size: 192, align: 8, elements: !369)
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "R", file: !11, line: 6, baseType: !141, size: 128, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "N", file: !11, line: 6, baseType: !107, size: 64, align: 64, offset: 128)
!372 = !DILocation(line: 138, column: 2, scope: !352)
!373 = !DILocation(line: 142, column: 13, scope: !364)
!374 = !DILocation(line: 144, column: 32, scope: !364)
!375 = !DILocation(line: 144, column: 24, scope: !364)
!376 = !DILocalVariable(name: "err", scope: !364, file: !11, line: 144, type: !12)
!377 = !DILocation(line: 144, column: 2, scope: !352)
!378 = !DILocation(line: 145, column: 9, scope: !364)
!379 = !DILocalVariable(name: "$ret9", scope: !352, file: !11, line: 137, type: !322)
!380 = !DILocation(line: 137, column: 70, scope: !352)
!381 = !DILocalVariable(name: "$ret10", scope: !352, file: !11, line: 137, type: !12)
!382 = !DILocation(line: 137, column: 83, scope: !352)
!383 = !DILocation(line: 146, column: 3, scope: !364)
!384 = !DILocalVariable(name: "buffer", scope: !364, file: !11, line: 144, type: !128)
!385 = !DILocation(line: 148, column: 34, scope: !364)
!386 = !DILocation(line: 148, column: 12, scope: !364)
!387 = !DILocation(line: 148, column: 10, scope: !364)
!388 = !DILocation(line: 150, column: 6, scope: !364)
!389 = !DILocalVariable(name: "file", scope: !364, file: !11, line: 150, type: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !11, line: 7, size: 64, align: 8, elements: !393)
!393 = !{!394}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !11, line: 7, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !11, line: 7, size: 640, align: 8, elements: !397)
!397 = !{!398, !429, !430, !438, !439}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !11, line: 7, baseType: !399, size: 384, align: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !11, line: 7, size: 384, align: 8, elements: !400)
!400 = !{!401, !408, !409, !413, !424, !425, !426, !427, !428}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !11, line: 7, baseType: !402, size: 128, align: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !11, line: 7, size: 128, align: 8, elements: !403)
!403 = !{!404, !406, !407}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !11, line: 7, baseType: !405, size: 64, align: 64)
!405 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !11, line: 7, baseType: !8, size: 32, align: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !11, line: 7, baseType: !8, size: 32, align: 32, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !11, line: 7, baseType: !58, size: 64, align: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !11, line: 7, baseType: !410, size: 64, align: 64, offset: 192)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !11, line: 7, size: 64, align: 8, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !11, line: 7, baseType: !24, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !11, line: 7, baseType: !414, size: 64, align: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !17, size: 192, align: 8, elements: !416)
!416 = !{!417, !75, !76}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !11, line: 7, size: 128, align: 8, elements: !420)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !11, line: 7, baseType: !51, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !11, line: 7, baseType: !423, size: 64, align: 64, offset: 64)
!423 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !11, line: 7, baseType: !8, size: 32, align: 32, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !11, line: 7, baseType: !49, size: 8, align: 8, offset: 352)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !11, line: 7, baseType: !49, size: 8, align: 8, offset: 360)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !11, line: 7, baseType: !49, size: 8, align: 8, offset: 368)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !11, line: 7, baseType: !49, size: 8, align: 8, offset: 376)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !11, line: 7, baseType: !54, size: 128, align: 64, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !11, line: 7, baseType: !431, size: 64, align: 64, offset: 512)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !11, line: 7, size: 256, align: 8, elements: !433)
!433 = !{!434, !435}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !11, line: 7, baseType: !128, size: 192, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !11, line: 7, baseType: !436, size: 64, align: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !11, line: 7, align: 8, elements: !3)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !11, line: 7, baseType: !49, size: 8, align: 8, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !11, line: 7, baseType: !49, size: 8, align: 8, offset: 584)
!440 = !DILocation(line: 150, column: 6, scope: !352)
!441 = !DILocation(line: 152, column: 26, scope: !364)
!442 = !DILocalVariable(name: "totalBytes", scope: !364, file: !11, line: 152, type: !107)
!443 = !DILocation(line: 152, column: 2, scope: !352)
!444 = !DILocation(line: 153, column: 14, scope: !364)
!445 = !DILocation(line: 153, column: 17, scope: !364)
!446 = !DILocation(line: 154, column: 22, scope: !447)
!447 = distinct !DILexicalBlock(scope: !364, file: !11, line: 153, column: 22)
!448 = !DILocation(line: 154, column: 13, scope: !447)
!449 = !DILocalVariable(name: "cleanupFn", scope: !364, file: !11, line: 174, type: !150)
!450 = !DILocation(line: 174, column: 6, scope: !352)
!451 = !DILocation(line: 175, column: 5, scope: !364)
!452 = !DILocation(line: 175, column: 10, scope: !364)
!453 = !DILocation(line: 155, column: 10, scope: !447)
!454 = !DILocation(line: 156, column: 4, scope: !447)
!455 = !DILocation(line: 158, column: 13, scope: !447)
!456 = !DILocation(line: 158, column: 17, scope: !447)
!457 = !DILocation(line: 158, column: 6, scope: !447)
!458 = !DILocalVariable(name: "readSrc", scope: !447, file: !11, line: 160, type: !141)
!459 = !DILocation(line: 160, column: 3, scope: !364)
!460 = !DILocation(line: 161, column: 21, scope: !447)
!461 = !DILocation(line: 162, column: 55, scope: !447)
!462 = !DILocation(line: 162, column: 14, scope: !447)
!463 = !DILocation(line: 162, column: 15, scope: !447)
!464 = !DILocation(line: 162, column: 12, scope: !447)
!465 = !DILocation(line: 165, column: 32, scope: !447)
!466 = !DILocation(line: 165, column: 27, scope: !447)
!467 = !DILocalVariable(name: "err", scope: !447, file: !11, line: 165, type: !12)
!468 = !DILocation(line: 165, column: 3, scope: !364)
!469 = !DILocation(line: 166, column: 10, scope: !447)
!470 = !DILocation(line: 167, column: 4, scope: !447)
!471 = !DILocalVariable(name: "writtenBytes", scope: !447, file: !11, line: 165, type: !107)
!472 = !DILocation(line: 169, column: 14, scope: !447)
!473 = !DILocation(line: 170, column: 3, scope: !447)
!474 = !DILocation(line: 170, column: 7, scope: !447)
!475 = !DILocation(line: 171, column: 13, scope: !447)
!476 = !DILocation(line: 171, column: 29, scope: !447)
!477 = !DILocation(line: 171, column: 11, scope: !447)
!478 = !DILocation(line: 176, column: 15, scope: !364)
!479 = !DILocation(line: 176, column: 13, scope: !364)
!480 = !DILocalVariable(name: "readers", scope: !364, file: !11, line: 142, type: !109)
!481 = !DILocation(line: 142, column: 2, scope: !352)
!482 = !DILocation(line: 181, column: 9, scope: !364)
!483 = !DILocation(line: 181, column: 2, scope: !364)
!484 = distinct !DISubprogram(name: "netutils.Read..1command_line_arguments.MaxReader", linkageName: "command_line_arguments.MaxReader.Read", scope: null, file: !11, line: 191, type: !485, isLocal: false, isDefinition: true, scopeLine: 191, isOptimized: false, unit: !1, retainedNodes: !3)
!485 = !DISubroutineType(types: !486)
!486 = !{!487, !491, !491, !128}
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !17, size: 192, align: 8, elements: !488)
!488 = !{!489, !490}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 7, baseType: !58, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 7, baseType: !12, size: 128, align: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaxReader", file: !11, line: 185, size: 256, align: 8, elements: !493)
!493 = !{!494, !495, !496}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "R", file: !11, line: 186, baseType: !141, size: 128, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "N", file: !11, line: 187, baseType: !107, size: 64, align: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Max", file: !11, line: 188, baseType: !107, size: 64, align: 64, offset: 192)
!497 = !DILocalVariable(name: "p", arg: 2, scope: !484, file: !11, line: 191, type: !128)
!498 = !DILocation(line: 191, column: 26, scope: !484)
!499 = !DILocalVariable(name: "r", arg: 1, scope: !484, file: !11, line: 191, type: !491)
!500 = !DILocation(line: 191, column: 1, scope: !484)
!501 = !DILocalVariable(name: "$ret12", scope: !484, file: !11, line: 191, type: !58)
!502 = !DILocation(line: 191, column: 37, scope: !484)
!503 = !DILocation(line: 192, column: 21, scope: !504)
!504 = distinct !DILexicalBlock(scope: !484, file: !11, line: 191, column: 1)
!505 = !DILocation(line: 192, column: 23, scope: !504)
!506 = !DILocalVariable(name: "readBytes", scope: !504, file: !11, line: 192, type: !58)
!507 = !DILocation(line: 192, column: 2, scope: !484)
!508 = !DILocalVariable(name: "err", scope: !504, file: !11, line: 192, type: !12)
!509 = !DILocation(line: 193, column: 9, scope: !504)
!510 = !DILocation(line: 193, column: 23, scope: !504)
!511 = !DILocalVariable(name: "$ret13", scope: !484, file: !11, line: 191, type: !12)
!512 = !DILocation(line: 191, column: 42, scope: !484)
!513 = !DILocation(line: 194, column: 3, scope: !504)
!514 = !DILocation(line: 197, column: 3, scope: !504)
!515 = !DILocation(line: 197, column: 6, scope: !504)
!516 = !DILocation(line: 198, column: 12, scope: !504)
!517 = !DILocation(line: 198, column: 9, scope: !504)
!518 = !DILocation(line: 201, column: 2, scope: !504)
!519 = !DILocation(line: 199, column: 21, scope: !504)
!520 = !DILocation(line: 199, column: 22, scope: !504)
!521 = !DILocation(line: 199, column: 3, scope: !504)
!522 = distinct !DISubprogram(name: "netutils.command_line_arguments.MaxReader..hash", linkageName: "command_line_arguments.command_line_arguments.MaxReader..hash", scope: null, file: !7, line: 1, type: !37, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!523 = !DILocalVariable(name: "key", arg: 1, scope: !522, file: !7, line: 1, type: !39)
!524 = !DILocation(line: 1, column: 1, scope: !522)
!525 = !DILocalVariable(name: "seed", arg: 2, scope: !522, file: !7, line: 1, type: !24)
!526 = !DILocalVariable(name: "$ret29", scope: !522, file: !7, line: 1, type: !24)
!527 = distinct !DISubprogram(name: "netutils.command_line_arguments.MaxReader..eq", linkageName: "command_line_arguments.command_line_arguments.MaxReader..eq", scope: null, file: !7, line: 1, type: !47, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!528 = !DILocalVariable(name: "key1", arg: 1, scope: !527, file: !7, line: 1, type: !39)
!529 = !DILocation(line: 1, column: 1, scope: !527)
!530 = !DILocalVariable(name: "key2", arg: 2, scope: !527, file: !7, line: 1, type: !39)
!531 = !DILocalVariable(name: "$ret30", scope: !527, file: !7, line: 1, type: !49)
!532 = distinct !DISubprogram(name: "netutils.NewBodyBufferWithOptions..func1", scope: null, file: !11, line: 176, type: !155, isLocal: true, isDefinition: true, scopeLine: 176, isOptimized: false, unit: !1, retainedNodes: !3)
!533 = !DILocation(line: 177, column: 4, scope: !532)
!534 = !DILocation(line: 177, column: 8, scope: !532)
!535 = !DILocalVariable(name: "$ret11", scope: !532, file: !11, line: 176, type: !12)
!536 = !DILocation(line: 176, column: 22, scope: !532)
!537 = !DILocation(line: 178, column: 4, scope: !532)
!538 = distinct !DISubprogram(name: "netutils.Error..1command_line_arguments.MaxSizeReachedError", linkageName: "command_line_arguments.MaxSizeReachedError.Error", scope: null, file: !11, line: 208, type: !539, isLocal: false, isDefinition: true, scopeLine: 208, isOptimized: false, unit: !1, retainedNodes: !3)
!539 = !DISubroutineType(types: !540)
!540 = !{!54, !541, !541}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaxSizeReachedError", file: !11, line: 204, size: 64, align: 8, elements: !543)
!543 = !{!544}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "MaxSize", file: !11, line: 205, baseType: !107, size: 64, align: 64)
!545 = !DILocalVariable(name: "e", arg: 1, scope: !538, file: !11, line: 208, type: !541)
!546 = !DILocation(line: 208, column: 1, scope: !538)
!547 = !DILocation(line: 209, column: 13, scope: !538)
!548 = !DILocation(line: 209, column: 2, scope: !538)
!549 = distinct !DISubprogram(name: "netutils.CopyUrl", linkageName: "command_line_arguments.CopyUrl", scope: null, file: !85, line: 14, type: !550, isLocal: false, isDefinition: true, scopeLine: 14, isOptimized: false, unit: !1, retainedNodes: !3)
!550 = !DISubroutineType(types: !551)
!551 = !{!552, !552}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !85, line: 7, size: 1024, align: 8, elements: !554)
!554 = !{!555, !556, !557, !564, !565, !566, !567, !568, !569}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !85, line: 7, baseType: !54, size: 128, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !85, line: 7, baseType: !54, size: 128, align: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !85, line: 7, baseType: !558, size: 64, align: 64, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !85, line: 7, size: 320, align: 8, elements: !560)
!560 = !{!561, !562, !563}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !85, line: 7, baseType: !54, size: 128, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !85, line: 7, baseType: !54, size: 128, align: 64, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !85, line: 7, baseType: !49, size: 8, align: 8, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !85, line: 7, baseType: !54, size: 128, align: 64, offset: 320)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !85, line: 7, baseType: !54, size: 128, align: 64, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !85, line: 7, baseType: !54, size: 128, align: 64, offset: 576)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !85, line: 7, baseType: !49, size: 8, align: 8, offset: 704)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !85, line: 7, baseType: !54, size: 128, align: 64, offset: 768)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !85, line: 7, baseType: !54, size: 128, align: 64, offset: 896)
!570 = !DILocalVariable(name: "in", arg: 1, scope: !549, file: !85, line: 14, type: !552)
!571 = !DILocation(line: 14, column: 14, scope: !549)
!572 = !DILocalVariable(name: "$ret15", scope: !549, file: !85, line: 14, type: !552)
!573 = !DILocation(line: 14, column: 27, scope: !549)
!574 = !DILocation(line: 15, column: 9, scope: !575)
!575 = distinct !DILexicalBlock(scope: !549, file: !85, line: 14, column: 1)
!576 = !DILocalVariable(name: "out", scope: !575, file: !85, line: 15, type: !552)
!577 = !DILocation(line: 15, column: 2, scope: !549)
!578 = !DILocation(line: 16, column: 9, scope: !575)
!579 = !DILocation(line: 16, column: 7, scope: !575)
!580 = !DILocation(line: 17, column: 7, scope: !575)
!581 = !DILocation(line: 17, column: 13, scope: !575)
!582 = !DILocation(line: 18, column: 7, scope: !575)
!583 = !DILocation(line: 20, column: 2, scope: !575)
!584 = !DILocation(line: 18, column: 13, scope: !575)
!585 = distinct !DISubprogram(name: "netutils.RawPath", linkageName: "command_line_arguments.RawPath", scope: null, file: !85, line: 24, type: !586, isLocal: false, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !1, retainedNodes: !3)
!586 = !DISubroutineType(types: !587)
!587 = !{!588, !54}
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !17, size: 256, align: 8, elements: !589)
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 24, baseType: !54, size: 128, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 24, baseType: !12, size: 128, align: 64, offset: 128)
!592 = !DILocalVariable(name: "in", arg: 1, scope: !585, file: !85, line: 24, type: !54)
!593 = !DILocation(line: 24, column: 14, scope: !585)
!594 = !DILocation(line: 25, column: 16, scope: !595)
!595 = distinct !DILexicalBlock(scope: !585, file: !85, line: 24, column: 1)
!596 = !DILocalVariable(name: "u", scope: !595, file: !85, line: 25, type: !552)
!597 = !DILocation(line: 25, column: 2, scope: !585)
!598 = !DILocalVariable(name: "err", scope: !595, file: !85, line: 25, type: !12)
!599 = !DILocation(line: 26, column: 9, scope: !595)
!600 = !DILocalVariable(name: "$ret16", scope: !585, file: !85, line: 24, type: !54)
!601 = !DILocation(line: 24, column: 26, scope: !585)
!602 = !DILocation(line: 27, column: 3, scope: !595)
!603 = !DILocalVariable(name: "$ret17", scope: !585, file: !85, line: 24, type: !12)
!604 = !DILocation(line: 24, column: 34, scope: !585)
!605 = !DILocation(line: 30, column: 6, scope: !595)
!606 = !DILocation(line: 30, column: 14, scope: !595)
!607 = !DILocation(line: 0, scope: !595)
!608 = !DILocation(line: 41, column: 17, scope: !595)
!609 = !DILocation(line: 0, scope: !610)
!610 = distinct !DILexicalBlock(scope: !595, file: !85, line: 34, column: 4)
!611 = !DILocalVariable(name: "path", scope: !595, file: !85, line: 29, type: !54)
!612 = !DILocation(line: 29, column: 2, scope: !585)
!613 = !DILocalVariable(name: "idx", scope: !595, file: !85, line: 41, type: !58)
!614 = !DILocation(line: 41, column: 2, scope: !585)
!615 = !DILocation(line: 42, column: 9, scope: !595)
!616 = !DILocation(line: 32, column: 13, scope: !595)
!617 = !DILocation(line: 32, column: 19, scope: !595)
!618 = !DILocation(line: 35, column: 19, scope: !610)
!619 = !DILocalVariable(name: "vals", scope: !610, file: !85, line: 35, type: !620)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !17, size: 192, align: 8, elements: !621)
!621 = !{!622, !75, !76}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !53, size: 64, align: 64)
!623 = !DILocation(line: 35, column: 3, scope: !595)
!624 = !DILocation(line: 36, column: 16, scope: !610)
!625 = !DILocation(line: 37, column: 19, scope: !610)
!626 = !DILocation(line: 37, column: 4, scope: !610)
!627 = !DILocation(line: 39, column: 14, scope: !610)
!628 = !DILocation(line: 39, column: 8, scope: !610)
!629 = !DILocation(line: 43, column: 3, scope: !595)
!630 = !DILocation(line: 45, column: 13, scope: !595)
!631 = !DILocation(line: 45, column: 2, scope: !595)
!632 = distinct !DISubprogram(name: "netutils.RawURL", linkageName: "command_line_arguments.RawURL", scope: null, file: !85, line: 50, type: !633, isLocal: false, isDefinition: true, scopeLine: 50, isOptimized: false, unit: !1, retainedNodes: !3)
!633 = !DISubroutineType(types: !634)
!634 = !{!54, !635}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !85, line: 7, size: 1984, align: 8, elements: !637)
!637 = !{!638, !639, !640, !641, !642, !643, !657, !666, !678, !679, !680, !681, !682, !683, !684, !690, !691, !692, !693, !884, !887, !900}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !85, line: 7, baseType: !54, size: 128, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !85, line: 7, baseType: !552, size: 64, align: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Proto", file: !85, line: 7, baseType: !54, size: 128, align: 64, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMajor", file: !85, line: 7, baseType: !58, size: 64, align: 64, offset: 320)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMinor", file: !85, line: 7, baseType: !58, size: 64, align: 64, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !85, line: 7, baseType: !644, size: 64, align: 64, offset: 448)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !646)
!646 = !{!647, !648, !649, !650, !652, !653, !654, !655, !656}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !58, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !28, size: 8, align: 8, offset: 72)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !651, size: 16, align: 16, offset: 80)
!651 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !24, size: 64, align: 64, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !39, size: 64, align: 64, offset: 320)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !85, line: 7, baseType: !658, size: 128, align: 64, offset: 512)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !11, line: 6, size: 128, align: 8, elements: !659)
!659 = !{!660, !139}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !11, line: 6, baseType: !661, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !17, size: 192, align: 8, elements: !663)
!663 = !{!119, !664, !665}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !17, line: 6, baseType: !330, size: 64, align: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !17, line: 6, baseType: !121, size: 64, align: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !85, line: 7, baseType: !667, size: 64, align: 64, offset: 640)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !85, line: 7, size: 64, align: 8, elements: !669)
!669 = !{!670}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !85, line: 7, baseType: !671, size: 64, align: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!674}
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !17, size: 256, align: 8, elements: !675)
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 7, baseType: !658, size: 128, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 7, baseType: !12, size: 128, align: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !85, line: 7, baseType: !107, size: 64, align: 64, offset: 704)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !85, line: 7, baseType: !620, size: 192, align: 64, offset: 768)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !85, line: 7, baseType: !49, size: 8, align: 8, offset: 960)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !85, line: 7, baseType: !54, size: 128, align: 64, offset: 1024)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Form", file: !85, line: 7, baseType: !644, size: 64, align: 64, offset: 1152)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "PostForm", file: !85, line: 7, baseType: !644, size: 64, align: 64, offset: 1216)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "MultipartForm", file: !85, line: 7, baseType: !685, size: 64, align: 64, offset: 1280)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", file: !85, line: 7, size: 128, align: 8, elements: !687)
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !85, line: 7, baseType: !644, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !85, line: 7, baseType: !644, size: 64, align: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !85, line: 7, baseType: !644, size: 64, align: 64, offset: 1344)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !85, line: 7, baseType: !54, size: 128, align: 64, offset: 1408)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "RequestURI", file: !85, line: 7, baseType: !54, size: 128, align: 64, offset: 1536)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !85, line: 7, baseType: !694, size: 64, align: 64, offset: 1664)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionState", file: !85, line: 7, size: 1344, align: 8, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704, !872, !877, !882, !883}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !85, line: 7, baseType: !651, size: 16, align: 16)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "HandshakeComplete", file: !85, line: 7, baseType: !49, size: 8, align: 8, offset: 16)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "DidResume", file: !85, line: 7, baseType: !49, size: 8, align: 8, offset: 24)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuite", file: !85, line: 7, baseType: !651, size: 16, align: 16, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocol", file: !85, line: 7, baseType: !54, size: 128, align: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocolIsMutual", file: !85, line: 7, baseType: !49, size: 8, align: 8, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !85, line: 7, baseType: !54, size: 128, align: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "PeerCertificates", file: !85, line: 7, baseType: !705, size: 192, align: 64, offset: 384)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !17, size: 192, align: 8, elements: !706)
!706 = !{!707, !75, !76}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !708, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !85, line: 7, size: 10624, align: 8, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !720, !722, !728, !729, !742, !768, !769, !802, !803, !805, !815, !816, !821, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !846, !851, !852, !853, !854, !865, !866, !867, !868, !869, !870, !871}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !85, line: 7, baseType: !128, size: 192, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !85, line: 7, baseType: !128, size: 192, align: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !85, line: 7, baseType: !128, size: 192, align: 64, offset: 384)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !85, line: 7, baseType: !128, size: 192, align: 64, offset: 576)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !85, line: 7, baseType: !128, size: 192, align: 64, offset: 768)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !85, line: 7, baseType: !128, size: 192, align: 64, offset: 960)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !85, line: 7, baseType: !719, size: 64, align: 64, offset: 1152)
!719 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !85, line: 7, baseType: !721, size: 64, align: 64, offset: 1216)
!721 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !85, line: 7, baseType: !723, size: 128, align: 64, offset: 1280)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "Token", file: !724, line: 5, size: 128, align: 8, elements: !725)
!724 = !DIFile(filename: "response.go", directory: ".")
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !724, line: 1, baseType: !20, size: 64, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !724, line: 1, baseType: !39, size: 64, align: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !85, line: 7, baseType: !58, size: 64, align: 64, offset: 1408)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !85, line: 7, baseType: !730, size: 64, align: 64, offset: 1472)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !85, line: 7, size: 256, align: 8, elements: !732)
!732 = !{!733, !734}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !85, line: 7, baseType: !49, size: 8, align: 8)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !85, line: 7, baseType: !735, size: 192, align: 64, offset: 64)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !85, line: 7, size: 192, align: 8, elements: !736)
!736 = !{!737, !740, !741}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !85, line: 1, baseType: !738, size: 64, align: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !85, line: 1, baseType: !58, size: 64, align: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !85, line: 1, baseType: !58, size: 64, align: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !85, line: 7, baseType: !743, size: 1984, align: 64, offset: 1536)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !85, line: 7, size: 1984, align: 8, elements: !744)
!744 = !{!745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !767}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !85, line: 7, baseType: !620, size: 192, align: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !85, line: 7, baseType: !620, size: 192, align: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !85, line: 7, baseType: !620, size: 192, align: 64, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !85, line: 7, baseType: !620, size: 192, align: 64, offset: 576)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !85, line: 7, baseType: !620, size: 192, align: 64, offset: 768)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !85, line: 7, baseType: !620, size: 192, align: 64, offset: 960)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !85, line: 7, baseType: !620, size: 192, align: 64, offset: 1152)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !85, line: 7, baseType: !54, size: 128, align: 64, offset: 1344)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !85, line: 7, baseType: !54, size: 128, align: 64, offset: 1472)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !85, line: 7, baseType: !755, size: 192, align: 64, offset: 1600)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !17, size: 192, align: 8, elements: !756)
!756 = !{!757, !75, !76}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !758, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !85, line: 7, size: 320, align: 8, elements: !760)
!760 = !{!761, !766}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !85, line: 7, baseType: !762, size: 192, align: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !85, line: 7, size: 192, align: 8, elements: !763)
!763 = !{!764, !740, !741}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !85, line: 1, baseType: !765, size: 64, align: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !85, line: 7, baseType: !723, size: 128, align: 64, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !85, line: 7, baseType: !755, size: 192, align: 64, offset: 1792)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !85, line: 7, baseType: !743, size: 1984, align: 64, offset: 3520)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !85, line: 7, baseType: !770, size: 192, align: 64, offset: 5504)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !11, line: 7, size: 192, align: 8, elements: !771)
!771 = !{!772, !773, !774}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !11, line: 7, baseType: !405, size: 64, align: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !11, line: 7, baseType: !107, size: 64, align: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !11, line: 7, baseType: !775, size: 64, align: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !11, line: 7, size: 704, align: 8, elements: !777)
!777 = !{!778, !779, !788, !799, !800, !801}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !11, line: 7, baseType: !54, size: 128, align: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !11, line: 7, baseType: !780, size: 192, align: 64, offset: 128)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !17, size: 192, align: 8, elements: !781)
!781 = !{!782, !75, !76}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !783, size: 64, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !11, line: 7, size: 256, align: 8, elements: !785)
!785 = !{!778, !786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !11, line: 7, baseType: !58, size: 64, align: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !11, line: 7, baseType: !49, size: 8, align: 8, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !11, line: 7, baseType: !789, size: 192, align: 64, offset: 320)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !17, size: 192, align: 8, elements: !790)
!790 = !{!791, !75, !76}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !792, size: 64, align: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !11, line: 7, size: 128, align: 8, elements: !794)
!794 = !{!795, !796, !797, !798}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !11, line: 7, baseType: !107, size: 64, align: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !11, line: 7, baseType: !28, size: 8, align: 8, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !11, line: 7, baseType: !49, size: 8, align: 8, offset: 72)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !11, line: 7, baseType: !49, size: 8, align: 8, offset: 80)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !11, line: 7, baseType: !107, size: 64, align: 64, offset: 512)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !11, line: 7, baseType: !107, size: 64, align: 64, offset: 576)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !11, line: 7, baseType: !783, size: 64, align: 64, offset: 640)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !85, line: 7, baseType: !770, size: 192, align: 64, offset: 5696)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !85, line: 7, baseType: !804, size: 64, align: 64, offset: 5888)
!804 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !85, line: 7, baseType: !806, size: 192, align: 64, offset: 5952)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !17, size: 192, align: 8, elements: !807)
!807 = !{!808, !75, !76}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !809, size: 64, align: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !85, line: 7, size: 448, align: 8, elements: !811)
!811 = !{!812, !813, !814}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !85, line: 7, baseType: !762, size: 192, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !85, line: 7, baseType: !49, size: 8, align: 8, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !85, line: 7, baseType: !128, size: 192, align: 64, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !85, line: 7, baseType: !806, size: 192, align: 64, offset: 6144)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !85, line: 7, baseType: !817, size: 192, align: 64, offset: 6336)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !17, size: 192, align: 8, elements: !818)
!818 = !{!819, !75, !76}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !820, size: 64, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !85, line: 7, baseType: !822, size: 192, align: 64, offset: 6528)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !17, size: 192, align: 8, elements: !823)
!823 = !{!824, !75, !76}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !825, size: 64, align: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !85, line: 7, baseType: !817, size: 192, align: 64, offset: 6720)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !85, line: 7, baseType: !49, size: 8, align: 8, offset: 6912)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !85, line: 7, baseType: !49, size: 8, align: 8, offset: 6920)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !85, line: 7, baseType: !58, size: 64, align: 64, offset: 6976)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !85, line: 7, baseType: !49, size: 8, align: 8, offset: 7040)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !85, line: 7, baseType: !128, size: 192, align: 64, offset: 7104)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !85, line: 7, baseType: !128, size: 192, align: 64, offset: 7296)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !85, line: 7, baseType: !620, size: 192, align: 64, offset: 7488)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !85, line: 7, baseType: !620, size: 192, align: 64, offset: 7680)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !85, line: 7, baseType: !620, size: 192, align: 64, offset: 7872)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !85, line: 7, baseType: !620, size: 192, align: 64, offset: 8064)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !85, line: 7, baseType: !839, size: 192, align: 64, offset: 8256)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !17, size: 192, align: 8, elements: !840)
!840 = !{!841, !75, !76}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !842, size: 64, align: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !85, line: 7, size: 192, align: 8, elements: !844)
!844 = !{!845, !740, !741}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !85, line: 1, baseType: !51, size: 64, align: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !85, line: 7, baseType: !847, size: 192, align: 64, offset: 8448)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !17, size: 192, align: 8, elements: !848)
!848 = !{!849, !75, !76}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !850, size: 64, align: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !85, line: 7, baseType: !49, size: 8, align: 8, offset: 8640)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !85, line: 7, baseType: !620, size: 192, align: 64, offset: 8704)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !85, line: 7, baseType: !620, size: 192, align: 64, offset: 8896)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !85, line: 7, baseType: !855, size: 192, align: 64, offset: 9088)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !17, size: 192, align: 8, elements: !856)
!856 = !{!857, !75, !76}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !858, size: 64, align: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !85, line: 7, size: 384, align: 8, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !85, line: 7, baseType: !843, size: 192, align: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !85, line: 7, baseType: !864, size: 192, align: 64, offset: 192)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !85, line: 7, size: 192, align: 8, elements: !844)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !85, line: 7, baseType: !855, size: 192, align: 64, offset: 9280)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !85, line: 7, baseType: !620, size: 192, align: 64, offset: 9472)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !85, line: 7, baseType: !620, size: 192, align: 64, offset: 9664)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !85, line: 7, baseType: !620, size: 192, align: 64, offset: 9856)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !85, line: 7, baseType: !620, size: 192, align: 64, offset: 10048)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !85, line: 7, baseType: !620, size: 192, align: 64, offset: 10240)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !85, line: 7, baseType: !817, size: 192, align: 64, offset: 10432)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "VerifiedChains", file: !85, line: 7, baseType: !873, size: 192, align: 64, offset: 576)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !17, size: 192, align: 8, elements: !874)
!874 = !{!875, !75, !76}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !876, size: 64, align: 64)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !85, line: 7, baseType: !878, size: 192, align: 64, offset: 768)
!878 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !17, size: 192, align: 8, elements: !879)
!879 = !{!880, !75, !76}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !17, line: 1, baseType: !881, size: 64, align: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPResponse", file: !85, line: 7, baseType: !128, size: 192, align: 64, offset: 960)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "TLSUnique", file: !85, line: 7, baseType: !128, size: 192, align: 64, offset: 1152)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", file: !85, line: 7, baseType: !885, size: 64, align: 64, offset: 1728)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !7, line: 1, align: 8, elements: !3)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !85, line: 7, baseType: !888, size: 64, align: 64, offset: 1792)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !85, line: 7, size: 1152, align: 8, elements: !890)
!890 = !{!891, !892, !640, !641, !642, !643, !657, !893, !894, !895, !896, !897, !898, !899}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !85, line: 7, baseType: !54, size: 128, align: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "StatusCode", file: !85, line: 7, baseType: !58, size: 64, align: 64, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !85, line: 7, baseType: !107, size: 64, align: 64, offset: 640)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !85, line: 7, baseType: !620, size: 192, align: 64, offset: 704)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !85, line: 7, baseType: !49, size: 8, align: 8, offset: 896)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "Uncompressed", file: !85, line: 7, baseType: !49, size: 8, align: 8, offset: 904)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !85, line: 7, baseType: !644, size: 64, align: 64, offset: 960)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "Request", file: !85, line: 7, baseType: !39, size: 64, align: 64, offset: 1024)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !85, line: 7, baseType: !694, size: 64, align: 64, offset: 1088)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !85, line: 7, baseType: !901, size: 128, align: 64, offset: 1856)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !85, line: 7, size: 128, align: 8, elements: !902)
!902 = !{!903, !925}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !85, line: 7, baseType: !904, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,Token)Token}", file: !17, size: 320, align: 8, elements: !906)
!906 = !{!907, !908, !916, !920, !921}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !17, line: 7, baseType: !20, size: 64, align: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !17, line: 7, baseType: !909, size: 64, align: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!912, !39}
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !17, size: 256, align: 8, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !17, line: 7, baseType: !770, size: 192, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !17, line: 7, baseType: !49, size: 8, align: 8, offset: 192)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !17, line: 7, baseType: !917, size: 64, align: 64, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!885, !39}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !17, line: 7, baseType: !330, size: 64, align: 64, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !17, line: 7, baseType: !922, size: 64, align: 64, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!723, !39, !723}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !85, line: 1, baseType: !39, size: 64, align: 64, offset: 64)
!926 = !DILocalVariable(name: "request", arg: 1, scope: !632, file: !85, line: 50, type: !635)
!927 = !DILocation(line: 50, column: 13, scope: !632)
!928 = !DILocation(line: 51, column: 38, scope: !632)
!929 = !DILocation(line: 51, column: 42, scope: !632)
!930 = !DILocation(line: 51, column: 69, scope: !632)
!931 = !DILocation(line: 51, column: 83, scope: !632)
!932 = !DILocation(line: 51, column: 22, scope: !632)
!933 = !DILocation(line: 51, column: 17, scope: !632)
!934 = !DILocation(line: 51, column: 2, scope: !632)
!935 = distinct !DISubprogram(name: "netutils.CopyHeaders", linkageName: "command_line_arguments.CopyHeaders", scope: null, file: !85, line: 56, type: !936, isLocal: false, isDefinition: true, scopeLine: 56, isOptimized: false, unit: !1, retainedNodes: !3)
!936 = !DISubroutineType(types: !937)
!937 = !{!40, !644, !644}
!938 = !DILocalVariable(name: "dst", arg: 1, scope: !935, file: !85, line: 56, type: !644)
!939 = !DILocation(line: 56, column: 18, scope: !935)
!940 = !DILocalVariable(name: "src", arg: 2, scope: !935, file: !85, line: 56, type: !644)
!941 = !DILocation(line: 56, column: 23, scope: !935)
!942 = !DILocation(line: 57, column: 2, scope: !943)
!943 = distinct !DILexicalBlock(scope: !935, file: !85, line: 57, column: 2)
!944 = !DILocation(line: 58, column: 3, scope: !945)
!945 = distinct !DILexicalBlock(scope: !943, file: !85, line: 58, column: 3)
!946 = !DILocalVariable(name: "v", scope: !945, file: !85, line: 58, type: !54)
!947 = !DILocation(line: 58, column: 7, scope: !943)
!948 = !DILocation(line: 59, column: 7, scope: !945)
!949 = !DILocalVariable(name: "k", scope: !943, file: !85, line: 57, type: !54)
!950 = !DILocation(line: 57, column: 6, scope: !935)
!951 = !DILocalVariable(name: "vv", scope: !943, file: !85, line: 57, type: !620)
!952 = distinct !DISubprogram(name: "netutils.HasHeaders", linkageName: "command_line_arguments.HasHeaders", scope: null, file: !85, line: 66, type: !953, isLocal: false, isDefinition: true, scopeLine: 66, isOptimized: false, unit: !1, retainedNodes: !3)
!953 = !DISubroutineType(types: !954)
!954 = !{!49, !620, !644}
!955 = !DILocalVariable(name: "names", arg: 1, scope: !952, file: !85, line: 66, type: !620)
!956 = !DILocation(line: 66, column: 17, scope: !952)
!957 = !DILocalVariable(name: "headers", arg: 2, scope: !952, file: !85, line: 66, type: !644)
!958 = !DILocation(line: 66, column: 33, scope: !952)
!959 = !DILocalVariable(name: "$ret19", scope: !952, file: !85, line: 66, type: !49)
!960 = !DILocation(line: 66, column: 54, scope: !952)
!961 = !DILocation(line: 67, column: 2, scope: !962)
!962 = distinct !DILexicalBlock(scope: !952, file: !85, line: 67, column: 2)
!963 = !DILocalVariable(name: "h", scope: !962, file: !85, line: 67, type: !54)
!964 = !DILocation(line: 67, column: 6, scope: !952)
!965 = !DILocation(line: 68, column: 13, scope: !962)
!966 = !DILocation(line: 68, column: 21, scope: !962)
!967 = !DILocation(line: 69, column: 4, scope: !962)
!968 = distinct !DISubprogram(name: "netutils.RemoveHeaders", linkageName: "command_line_arguments.RemoveHeaders", scope: null, file: !85, line: 76, type: !969, isLocal: false, isDefinition: true, scopeLine: 76, isOptimized: false, unit: !1, retainedNodes: !3)
!969 = !DISubroutineType(types: !970)
!970 = !{!40, !620, !644}
!971 = !DILocalVariable(name: "names", arg: 1, scope: !968, file: !85, line: 76, type: !620)
!972 = !DILocation(line: 76, column: 20, scope: !968)
!973 = !DILocalVariable(name: "headers", arg: 2, scope: !968, file: !85, line: 76, type: !644)
!974 = !DILocation(line: 76, column: 36, scope: !968)
!975 = !DILocation(line: 77, column: 2, scope: !976)
!976 = distinct !DILexicalBlock(scope: !968, file: !85, line: 77, column: 2)
!977 = !DILocalVariable(name: "h", scope: !976, file: !85, line: 77, type: !54)
!978 = !DILocation(line: 77, column: 6, scope: !968)
!979 = !DILocation(line: 78, column: 10, scope: !976)
!980 = distinct !DISubprogram(name: "netutils.MustParseUrl", linkageName: "command_line_arguments.MustParseUrl", scope: null, file: !85, line: 82, type: !981, isLocal: false, isDefinition: true, scopeLine: 82, isOptimized: false, unit: !1, retainedNodes: !3)
!981 = !DISubroutineType(types: !982)
!982 = !{!552, !54}
!983 = !DILocalVariable(name: "inUrl", arg: 1, scope: !980, file: !85, line: 82, type: !54)
!984 = !DILocation(line: 82, column: 19, scope: !980)
!985 = !DILocalVariable(name: "$ret20", scope: !980, file: !85, line: 82, type: !552)
!986 = !DILocation(line: 82, column: 33, scope: !980)
!987 = !DILocation(line: 83, column: 12, scope: !988)
!988 = distinct !DILexicalBlock(scope: !980, file: !85, line: 82, column: 1)
!989 = !DILocalVariable(name: "err", scope: !988, file: !85, line: 83, type: !12)
!990 = !DILocation(line: 83, column: 2, scope: !980)
!991 = !DILocation(line: 84, column: 9, scope: !988)
!992 = !DILocalVariable(name: "u", scope: !988, file: !85, line: 83, type: !552)
!993 = !DILocation(line: 87, column: 2, scope: !988)
!994 = !DILocation(line: 85, column: 9, scope: !988)
!995 = !DILocation(line: 85, column: 3, scope: !988)
!996 = distinct !DISubprogram(name: "netutils.ParseUrl", linkageName: "command_line_arguments.ParseUrl", scope: null, file: !85, line: 93, type: !997, isLocal: false, isDefinition: true, scopeLine: 93, isOptimized: false, unit: !1, retainedNodes: !3)
!997 = !DISubroutineType(types: !998)
!998 = !{!999, !54}
!999 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*URL,error}", file: !17, size: 192, align: 8, elements: !1000)
!1000 = !{!1001, !490}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 7, baseType: !552, size: 64, align: 64)
!1002 = !DILocalVariable(name: "inUrl", arg: 1, scope: !996, file: !85, line: 93, type: !54)
!1003 = !DILocation(line: 93, column: 15, scope: !996)
!1004 = !DILocalVariable(name: "$ret21", scope: !996, file: !85, line: 93, type: !552)
!1005 = !DILocation(line: 93, column: 30, scope: !996)
!1006 = !DILocation(line: 94, column: 24, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !996, file: !85, line: 93, column: 1)
!1008 = !DILocalVariable(name: "parsedUrl", scope: !1007, file: !85, line: 94, type: !552)
!1009 = !DILocation(line: 94, column: 2, scope: !996)
!1010 = !DILocalVariable(name: "err", scope: !1007, file: !85, line: 94, type: !12)
!1011 = !DILocation(line: 95, column: 9, scope: !1007)
!1012 = !DILocation(line: 96, column: 3, scope: !1007)
!1013 = !DILocalVariable(name: "$ret22", scope: !996, file: !85, line: 93, type: !12)
!1014 = !DILocation(line: 93, column: 40, scope: !996)
!1015 = !DILocation(line: 99, column: 14, scope: !1007)
!1016 = !DILocation(line: 99, column: 20, scope: !1007)
!1017 = !DILocation(line: 99, column: 46, scope: !1007)
!1018 = !DILocation(line: 100, column: 19, scope: !1007)
!1019 = !DILocation(line: 100, column: 3, scope: !1007)
!1020 = !DILocation(line: 102, column: 2, scope: !1007)
!1021 = distinct !DISubprogram(name: "netutils.command_line_arguments.BasicAuth..hash", linkageName: "command_line_arguments.command_line_arguments.BasicAuth..hash", scope: null, file: !7, line: 1, type: !37, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!1022 = !DILocalVariable(name: "key", arg: 1, scope: !1021, file: !7, line: 1, type: !39)
!1023 = !DILocation(line: 1, column: 1, scope: !1021)
!1024 = !DILocalVariable(name: "seed", arg: 2, scope: !1021, file: !7, line: 1, type: !24)
!1025 = !DILocalVariable(name: "$ret31", scope: !1021, file: !7, line: 1, type: !24)
!1026 = distinct !DISubprogram(name: "netutils.command_line_arguments.BasicAuth..eq", linkageName: "command_line_arguments.command_line_arguments.BasicAuth..eq", scope: null, file: !7, line: 1, type: !47, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!1027 = !DILocalVariable(name: "key1", arg: 1, scope: !1026, file: !7, line: 1, type: !39)
!1028 = !DILocation(line: 1, column: 1, scope: !1026)
!1029 = !DILocalVariable(name: "key2", arg: 2, scope: !1026, file: !7, line: 1, type: !39)
!1030 = !DILocalVariable(name: "$ret32", scope: !1026, file: !7, line: 1, type: !49)
!1031 = distinct !DISubprogram(name: "netutils.String..1command_line_arguments.BasicAuth", linkageName: "command_line_arguments.BasicAuth.String", scope: null, file: !85, line: 110, type: !1032, isLocal: false, isDefinition: true, scopeLine: 110, isOptimized: false, unit: !1, retainedNodes: !3)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!54, !1034, !1034}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DICompositeType(tag: DW_TAG_structure_type, name: "BasicAuth", file: !85, line: 105, size: 256, align: 8, elements: !1036)
!1036 = !{!1037, !1038}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "Username", file: !85, line: 106, baseType: !54, size: 128, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "Password", file: !85, line: 107, baseType: !54, size: 128, align: 64, offset: 128)
!1039 = !DILocalVariable(name: "ba", arg: 1, scope: !1031, file: !85, line: 110, type: !1034)
!1040 = !DILocation(line: 110, column: 1, scope: !1031)
!1041 = !DILocation(line: 111, column: 77, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1031, file: !85, line: 110, column: 1)
!1043 = !DILocation(line: 111, column: 90, scope: !1042)
!1044 = !DILocation(line: 111, column: 58, scope: !1042)
!1045 = !DILocation(line: 111, column: 20, scope: !1042)
!1046 = !DILocation(line: 111, column: 53, scope: !1042)
!1047 = !DILocation(line: 111, column: 31, scope: !1042)
!1048 = !DILocalVariable(name: "encoded", scope: !1042, file: !85, line: 111, type: !54)
!1049 = !DILocation(line: 111, column: 2, scope: !1031)
!1050 = !DILocation(line: 112, column: 13, scope: !1042)
!1051 = !DILocation(line: 112, column: 2, scope: !1042)
!1052 = distinct !DISubprogram(name: "netutils.ParseAuthHeader", linkageName: "command_line_arguments.ParseAuthHeader", scope: null, file: !85, line: 115, type: !1053, isLocal: false, isDefinition: true, scopeLine: 115, isOptimized: false, unit: !1, retainedNodes: !3)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!1055, !54}
!1055 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*BasicAuth,error}", file: !17, size: 192, align: 8, elements: !1056)
!1056 = !{!1057, !1058}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 115, baseType: !1034, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !17, line: 115, baseType: !12, size: 128, align: 64, offset: 64)
!1059 = !DILocalVariable(name: "header", arg: 1, scope: !1052, file: !85, line: 115, type: !54)
!1060 = !DILocation(line: 115, column: 22, scope: !1052)
!1061 = !DILocalVariable(name: "$ret24", scope: !1052, file: !85, line: 115, type: !1034)
!1062 = !DILocation(line: 115, column: 38, scope: !1052)
!1063 = !DILocation(line: 117, column: 20, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1052, file: !85, line: 115, column: 1)
!1065 = !DILocalVariable(name: "values", scope: !1064, file: !85, line: 117, type: !620)
!1066 = !DILocation(line: 117, column: 2, scope: !1052)
!1067 = !DILocation(line: 118, column: 17, scope: !1064)
!1068 = !DILocation(line: 119, column: 30, scope: !1064)
!1069 = !DILocation(line: 119, column: 19, scope: !1064)
!1070 = !DILocalVariable(name: "$ret25", scope: !1052, file: !85, line: 115, type: !12)
!1071 = !DILocation(line: 115, column: 50, scope: !1052)
!1072 = !DILocation(line: 119, column: 3, scope: !1064)
!1073 = !DILocation(line: 122, column: 23, scope: !1064)
!1074 = !DILocalVariable(name: "auth_type", scope: !1064, file: !85, line: 122, type: !54)
!1075 = !DILocation(line: 122, column: 2, scope: !1052)
!1076 = !DILocation(line: 123, column: 15, scope: !1064)
!1077 = !DILocation(line: 124, column: 19, scope: !1064)
!1078 = !DILocation(line: 124, column: 3, scope: !1064)
!1079 = !DILocation(line: 127, column: 26, scope: !1064)
!1080 = !DILocalVariable(name: "encoded_string", scope: !1064, file: !85, line: 127, type: !54)
!1081 = !DILocation(line: 127, column: 2, scope: !1052)
!1082 = !DILocation(line: 128, column: 32, scope: !1064)
!1083 = !DILocation(line: 128, column: 43, scope: !1064)
!1084 = !DILocalVariable(name: "err", scope: !1064, file: !85, line: 128, type: !12)
!1085 = !DILocation(line: 128, column: 2, scope: !1052)
!1086 = !DILocation(line: 129, column: 9, scope: !1064)
!1087 = !DILocation(line: 130, column: 19, scope: !1064)
!1088 = !DILocation(line: 130, column: 84, scope: !1064)
!1089 = !DILocation(line: 130, column: 3, scope: !1064)
!1090 = !DILocation(line: 133, column: 26, scope: !1064)
!1091 = !DILocation(line: 133, column: 19, scope: !1064)
!1092 = !DILocation(line: 134, column: 17, scope: !1064)
!1093 = !DILocation(line: 135, column: 19, scope: !1064)
!1094 = !DILocation(line: 135, column: 3, scope: !1064)
!1095 = !DILocation(line: 137, column: 57, scope: !1064)
!1096 = !DILocation(line: 137, column: 9, scope: !1064)
!1097 = !DILocation(line: 137, column: 10, scope: !1064)
!1098 = !DILocation(line: 137, column: 2, scope: !1064)
!1099 = distinct !DISubprogram(name: "netutils.NewHttpResponse", linkageName: "command_line_arguments.NewHttpResponse", scope: null, file: !724, line: 11, type: !1100, isLocal: false, isDefinition: true, scopeLine: 11, isOptimized: false, unit: !1, retainedNodes: !3)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!888, !635, !58, !128, !54}
!1102 = !DILocalVariable(name: "body", arg: 3, scope: !1099, file: !724, line: 11, type: !128)
!1103 = !DILocation(line: 11, column: 61, scope: !1099)
!1104 = !DILocalVariable(name: "request", arg: 1, scope: !1099, file: !724, line: 11, type: !635)
!1105 = !DILocation(line: 11, column: 22, scope: !1099)
!1106 = !DILocalVariable(name: "statusCode", arg: 2, scope: !1099, file: !724, line: 11, type: !58)
!1107 = !DILocation(line: 11, column: 45, scope: !1099)
!1108 = !DILocalVariable(name: "contentType", arg: 4, scope: !1099, file: !724, line: 11, type: !54)
!1109 = !DILocation(line: 11, column: 74, scope: !1099)
!1110 = !DILocalVariable(name: "$ret26", scope: !1099, file: !724, line: 11, type: !888)
!1111 = !DILocation(line: 11, column: 94, scope: !1099)
!1112 = !DILocation(line: 13, column: 53, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1099, file: !724, line: 11, column: 1)
!1114 = !DILocation(line: 13, column: 19, scope: !1113)
!1115 = !DILocation(line: 18, column: 15, scope: !1113)
