; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22request\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22endpoint\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/vulcan/endpoint\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/mailgun/vulcan/endpoint\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22netutils\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/vulcan/netutils\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/mailgun/vulcan/netutils\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22http\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22net/http\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./request.go", directory: "/home/wangcong/go_path/src/github.com/vulcand/vulcan/request")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "request.command_line_arguments.BaseAttempt..hash", linkageName: "command_line_arguments.command_line_arguments.BaseAttempt..hash", scope: null, file: !7, line: 1, type: !10, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !13, !12}
!12 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "void")
!15 = !DILocalVariable(name: "key", arg: 1, scope: !9, file: !7, line: 1, type: !13)
!16 = !DILocation(line: 1, column: 1, scope: !9)
!17 = !DILocalVariable(name: "seed", arg: 2, scope: !9, file: !7, line: 1, type: !12)
!18 = !DILocalVariable(name: "$ret14", scope: !9, file: !7, line: 1, type: !12)
!19 = distinct !DISubprogram(name: "request.command_line_arguments.BaseAttempt..eq", linkageName: "command_line_arguments.command_line_arguments.BaseAttempt..eq", scope: null, file: !7, line: 1, type: !20, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !13, !13}
!22 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!23 = !DILocalVariable(name: "key1", arg: 1, scope: !19, file: !7, line: 1, type: !13)
!24 = !DILocation(line: 1, column: 1, scope: !19)
!25 = !DILocalVariable(name: "key2", arg: 2, scope: !19, file: !7, line: 1, type: !13)
!26 = !DILocalVariable(name: "$ret15", scope: !19, file: !7, line: 1, type: !22)
!27 = distinct !DISubprogram(name: "request.GetDuration..1command_line_arguments.BaseAttempt", linkageName: "command_line_arguments.BaseAttempt.GetDuration", scope: null, file: !28, line: 52, type: !29, isLocal: false, isDefinition: true, scopeLine: 52, isOptimized: false, unit: !1, retainedNodes: !3)
!28 = !DIFile(filename: "request.go", directory: ".")
!29 = !DISubroutineType(types: !30)
!30 = !{!31, !32, !32}
!31 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "BaseAttempt", file: !28, line: 37, size: 384, align: 8, elements: !34)
!34 = !{!35, !99, !100, !426}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !28, line: 38, baseType: !36, size: 128, align: 64)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !37)
!37 = !{!38, !98}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !41, size: 128, align: 8, elements: !42)
!41 = !DIFile(filename: "", directory: "")
!42 = !{!43, !94}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !41, line: 1, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !46)
!46 = !{!47, !48, !49, !50, !52, !53, !54, !60, !66, !68, !75, !93}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !12, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !51, size: 8, align: 8, offset: 160)
!51 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !51, size: 8, align: 8, offset: 168)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !51, size: 8, align: 8, offset: 176)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !55, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !57)
!57 = !{!58}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !61, size: 64, align: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !63)
!63 = !{!64}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !67, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !69, size: 64, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !71)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !67, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !74, size: 64, align: 64, offset: 64)
!74 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !76, size: 64, align: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !78)
!78 = !{!79, !80, !81}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !69, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !69, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !82, size: 192, align: 64, offset: 128)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !41, size: 192, align: 8, elements: !83)
!83 = !{!84, !91, !92}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !87)
!87 = !{!79, !80, !88, !89, !90}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !41, line: 1, baseType: !74, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !41, line: 1, baseType: !74, size: 64, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !41, line: 1, baseType: !95, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!70, !13}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Duration", file: !28, line: 39, baseType: !31, size: 64, align: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !28, line: 40, baseType: !101, size: 64, align: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !28, line: 6, size: 1152, align: 8, elements: !103)
!103 = !{!104, !105, !106, !107, !108, !109, !123, !147, !149, !153, !154, !155, !156, !425}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !28, line: 6, baseType: !70, size: 128, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "StatusCode", file: !28, line: 6, baseType: !74, size: 64, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Proto", file: !28, line: 6, baseType: !70, size: 128, align: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMajor", file: !28, line: 6, baseType: !74, size: 64, align: 64, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMinor", file: !28, line: 6, baseType: !74, size: 64, align: 64, offset: 384)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !28, line: 6, baseType: !110, size: 64, align: 64, offset: 448)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !112)
!112 = !{!113, !114, !115, !116, !118, !119, !120, !121, !122}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !74, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !51, size: 8, align: 8, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !51, size: 8, align: 8, offset: 72)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !117, size: 16, align: 16, offset: 80)
!117 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !12, size: 64, align: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !28, line: 6, baseType: !124, size: 128, align: 64, offset: 512)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !28, line: 6, size: 128, align: 8, elements: !125)
!125 = !{!126, !146}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 6, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !41, size: 192, align: 8, elements: !129)
!129 = !{!130, !131, !135}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !41, line: 6, baseType: !44, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !41, line: 6, baseType: !132, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!36, !13}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !41, line: 6, baseType: !136, size: 64, align: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!139, !13, !143}
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !41, size: 192, align: 8, elements: !140)
!140 = !{!141, !142}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !41, line: 5, baseType: !74, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !41, line: 5, baseType: !36, size: 128, align: 64, offset: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !41, size: 192, align: 8, elements: !144)
!144 = !{!145, !91, !92}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !67, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !28, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !28, line: 6, baseType: !148, size: 64, align: 64, offset: 640)
!148 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !28, line: 6, baseType: !150, size: 192, align: 64, offset: 704)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !41, size: 192, align: 8, elements: !151)
!151 = !{!152, !91, !92}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !69, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 896)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Uncompressed", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 904)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !28, line: 6, baseType: !110, size: 64, align: 64, offset: 960)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Request", file: !28, line: 6, baseType: !157, size: 64, align: 64, offset: 1024)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !28, line: 6, size: 1984, align: 8, elements: !159)
!159 = !{!160, !161, !106, !107, !108, !109, !123, !180, !192, !193, !194, !195, !196, !197, !198, !204, !205, !206, !207, !397, !400, !401}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !28, line: 6, baseType: !70, size: 128, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !28, line: 6, baseType: !162, size: 64, align: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !28, line: 6, size: 1024, align: 8, elements: !164)
!164 = !{!165, !166, !167, !174, !175, !176, !177, !178, !179}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !28, line: 6, baseType: !70, size: 128, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !28, line: 6, baseType: !70, size: 128, align: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !28, line: 6, baseType: !168, size: 64, align: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !28, line: 6, size: 320, align: 8, elements: !170)
!170 = !{!171, !172, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !28, line: 6, baseType: !70, size: 128, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !28, line: 6, baseType: !70, size: 128, align: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !28, line: 6, baseType: !70, size: 128, align: 64, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !28, line: 6, baseType: !70, size: 128, align: 64, offset: 448)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !28, line: 6, baseType: !70, size: 128, align: 64, offset: 576)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 704)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !28, line: 6, baseType: !70, size: 128, align: 64, offset: 768)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !28, line: 6, baseType: !70, size: 128, align: 64, offset: 896)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !28, line: 6, baseType: !181, size: 64, align: 64, offset: 640)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !28, line: 6, size: 64, align: 8, elements: !183)
!183 = !{!184}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !28, line: 6, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!188}
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !41, size: 256, align: 8, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !41, line: 6, baseType: !124, size: 128, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !41, line: 6, baseType: !36, size: 128, align: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !28, line: 6, baseType: !148, size: 64, align: 64, offset: 704)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !28, line: 6, baseType: !150, size: 192, align: 64, offset: 768)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 960)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !28, line: 6, baseType: !70, size: 128, align: 64, offset: 1024)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Form", file: !28, line: 6, baseType: !110, size: 64, align: 64, offset: 1152)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "PostForm", file: !28, line: 6, baseType: !110, size: 64, align: 64, offset: 1216)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "MultipartForm", file: !28, line: 6, baseType: !199, size: 64, align: 64, offset: 1280)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", file: !28, line: 6, size: 128, align: 8, elements: !201)
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !28, line: 6, baseType: !110, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !28, line: 6, baseType: !110, size: 64, align: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !28, line: 6, baseType: !110, size: 64, align: 64, offset: 1344)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !28, line: 6, baseType: !70, size: 128, align: 64, offset: 1408)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "RequestURI", file: !28, line: 6, baseType: !70, size: 128, align: 64, offset: 1536)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !28, line: 6, baseType: !208, size: 64, align: 64, offset: 1664)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionState", file: !28, line: 6, size: 1344, align: 8, elements: !210)
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !385, !390, !395, !396}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !28, line: 6, baseType: !117, size: 16, align: 16)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "HandshakeComplete", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 16)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "DidResume", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 24)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuite", file: !28, line: 6, baseType: !117, size: 16, align: 16, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocol", file: !28, line: 6, baseType: !70, size: 128, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocolIsMutual", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !28, line: 6, baseType: !70, size: 128, align: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "PeerCertificates", file: !28, line: 6, baseType: !219, size: 192, align: 64, offset: 384)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !41, size: 192, align: 8, elements: !220)
!220 = !{!221, !91, !92}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !28, line: 6, size: 10624, align: 8, elements: !225)
!225 = !{!226, !227, !228, !229, !230, !231, !232, !234, !236, !240, !241, !254, !280, !281, !315, !316, !318, !328, !329, !334, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !359, !364, !365, !366, !367, !378, !379, !380, !381, !382, !383, !384}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !28, line: 6, baseType: !143, size: 192, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !28, line: 6, baseType: !143, size: 192, align: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !28, line: 6, baseType: !143, size: 192, align: 64, offset: 384)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !28, line: 6, baseType: !143, size: 192, align: 64, offset: 576)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !28, line: 6, baseType: !143, size: 192, align: 64, offset: 768)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !28, line: 6, baseType: !143, size: 192, align: 64, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !28, line: 6, baseType: !233, size: 64, align: 64, offset: 1152)
!233 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !28, line: 6, baseType: !235, size: 64, align: 64, offset: 1216)
!235 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !28, line: 6, baseType: !237, size: 128, align: 64, offset: 1280)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !28, line: 6, size: 128, align: 8, elements: !238)
!238 = !{!239, !146}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !28, line: 1, baseType: !44, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !28, line: 6, baseType: !74, size: 64, align: 64, offset: 1408)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !28, line: 6, baseType: !242, size: 64, align: 64, offset: 1472)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !28, line: 6, size: 256, align: 8, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !28, line: 6, baseType: !22, size: 8, align: 8)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !28, line: 6, baseType: !247, size: 192, align: 64, offset: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !28, line: 6, size: 192, align: 8, elements: !248)
!248 = !{!249, !252, !253}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !28, line: 1, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !28, line: 1, baseType: !74, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !28, line: 1, baseType: !74, size: 64, align: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !28, line: 6, baseType: !255, size: 1984, align: 64, offset: 1536)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !28, line: 6, size: 1984, align: 8, elements: !256)
!256 = !{!257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !279}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !28, line: 6, baseType: !150, size: 192, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !28, line: 6, baseType: !150, size: 192, align: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !28, line: 6, baseType: !150, size: 192, align: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !28, line: 6, baseType: !150, size: 192, align: 64, offset: 576)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !28, line: 6, baseType: !150, size: 192, align: 64, offset: 768)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !28, line: 6, baseType: !150, size: 192, align: 64, offset: 960)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !28, line: 6, baseType: !150, size: 192, align: 64, offset: 1152)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !28, line: 6, baseType: !70, size: 128, align: 64, offset: 1344)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !28, line: 6, baseType: !70, size: 128, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !28, line: 6, baseType: !267, size: 192, align: 64, offset: 1600)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !41, size: 192, align: 8, elements: !268)
!268 = !{!269, !91, !92}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !28, line: 6, size: 320, align: 8, elements: !272)
!272 = !{!273, !278}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !28, line: 6, baseType: !274, size: 192, align: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !28, line: 6, size: 192, align: 8, elements: !275)
!275 = !{!276, !252, !253}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !28, line: 1, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !28, line: 6, baseType: !237, size: 128, align: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !28, line: 6, baseType: !267, size: 192, align: 64, offset: 1792)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !28, line: 6, baseType: !255, size: 1984, align: 64, offset: 3520)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !28, line: 6, baseType: !282, size: 192, align: 64, offset: 5504)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !28, line: 6, size: 192, align: 8, elements: !283)
!283 = !{!284, !286, !287}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !28, line: 6, baseType: !285, size: 64, align: 64)
!285 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !28, line: 6, baseType: !148, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !28, line: 6, baseType: !288, size: 64, align: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !28, line: 6, size: 704, align: 8, elements: !290)
!290 = !{!291, !292, !301, !312, !313, !314}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !28, line: 6, baseType: !70, size: 128, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !28, line: 6, baseType: !293, size: 192, align: 64, offset: 128)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !41, size: 192, align: 8, elements: !294)
!294 = !{!295, !91, !92}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !28, line: 6, size: 256, align: 8, elements: !298)
!298 = !{!291, !299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !28, line: 6, baseType: !74, size: 64, align: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !28, line: 6, baseType: !302, size: 192, align: 64, offset: 320)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !41, size: 192, align: 8, elements: !303)
!303 = !{!304, !91, !92}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !28, line: 6, size: 128, align: 8, elements: !307)
!307 = !{!308, !309, !310, !311}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !28, line: 6, baseType: !148, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !28, line: 6, baseType: !51, size: 8, align: 8, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 72)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 80)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !28, line: 6, baseType: !148, size: 64, align: 64, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !28, line: 6, baseType: !148, size: 64, align: 64, offset: 576)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !28, line: 6, baseType: !296, size: 64, align: 64, offset: 640)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !28, line: 6, baseType: !282, size: 192, align: 64, offset: 5696)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !28, line: 6, baseType: !317, size: 64, align: 64, offset: 5888)
!317 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !28, line: 6, baseType: !319, size: 192, align: 64, offset: 5952)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !41, size: 192, align: 8, elements: !320)
!320 = !{!321, !91, !92}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !28, line: 6, size: 448, align: 8, elements: !324)
!324 = !{!325, !326, !327}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !28, line: 6, baseType: !274, size: 192, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !28, line: 6, baseType: !143, size: 192, align: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !28, line: 6, baseType: !319, size: 192, align: 64, offset: 6144)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !28, line: 6, baseType: !330, size: 192, align: 64, offset: 6336)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !41, size: 192, align: 8, elements: !331)
!331 = !{!332, !91, !92}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !28, line: 6, baseType: !335, size: 192, align: 64, offset: 6528)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !41, size: 192, align: 8, elements: !336)
!336 = !{!337, !91, !92}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !28, line: 6, baseType: !330, size: 192, align: 64, offset: 6720)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 6912)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 6920)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !28, line: 6, baseType: !74, size: 64, align: 64, offset: 6976)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 7040)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !28, line: 6, baseType: !143, size: 192, align: 64, offset: 7104)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !28, line: 6, baseType: !143, size: 192, align: 64, offset: 7296)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !28, line: 6, baseType: !150, size: 192, align: 64, offset: 7488)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !28, line: 6, baseType: !150, size: 192, align: 64, offset: 7680)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !28, line: 6, baseType: !150, size: 192, align: 64, offset: 7872)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !28, line: 6, baseType: !150, size: 192, align: 64, offset: 8064)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !28, line: 6, baseType: !352, size: 192, align: 64, offset: 8256)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !41, size: 192, align: 8, elements: !353)
!353 = !{!354, !91, !92}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !28, line: 6, size: 192, align: 8, elements: !357)
!357 = !{!358, !252, !253}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !28, line: 1, baseType: !67, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !28, line: 6, baseType: !360, size: 192, align: 64, offset: 8448)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !41, size: 192, align: 8, elements: !361)
!361 = !{!362, !91, !92}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !28, line: 6, baseType: !22, size: 8, align: 8, offset: 8640)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !28, line: 6, baseType: !150, size: 192, align: 64, offset: 8704)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !28, line: 6, baseType: !150, size: 192, align: 64, offset: 8896)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !28, line: 6, baseType: !368, size: 192, align: 64, offset: 9088)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !41, size: 192, align: 8, elements: !369)
!369 = !{!370, !91, !92}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !28, line: 6, size: 384, align: 8, elements: !374)
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !28, line: 6, baseType: !356, size: 192, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !28, line: 6, baseType: !377, size: 192, align: 64, offset: 192)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !28, line: 6, size: 192, align: 8, elements: !357)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !28, line: 6, baseType: !368, size: 192, align: 64, offset: 9280)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !28, line: 6, baseType: !150, size: 192, align: 64, offset: 9472)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !28, line: 6, baseType: !150, size: 192, align: 64, offset: 9664)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !28, line: 6, baseType: !150, size: 192, align: 64, offset: 9856)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !28, line: 6, baseType: !150, size: 192, align: 64, offset: 10048)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !28, line: 6, baseType: !150, size: 192, align: 64, offset: 10240)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !28, line: 6, baseType: !330, size: 192, align: 64, offset: 10432)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "VerifiedChains", file: !28, line: 6, baseType: !386, size: 192, align: 64, offset: 576)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !41, size: 192, align: 8, elements: !387)
!387 = !{!388, !91, !92}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !28, line: 6, baseType: !391, size: 192, align: 64, offset: 768)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !41, size: 192, align: 8, elements: !392)
!392 = !{!393, !91, !92}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPResponse", file: !28, line: 6, baseType: !143, size: 192, align: 64, offset: 960)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "TLSUnique", file: !28, line: 6, baseType: !143, size: 192, align: 64, offset: 1152)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", file: !28, line: 6, baseType: !398, size: 64, align: 64, offset: 1728)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !7, line: 1, align: 8, elements: !3)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !28, line: 6, baseType: !13, size: 64, align: 64, offset: 1792)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !28, line: 6, baseType: !402, size: 128, align: 64, offset: 1856)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !28, line: 6, size: 128, align: 8, elements: !403)
!403 = !{!404, !146}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 6, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,PrivateKey)PrivateKey}", file: !41, size: 320, align: 8, elements: !407)
!407 = !{!130, !408, !416, !420, !421}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !41, line: 6, baseType: !409, size: 64, align: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!412, !13}
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !41, size: 256, align: 8, elements: !413)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !41, line: 6, baseType: !282, size: 192, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !41, line: 6, baseType: !22, size: 8, align: 8, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !41, line: 6, baseType: !417, size: 64, align: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!398, !13}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !41, line: 6, baseType: !132, size: 64, align: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !41, line: 6, baseType: !422, size: 64, align: 64, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!237, !13, !237}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !28, line: 6, baseType: !208, size: 64, align: 64, offset: 1088)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Endpoint", file: !28, line: 41, baseType: !427, size: 128, align: 64, offset: 256)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "Endpoint", file: !28, line: 10, size: 128, align: 8, elements: !428)
!428 = !{!429, !146}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 10, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)*URL,*func(*void)string}", file: !41, size: 256, align: 8, elements: !432)
!432 = !{!433, !434, !435, !439}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !41, line: 10, baseType: !44, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "GetId", file: !41, line: 10, baseType: !95, size: 64, align: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "GetUrl", file: !41, line: 10, baseType: !436, size: 64, align: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!162, !13}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !41, line: 10, baseType: !95, size: 64, align: 64, offset: 192)
!440 = !DILocalVariable(name: "ba", arg: 1, scope: !27, file: !28, line: 52, type: !32)
!441 = !DILocation(line: 52, column: 1, scope: !27)
!442 = !DILocalVariable(name: "$ret2", scope: !27, file: !28, line: 52, type: !31)
!443 = !DILocation(line: 52, column: 38, scope: !27)
!444 = !DILocation(line: 53, column: 11, scope: !27)
!445 = !DILocation(line: 53, column: 2, scope: !27)
!446 = distinct !DISubprogram(name: "request.GetEndpoint..1command_line_arguments.BaseAttempt", linkageName: "command_line_arguments.BaseAttempt.GetEndpoint", scope: null, file: !28, line: 56, type: !447, isLocal: false, isDefinition: true, scopeLine: 56, isOptimized: false, unit: !1, retainedNodes: !3)
!447 = !DISubroutineType(types: !448)
!448 = !{!427, !32, !32}
!449 = !DILocalVariable(name: "ba", arg: 1, scope: !446, file: !28, line: 56, type: !32)
!450 = !DILocation(line: 56, column: 1, scope: !446)
!451 = !DILocation(line: 57, column: 11, scope: !446)
!452 = !DILocation(line: 57, column: 2, scope: !446)
!453 = !DILocalVariable(name: "$ret3", scope: !446, file: !28, line: 56, type: !427)
!454 = !DILocation(line: 56, column: 38, scope: !446)
!455 = distinct !DISubprogram(name: "request.GetError..1command_line_arguments.BaseAttempt", linkageName: "command_line_arguments.BaseAttempt.GetError", scope: null, file: !28, line: 48, type: !456, isLocal: false, isDefinition: true, scopeLine: 48, isOptimized: false, unit: !1, retainedNodes: !3)
!456 = !DISubroutineType(types: !457)
!457 = !{!36, !32, !32}
!458 = !DILocalVariable(name: "ba", arg: 1, scope: !455, file: !28, line: 48, type: !32)
!459 = !DILocation(line: 48, column: 1, scope: !455)
!460 = !DILocation(line: 49, column: 11, scope: !455)
!461 = !DILocation(line: 49, column: 2, scope: !455)
!462 = !DILocalVariable(name: "$ret1", scope: !455, file: !28, line: 48, type: !36)
!463 = !DILocation(line: 48, column: 35, scope: !455)
!464 = distinct !DISubprogram(name: "request.GetResponse..1command_line_arguments.BaseAttempt", linkageName: "command_line_arguments.BaseAttempt.GetResponse", scope: null, file: !28, line: 44, type: !465, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!465 = !DISubroutineType(types: !466)
!466 = !{!101, !32, !32}
!467 = !DILocalVariable(name: "ba", arg: 1, scope: !464, file: !28, line: 44, type: !32)
!468 = !DILocation(line: 44, column: 1, scope: !464)
!469 = !DILocalVariable(name: "$ret0", scope: !464, file: !28, line: 44, type: !101)
!470 = !DILocation(line: 44, column: 38, scope: !464)
!471 = !DILocation(line: 45, column: 11, scope: !464)
!472 = !DILocation(line: 45, column: 2, scope: !464)
!473 = distinct !DISubprogram(name: "request.AddAttempt..1command_line_arguments.BaseRequest", linkageName: "command_line_arguments.BaseRequest.AddAttempt", scope: null, file: !28, line: 103, type: !474, isLocal: false, isDefinition: true, scopeLine: 103, isOptimized: false, unit: !1, retainedNodes: !3)
!474 = !DISubroutineType(types: !475)
!475 = !{!14, !476, !476, !524}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "BaseRequest", file: !28, line: 60, size: 576, align: 8, elements: !478)
!478 = !{!479, !480, !481, !519, !544, !558}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "HttpRequest", file: !28, line: 61, baseType: !157, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !28, line: 62, baseType: !148, size: 64, align: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !28, line: 63, baseType: !482, size: 128, align: 64, offset: 128)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiReader", file: !28, line: 11, size: 128, align: 8, elements: !483)
!483 = !{!484, !146}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 11, baseType: !485, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,int64,int)struct{int64,error},*func(*void)struct{int64,error},*func(*void,Writer)struct{int64,error}}", file: !41, size: 384, align: 8, elements: !487)
!487 = !{!488, !489, !490, !491, !499, !503}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !41, line: 11, baseType: !44, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !41, line: 11, baseType: !132, size: 64, align: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !41, line: 11, baseType: !136, size: 64, align: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Seek", file: !41, line: 11, baseType: !492, size: 64, align: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!495, !13, !148, !74}
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !41, size: 192, align: 8, elements: !496)
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !41, line: 6, baseType: !148, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !41, line: 6, baseType: !36, size: 128, align: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "TotalSize", file: !41, line: 11, baseType: !500, size: 64, align: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!495, !13}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "WriteTo", file: !41, line: 11, baseType: !504, size: 64, align: 64, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!507, !13, !511}
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !41, size: 192, align: 8, elements: !508)
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !41, line: 11, baseType: !148, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !41, line: 11, baseType: !36, size: 128, align: 64, offset: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !28, line: 5, size: 128, align: 8, elements: !512)
!512 = !{!513, !146}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 5, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !41, size: 128, align: 8, elements: !516)
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !41, line: 5, baseType: !44, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !41, line: 5, baseType: !136, size: 64, align: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "Attempts", file: !28, line: 64, baseType: !520, size: 192, align: 64, offset: 256)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Attempt,int,int}", file: !41, size: 192, align: 8, elements: !521)
!521 = !{!522, !91, !92}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !523, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "Attempt", file: !28, line: 30, size: 128, align: 8, elements: !525)
!525 = !{!526, !146}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !28, line: 30, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Duration,*func(*void)Endpoint,*func(*void)error,*func(*void)*Response}", file: !41, size: 320, align: 8, elements: !529)
!529 = !{!530, !531, !535, !539, !540}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !41, line: 30, baseType: !44, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "GetDuration", file: !41, line: 30, baseType: !532, size: 64, align: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!31, !13}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "GetEndpoint", file: !41, line: 30, baseType: !536, size: 64, align: 64, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!427, !13}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "GetError", file: !41, line: 30, baseType: !132, size: 64, align: 64, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "GetResponse", file: !41, line: 30, baseType: !541, size: 64, align: 64, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!101, !13}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "userDataMutex", file: !28, line: 65, baseType: !545, size: 64, align: 64, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !28, line: 6, size: 192, align: 8, elements: !547)
!547 = !{!548, !554, !555, !556, !557}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !28, line: 6, baseType: !549, size: 64, align: 32)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !28, line: 6, size: 64, align: 8, elements: !550)
!550 = !{!551, !553}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !28, line: 6, baseType: !552, size: 32, align: 32)
!552 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !28, line: 6, baseType: !8, size: 32, align: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !28, line: 6, baseType: !8, size: 32, align: 32, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !28, line: 6, baseType: !8, size: 32, align: 32, offset: 96)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !28, line: 6, baseType: !552, size: 32, align: 32, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !28, line: 6, baseType: !552, size: 32, align: 32, offset: 160)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "userData", file: !28, line: 66, baseType: !110, size: 64, align: 64, offset: 512)
!559 = !DILocalVariable(name: "br", arg: 1, scope: !473, file: !28, line: 103, type: !476)
!560 = !DILocation(line: 103, column: 1, scope: !473)
!561 = !DILocation(line: 104, column: 4, scope: !473)
!562 = !DILocation(line: 104, column: 16, scope: !473)
!563 = !DILocation(line: 104, column: 14, scope: !473)
!564 = distinct !DISubprogram(name: "request.DeleteUserData..1command_line_arguments.BaseRequest", linkageName: "command_line_arguments.BaseRequest.DeleteUserData", scope: null, file: !28, line: 134, type: !565, isLocal: false, isDefinition: true, scopeLine: 134, isOptimized: false, unit: !1, retainedNodes: !3)
!565 = !DISubroutineType(types: !566)
!566 = !{!14, !476, !476, !70}
!567 = !DILocalVariable(name: "br", arg: 1, scope: !564, file: !28, line: 134, type: !476)
!568 = !DILocation(line: 134, column: 1, scope: !564)
!569 = !DILocalVariable(name: "key", arg: 2, scope: !564, file: !28, line: 134, type: !70)
!570 = !DILocation(line: 134, column: 39, scope: !564)
!571 = !DILocation(line: 135, column: 4, scope: !564)
!572 = !DILocation(line: 142, column: 1, scope: !564)
!573 = !DILocation(line: 135, column: 18, scope: !564)
!574 = !DILocation(line: 136, column: 10, scope: !564)
!575 = !DILocation(line: 136, column: 2, scope: !564)
!576 = !DILocation(line: 137, column: 7, scope: !564)
!577 = !DILocation(line: 137, column: 17, scope: !564)
!578 = !DILocation(line: 141, column: 2, scope: !564)
!579 = !DILocation(line: 138, column: 3, scope: !564)
!580 = distinct !DISubprogram(name: "request.GetAttempts..1command_line_arguments.BaseRequest", linkageName: "command_line_arguments.BaseRequest.GetAttempts", scope: null, file: !28, line: 107, type: !581, isLocal: false, isDefinition: true, scopeLine: 107, isOptimized: false, unit: !1, retainedNodes: !3)
!581 = !DISubroutineType(types: !582)
!582 = !{!520, !476, !476}
!583 = !DILocalVariable(name: "br", arg: 1, scope: !580, file: !28, line: 107, type: !476)
!584 = !DILocation(line: 107, column: 1, scope: !580)
!585 = !DILocation(line: 108, column: 11, scope: !580)
!586 = !DILocation(line: 108, column: 2, scope: !580)
!587 = distinct !DISubprogram(name: "request.GetBody..1command_line_arguments.BaseRequest", linkageName: "command_line_arguments.BaseRequest.GetBody", scope: null, file: !28, line: 99, type: !588, isLocal: false, isDefinition: true, scopeLine: 99, isOptimized: false, unit: !1, retainedNodes: !3)
!588 = !DISubroutineType(types: !589)
!589 = !{!482, !476, !476}
!590 = !DILocalVariable(name: "br", arg: 1, scope: !587, file: !28, line: 99, type: !476)
!591 = !DILocation(line: 99, column: 1, scope: !587)
!592 = !DILocation(line: 100, column: 11, scope: !587)
!593 = !DILocation(line: 100, column: 2, scope: !587)
!594 = !DILocalVariable(name: "$ret8", scope: !587, file: !28, line: 99, type: !482)
!595 = !DILocation(line: 99, column: 34, scope: !587)
!596 = distinct !DISubprogram(name: "request.GetHttpRequest..1command_line_arguments.BaseRequest", linkageName: "command_line_arguments.BaseRequest.GetHttpRequest", scope: null, file: !28, line: 83, type: !597, isLocal: false, isDefinition: true, scopeLine: 83, isOptimized: false, unit: !1, retainedNodes: !3)
!597 = !DISubroutineType(types: !598)
!598 = !{!157, !476, !476}
!599 = !DILocalVariable(name: "br", arg: 1, scope: !596, file: !28, line: 83, type: !476)
!600 = !DILocation(line: 83, column: 1, scope: !596)
!601 = !DILocalVariable(name: "$ret6", scope: !596, file: !28, line: 83, type: !157)
!602 = !DILocation(line: 83, column: 41, scope: !596)
!603 = !DILocation(line: 84, column: 11, scope: !596)
!604 = !DILocation(line: 84, column: 2, scope: !596)
!605 = distinct !DISubprogram(name: "request.GetId..1command_line_arguments.BaseRequest", linkageName: "command_line_arguments.BaseRequest.GetId", scope: null, file: !28, line: 91, type: !606, isLocal: false, isDefinition: true, scopeLine: 91, isOptimized: false, unit: !1, retainedNodes: !3)
!606 = !DISubroutineType(types: !607)
!607 = !{!148, !476, !476}
!608 = !DILocalVariable(name: "br", arg: 1, scope: !605, file: !28, line: 91, type: !476)
!609 = !DILocation(line: 91, column: 1, scope: !605)
!610 = !DILocalVariable(name: "$ret7", scope: !605, file: !28, line: 91, type: !148)
!611 = !DILocation(line: 91, column: 32, scope: !605)
!612 = !DILocation(line: 92, column: 11, scope: !605)
!613 = !DILocation(line: 92, column: 2, scope: !605)
!614 = distinct !DISubprogram(name: "request.GetLastAttempt..1command_line_arguments.BaseRequest", linkageName: "command_line_arguments.BaseRequest.GetLastAttempt", scope: null, file: !28, line: 111, type: !615, isLocal: false, isDefinition: true, scopeLine: 111, isOptimized: false, unit: !1, retainedNodes: !3)
!615 = !DISubroutineType(types: !616)
!616 = !{!524, !476, !476}
!617 = !DILocalVariable(name: "br", arg: 1, scope: !614, file: !28, line: 111, type: !476)
!618 = !DILocation(line: 111, column: 1, scope: !614)
!619 = !DILocation(line: 112, column: 11, scope: !614)
!620 = !DILocation(line: 112, column: 22, scope: !614)
!621 = !DILocalVariable(name: "$ret10", scope: !614, file: !28, line: 111, type: !524)
!622 = !DILocation(line: 111, column: 41, scope: !614)
!623 = !DILocation(line: 113, column: 3, scope: !614)
!624 = !DILocation(line: 115, column: 37, scope: !614)
!625 = !DILocation(line: 115, column: 20, scope: !614)
!626 = !DILocation(line: 115, column: 2, scope: !614)
!627 = distinct !DISubprogram(name: "request.GetUserData..1command_line_arguments.BaseRequest", linkageName: "command_line_arguments.BaseRequest.GetUserData", scope: null, file: !28, line: 125, type: !628, isLocal: false, isDefinition: true, scopeLine: 125, isOptimized: false, unit: !1, retainedNodes: !3)
!628 = !DISubroutineType(types: !629)
!629 = !{!630, !476, !476, !70}
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{PrivateKey,bool}", file: !41, size: 192, align: 8, elements: !631)
!631 = !{!632, !633}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "i", file: !41, line: 125, baseType: !237, size: 128, align: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !41, line: 125, baseType: !22, size: 8, align: 8, offset: 128)
!634 = !DILocalVariable(name: "br", arg: 1, scope: !627, file: !28, line: 125, type: !476)
!635 = !DILocation(line: 125, column: 1, scope: !627)
!636 = !DILocalVariable(name: "key", arg: 2, scope: !627, file: !28, line: 125, type: !70)
!637 = !DILocation(line: 125, column: 36, scope: !627)
!638 = !DILocalVariable(name: "b", scope: !627, file: !28, line: 125, type: !22)
!639 = !DILocation(line: 125, column: 64, scope: !627)
!640 = !DILocation(line: 126, column: 4, scope: !627)
!641 = !DILocation(line: 133, column: 1, scope: !627)
!642 = !DILocation(line: 126, column: 18, scope: !627)
!643 = !DILocation(line: 127, column: 10, scope: !627)
!644 = !DILocation(line: 127, column: 2, scope: !627)
!645 = !DILocation(line: 128, column: 7, scope: !627)
!646 = !DILocation(line: 128, column: 17, scope: !627)
!647 = !DILocation(line: 131, column: 7, scope: !627)
!648 = !DILocation(line: 132, column: 2, scope: !627)
!649 = !DILocation(line: 129, column: 3, scope: !627)
!650 = distinct !DISubprogram(name: "request.SetBody..1command_line_arguments.BaseRequest", linkageName: "command_line_arguments.BaseRequest.SetBody", scope: null, file: !28, line: 95, type: !651, isLocal: false, isDefinition: true, scopeLine: 95, isOptimized: false, unit: !1, retainedNodes: !3)
!651 = !DISubroutineType(types: !652)
!652 = !{!14, !476, !476, !482}
!653 = !DILocalVariable(name: "br", arg: 1, scope: !650, file: !28, line: 95, type: !476)
!654 = !DILocation(line: 95, column: 1, scope: !650)
!655 = !DILocation(line: 96, column: 4, scope: !650)
!656 = !DILocation(line: 96, column: 10, scope: !650)
!657 = distinct !DISubprogram(name: "request.SetHttpRequest..1command_line_arguments.BaseRequest", linkageName: "command_line_arguments.BaseRequest.SetHttpRequest", scope: null, file: !28, line: 87, type: !658, isLocal: false, isDefinition: true, scopeLine: 87, isOptimized: false, unit: !1, retainedNodes: !3)
!658 = !DISubroutineType(types: !659)
!659 = !{!14, !476, !476, !157}
!660 = !DILocalVariable(name: "br", arg: 1, scope: !657, file: !28, line: 87, type: !476)
!661 = !DILocation(line: 87, column: 1, scope: !657)
!662 = !DILocalVariable(name: "r", arg: 2, scope: !657, file: !28, line: 87, type: !157)
!663 = !DILocation(line: 87, column: 39, scope: !657)
!664 = !DILocation(line: 88, column: 4, scope: !657)
!665 = !DILocation(line: 88, column: 17, scope: !657)
!666 = distinct !DISubprogram(name: "request.SetUserData..1command_line_arguments.BaseRequest", linkageName: "command_line_arguments.BaseRequest.SetUserData", scope: null, file: !28, line: 117, type: !667, isLocal: false, isDefinition: true, scopeLine: 117, isOptimized: false, unit: !1, retainedNodes: !3)
!667 = !DISubroutineType(types: !668)
!668 = !{!14, !476, !476, !70, !237}
!669 = !DILocalVariable(name: "br", arg: 1, scope: !666, file: !28, line: 117, type: !476)
!670 = !DILocation(line: 117, column: 1, scope: !666)
!671 = !DILocalVariable(name: "key", arg: 2, scope: !666, file: !28, line: 117, type: !70)
!672 = !DILocation(line: 117, column: 36, scope: !666)
!673 = !DILocalVariable(name: "baton", arg: 3, scope: !666, file: !28, line: 117, type: !237)
!674 = !DILocation(line: 117, column: 48, scope: !666)
!675 = !DILocation(line: 118, column: 4, scope: !666)
!676 = !DILocation(line: 124, column: 1, scope: !666)
!677 = !DILocation(line: 118, column: 18, scope: !666)
!678 = !DILocation(line: 119, column: 10, scope: !666)
!679 = !DILocation(line: 119, column: 2, scope: !666)
!680 = !DILocation(line: 120, column: 7, scope: !666)
!681 = !DILocation(line: 120, column: 17, scope: !666)
!682 = !DILocation(line: 121, column: 17, scope: !666)
!683 = !DILocation(line: 121, column: 15, scope: !666)
!684 = !DILocation(line: 123, column: 4, scope: !666)
!685 = !DILocation(line: 123, column: 19, scope: !666)
