; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22vulcan\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22log\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/log\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/mailgun/log\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/vulcan/errors\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/mailgun/vulcan/errors\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22netutils\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/vulcan/netutils\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/mailgun/vulcan/netutils\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22request\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./proxy.go", directory: "/home/wangcong/go_path/src/github.com/vulcand/vulcan")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "vulcan.command_line_arguments.Proxy..hash", linkageName: "command_line_arguments.command_line_arguments.Proxy..hash", scope: null, file: !7, line: 1, type: !10, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !13, !12}
!12 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "void")
!15 = !DILocalVariable(name: "key", arg: 1, scope: !9, file: !7, line: 1, type: !13)
!16 = !DILocation(line: 1, column: 1, scope: !9)
!17 = !DILocalVariable(name: "seed", arg: 2, scope: !9, file: !7, line: 1, type: !12)
!18 = !DILocalVariable(name: "$ret9", scope: !9, file: !7, line: 1, type: !12)
!19 = !DILocalVariable(name: "key", arg: 1, scope: !20, file: !7, line: 1, type: !13)
!20 = distinct !DISubprogram(name: "vulcan.command_line_arguments.Options..hash", linkageName: "command_line_arguments.command_line_arguments.Options..hash", scope: null, file: !7, line: 1, type: !10, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!21 = !DILocation(line: 1, column: 1, scope: !20, inlinedAt: !22)
!22 = distinct !DILocation(line: 1, column: 1, scope: !9)
!23 = !DILocalVariable(name: "seed", arg: 2, scope: !20, file: !7, line: 1, type: !12)
!24 = !DILocalVariable(name: "$ret23", scope: !20, file: !7, line: 1, type: !12)
!25 = distinct !DISubprogram(name: "vulcan.command_line_arguments.Proxy..eq", linkageName: "command_line_arguments.command_line_arguments.Proxy..eq", scope: null, file: !7, line: 1, type: !26, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !13, !13}
!28 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!29 = !DILocalVariable(name: "key1", arg: 1, scope: !25, file: !7, line: 1, type: !13)
!30 = !DILocation(line: 1, column: 1, scope: !25)
!31 = !DILocalVariable(name: "key2", arg: 2, scope: !25, file: !7, line: 1, type: !13)
!32 = !DILocalVariable(name: "$ret10", scope: !25, file: !7, line: 1, type: !28)
!33 = distinct !DISubprogram(name: "vulcan.GetRouter..1command_line_arguments.Proxy", linkageName: "command_line_arguments.Proxy.GetRouter", scope: null, file: !34, line: 71, type: !35, isLocal: false, isDefinition: true, scopeLine: 71, isOptimized: false, unit: !1, retainedNodes: !3)
!34 = !DIFile(filename: "proxy.go", directory: ".")
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !583, !583}
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "Router", file: !34, line: 14, size: 128, align: 8, elements: !38)
!38 = !{!39, !173}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !34, line: 14, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Request)struct{Location,error}}", file: !42, size: 128, align: 8, elements: !43)
!42 = !DIFile(filename: "", directory: "")
!43 = !{!44, !95}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !42, line: 14, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !47)
!47 = !{!48, !49, !50, !51, !53, !54, !55, !61, !67, !69, !76, !94}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !12, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !52, size: 8, align: 8, offset: 160)
!52 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !52, size: 8, align: 8, offset: 168)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !52, size: 8, align: 8, offset: 176)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !56, size: 64, align: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !58)
!58 = !{!59}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !62, size: 64, align: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !64)
!64 = !{!65}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !68, size: 64, align: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !70, size: 64, align: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !68, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !77, size: 64, align: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !79)
!79 = !{!80, !81, !82}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !70, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !70, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !83, size: 192, align: 64, offset: 128)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !42, size: 192, align: 8, elements: !84)
!84 = !{!85, !92, !93}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !42, line: 1, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !88)
!88 = !{!80, !81, !89, !90, !91}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !42, line: 1, baseType: !75, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !42, line: 1, baseType: !75, size: 64, align: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Route", file: !42, line: 14, baseType: !96, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!99, !13, !455}
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Location,error}", file: !42, size: 256, align: 8, elements: !100)
!100 = !{!101, !582}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !42, line: 14, baseType: !102, size: 128, align: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !34, line: 14, size: 128, align: 8, elements: !103)
!103 = !{!104, !173}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !34, line: 14, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void,Request)struct{*Response,error}}", file: !42, size: 192, align: 8, elements: !107)
!107 = !{!44, !108, !112}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "GetId", file: !42, line: 14, baseType: !109, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!71, !13}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "RoundTrip", file: !42, line: 14, baseType: !113, size: 64, align: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!116, !13, !455}
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Response,error}", file: !42, size: 192, align: 8, elements: !117)
!117 = !{!118, !454}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !42, line: 14, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !34, line: 7, size: 1152, align: 8, elements: !121)
!121 = !{!122, !123, !124, !125, !126, !127, !141, !174, !176, !180, !181, !182, !183, !453}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !34, line: 7, baseType: !71, size: 128, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "StatusCode", file: !34, line: 7, baseType: !75, size: 64, align: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Proto", file: !34, line: 7, baseType: !71, size: 128, align: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMajor", file: !34, line: 7, baseType: !75, size: 64, align: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMinor", file: !34, line: 7, baseType: !75, size: 64, align: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !34, line: 7, baseType: !128, size: 64, align: 64, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !130)
!130 = !{!131, !132, !133, !134, !136, !137, !138, !139, !140}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !75, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !52, size: 8, align: 8, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !52, size: 8, align: 8, offset: 72)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !135, size: 16, align: 16, offset: 80)
!135 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !12, size: 64, align: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !34, line: 7, baseType: !142, size: 128, align: 64, offset: 512)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !34, line: 5, size: 128, align: 8, elements: !143)
!143 = !{!144, !173}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !34, line: 5, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !42, size: 192, align: 8, elements: !147)
!147 = !{!148, !149, !162}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !42, line: 5, baseType: !45, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !42, line: 5, baseType: !150, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!153, !13}
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !154)
!154 = !{!155, !161}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !42, size: 128, align: 8, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !42, line: 1, baseType: !45, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !42, line: 1, baseType: !109, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !42, line: 5, baseType: !163, size: 64, align: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!166, !13, !170}
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !42, size: 192, align: 8, elements: !167)
!167 = !{!168, !169}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !42, line: 5, baseType: !75, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !42, line: 5, baseType: !153, size: 128, align: 64, offset: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !42, size: 192, align: 8, elements: !171)
!171 = !{!172, !92, !93}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !42, line: 1, baseType: !68, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !34, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !34, line: 7, baseType: !175, size: 64, align: 64, offset: 640)
!175 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !34, line: 7, baseType: !177, size: 192, align: 64, offset: 704)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !42, size: 192, align: 8, elements: !178)
!178 = !{!179, !92, !93}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !42, line: 1, baseType: !70, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !34, line: 7, baseType: !28, size: 8, align: 8, offset: 896)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Uncompressed", file: !34, line: 7, baseType: !28, size: 8, align: 8, offset: 904)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !34, line: 7, baseType: !128, size: 64, align: 64, offset: 960)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Request", file: !34, line: 7, baseType: !184, size: 64, align: 64, offset: 1024)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !34, line: 7, size: 1984, align: 8, elements: !186)
!186 = !{!187, !188, !124, !125, !126, !127, !141, !207, !219, !220, !221, !222, !223, !224, !225, !231, !232, !233, !234, !424, !427, !428}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !34, line: 7, baseType: !71, size: 128, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !34, line: 7, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !34, line: 7, size: 1024, align: 8, elements: !191)
!191 = !{!192, !193, !194, !201, !202, !203, !204, !205, !206}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !34, line: 7, baseType: !71, size: 128, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !34, line: 7, baseType: !71, size: 128, align: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !34, line: 7, baseType: !195, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !34, line: 7, size: 320, align: 8, elements: !197)
!197 = !{!198, !199, !200}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !34, line: 7, baseType: !71, size: 128, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !34, line: 7, baseType: !71, size: 128, align: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !34, line: 7, baseType: !28, size: 8, align: 8, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !34, line: 7, baseType: !71, size: 128, align: 64, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !34, line: 7, baseType: !71, size: 128, align: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !34, line: 7, baseType: !71, size: 128, align: 64, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !34, line: 7, baseType: !28, size: 8, align: 8, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !34, line: 7, baseType: !71, size: 128, align: 64, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !34, line: 7, baseType: !71, size: 128, align: 64, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !34, line: 7, baseType: !208, size: 64, align: 64, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !34, line: 7, size: 64, align: 8, elements: !210)
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !34, line: 7, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!215}
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !42, size: 256, align: 8, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !42, line: 7, baseType: !142, size: 128, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !42, line: 7, baseType: !153, size: 128, align: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !34, line: 7, baseType: !175, size: 64, align: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !34, line: 7, baseType: !177, size: 192, align: 64, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !34, line: 7, baseType: !28, size: 8, align: 8, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !34, line: 7, baseType: !71, size: 128, align: 64, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Form", file: !34, line: 7, baseType: !128, size: 64, align: 64, offset: 1152)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "PostForm", file: !34, line: 7, baseType: !128, size: 64, align: 64, offset: 1216)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "MultipartForm", file: !34, line: 7, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", file: !34, line: 7, size: 128, align: 8, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !34, line: 7, baseType: !128, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !34, line: 7, baseType: !128, size: 64, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !34, line: 7, baseType: !128, size: 64, align: 64, offset: 1344)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !34, line: 7, baseType: !71, size: 128, align: 64, offset: 1408)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "RequestURI", file: !34, line: 7, baseType: !71, size: 128, align: 64, offset: 1536)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !34, line: 7, baseType: !235, size: 64, align: 64, offset: 1664)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionState", file: !34, line: 7, size: 1344, align: 8, elements: !237)
!237 = !{!238, !239, !240, !241, !242, !243, !244, !245, !412, !417, !422, !423}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !34, line: 7, baseType: !135, size: 16, align: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "HandshakeComplete", file: !34, line: 7, baseType: !28, size: 8, align: 8, offset: 16)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "DidResume", file: !34, line: 7, baseType: !28, size: 8, align: 8, offset: 24)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuite", file: !34, line: 7, baseType: !135, size: 16, align: 16, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocol", file: !34, line: 7, baseType: !71, size: 128, align: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocolIsMutual", file: !34, line: 7, baseType: !28, size: 8, align: 8, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !34, line: 7, baseType: !71, size: 128, align: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "PeerCertificates", file: !34, line: 7, baseType: !246, size: 192, align: 64, offset: 384)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !42, size: 192, align: 8, elements: !247)
!247 = !{!248, !92, !93}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !42, line: 1, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !34, line: 7, size: 10624, align: 8, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !261, !263, !267, !268, !281, !307, !308, !342, !343, !345, !355, !356, !361, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !386, !391, !392, !393, !394, !405, !406, !407, !408, !409, !410, !411}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !34, line: 7, baseType: !170, size: 192, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !34, line: 7, baseType: !170, size: 192, align: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !34, line: 7, baseType: !170, size: 192, align: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !34, line: 7, baseType: !170, size: 192, align: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !34, line: 7, baseType: !170, size: 192, align: 64, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !34, line: 7, baseType: !170, size: 192, align: 64, offset: 960)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !34, line: 7, baseType: !260, size: 64, align: 64, offset: 1152)
!260 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !34, line: 7, baseType: !262, size: 64, align: 64, offset: 1216)
!262 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !34, line: 7, baseType: !264, size: 128, align: 64, offset: 1280)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !34, line: 7, size: 128, align: 8, elements: !265)
!265 = !{!266, !173}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !34, line: 1, baseType: !45, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !34, line: 7, baseType: !75, size: 64, align: 64, offset: 1408)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !34, line: 7, baseType: !269, size: 64, align: 64, offset: 1472)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !34, line: 7, size: 256, align: 8, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !34, line: 7, baseType: !28, size: 8, align: 8)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !34, line: 7, baseType: !274, size: 192, align: 64, offset: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !34, line: 7, size: 192, align: 8, elements: !275)
!275 = !{!276, !279, !280}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !34, line: 1, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !34, line: 1, baseType: !75, size: 64, align: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !34, line: 1, baseType: !75, size: 64, align: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !34, line: 7, baseType: !282, size: 1984, align: 64, offset: 1536)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !34, line: 7, size: 1984, align: 8, elements: !283)
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !306}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !34, line: 7, baseType: !177, size: 192, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !34, line: 7, baseType: !177, size: 192, align: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !34, line: 7, baseType: !177, size: 192, align: 64, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !34, line: 7, baseType: !177, size: 192, align: 64, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !34, line: 7, baseType: !177, size: 192, align: 64, offset: 768)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !34, line: 7, baseType: !177, size: 192, align: 64, offset: 960)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !34, line: 7, baseType: !177, size: 192, align: 64, offset: 1152)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !34, line: 7, baseType: !71, size: 128, align: 64, offset: 1344)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !34, line: 7, baseType: !71, size: 128, align: 64, offset: 1472)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !34, line: 7, baseType: !294, size: 192, align: 64, offset: 1600)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !42, size: 192, align: 8, elements: !295)
!295 = !{!296, !92, !93}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !42, line: 1, baseType: !297, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !34, line: 7, size: 320, align: 8, elements: !299)
!299 = !{!300, !305}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !34, line: 7, baseType: !301, size: 192, align: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !34, line: 7, size: 192, align: 8, elements: !302)
!302 = !{!303, !279, !280}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !34, line: 1, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !34, line: 7, baseType: !264, size: 128, align: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !34, line: 7, baseType: !294, size: 192, align: 64, offset: 1792)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !34, line: 7, baseType: !282, size: 1984, align: 64, offset: 3520)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !34, line: 7, baseType: !309, size: 192, align: 64, offset: 5504)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !34, line: 6, size: 192, align: 8, elements: !310)
!310 = !{!311, !313, !314}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !34, line: 6, baseType: !312, size: 64, align: 64)
!312 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !34, line: 6, baseType: !175, size: 64, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !34, line: 6, baseType: !315, size: 64, align: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !34, line: 6, size: 704, align: 8, elements: !317)
!317 = !{!318, !319, !328, !339, !340, !341}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !34, line: 6, baseType: !71, size: 128, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !34, line: 6, baseType: !320, size: 192, align: 64, offset: 128)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !42, size: 192, align: 8, elements: !321)
!321 = !{!322, !92, !93}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !42, line: 1, baseType: !323, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !34, line: 6, size: 256, align: 8, elements: !325)
!325 = !{!318, !326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !34, line: 6, baseType: !75, size: 64, align: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !34, line: 6, baseType: !28, size: 8, align: 8, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !34, line: 6, baseType: !329, size: 192, align: 64, offset: 320)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !42, size: 192, align: 8, elements: !330)
!330 = !{!331, !92, !93}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !42, line: 1, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !34, line: 6, size: 128, align: 8, elements: !334)
!334 = !{!335, !336, !337, !338}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !34, line: 6, baseType: !175, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !34, line: 6, baseType: !52, size: 8, align: 8, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !34, line: 6, baseType: !28, size: 8, align: 8, offset: 72)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !34, line: 6, baseType: !28, size: 8, align: 8, offset: 80)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !34, line: 6, baseType: !175, size: 64, align: 64, offset: 512)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !34, line: 6, baseType: !175, size: 64, align: 64, offset: 576)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !34, line: 6, baseType: !323, size: 64, align: 64, offset: 640)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !34, line: 7, baseType: !309, size: 192, align: 64, offset: 5696)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !34, line: 7, baseType: !344, size: 64, align: 64, offset: 5888)
!344 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !34, line: 7, baseType: !346, size: 192, align: 64, offset: 5952)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !42, size: 192, align: 8, elements: !347)
!347 = !{!348, !92, !93}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !42, line: 1, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !34, line: 7, size: 448, align: 8, elements: !351)
!351 = !{!352, !353, !354}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !34, line: 7, baseType: !301, size: 192, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !34, line: 7, baseType: !28, size: 8, align: 8, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !34, line: 7, baseType: !170, size: 192, align: 64, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !34, line: 7, baseType: !346, size: 192, align: 64, offset: 6144)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !34, line: 7, baseType: !357, size: 192, align: 64, offset: 6336)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !42, size: 192, align: 8, elements: !358)
!358 = !{!359, !92, !93}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !42, line: 1, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !34, line: 7, baseType: !362, size: 192, align: 64, offset: 6528)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !42, size: 192, align: 8, elements: !363)
!363 = !{!364, !92, !93}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !42, line: 1, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !34, line: 7, baseType: !357, size: 192, align: 64, offset: 6720)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !34, line: 7, baseType: !28, size: 8, align: 8, offset: 6912)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !34, line: 7, baseType: !28, size: 8, align: 8, offset: 6920)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !34, line: 7, baseType: !75, size: 64, align: 64, offset: 6976)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !34, line: 7, baseType: !28, size: 8, align: 8, offset: 7040)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !34, line: 7, baseType: !170, size: 192, align: 64, offset: 7104)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !34, line: 7, baseType: !170, size: 192, align: 64, offset: 7296)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !34, line: 7, baseType: !177, size: 192, align: 64, offset: 7488)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !34, line: 7, baseType: !177, size: 192, align: 64, offset: 7680)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !34, line: 7, baseType: !177, size: 192, align: 64, offset: 7872)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !34, line: 7, baseType: !177, size: 192, align: 64, offset: 8064)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !34, line: 7, baseType: !379, size: 192, align: 64, offset: 8256)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !42, size: 192, align: 8, elements: !380)
!380 = !{!381, !92, !93}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !42, line: 1, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !34, line: 6, size: 192, align: 8, elements: !384)
!384 = !{!385, !279, !280}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !34, line: 1, baseType: !68, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !34, line: 7, baseType: !387, size: 192, align: 64, offset: 8448)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !42, size: 192, align: 8, elements: !388)
!388 = !{!389, !92, !93}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !42, line: 1, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !34, line: 7, baseType: !28, size: 8, align: 8, offset: 8640)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !34, line: 7, baseType: !177, size: 192, align: 64, offset: 8704)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !34, line: 7, baseType: !177, size: 192, align: 64, offset: 8896)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !34, line: 7, baseType: !395, size: 192, align: 64, offset: 9088)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !42, size: 192, align: 8, elements: !396)
!396 = !{!397, !92, !93}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !42, line: 1, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !34, line: 6, size: 384, align: 8, elements: !401)
!401 = !{!402, !403}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !34, line: 6, baseType: !383, size: 192, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !34, line: 6, baseType: !404, size: 192, align: 64, offset: 192)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !34, line: 6, size: 192, align: 8, elements: !384)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !34, line: 7, baseType: !395, size: 192, align: 64, offset: 9280)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !34, line: 7, baseType: !177, size: 192, align: 64, offset: 9472)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !34, line: 7, baseType: !177, size: 192, align: 64, offset: 9664)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !34, line: 7, baseType: !177, size: 192, align: 64, offset: 9856)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !34, line: 7, baseType: !177, size: 192, align: 64, offset: 10048)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !34, line: 7, baseType: !177, size: 192, align: 64, offset: 10240)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !34, line: 7, baseType: !357, size: 192, align: 64, offset: 10432)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "VerifiedChains", file: !34, line: 7, baseType: !413, size: 192, align: 64, offset: 576)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !42, size: 192, align: 8, elements: !414)
!414 = !{!415, !92, !93}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !42, line: 1, baseType: !416, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !34, line: 7, baseType: !418, size: 192, align: 64, offset: 768)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !42, size: 192, align: 8, elements: !419)
!419 = !{!420, !92, !93}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !42, line: 1, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPResponse", file: !34, line: 7, baseType: !170, size: 192, align: 64, offset: 960)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "TLSUnique", file: !34, line: 7, baseType: !170, size: 192, align: 64, offset: 1152)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", file: !34, line: 7, baseType: !425, size: 64, align: 64, offset: 1728)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !7, line: 1, align: 8, elements: !3)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !34, line: 7, baseType: !13, size: 64, align: 64, offset: 1792)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !34, line: 7, baseType: !429, size: 128, align: 64, offset: 1856)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !34, line: 6, size: 128, align: 8, elements: !430)
!430 = !{!431, !173}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !34, line: 6, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,PrivateKey)PrivateKey}", file: !42, size: 320, align: 8, elements: !434)
!434 = !{!435, !436, !444, !448, !449}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !42, line: 6, baseType: !45, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !42, line: 6, baseType: !437, size: 64, align: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!440, !13}
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !42, size: 256, align: 8, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !42, line: 6, baseType: !309, size: 192, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !42, line: 6, baseType: !28, size: 8, align: 8, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !42, line: 6, baseType: !445, size: 64, align: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!425, !13}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !42, line: 6, baseType: !150, size: 64, align: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !42, line: 6, baseType: !450, size: 64, align: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!264, !13, !264}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !34, line: 7, baseType: !235, size: 64, align: 64, offset: 1088)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !42, line: 14, baseType: !153, size: 128, align: 64, offset: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !34, line: 13, size: 128, align: 8, elements: !456)
!456 = !{!457, !173}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !34, line: 13, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Attempt)void,*func(*void,string)void,*func(*void)struct{*Attempt,int,int},*func(*void)MultiReader,*func(*void)*Request,*func(*void)int64,*func(*void)Attempt,*func(*void,string)struct{PrivateKey,bool},*func(*void,MultiReader)void,*func(*void,*Request)void,*func(*void,string,PrivateKey)void,*func(*void)string}", file: !42, size: 832, align: 8, elements: !460)
!460 = !{!461, !462, !498, !502, !510, !549, !553, !557, !561, !569, !573, !577, !581}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !42, line: 13, baseType: !45, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "AddAttempt", file: !42, line: 13, baseType: !463, size: 64, align: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!14, !13, !466}
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "Attempt", file: !34, line: 13, size: 128, align: 8, elements: !467)
!467 = !{!468, !173}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !34, line: 13, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Duration,*func(*void)Endpoint,*func(*void)error,*func(*void)*Response}", file: !42, size: 320, align: 8, elements: !471)
!471 = !{!461, !472, !477, !493, !494}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "GetDuration", file: !42, line: 13, baseType: !473, size: 64, align: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!476, !13}
!476 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "GetEndpoint", file: !42, line: 13, baseType: !478, size: 64, align: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!481, !13}
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "Endpoint", file: !34, line: 13, size: 128, align: 8, elements: !482)
!482 = !{!483, !173}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !34, line: 13, baseType: !484, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)*URL,*func(*void)string}", file: !42, size: 256, align: 8, elements: !486)
!486 = !{!461, !487, !488, !492}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "GetId", file: !42, line: 13, baseType: !109, size: 64, align: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "GetUrl", file: !42, line: 13, baseType: !489, size: 64, align: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!189, !13}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !42, line: 13, baseType: !109, size: 64, align: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "GetError", file: !42, line: 13, baseType: !150, size: 64, align: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "GetResponse", file: !42, line: 13, baseType: !495, size: 64, align: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!119, !13}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteUserData", file: !42, line: 13, baseType: !499, size: 64, align: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!14, !13, !71}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "GetAttempts", file: !42, line: 13, baseType: !503, size: 64, align: 64, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!506, !13}
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Attempt,int,int}", file: !42, size: 192, align: 8, elements: !507)
!507 = !{!508, !92, !93}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !42, line: 1, baseType: !509, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !42, line: 13, baseType: !511, size: 64, align: 64, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!514, !13}
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiReader", file: !34, line: 12, size: 128, align: 8, elements: !515)
!515 = !{!516, !173}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !34, line: 12, baseType: !517, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,int64,int)struct{int64,error},*func(*void)struct{int64,error},*func(*void,Writer)struct{int64,error}}", file: !42, size: 384, align: 8, elements: !519)
!519 = !{!520, !521, !522, !523, !531, !535}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !42, line: 12, baseType: !45, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !42, line: 12, baseType: !150, size: 64, align: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !42, line: 12, baseType: !163, size: 64, align: 64, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Seek", file: !42, line: 12, baseType: !524, size: 64, align: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!527, !13, !175, !75}
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !42, size: 192, align: 8, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !42, line: 5, baseType: !175, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !42, line: 5, baseType: !153, size: 128, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "TotalSize", file: !42, line: 12, baseType: !532, size: 64, align: 64, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!527, !13}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "WriteTo", file: !42, line: 12, baseType: !536, size: 64, align: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!539, !13, !542}
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !42, size: 192, align: 8, elements: !540)
!540 = !{!541, !169}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !42, line: 5, baseType: !175, size: 64, align: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !34, line: 5, size: 128, align: 8, elements: !543)
!543 = !{!544, !173}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !34, line: 5, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !42, size: 128, align: 8, elements: !547)
!547 = !{!148, !548}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !42, line: 5, baseType: !163, size: 64, align: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "GetHttpRequest", file: !42, line: 13, baseType: !550, size: 64, align: 64, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!184, !13}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "GetId", file: !42, line: 13, baseType: !554, size: 64, align: 64, offset: 384)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!175, !13}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "GetLastAttempt", file: !42, line: 13, baseType: !558, size: 64, align: 64, offset: 448)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!466, !13}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserData", file: !42, line: 13, baseType: !562, size: 64, align: 64, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!565, !13, !71}
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{PrivateKey,bool}", file: !42, size: 192, align: 8, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !42, line: 13, baseType: !264, size: 128, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !42, line: 13, baseType: !28, size: 8, align: 8, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "SetBody", file: !42, line: 13, baseType: !570, size: 64, align: 64, offset: 576)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!14, !13, !514}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "SetHttpRequest", file: !42, line: 13, baseType: !574, size: 64, align: 64, offset: 640)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!14, !13, !184}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "SetUserData", file: !42, line: 13, baseType: !578, size: 64, align: 64, offset: 704)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!14, !13, !71, !264}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !42, line: 13, baseType: !109, size: 64, align: 64, offset: 768)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !42, line: 14, baseType: !153, size: 128, align: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "Proxy", file: !34, line: 17, size: 320, align: 8, elements: !585)
!585 = !{!586, !587, !622}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "router", file: !34, line: 19, baseType: !37, size: 128, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "options", file: !34, line: 21, baseType: !588, size: 128, align: 64, offset: 128)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "Options", file: !34, line: 26, size: 128, align: 8, elements: !589)
!589 = !{!590}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorFormatter", file: !34, line: 28, baseType: !591, size: 128, align: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", file: !34, line: 11, size: 128, align: 8, elements: !592)
!592 = !{!593, !173}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !34, line: 11, baseType: !594, size: 64, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,ProxyError)struct{int,struct{*uint8,int,int},string}}", file: !42, size: 128, align: 8, elements: !596)
!596 = !{!597, !598}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !42, line: 11, baseType: !45, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Format", file: !42, line: 11, baseType: !599, size: 64, align: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!602, !13, !607}
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,struct{*uint8,int,int},string}", file: !42, size: 384, align: 8, elements: !603)
!603 = !{!604, !605, !606}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "statusCode", file: !42, line: 11, baseType: !75, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "body", file: !42, line: 11, baseType: !170, size: 192, align: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "contentType", file: !42, line: 11, baseType: !71, size: 128, align: 64, offset: 256)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProxyError", file: !34, line: 11, size: 128, align: 8, elements: !608)
!608 = !{!609, !173}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !34, line: 11, baseType: !610, size: 64, align: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)int,*func(*void)Header}", file: !42, size: 256, align: 8, elements: !612)
!612 = !{!597, !613, !614, !618}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !42, line: 11, baseType: !109, size: 64, align: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "GetStatusCode", file: !42, line: 11, baseType: !615, size: 64, align: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!75, !13}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Headers", file: !42, line: 11, baseType: !619, size: 64, align: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!128, !13}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "lastRequestId", file: !34, line: 23, baseType: !175, size: 64, align: 64, offset: 256)
!623 = !DILocalVariable(name: "p", arg: 1, scope: !33, file: !34, line: 71, type: !583)
!624 = !DILocation(line: 71, column: 1, scope: !33)
!625 = !DILocation(line: 72, column: 10, scope: !33)
!626 = !DILocation(line: 72, column: 2, scope: !33)
!627 = !DILocalVariable(name: "$ret4", scope: !33, file: !34, line: 71, type: !37)
!628 = !DILocation(line: 71, column: 29, scope: !33)
!629 = distinct !DISubprogram(name: "vulcan.ServeHTTP..1command_line_arguments.Proxy", linkageName: "command_line_arguments.Proxy.ServeHTTP", scope: null, file: !34, line: 32, type: !630, isLocal: false, isDefinition: true, scopeLine: 32, isOptimized: false, unit: !1, retainedNodes: !3)
!630 = !DISubroutineType(types: !631)
!631 = !{!14, !583, !583, !632, !184}
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "ResponseWriter", file: !34, line: 7, size: 128, align: 8, elements: !633)
!633 = !{!634, !173}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !34, line: 7, baseType: !635, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Header,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,int)void}", file: !42, size: 256, align: 8, elements: !637)
!637 = !{!638, !639, !640, !648}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !42, line: 7, baseType: !45, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !42, line: 7, baseType: !619, size: 64, align: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !42, line: 7, baseType: !641, size: 64, align: 64, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!644, !13, !170}
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !42, size: 192, align: 8, elements: !645)
!645 = !{!646, !647}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !42, line: 7, baseType: !75, size: 64, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !42, line: 7, baseType: !153, size: 128, align: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "WriteHeader", file: !42, line: 7, baseType: !649, size: 64, align: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!14, !13, !75}
!652 = !DILocalVariable(name: "p", arg: 1, scope: !629, file: !34, line: 32, type: !583)
!653 = !DILocation(line: 32, column: 1, scope: !629)
!654 = !DILocalVariable(name: "w", arg: 2, scope: !629, file: !34, line: 32, type: !632)
!655 = !DILocation(line: 32, column: 27, scope: !629)
!656 = !DILocalVariable(name: "r", arg: 3, scope: !629, file: !34, line: 32, type: !184)
!657 = !DILocation(line: 32, column: 50, scope: !629)
!658 = !DILocation(line: 33, column: 10, scope: !659)
!659 = distinct !DILexicalBlock(scope: !629, file: !34, line: 32, column: 1)
!660 = !DILocalVariable(name: "err", scope: !659, file: !34, line: 33, type: !153)
!661 = !DILocation(line: 33, column: 2, scope: !629)
!662 = !DILocation(line: 34, column: 9, scope: !659)
!663 = !DILocation(line: 35, column: 3, scope: !659)
!664 = !DILocation(line: 38, column: 2, scope: !659)
!665 = !DILocation(line: 39, column: 2, scope: !659)
!666 = !DILocalVariable(name: "e", scope: !667, file: !34, line: 38, type: !153)
!667 = distinct !DILexicalBlock(scope: !659, file: !34, line: 48, column: 3)
!668 = !DILocation(line: 38, column: 9, scope: !659)
!669 = !DILocation(line: 48, column: 4, scope: !667)
!670 = !DILocation(line: 38, column: 9, scope: !671)
!671 = distinct !DILexicalBlock(scope: !659, file: !34, line: 41, column: 3)
!672 = !DILocation(line: 39, column: 2, scope: !671)
!673 = !DILocalVariable(name: "e", scope: !671, file: !34, line: 38, type: !674)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "RedirectError", file: !34, line: 11, size: 64, align: 8, elements: !676)
!676 = !{!677}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !34, line: 11, baseType: !189, size: 64, align: 64)
!678 = !DILocation(line: 41, column: 4, scope: !671)
!679 = !DILocation(line: 41, column: 12, scope: !671)
!680 = !DILocation(line: 41, column: 9, scope: !671)
!681 = !DILocation(line: 42, column: 13, scope: !671)
!682 = !DILocation(line: 42, column: 17, scope: !671)
!683 = !DILocation(line: 42, column: 4, scope: !671)
!684 = !DILocation(line: 42, column: 10, scope: !671)
!685 = !DILocation(line: 43, column: 19, scope: !671)
!686 = !DILocation(line: 43, column: 23, scope: !671)
!687 = !DILocation(line: 43, column: 4, scope: !671)
!688 = !DILocation(line: 43, column: 16, scope: !671)
!689 = !DILocation(line: 44, column: 14, scope: !690)
!690 = distinct !DILexicalBlock(scope: !671, file: !34, line: 44, column: 3)
!691 = !DILocalVariable(name: "err", scope: !690, file: !34, line: 44, type: !153)
!692 = !DILocation(line: 44, column: 6, scope: !671)
!693 = !DILocation(line: 44, column: 39, scope: !690)
!694 = !DILocation(line: 45, column: 5, scope: !690)
!695 = distinct !DISubprogram(name: "vulcan.proxyRequest..1command_line_arguments.Proxy", linkageName: "command_line_arguments.Proxy.proxyRequest", scope: null, file: !34, line: 76, type: !696, isLocal: false, isDefinition: true, scopeLine: 76, isOptimized: false, unit: !1, retainedNodes: !3)
!696 = !DISubroutineType(types: !697)
!697 = !{!153, !583, !583, !632, !184}
!698 = !DILocalVariable(name: "p", arg: 1, scope: !695, file: !34, line: 76, type: !583)
!699 = !DILocation(line: 76, column: 1, scope: !695)
!700 = !DILocalVariable(name: "w", arg: 2, scope: !695, file: !34, line: 76, type: !632)
!701 = !DILocation(line: 76, column: 30, scope: !695)
!702 = !DILocalVariable(name: "r", arg: 3, scope: !695, file: !34, line: 76, type: !184)
!703 = !DILocation(line: 76, column: 53, scope: !695)
!704 = !DILocation(line: 79, column: 53, scope: !705)
!705 = distinct !DILexicalBlock(scope: !695, file: !34, line: 76, column: 1)
!706 = !DILocation(line: 79, column: 42, scope: !705)
!707 = !DILocation(line: 79, column: 17, scope: !705)
!708 = !DILocalVariable(name: "req", scope: !705, file: !34, line: 79, type: !709)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "BaseRequest", file: !34, line: 13, size: 576, align: 8, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !730}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "HttpRequest", file: !34, line: 13, baseType: !184, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !34, line: 13, baseType: !175, size: 64, align: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !34, line: 13, baseType: !514, size: 128, align: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "Attempts", file: !34, line: 13, baseType: !506, size: 192, align: 64, offset: 256)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "userDataMutex", file: !34, line: 13, baseType: !717, size: 64, align: 64, offset: 448)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !34, line: 7, size: 192, align: 8, elements: !719)
!719 = !{!720, !726, !727, !728, !729}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !34, line: 7, baseType: !721, size: 64, align: 32)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !34, line: 5, size: 64, align: 8, elements: !722)
!722 = !{!723, !725}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !34, line: 5, baseType: !724, size: 32, align: 32)
!724 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !34, line: 5, baseType: !8, size: 32, align: 32, offset: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !34, line: 7, baseType: !8, size: 32, align: 32, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !34, line: 7, baseType: !8, size: 32, align: 32, offset: 96)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !34, line: 7, baseType: !724, size: 32, align: 32, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !34, line: 7, baseType: !724, size: 32, align: 32, offset: 160)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "userData", file: !34, line: 13, baseType: !128, size: 64, align: 64, offset: 512)
!731 = !DILocation(line: 79, column: 2, scope: !695)
!732 = !DILocation(line: 80, column: 27, scope: !705)
!733 = !DILocation(line: 80, column: 34, scope: !705)
!734 = !DILocalVariable(name: "location", scope: !705, file: !34, line: 80, type: !102)
!735 = !DILocation(line: 80, column: 2, scope: !695)
!736 = !DILocalVariable(name: "err", scope: !705, file: !34, line: 80, type: !153)
!737 = !DILocation(line: 81, column: 9, scope: !705)
!738 = !DILocation(line: 82, column: 3, scope: !705)
!739 = !DILocalVariable(name: "$ret5", scope: !695, file: !34, line: 76, type: !153)
!740 = !DILocation(line: 76, column: 70, scope: !695)
!741 = !DILocation(line: 86, column: 14, scope: !705)
!742 = !DILocation(line: 87, column: 7, scope: !705)
!743 = !DILocation(line: 88, column: 17, scope: !705)
!744 = !DILocation(line: 88, column: 3, scope: !705)
!745 = !DILocation(line: 91, column: 27, scope: !705)
!746 = !DILocalVariable(name: "response", scope: !705, file: !34, line: 91, type: !119)
!747 = !DILocation(line: 91, column: 2, scope: !695)
!748 = !DILocation(line: 92, column: 14, scope: !705)
!749 = !DILocation(line: 93, column: 25, scope: !705)
!750 = !DILocation(line: 93, column: 44, scope: !705)
!751 = !DILocation(line: 93, column: 12, scope: !705)
!752 = !DILocation(line: 94, column: 4, scope: !705)
!753 = !DILocation(line: 94, column: 25, scope: !705)
!754 = !DILocation(line: 95, column: 11, scope: !705)
!755 = !DILocation(line: 99, column: 3, scope: !705)
!756 = !DILocation(line: 95, column: 22, scope: !705)
!757 = !DILocation(line: 95, column: 6, scope: !705)
!758 = !DILocation(line: 96, column: 16, scope: !705)
!759 = !DILocation(line: 97, column: 3, scope: !705)
!760 = distinct !DISubprogram(name: "vulcan.replyError..1command_line_arguments.Proxy", linkageName: "command_line_arguments.Proxy.replyError", scope: null, file: !34, line: 104, type: !761, isLocal: false, isDefinition: true, scopeLine: 104, isOptimized: false, unit: !1, retainedNodes: !3)
!761 = !DISubroutineType(types: !762)
!762 = !{!14, !583, !583, !153, !632, !184}
!763 = !DILocalVariable(name: "p", arg: 1, scope: !760, file: !34, line: 104, type: !583)
!764 = !DILocation(line: 104, column: 1, scope: !760)
!765 = !DILocalVariable(name: "err", arg: 2, scope: !760, file: !34, line: 104, type: !153)
!766 = !DILocation(line: 104, column: 28, scope: !760)
!767 = !DILocalVariable(name: "w", arg: 3, scope: !760, file: !34, line: 104, type: !632)
!768 = !DILocation(line: 104, column: 39, scope: !760)
!769 = !DILocalVariable(name: "req", arg: 4, scope: !760, file: !34, line: 104, type: !184)
!770 = !DILocation(line: 104, column: 62, scope: !760)
!771 = !DILocalVariable(name: "err", arg: 1, scope: !772, file: !34, line: 122, type: !153)
!772 = distinct !DISubprogram(name: "vulcan.convertError", scope: null, file: !34, line: 122, type: !773, isLocal: true, isDefinition: true, scopeLine: 122, isOptimized: false, unit: !1, retainedNodes: !3)
!773 = !DISubroutineType(types: !774)
!774 = !{!607, !153}
!775 = !DILocation(line: 122, column: 19, scope: !772, inlinedAt: !776)
!776 = distinct !DILocation(line: 105, column: 16, scope: !777)
!777 = distinct !DILexicalBlock(scope: !760, file: !34, line: 104, column: 1)
!778 = !DILocation(line: 123, column: 2, scope: !772, inlinedAt: !776)
!779 = !DILocation(line: 124, column: 2, scope: !772, inlinedAt: !776)
!780 = !DILocation(line: 123, column: 9, scope: !781, inlinedAt: !776)
!781 = distinct !DILexicalBlock(scope: !772, file: !34, line: 125, column: 3)
!782 = !DILocation(line: 126, column: 2, scope: !772, inlinedAt: !776)
!783 = !DILocation(line: 124, column: 2, scope: !781, inlinedAt: !776)
!784 = !DILocalVariable(name: "e", scope: !781, file: !34, line: 123, type: !607)
!785 = !DILocation(line: 123, column: 9, scope: !772, inlinedAt: !776)
!786 = !DILocation(line: 125, column: 3, scope: !781, inlinedAt: !776)
!787 = !DILocalVariable(name: "$ret8", scope: !772, file: !34, line: 122, type: !607)
!788 = !DILocation(line: 122, column: 30, scope: !772, inlinedAt: !776)
!789 = !DILocation(line: 133, column: 16, scope: !772, inlinedAt: !776)
!790 = !DILocation(line: 133, column: 2, scope: !772, inlinedAt: !776)
!791 = !DILocation(line: 123, column: 9, scope: !792, inlinedAt: !776)
!792 = distinct !DILexicalBlock(scope: !772, file: !34, line: 127, column: 3)
!793 = !DILocation(line: 130, column: 2, scope: !772, inlinedAt: !776)
!794 = !DILocation(line: 126, column: 2, scope: !792, inlinedAt: !776)
!795 = !DILocalVariable(name: "e", scope: !792, file: !34, line: 123, type: !796)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", file: !34, line: 6, size: 128, align: 8, elements: !797)
!797 = !{!798, !173}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !34, line: 6, baseType: !799, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)bool,*func(*void)bool}", file: !42, size: 256, align: 8, elements: !801)
!801 = !{!435, !802, !803, !807}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !42, line: 6, baseType: !109, size: 64, align: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "Temporary", file: !42, line: 6, baseType: !804, size: 64, align: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!28, !13}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "Timeout", file: !42, line: 6, baseType: !804, size: 64, align: 64, offset: 192)
!808 = !DILocation(line: 127, column: 7, scope: !792, inlinedAt: !776)
!809 = !DILocation(line: 127, column: 3, scope: !792, inlinedAt: !776)
!810 = !DILocation(line: 128, column: 18, scope: !792, inlinedAt: !776)
!811 = !DILocation(line: 128, column: 4, scope: !792, inlinedAt: !776)
!812 = !DILocation(line: 123, column: 9, scope: !813, inlinedAt: !776)
!813 = distinct !DILexicalBlock(scope: !772, file: !34, line: 131, column: 3)
!814 = !DILocation(line: 130, column: 2, scope: !813, inlinedAt: !776)
!815 = !DILocalVariable(name: "e", scope: !813, file: !34, line: 123, type: !816)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaxSizeReachedError", file: !34, line: 12, size: 64, align: 8, elements: !818)
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "MaxSize", file: !34, line: 12, baseType: !175, size: 64, align: 64)
!820 = !DILocation(line: 131, column: 17, scope: !813, inlinedAt: !776)
!821 = !DILocation(line: 131, column: 3, scope: !813, inlinedAt: !776)
!822 = !DILocation(line: 105, column: 16, scope: !777)
!823 = !DILocalVariable(name: "proxyError", scope: !777, file: !34, line: 105, type: !607)
!824 = !DILocation(line: 105, column: 2, scope: !760)
!825 = !DILocation(line: 106, column: 36, scope: !777)
!826 = !DILocation(line: 106, column: 59, scope: !777)
!827 = !DILocalVariable(name: "statusCode", scope: !777, file: !34, line: 106, type: !75)
!828 = !DILocation(line: 106, column: 2, scope: !760)
!829 = !DILocalVariable(name: "contentType", scope: !777, file: !34, line: 106, type: !71)
!830 = !DILocation(line: 107, column: 3, scope: !777)
!831 = !DILocation(line: 107, column: 12, scope: !777)
!832 = !DILocation(line: 108, column: 15, scope: !777)
!833 = !DILocation(line: 108, column: 26, scope: !777)
!834 = !DILocation(line: 109, column: 25, scope: !777)
!835 = !DILocation(line: 109, column: 46, scope: !777)
!836 = !DILocation(line: 109, column: 12, scope: !777)
!837 = !DILocation(line: 111, column: 3, scope: !777)
!838 = !DILocation(line: 112, column: 3, scope: !777)
!839 = !DILocalVariable(name: "body", scope: !777, file: !34, line: 106, type: !170)
!840 = !DILocation(line: 1, column: 1, scope: !20)
!841 = distinct !DISubprogram(name: "vulcan.command_line_arguments.Options..eq", linkageName: "command_line_arguments.command_line_arguments.Options..eq", scope: null, file: !7, line: 1, type: !26, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!842 = !DILocalVariable(name: "key1", arg: 1, scope: !841, file: !7, line: 1, type: !13)
!843 = !DILocation(line: 1, column: 1, scope: !841)
!844 = !DILocalVariable(name: "key2", arg: 2, scope: !841, file: !7, line: 1, type: !13)
!845 = !DILocalVariable(name: "$ret24", scope: !841, file: !7, line: 1, type: !28)
!846 = distinct !DISubprogram(name: "vulcan.NewProxy", linkageName: "command_line_arguments.NewProxy", scope: null, file: !34, line: 53, type: !847, isLocal: false, isDefinition: true, scopeLine: 53, isOptimized: false, unit: !1, retainedNodes: !3)
!847 = !DISubroutineType(types: !848)
!848 = !{!849, !37}
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Proxy,error}", file: !42, size: 192, align: 8, elements: !850)
!850 = !{!851, !852}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !42, line: 53, baseType: !583, size: 64, align: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !42, line: 53, baseType: !153, size: 128, align: 64, offset: 64)
!853 = !DILocalVariable(name: "router", arg: 1, scope: !846, file: !34, line: 53, type: !37)
!854 = !DILocation(line: 53, column: 15, scope: !846)
!855 = !DILocalVariable(name: "$ret0", scope: !846, file: !34, line: 53, type: !583)
!856 = !DILocation(line: 53, column: 37, scope: !846)
!857 = !DILocation(line: 54, column: 9, scope: !846)
!858 = !DILocation(line: 54, column: 2, scope: !846)
!859 = distinct !DISubprogram(name: "vulcan.NewProxyWithOptions", linkageName: "command_line_arguments.NewProxyWithOptions", scope: null, file: !34, line: 58, type: !860, isLocal: false, isDefinition: true, scopeLine: 58, isOptimized: false, unit: !1, retainedNodes: !3)
!860 = !DISubroutineType(types: !861)
!861 = !{!849, !37, !588}
!862 = !DILocalVariable(name: "router", arg: 1, scope: !859, file: !34, line: 58, type: !37)
!863 = !DILocation(line: 58, column: 26, scope: !859)
!864 = !DILocalVariable(name: "o", arg: 2, scope: !859, file: !34, line: 58, type: !588)
!865 = !DILocation(line: 58, column: 47, scope: !859)
!866 = !DILocalVariable(name: "$ret2", scope: !859, file: !34, line: 58, type: !583)
!867 = !DILocation(line: 58, column: 59, scope: !859)
!868 = !DILocalVariable(name: "o", arg: 1, scope: !869, file: !34, line: 115, type: !588)
!869 = distinct !DISubprogram(name: "vulcan.validateOptions", scope: null, file: !34, line: 115, type: !870, isLocal: true, isDefinition: true, scopeLine: 115, isOptimized: false, unit: !1, retainedNodes: !3)
!870 = !DISubroutineType(types: !871)
!871 = !{!872, !588}
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Options,error}", file: !42, size: 256, align: 8, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !42, line: 115, baseType: !588, size: 128, align: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !42, line: 115, baseType: !153, size: 128, align: 64, offset: 128)
!876 = !DILocation(line: 115, column: 22, scope: !869, inlinedAt: !877)
!877 = distinct !DILocation(line: 59, column: 12, scope: !878)
!878 = distinct !DILexicalBlock(scope: !859, file: !34, line: 58, column: 1)
!879 = !DILocation(line: 116, column: 22, scope: !869, inlinedAt: !877)
!880 = !DILocation(line: 117, column: 22, scope: !869, inlinedAt: !877)
!881 = !DILocation(line: 117, column: 20, scope: !869, inlinedAt: !877)
!882 = !DILocalVariable(name: "$ret6", scope: !869, file: !34, line: 115, type: !588)
!883 = !DILocation(line: 115, column: 34, scope: !869, inlinedAt: !877)
!884 = !DILocalVariable(name: "err", scope: !878, file: !34, line: 59, type: !153)
!885 = !DILocation(line: 59, column: 2, scope: !859)
!886 = !DILocation(line: 64, column: 7, scope: !878)
!887 = !DILocation(line: 64, column: 8, scope: !878)
!888 = !DILocalVariable(name: "p", scope: !878, file: !34, line: 64, type: !583)
!889 = !DILocation(line: 64, column: 2, scope: !859)
!890 = !DILocalVariable(name: "$ret3", scope: !859, file: !34, line: 58, type: !153)
!891 = !DILocation(line: 58, column: 67, scope: !859)
!892 = !DILocation(line: 68, column: 2, scope: !878)
!893 = distinct !DISubprogram(name: "vulcan.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !34, line: 2, type: !894, isLocal: false, isDefinition: true, scopeLine: 2, isOptimized: false, unit: !1, retainedNodes: !3)
!894 = !DISubroutineType(types: !895)
!895 = !{!14}
!896 = !DILocation(line: 1, column: 1, scope: !897)
!897 = !DILexicalBlockFile(scope: !893, file: !7, discriminator: 0)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "vulcan"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "command-line-arguments"
	.ascii ";\n"
	.ascii "import "
	.ascii "log"
	.ascii " "
	.ascii "github.com/mailgun/log"
	.ascii " \""
	.ascii "github.com/mailgun/log"
	.ascii "\";\n"
	.ascii "import "
	.ascii "errors"
	.ascii " "
	.ascii "github.com/mailgun/vulcan/errors"
	.ascii " \""
	.ascii "github.com/mailgun/vulcan/errors"
	.ascii "\";\n"
	.ascii "import "
	.ascii "netutils"
	.ascii " "
	.ascii "github.com/mailgun/vulcan/netutils"
	.ascii " \""
	.ascii "github.com/mailgun/vulcan/netutils"
	.ascii "\";\n"
	.ascii "import "
	.ascii "request"
	.ascii " "
	.ascii "github.com/mailgun/vulcan/request"
	.ascii " \""
	.ascii "github.com/mailgun/vulcan/request"
	.ascii "\";\n"
	.ascii "import "
	.ascii "route"
	.ascii " "
	.ascii "github.com/mailgun/vulcan/route"
	.ascii " \""
	.ascii "github.com/mailgun/vulcan/route"
	.ascii "\";\n"
	.ascii "import "
	.ascii "io"
	.ascii " "
	.ascii "io"
	.ascii " \""
	.ascii "io"
	.ascii "\";\n"
	.ascii "import "
	.ascii "net"
	.ascii " "
	.ascii "net"
	.ascii " \""
	.ascii "net"
	.ascii "\";\n"
	.ascii "import "
	.ascii "http"
	.ascii " "
	.ascii "net/http"
	.ascii " \""
	.ascii "net/http"
	.ascii "\";\n"
	.ascii "import "
	.ascii "atomic"
	.ascii " "
	.ascii "sync/atomic"
	.ascii " \""
	.ascii "sync/atomic"
	.ascii "\";\n"
	.ascii "init"
	.ascii " "
	.ascii "bufio"
	.ascii " "
	.ascii "bufio..import"
	.ascii " "
	.ascii "bytes"
	.ascii " "
	.ascii "bytes..import"
	.ascii " "
	.ascii "flate"
	.ascii " "
	.ascii "compress_flate..import"
	.ascii " "
	.ascii "gzip"
	.ascii " "
	.ascii "compress_gzip..import"
	.ascii " "
	.ascii "context"
	.ascii " "
	.ascii "context..import"
	.ascii " "
	.ascii "crypto"
	.ascii " "
	.ascii "crypto..import"
	.ascii " "
	.ascii "cipher"
	.ascii " "
	.ascii "crypto_cipher..import"
	.ascii " "
	.ascii "des"
	.ascii " "
	.ascii "crypto_des..import"
	.ascii " "
	.ascii "dsa"
	.ascii " "
	.ascii "crypto_dsa..import"
	.ascii " "
	.ascii "ecdsa"
	.ascii " "
	.ascii "crypto_ecdsa..import"
	.ascii " "
	.ascii "elliptic"
	.ascii " "
	.ascii "crypto_elliptic..import"
	.ascii " "
	.ascii "md5"
	.ascii " "
	.ascii "crypto_md5..import"
	.ascii " "
	.ascii "rand"
