; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22hostroute\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22location\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/vulcan/location\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/mailgun/vulcan/location\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22request\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/vulcan/request\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/mailgun/vulcan/request\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22route\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./host.go", directory: "/home/wangcong/go_path/src/github.com/vulcand/vulcan/route/hostroute")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "hostroute.GetRouter..1command_line_arguments.HostRouter", linkageName: "command_line_arguments.HostRouter.GetRouter", scope: null, file: !10, line: 51, type: !11, isLocal: false, isDefinition: true, scopeLine: 51, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DIFile(filename: "host.go", directory: ".")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !562, !562, !55}
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "Router", file: !10, line: 8, size: 128, align: 8, elements: !14)
!14 = !{!15, !157}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 8, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Request)struct{Location,error}}", file: !18, size: 128, align: 8, elements: !19)
!18 = !DIFile(filename: "", directory: "")
!19 = !{!20, !79}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 8, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !23)
!23 = !{!24, !26, !27, !28, !30, !31, !32, !42, !51, !53, !60, !78}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 160)
!29 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 168)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 176)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !33, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !35)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!25, !40, !25}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "void")
!42 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !43, size: 64, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !45)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !40, !40}
!50 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !52, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !54, size: 64, align: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !52, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !61, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !63)
!63 = !{!64, !65, !66}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !54, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !54, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !67, size: 192, align: 64, offset: 128)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !18, size: 192, align: 8, elements: !68)
!68 = !{!69, !76, !77}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !72)
!72 = !{!64, !65, !73, !74, !75}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !18, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !18, line: 1, baseType: !59, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Route", file: !18, line: 8, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!83, !40, !438}
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Location,error}", file: !18, size: 256, align: 8, elements: !84)
!84 = !{!85, !561}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 8, baseType: !86, size: 128, align: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !10, line: 6, size: 128, align: 8, elements: !87)
!87 = !{!88, !157}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 6, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void,Request)struct{*Response,error}}", file: !18, size: 192, align: 8, elements: !91)
!91 = !{!92, !93, !97}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 6, baseType: !21, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "GetId", file: !18, line: 6, baseType: !94, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!55, !40}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "RoundTrip", file: !18, line: 6, baseType: !98, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!101, !40, !438}
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Response,error}", file: !18, size: 192, align: 8, elements: !102)
!102 = !{!103, !437}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 6, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !10, line: 6, size: 1152, align: 8, elements: !106)
!106 = !{!107, !108, !109, !110, !111, !112, !126, !158, !160, !164, !165, !166, !167, !436}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !10, line: 6, baseType: !55, size: 128, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "StatusCode", file: !10, line: 6, baseType: !59, size: 64, align: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Proto", file: !10, line: 6, baseType: !55, size: 128, align: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMajor", file: !10, line: 6, baseType: !59, size: 64, align: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMinor", file: !10, line: 6, baseType: !59, size: 64, align: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !10, line: 6, baseType: !113, size: 64, align: 64, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !115)
!115 = !{!116, !117, !118, !119, !121, !122, !123, !124, !125}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !59, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 72)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !120, size: 16, align: 16, offset: 80)
!120 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !25, size: 64, align: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !10, line: 6, baseType: !127, size: 128, align: 64, offset: 512)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !10, line: 6, size: 128, align: 8, elements: !128)
!128 = !{!129, !157}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 6, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !18, size: 192, align: 8, elements: !132)
!132 = !{!92, !133, !146}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !18, line: 6, baseType: !134, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!137, !40}
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !138)
!138 = !{!139, !145}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !18, size: 128, align: 8, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 1, baseType: !21, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !18, line: 1, baseType: !94, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !18, line: 6, baseType: !147, size: 64, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!150, !40, !154}
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !18, size: 192, align: 8, elements: !151)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !18, line: 5, baseType: !59, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !18, line: 5, baseType: !137, size: 128, align: 64, offset: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !18, size: 192, align: 8, elements: !155)
!155 = !{!156, !76, !77}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !52, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !10, line: 6, baseType: !159, size: 64, align: 64, offset: 640)
!159 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !10, line: 6, baseType: !161, size: 192, align: 64, offset: 704)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !18, size: 192, align: 8, elements: !162)
!162 = !{!163, !76, !77}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !54, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !10, line: 6, baseType: !50, size: 8, align: 8, offset: 896)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Uncompressed", file: !10, line: 6, baseType: !50, size: 8, align: 8, offset: 904)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !10, line: 6, baseType: !113, size: 64, align: 64, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Request", file: !10, line: 6, baseType: !168, size: 64, align: 64, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !10, line: 6, size: 1984, align: 8, elements: !170)
!170 = !{!171, !172, !109, !110, !111, !112, !126, !191, !203, !204, !205, !206, !207, !208, !209, !215, !216, !217, !218, !408, !411, !412}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !10, line: 6, baseType: !55, size: 128, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !10, line: 6, baseType: !173, size: 64, align: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !10, line: 6, size: 1024, align: 8, elements: !175)
!175 = !{!176, !177, !178, !185, !186, !187, !188, !189, !190}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !10, line: 6, baseType: !55, size: 128, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !10, line: 6, baseType: !55, size: 128, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !10, line: 6, baseType: !179, size: 64, align: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !10, line: 6, size: 320, align: 8, elements: !181)
!181 = !{!182, !183, !184}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !10, line: 6, baseType: !55, size: 128, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !10, line: 6, baseType: !55, size: 128, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !10, line: 6, baseType: !50, size: 8, align: 8, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !10, line: 6, baseType: !55, size: 128, align: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !10, line: 6, baseType: !55, size: 128, align: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !10, line: 6, baseType: !55, size: 128, align: 64, offset: 576)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !10, line: 6, baseType: !50, size: 8, align: 8, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !10, line: 6, baseType: !55, size: 128, align: 64, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !10, line: 6, baseType: !55, size: 128, align: 64, offset: 896)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !10, line: 6, baseType: !192, size: 64, align: 64, offset: 640)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 6, size: 64, align: 8, elements: !194)
!194 = !{!195}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 6, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!199}
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !18, size: 256, align: 8, elements: !200)
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 6, baseType: !127, size: 128, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 6, baseType: !137, size: 128, align: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !10, line: 6, baseType: !159, size: 64, align: 64, offset: 704)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !10, line: 6, baseType: !161, size: 192, align: 64, offset: 768)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !10, line: 6, baseType: !50, size: 8, align: 8, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !10, line: 6, baseType: !55, size: 128, align: 64, offset: 1024)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Form", file: !10, line: 6, baseType: !113, size: 64, align: 64, offset: 1152)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "PostForm", file: !10, line: 6, baseType: !113, size: 64, align: 64, offset: 1216)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "MultipartForm", file: !10, line: 6, baseType: !210, size: 64, align: 64, offset: 1280)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", file: !10, line: 6, size: 128, align: 8, elements: !212)
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !10, line: 6, baseType: !113, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !10, line: 6, baseType: !113, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !10, line: 6, baseType: !113, size: 64, align: 64, offset: 1344)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !10, line: 6, baseType: !55, size: 128, align: 64, offset: 1408)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "RequestURI", file: !10, line: 6, baseType: !55, size: 128, align: 64, offset: 1536)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !10, line: 6, baseType: !219, size: 64, align: 64, offset: 1664)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionState", file: !10, line: 6, size: 1344, align: 8, elements: !221)
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !396, !401, !406, !407}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !10, line: 6, baseType: !120, size: 16, align: 16)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "HandshakeComplete", file: !10, line: 6, baseType: !50, size: 8, align: 8, offset: 16)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "DidResume", file: !10, line: 6, baseType: !50, size: 8, align: 8, offset: 24)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuite", file: !10, line: 6, baseType: !120, size: 16, align: 16, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocol", file: !10, line: 6, baseType: !55, size: 128, align: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocolIsMutual", file: !10, line: 6, baseType: !50, size: 8, align: 8, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !10, line: 6, baseType: !55, size: 128, align: 64, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "PeerCertificates", file: !10, line: 6, baseType: !230, size: 192, align: 64, offset: 384)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !18, size: 192, align: 8, elements: !231)
!231 = !{!232, !76, !77}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !10, line: 6, size: 10624, align: 8, elements: !236)
!236 = !{!237, !238, !239, !240, !241, !242, !243, !245, !247, !251, !252, !265, !291, !292, !326, !327, !329, !339, !340, !345, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !370, !375, !376, !377, !378, !389, !390, !391, !392, !393, !394, !395}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !10, line: 6, baseType: !154, size: 192, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !10, line: 6, baseType: !154, size: 192, align: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !10, line: 6, baseType: !154, size: 192, align: 64, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !10, line: 6, baseType: !154, size: 192, align: 64, offset: 576)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !10, line: 6, baseType: !154, size: 192, align: 64, offset: 768)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !10, line: 6, baseType: !154, size: 192, align: 64, offset: 960)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !10, line: 6, baseType: !244, size: 64, align: 64, offset: 1152)
!244 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !10, line: 6, baseType: !246, size: 64, align: 64, offset: 1216)
!246 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !10, line: 6, baseType: !248, size: 128, align: 64, offset: 1280)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !18, size: 128, align: 8, elements: !249)
!249 = !{!143, !250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !18, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !10, line: 6, baseType: !59, size: 64, align: 64, offset: 1408)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !10, line: 6, baseType: !253, size: 64, align: 64, offset: 1472)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !10, line: 6, size: 256, align: 8, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !10, line: 6, baseType: !50, size: 8, align: 8)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !10, line: 6, baseType: !258, size: 192, align: 64, offset: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !10, line: 6, size: 192, align: 8, elements: !259)
!259 = !{!260, !263, !264}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !59, size: 64, align: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !10, line: 6, baseType: !266, size: 1984, align: 64, offset: 1536)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !10, line: 6, size: 1984, align: 8, elements: !267)
!267 = !{!268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !290}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !10, line: 6, baseType: !161, size: 192, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !10, line: 6, baseType: !161, size: 192, align: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !10, line: 6, baseType: !161, size: 192, align: 64, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !10, line: 6, baseType: !161, size: 192, align: 64, offset: 576)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !10, line: 6, baseType: !161, size: 192, align: 64, offset: 768)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !10, line: 6, baseType: !161, size: 192, align: 64, offset: 960)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !10, line: 6, baseType: !161, size: 192, align: 64, offset: 1152)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !10, line: 6, baseType: !55, size: 128, align: 64, offset: 1344)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !10, line: 6, baseType: !55, size: 128, align: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !10, line: 6, baseType: !278, size: 192, align: 64, offset: 1600)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !18, size: 192, align: 8, elements: !279)
!279 = !{!280, !76, !77}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !10, line: 6, size: 320, align: 8, elements: !283)
!283 = !{!284, !289}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !10, line: 6, baseType: !285, size: 192, align: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !10, line: 6, size: 192, align: 8, elements: !286)
!286 = !{!287, !263, !264}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !10, line: 6, baseType: !248, size: 128, align: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !10, line: 6, baseType: !278, size: 192, align: 64, offset: 1792)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !10, line: 6, baseType: !266, size: 1984, align: 64, offset: 3520)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !10, line: 6, baseType: !293, size: 192, align: 64, offset: 5504)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !10, line: 6, size: 192, align: 8, elements: !294)
!294 = !{!295, !297, !298}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !10, line: 6, baseType: !296, size: 64, align: 64)
!296 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !10, line: 6, baseType: !159, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !10, line: 6, baseType: !299, size: 64, align: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !10, line: 6, size: 704, align: 8, elements: !301)
!301 = !{!302, !303, !312, !323, !324, !325}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !10, line: 6, baseType: !55, size: 128, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !10, line: 6, baseType: !304, size: 192, align: 64, offset: 128)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !18, size: 192, align: 8, elements: !305)
!305 = !{!306, !76, !77}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !10, line: 6, size: 256, align: 8, elements: !309)
!309 = !{!302, !310, !311}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !10, line: 6, baseType: !59, size: 64, align: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !10, line: 6, baseType: !50, size: 8, align: 8, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !10, line: 6, baseType: !313, size: 192, align: 64, offset: 320)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !18, size: 192, align: 8, elements: !314)
!314 = !{!315, !76, !77}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !10, line: 6, size: 128, align: 8, elements: !318)
!318 = !{!319, !320, !321, !322}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !10, line: 6, baseType: !159, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !10, line: 6, baseType: !29, size: 8, align: 8, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !10, line: 6, baseType: !50, size: 8, align: 8, offset: 72)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !10, line: 6, baseType: !50, size: 8, align: 8, offset: 80)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !10, line: 6, baseType: !159, size: 64, align: 64, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !10, line: 6, baseType: !159, size: 64, align: 64, offset: 576)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !10, line: 6, baseType: !307, size: 64, align: 64, offset: 640)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !10, line: 6, baseType: !293, size: 192, align: 64, offset: 5696)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !10, line: 6, baseType: !328, size: 64, align: 64, offset: 5888)
!328 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !10, line: 6, baseType: !330, size: 192, align: 64, offset: 5952)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !18, size: 192, align: 8, elements: !331)
!331 = !{!332, !76, !77}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !10, line: 6, size: 448, align: 8, elements: !335)
!335 = !{!336, !337, !338}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !10, line: 6, baseType: !285, size: 192, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !10, line: 6, baseType: !50, size: 8, align: 8, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !10, line: 6, baseType: !154, size: 192, align: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !10, line: 6, baseType: !330, size: 192, align: 64, offset: 6144)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !10, line: 6, baseType: !341, size: 192, align: 64, offset: 6336)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !18, size: 192, align: 8, elements: !342)
!342 = !{!343, !76, !77}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !10, line: 6, baseType: !346, size: 192, align: 64, offset: 6528)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !18, size: 192, align: 8, elements: !347)
!347 = !{!348, !76, !77}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !10, line: 6, baseType: !341, size: 192, align: 64, offset: 6720)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !10, line: 6, baseType: !50, size: 8, align: 8, offset: 6912)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !10, line: 6, baseType: !50, size: 8, align: 8, offset: 6920)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !10, line: 6, baseType: !59, size: 64, align: 64, offset: 6976)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !10, line: 6, baseType: !50, size: 8, align: 8, offset: 7040)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !10, line: 6, baseType: !154, size: 192, align: 64, offset: 7104)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !10, line: 6, baseType: !154, size: 192, align: 64, offset: 7296)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !10, line: 6, baseType: !161, size: 192, align: 64, offset: 7488)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !10, line: 6, baseType: !161, size: 192, align: 64, offset: 7680)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !10, line: 6, baseType: !161, size: 192, align: 64, offset: 7872)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !10, line: 6, baseType: !161, size: 192, align: 64, offset: 8064)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !10, line: 6, baseType: !363, size: 192, align: 64, offset: 8256)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !18, size: 192, align: 8, elements: !364)
!364 = !{!365, !76, !77}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !10, line: 6, size: 192, align: 8, elements: !368)
!368 = !{!369, !263, !264}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !52, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !10, line: 6, baseType: !371, size: 192, align: 64, offset: 8448)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !18, size: 192, align: 8, elements: !372)
!372 = !{!373, !76, !77}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !10, line: 6, baseType: !50, size: 8, align: 8, offset: 8640)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !10, line: 6, baseType: !161, size: 192, align: 64, offset: 8704)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !10, line: 6, baseType: !161, size: 192, align: 64, offset: 8896)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !10, line: 6, baseType: !379, size: 192, align: 64, offset: 9088)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !18, size: 192, align: 8, elements: !380)
!380 = !{!381, !76, !77}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !10, line: 6, size: 384, align: 8, elements: !385)
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !10, line: 6, baseType: !367, size: 192, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !10, line: 6, baseType: !388, size: 192, align: 64, offset: 192)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !10, line: 6, size: 192, align: 8, elements: !368)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !10, line: 6, baseType: !379, size: 192, align: 64, offset: 9280)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !10, line: 6, baseType: !161, size: 192, align: 64, offset: 9472)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !10, line: 6, baseType: !161, size: 192, align: 64, offset: 9664)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !10, line: 6, baseType: !161, size: 192, align: 64, offset: 9856)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !10, line: 6, baseType: !161, size: 192, align: 64, offset: 10048)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !10, line: 6, baseType: !161, size: 192, align: 64, offset: 10240)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !10, line: 6, baseType: !341, size: 192, align: 64, offset: 10432)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "VerifiedChains", file: !10, line: 6, baseType: !397, size: 192, align: 64, offset: 576)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !18, size: 192, align: 8, elements: !398)
!398 = !{!399, !76, !77}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !10, line: 6, baseType: !402, size: 192, align: 64, offset: 768)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !18, size: 192, align: 8, elements: !403)
!403 = !{!404, !76, !77}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPResponse", file: !10, line: 6, baseType: !154, size: 192, align: 64, offset: 960)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "TLSUnique", file: !10, line: 6, baseType: !154, size: 192, align: 64, offset: 1152)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", file: !10, line: 6, baseType: !409, size: 64, align: 64, offset: 1728)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !7, line: 1, align: 8, elements: !3)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !10, line: 6, baseType: !40, size: 64, align: 64, offset: 1792)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !10, line: 6, baseType: !413, size: 128, align: 64, offset: 1856)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !10, line: 6, size: 128, align: 8, elements: !414)
!414 = !{!415, !157}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 6, baseType: !416, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,struct{*_type,*void})struct{*_type,*void}}", file: !18, size: 320, align: 8, elements: !418)
!418 = !{!92, !419, !427, !431, !432}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !18, line: 6, baseType: !420, size: 64, align: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!423, !40}
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !18, size: 256, align: 8, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !18, line: 6, baseType: !293, size: 192, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !18, line: 6, baseType: !50, size: 8, align: 8, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !18, line: 6, baseType: !428, size: 64, align: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!409, !40}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !18, line: 6, baseType: !134, size: 64, align: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !18, line: 6, baseType: !433, size: 64, align: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!248, !40, !248}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !10, line: 6, baseType: !219, size: 64, align: 64, offset: 1088)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 6, baseType: !137, size: 128, align: 64, offset: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !10, line: 6, size: 128, align: 8, elements: !439)
!439 = !{!440, !157}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 6, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Attempt)void,*func(*void,string)void,*func(*void)struct{*Attempt,int,int},*func(*void)MultiReader,*func(*void)*Request,*func(*void)int64,*func(*void)Attempt,*func(*void,string)struct{struct{*_type,*void},bool},*func(*void,MultiReader)void,*func(*void,*Request)void,*func(*void,string,struct{*_type,*void})void,*func(*void)string}", file: !18, size: 832, align: 8, elements: !443)
!443 = !{!92, !444, !479, !483, !491, !528, !532, !536, !540, !548, !552, !556, !560}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "AddAttempt", file: !18, line: 6, baseType: !445, size: 64, align: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!41, !40, !448}
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "Attempt", file: !10, line: 6, size: 128, align: 8, elements: !449)
!449 = !{!450, !157}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 6, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Duration,*func(*void)Endpoint,*func(*void)error,*func(*void)*Response}", file: !18, size: 320, align: 8, elements: !453)
!453 = !{!92, !454, !459, !474, !475}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "GetDuration", file: !18, line: 6, baseType: !455, size: 64, align: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!458, !40}
!458 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "GetEndpoint", file: !18, line: 6, baseType: !460, size: 64, align: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!463, !40}
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "Endpoint", file: !10, line: 6, size: 128, align: 8, elements: !464)
!464 = !{!465, !157}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 6, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)*URL,*func(*void)string}", file: !18, size: 256, align: 8, elements: !468)
!468 = !{!92, !93, !469, !473}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "GetUrl", file: !18, line: 6, baseType: !470, size: 64, align: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!173, !40}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !18, line: 6, baseType: !94, size: 64, align: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "GetError", file: !18, line: 6, baseType: !134, size: 64, align: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "GetResponse", file: !18, line: 6, baseType: !476, size: 64, align: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!104, !40}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteUserData", file: !18, line: 6, baseType: !480, size: 64, align: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!41, !40, !55}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "GetAttempts", file: !18, line: 6, baseType: !484, size: 64, align: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!487, !40}
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Attempt,int,int}", file: !18, size: 192, align: 8, elements: !488)
!488 = !{!489, !76, !77}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !18, line: 6, baseType: !492, size: 64, align: 64, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!495, !40}
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiReader", file: !10, line: 6, size: 128, align: 8, elements: !496)
!496 = !{!497, !157}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 6, baseType: !498, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,int64,int)struct{int64,error},*func(*void)struct{int64,error},*func(*void,Writer)struct{int64,error}}", file: !18, size: 384, align: 8, elements: !500)
!500 = !{!92, !133, !146, !501, !508, !512}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "Seek", file: !18, line: 6, baseType: !502, size: 64, align: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!505, !40, !159, !59}
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !18, size: 192, align: 8, elements: !506)
!506 = !{!507, !437}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 6, baseType: !159, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "TotalSize", file: !18, line: 6, baseType: !509, size: 64, align: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!505, !40}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "WriteTo", file: !18, line: 6, baseType: !513, size: 64, align: 64, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!516, !40, !520}
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !18, size: 192, align: 8, elements: !517)
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !18, line: 6, baseType: !159, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !18, line: 6, baseType: !137, size: 128, align: 64, offset: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !10, line: 5, size: 128, align: 8, elements: !521)
!521 = !{!522, !157}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 5, baseType: !523, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !18, size: 128, align: 8, elements: !525)
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 5, baseType: !21, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !18, line: 5, baseType: !147, size: 64, align: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "GetHttpRequest", file: !18, line: 6, baseType: !529, size: 64, align: 64, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!168, !40}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "GetId", file: !18, line: 6, baseType: !533, size: 64, align: 64, offset: 384)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!159, !40}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "GetLastAttempt", file: !18, line: 6, baseType: !537, size: 64, align: 64, offset: 448)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!448, !40}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserData", file: !18, line: 6, baseType: !541, size: 64, align: 64, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!544, !40, !55}
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*_type,*void},bool}", file: !18, size: 192, align: 8, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 6, baseType: !248, size: 128, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 6, baseType: !50, size: 8, align: 8, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "SetBody", file: !18, line: 6, baseType: !549, size: 64, align: 64, offset: 576)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!41, !40, !495}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "SetHttpRequest", file: !18, line: 6, baseType: !553, size: 64, align: 64, offset: 640)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!41, !40, !168}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "SetUserData", file: !18, line: 6, baseType: !557, size: 64, align: 64, offset: 704)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!41, !40, !55, !248}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !18, line: 6, baseType: !94, size: 64, align: 64, offset: 768)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 8, baseType: !137, size: 128, align: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "HostRouter", file: !10, line: 15, size: 128, align: 8, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "routers", file: !10, line: 16, baseType: !113, size: 64, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !10, line: 17, baseType: !567, size: 64, align: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !10, line: 7, size: 64, align: 8, elements: !569)
!569 = !{!570, !572}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !10, line: 7, baseType: !571, size: 32, align: 32)
!571 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !10, line: 7, baseType: !8, size: 32, align: 32, offset: 32)
!573 = !DILocalVariable(name: "h", arg: 1, scope: !9, file: !10, line: 51, type: !562)
!574 = !DILocation(line: 51, column: 1, scope: !9)
!575 = !DILocalVariable(name: "$ret4", scope: !9, file: !10, line: 51, type: !13)
!576 = !DILocation(line: 51, column: 49, scope: !9)
!577 = !DILocation(line: 52, column: 3, scope: !578)
!578 = distinct !DILexicalBlock(scope: !9, file: !10, line: 51, column: 1)
!579 = !DILocation(line: 57, column: 1, scope: !9)
!580 = !DILocation(line: 52, column: 9, scope: !578)
!581 = !DILocation(line: 53, column: 9, scope: !578)
!582 = !DILocation(line: 53, column: 2, scope: !578)
!583 = !DILocation(line: 55, column: 13, scope: !578)
!584 = !DILocation(line: 55, column: 21, scope: !578)
!585 = !DILocalVariable(name: "router", scope: !578, file: !10, line: 55, type: !13)
!586 = !DILocation(line: 55, column: 2, scope: !9)
!587 = !DILocation(line: 56, column: 2, scope: !9)
!588 = distinct !DISubprogram(name: "hostroute.RemoveRouter..1command_line_arguments.HostRouter", linkageName: "command_line_arguments.HostRouter.RemoveRouter", scope: null, file: !10, line: 59, type: !589, isLocal: false, isDefinition: true, scopeLine: 59, isOptimized: false, unit: !1, retainedNodes: !3)
!589 = !DISubroutineType(types: !590)
!590 = !{!41, !562, !562, !55}
!591 = !DILocalVariable(name: "h", arg: 1, scope: !588, file: !10, line: 59, type: !562)
!592 = !DILocation(line: 59, column: 1, scope: !588)
!593 = !DILocalVariable(name: "hostname", arg: 2, scope: !588, file: !10, line: 59, type: !55)
!594 = !DILocation(line: 59, column: 35, scope: !588)
!595 = !DILocation(line: 60, column: 3, scope: !588)
!596 = !DILocation(line: 64, column: 1, scope: !588)
!597 = !DILocation(line: 60, column: 9, scope: !588)
!598 = !DILocation(line: 61, column: 9, scope: !588)
!599 = !DILocation(line: 61, column: 2, scope: !588)
!600 = !DILocation(line: 63, column: 10, scope: !588)
!601 = !DILocation(line: 63, column: 2, scope: !588)
!602 = distinct !DISubprogram(name: "hostroute.Route..1command_line_arguments.HostRouter", linkageName: "command_line_arguments.HostRouter.Route", scope: null, file: !10, line: 27, type: !603, isLocal: false, isDefinition: true, scopeLine: 27, isOptimized: false, unit: !1, retainedNodes: !3)
!603 = !DISubroutineType(types: !604)
!604 = !{!83, !562, !562, !438}
!605 = !DILocalVariable(name: "h", arg: 1, scope: !602, file: !10, line: 27, type: !562)
!606 = !DILocation(line: 27, column: 1, scope: !602)
!607 = !DILocalVariable(name: "req", arg: 2, scope: !602, file: !10, line: 27, type: !438)
!608 = !DILocation(line: 27, column: 28, scope: !602)
!609 = !DILocation(line: 28, column: 3, scope: !610)
!610 = distinct !DILexicalBlock(scope: !602, file: !10, line: 27, column: 1)
!611 = !DILocation(line: 37, column: 1, scope: !602)
!612 = !DILocation(line: 28, column: 9, scope: !610)
!613 = !DILocation(line: 29, column: 9, scope: !610)
!614 = !DILocation(line: 29, column: 2, scope: !610)
!615 = !DILocation(line: 31, column: 47, scope: !610)
!616 = !DILocation(line: 31, column: 64, scope: !610)
!617 = !DILocation(line: 31, column: 36, scope: !610)
!618 = !DILocation(line: 31, column: 22, scope: !610)
!619 = !DILocation(line: 31, column: 76, scope: !610)
!620 = !DILocalVariable(name: "exists", scope: !610, file: !10, line: 32, type: !50)
!621 = !DILocation(line: 32, column: 2, scope: !602)
!622 = !DILocation(line: 32, column: 22, scope: !610)
!623 = !DILocation(line: 32, column: 2, scope: !610)
!624 = !DILocation(line: 33, column: 5, scope: !610)
!625 = !DILocation(line: 34, column: 3, scope: !610)
!626 = !DILocalVariable(name: "matcher", scope: !610, file: !10, line: 32, type: !13)
!627 = !DILocation(line: 36, column: 16, scope: !610)
!628 = !DILocation(line: 34, column: 3, scope: !602)
