; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22pathroute\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22location\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/vulcan/location\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/mailgun/vulcan/location\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22request\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/vulcan/request\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./route.go", directory: "/home/wangcong/go_path/src/github.com/vulcand/vulcan/route/pathroute")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "pathroute.AddLocation..1command_line_arguments.PathRouter", linkageName: "command_line_arguments.PathRouter.AddLocation", scope: null, file: !10, line: 68, type: !11, isLocal: false, isDefinition: true, scopeLine: 68, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DIFile(filename: "route.go", directory: ".")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !84, !84, !55, !96}
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !14)
!14 = !{!15, !83}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !18, size: 128, align: 8, elements: !19)
!18 = !DIFile(filename: "", directory: "")
!19 = !{!20, !79}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 1, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !23)
!23 = !{!24, !26, !27, !28, !30, !31, !32, !42, !51, !53, !60, !78}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !25, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 160)
!29 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 168)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 176)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !33, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !35)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!25, !40, !25}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "void")
!42 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !43, size: 64, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !45)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !40, !40}
!50 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !52, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !54, size: 64, align: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !52, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !61, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !63)
!63 = !{!64, !65, !66}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !54, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !54, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !67, size: 192, align: 64, offset: 128)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !18, size: 192, align: 8, elements: !68)
!68 = !{!69, !76, !77}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !72)
!72 = !{!64, !65, !73, !74, !75}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !18, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !18, line: 1, baseType: !59, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !18, line: 1, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!55, !40}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathRouter", file: !10, line: 16, size: 320, align: 8, elements: !86)
!86 = !{!87, !559, !710}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "locations", file: !10, line: 17, baseType: !88, size: 192, align: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.command-line-arguments.locPair,int,int}", file: !18, size: 192, align: 8, elements: !89)
!89 = !{!90, !76, !77}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.locPair", file: !10, line: 22, size: 256, align: 8, elements: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", file: !10, line: 23, baseType: !55, size: 128, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "location", file: !10, line: 24, baseType: !96, size: 128, align: 64, offset: 128)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !10, line: 7, size: 128, align: 8, elements: !97)
!97 = !{!98, !155}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 7, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void,Request)struct{*Response,error}}", file: !18, size: 192, align: 8, elements: !101)
!101 = !{!102, !103, !104}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 7, baseType: !21, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "GetId", file: !18, line: 7, baseType: !80, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "RoundTrip", file: !18, line: 7, baseType: !105, size: 64, align: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!108, !40, !436}
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Response,error}", file: !18, size: 192, align: 8, elements: !109)
!109 = !{!110, !435}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 7, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !10, line: 7, size: 1152, align: 8, elements: !113)
!113 = !{!114, !115, !116, !117, !118, !119, !133, !156, !158, !162, !163, !164, !165, !434}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !10, line: 7, baseType: !55, size: 128, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "StatusCode", file: !10, line: 7, baseType: !59, size: 64, align: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Proto", file: !10, line: 7, baseType: !55, size: 128, align: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMajor", file: !10, line: 7, baseType: !59, size: 64, align: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMinor", file: !10, line: 7, baseType: !59, size: 64, align: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !10, line: 7, baseType: !120, size: 64, align: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !122)
!122 = !{!123, !124, !125, !126, !128, !129, !130, !131, !132}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !59, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !29, size: 8, align: 8, offset: 72)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !127, size: 16, align: 16, offset: 80)
!127 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !25, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !40, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !10, line: 7, baseType: !134, size: 128, align: 64, offset: 512)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !10, line: 7, size: 128, align: 8, elements: !135)
!135 = !{!136, !155}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 7, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !18, size: 192, align: 8, elements: !139)
!139 = !{!102, !140, !144}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !18, line: 7, baseType: !141, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!13, !40}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !18, line: 7, baseType: !145, size: 64, align: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!148, !40, !152}
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !18, size: 192, align: 8, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !18, line: 5, baseType: !59, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !18, line: 5, baseType: !13, size: 128, align: 64, offset: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !18, size: 192, align: 8, elements: !153)
!153 = !{!154, !76, !77}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !52, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !10, line: 7, baseType: !157, size: 64, align: 64, offset: 640)
!157 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !10, line: 7, baseType: !159, size: 192, align: 64, offset: 704)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !18, size: 192, align: 8, elements: !160)
!160 = !{!161, !76, !77}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !54, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !10, line: 7, baseType: !50, size: 8, align: 8, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Uncompressed", file: !10, line: 7, baseType: !50, size: 8, align: 8, offset: 904)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !10, line: 7, baseType: !120, size: 64, align: 64, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Request", file: !10, line: 7, baseType: !166, size: 64, align: 64, offset: 1024)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !10, line: 7, size: 1984, align: 8, elements: !168)
!168 = !{!169, !170, !116, !117, !118, !119, !133, !189, !201, !202, !203, !204, !205, !206, !207, !213, !214, !215, !216, !406, !409, !410}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !10, line: 7, baseType: !55, size: 128, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !10, line: 7, baseType: !171, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !10, line: 7, size: 1024, align: 8, elements: !173)
!173 = !{!174, !175, !176, !183, !184, !185, !186, !187, !188}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !10, line: 7, baseType: !55, size: 128, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !10, line: 7, baseType: !55, size: 128, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !10, line: 7, baseType: !177, size: 64, align: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !10, line: 7, size: 320, align: 8, elements: !179)
!179 = !{!180, !181, !182}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !10, line: 7, baseType: !55, size: 128, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !10, line: 7, baseType: !55, size: 128, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !10, line: 7, baseType: !50, size: 8, align: 8, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !10, line: 7, baseType: !55, size: 128, align: 64, offset: 320)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !10, line: 7, baseType: !55, size: 128, align: 64, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !10, line: 7, baseType: !55, size: 128, align: 64, offset: 576)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !10, line: 7, baseType: !50, size: 8, align: 8, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !10, line: 7, baseType: !55, size: 128, align: 64, offset: 768)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !10, line: 7, baseType: !55, size: 128, align: 64, offset: 896)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !10, line: 7, baseType: !190, size: 64, align: 64, offset: 640)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 7, size: 64, align: 8, elements: !192)
!192 = !{!193}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 7, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!197}
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !18, size: 256, align: 8, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 7, baseType: !134, size: 128, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 7, baseType: !13, size: 128, align: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !10, line: 7, baseType: !157, size: 64, align: 64, offset: 704)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !10, line: 7, baseType: !159, size: 192, align: 64, offset: 768)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !10, line: 7, baseType: !50, size: 8, align: 8, offset: 960)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !10, line: 7, baseType: !55, size: 128, align: 64, offset: 1024)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Form", file: !10, line: 7, baseType: !120, size: 64, align: 64, offset: 1152)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "PostForm", file: !10, line: 7, baseType: !120, size: 64, align: 64, offset: 1216)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "MultipartForm", file: !10, line: 7, baseType: !208, size: 64, align: 64, offset: 1280)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", file: !10, line: 7, size: 128, align: 8, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !10, line: 7, baseType: !120, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !10, line: 7, baseType: !120, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !10, line: 7, baseType: !120, size: 64, align: 64, offset: 1344)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !10, line: 7, baseType: !55, size: 128, align: 64, offset: 1408)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "RequestURI", file: !10, line: 7, baseType: !55, size: 128, align: 64, offset: 1536)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !10, line: 7, baseType: !217, size: 64, align: 64, offset: 1664)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionState", file: !10, line: 7, size: 1344, align: 8, elements: !219)
!219 = !{!220, !221, !222, !223, !224, !225, !226, !227, !394, !399, !404, !405}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !10, line: 7, baseType: !127, size: 16, align: 16)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "HandshakeComplete", file: !10, line: 7, baseType: !50, size: 8, align: 8, offset: 16)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "DidResume", file: !10, line: 7, baseType: !50, size: 8, align: 8, offset: 24)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuite", file: !10, line: 7, baseType: !127, size: 16, align: 16, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocol", file: !10, line: 7, baseType: !55, size: 128, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocolIsMutual", file: !10, line: 7, baseType: !50, size: 8, align: 8, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !10, line: 7, baseType: !55, size: 128, align: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "PeerCertificates", file: !10, line: 7, baseType: !228, size: 192, align: 64, offset: 384)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !18, size: 192, align: 8, elements: !229)
!229 = !{!230, !76, !77}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !10, line: 7, size: 10624, align: 8, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !243, !245, !249, !250, !263, !289, !290, !324, !325, !327, !337, !338, !343, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !368, !373, !374, !375, !376, !387, !388, !389, !390, !391, !392, !393}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !10, line: 7, baseType: !152, size: 192, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !10, line: 7, baseType: !152, size: 192, align: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !10, line: 7, baseType: !152, size: 192, align: 64, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !10, line: 7, baseType: !152, size: 192, align: 64, offset: 576)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !10, line: 7, baseType: !152, size: 192, align: 64, offset: 768)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !10, line: 7, baseType: !152, size: 192, align: 64, offset: 960)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !10, line: 7, baseType: !242, size: 64, align: 64, offset: 1152)
!242 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !10, line: 7, baseType: !244, size: 64, align: 64, offset: 1216)
!244 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !10, line: 7, baseType: !246, size: 128, align: 64, offset: 1280)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !18, size: 128, align: 8, elements: !247)
!247 = !{!20, !248}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !18, line: 1, baseType: !40, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !10, line: 7, baseType: !59, size: 64, align: 64, offset: 1408)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !10, line: 7, baseType: !251, size: 64, align: 64, offset: 1472)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !10, line: 7, size: 256, align: 8, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !10, line: 7, baseType: !50, size: 8, align: 8)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !10, line: 7, baseType: !256, size: 192, align: 64, offset: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !10, line: 7, size: 192, align: 8, elements: !257)
!257 = !{!258, !261, !262}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !59, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !59, size: 64, align: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !10, line: 7, baseType: !264, size: 1984, align: 64, offset: 1536)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !10, line: 7, size: 1984, align: 8, elements: !265)
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !288}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !10, line: 7, baseType: !159, size: 192, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !10, line: 7, baseType: !159, size: 192, align: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !10, line: 7, baseType: !159, size: 192, align: 64, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !10, line: 7, baseType: !159, size: 192, align: 64, offset: 576)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !10, line: 7, baseType: !159, size: 192, align: 64, offset: 768)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !10, line: 7, baseType: !159, size: 192, align: 64, offset: 960)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !10, line: 7, baseType: !159, size: 192, align: 64, offset: 1152)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !10, line: 7, baseType: !55, size: 128, align: 64, offset: 1344)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !10, line: 7, baseType: !55, size: 128, align: 64, offset: 1472)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !10, line: 7, baseType: !276, size: 192, align: 64, offset: 1600)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !18, size: 192, align: 8, elements: !277)
!277 = !{!278, !76, !77}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !10, line: 7, size: 320, align: 8, elements: !281)
!281 = !{!282, !287}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !10, line: 7, baseType: !283, size: 192, align: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !10, line: 7, size: 192, align: 8, elements: !284)
!284 = !{!285, !261, !262}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !10, line: 7, baseType: !246, size: 128, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !10, line: 7, baseType: !276, size: 192, align: 64, offset: 1792)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !10, line: 7, baseType: !264, size: 1984, align: 64, offset: 3520)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !10, line: 7, baseType: !291, size: 192, align: 64, offset: 5504)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !10, line: 7, size: 192, align: 8, elements: !292)
!292 = !{!293, !295, !296}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !10, line: 7, baseType: !294, size: 64, align: 64)
!294 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !10, line: 7, baseType: !157, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !10, line: 7, baseType: !297, size: 64, align: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !10, line: 7, size: 704, align: 8, elements: !299)
!299 = !{!300, !301, !310, !321, !322, !323}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !10, line: 7, baseType: !55, size: 128, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !10, line: 7, baseType: !302, size: 192, align: 64, offset: 128)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !18, size: 192, align: 8, elements: !303)
!303 = !{!304, !76, !77}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !10, line: 7, size: 256, align: 8, elements: !307)
!307 = !{!300, !308, !309}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !10, line: 7, baseType: !59, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !10, line: 7, baseType: !50, size: 8, align: 8, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !10, line: 7, baseType: !311, size: 192, align: 64, offset: 320)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !18, size: 192, align: 8, elements: !312)
!312 = !{!313, !76, !77}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !10, line: 7, size: 128, align: 8, elements: !316)
!316 = !{!317, !318, !319, !320}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !10, line: 7, baseType: !157, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !10, line: 7, baseType: !29, size: 8, align: 8, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !10, line: 7, baseType: !50, size: 8, align: 8, offset: 72)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !10, line: 7, baseType: !50, size: 8, align: 8, offset: 80)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !10, line: 7, baseType: !157, size: 64, align: 64, offset: 512)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !10, line: 7, baseType: !157, size: 64, align: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !10, line: 7, baseType: !305, size: 64, align: 64, offset: 640)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !10, line: 7, baseType: !291, size: 192, align: 64, offset: 5696)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !10, line: 7, baseType: !326, size: 64, align: 64, offset: 5888)
!326 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !10, line: 7, baseType: !328, size: 192, align: 64, offset: 5952)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !18, size: 192, align: 8, elements: !329)
!329 = !{!330, !76, !77}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !10, line: 7, size: 448, align: 8, elements: !333)
!333 = !{!334, !335, !336}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !10, line: 7, baseType: !283, size: 192, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !10, line: 7, baseType: !50, size: 8, align: 8, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !10, line: 7, baseType: !152, size: 192, align: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !10, line: 7, baseType: !328, size: 192, align: 64, offset: 6144)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !10, line: 7, baseType: !339, size: 192, align: 64, offset: 6336)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !18, size: 192, align: 8, elements: !340)
!340 = !{!341, !76, !77}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !10, line: 7, baseType: !344, size: 192, align: 64, offset: 6528)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !18, size: 192, align: 8, elements: !345)
!345 = !{!346, !76, !77}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !10, line: 7, baseType: !339, size: 192, align: 64, offset: 6720)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !10, line: 7, baseType: !50, size: 8, align: 8, offset: 6912)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !10, line: 7, baseType: !50, size: 8, align: 8, offset: 6920)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !10, line: 7, baseType: !59, size: 64, align: 64, offset: 6976)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !10, line: 7, baseType: !50, size: 8, align: 8, offset: 7040)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !10, line: 7, baseType: !152, size: 192, align: 64, offset: 7104)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !10, line: 7, baseType: !152, size: 192, align: 64, offset: 7296)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !10, line: 7, baseType: !159, size: 192, align: 64, offset: 7488)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !10, line: 7, baseType: !159, size: 192, align: 64, offset: 7680)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !10, line: 7, baseType: !159, size: 192, align: 64, offset: 7872)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !10, line: 7, baseType: !159, size: 192, align: 64, offset: 8064)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !10, line: 7, baseType: !361, size: 192, align: 64, offset: 8256)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !18, size: 192, align: 8, elements: !362)
!362 = !{!363, !76, !77}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !10, line: 7, size: 192, align: 8, elements: !366)
!366 = !{!367, !261, !262}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !52, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !10, line: 7, baseType: !369, size: 192, align: 64, offset: 8448)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !18, size: 192, align: 8, elements: !370)
!370 = !{!371, !76, !77}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !10, line: 7, baseType: !50, size: 8, align: 8, offset: 8640)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !10, line: 7, baseType: !159, size: 192, align: 64, offset: 8704)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !10, line: 7, baseType: !159, size: 192, align: 64, offset: 8896)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !10, line: 7, baseType: !377, size: 192, align: 64, offset: 9088)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !18, size: 192, align: 8, elements: !378)
!378 = !{!379, !76, !77}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !10, line: 7, size: 384, align: 8, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !10, line: 7, baseType: !365, size: 192, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !10, line: 7, baseType: !386, size: 192, align: 64, offset: 192)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !10, line: 7, size: 192, align: 8, elements: !366)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !10, line: 7, baseType: !377, size: 192, align: 64, offset: 9280)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !10, line: 7, baseType: !159, size: 192, align: 64, offset: 9472)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !10, line: 7, baseType: !159, size: 192, align: 64, offset: 9664)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !10, line: 7, baseType: !159, size: 192, align: 64, offset: 9856)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !10, line: 7, baseType: !159, size: 192, align: 64, offset: 10048)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !10, line: 7, baseType: !159, size: 192, align: 64, offset: 10240)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !10, line: 7, baseType: !339, size: 192, align: 64, offset: 10432)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "VerifiedChains", file: !10, line: 7, baseType: !395, size: 192, align: 64, offset: 576)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !18, size: 192, align: 8, elements: !396)
!396 = !{!397, !76, !77}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !10, line: 7, baseType: !400, size: 192, align: 64, offset: 768)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !18, size: 192, align: 8, elements: !401)
!401 = !{!402, !76, !77}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPResponse", file: !10, line: 7, baseType: !152, size: 192, align: 64, offset: 960)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "TLSUnique", file: !10, line: 7, baseType: !152, size: 192, align: 64, offset: 1152)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", file: !10, line: 7, baseType: !407, size: 64, align: 64, offset: 1728)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !7, line: 1, align: 8, elements: !3)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !10, line: 7, baseType: !40, size: 64, align: 64, offset: 1792)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !10, line: 7, baseType: !411, size: 128, align: 64, offset: 1856)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !10, line: 7, size: 128, align: 8, elements: !412)
!412 = !{!413, !155}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 7, baseType: !414, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,struct{*_type,*void})struct{*_type,*void}}", file: !18, size: 320, align: 8, elements: !416)
!416 = !{!102, !417, !425, !429, !430}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !18, line: 7, baseType: !418, size: 64, align: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!421, !40}
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !18, size: 256, align: 8, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !18, line: 7, baseType: !291, size: 192, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !18, line: 7, baseType: !50, size: 8, align: 8, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !18, line: 7, baseType: !426, size: 64, align: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!407, !40}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !18, line: 7, baseType: !141, size: 64, align: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !18, line: 7, baseType: !431, size: 64, align: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!246, !40, !246}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !10, line: 7, baseType: !217, size: 64, align: 64, offset: 1088)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 7, baseType: !13, size: 128, align: 64, offset: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !10, line: 7, size: 128, align: 8, elements: !437)
!437 = !{!438, !155}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 7, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Attempt)void,*func(*void,string)void,*func(*void)struct{*Attempt,int,int},*func(*void)MultiReader,*func(*void)*Request,*func(*void)int64,*func(*void)Attempt,*func(*void,string)struct{struct{*_type,*void},bool},*func(*void,MultiReader)void,*func(*void,*Request)void,*func(*void,string,struct{*_type,*void})void,*func(*void)string}", file: !18, size: 832, align: 8, elements: !441)
!441 = !{!102, !442, !477, !481, !489, !526, !530, !534, !538, !546, !550, !554, !558}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "AddAttempt", file: !18, line: 7, baseType: !443, size: 64, align: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!41, !40, !446}
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "Attempt", file: !10, line: 7, size: 128, align: 8, elements: !447)
!447 = !{!448, !155}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 7, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Duration,*func(*void)Endpoint,*func(*void)error,*func(*void)*Response}", file: !18, size: 320, align: 8, elements: !451)
!451 = !{!102, !452, !457, !472, !473}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "GetDuration", file: !18, line: 7, baseType: !453, size: 64, align: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!456, !40}
!456 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "GetEndpoint", file: !18, line: 7, baseType: !458, size: 64, align: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!461, !40}
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "Endpoint", file: !10, line: 7, size: 128, align: 8, elements: !462)
!462 = !{!463, !155}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 7, baseType: !464, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)*URL,*func(*void)string}", file: !18, size: 256, align: 8, elements: !466)
!466 = !{!102, !103, !467, !471}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "GetUrl", file: !18, line: 7, baseType: !468, size: 64, align: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!171, !40}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !18, line: 7, baseType: !80, size: 64, align: 64, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "GetError", file: !18, line: 7, baseType: !141, size: 64, align: 64, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "GetResponse", file: !18, line: 7, baseType: !474, size: 64, align: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!111, !40}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteUserData", file: !18, line: 7, baseType: !478, size: 64, align: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!41, !40, !55}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "GetAttempts", file: !18, line: 7, baseType: !482, size: 64, align: 64, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!485, !40}
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Attempt,int,int}", file: !18, size: 192, align: 8, elements: !486)
!486 = !{!487, !76, !77}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !18, line: 7, baseType: !490, size: 64, align: 64, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!493, !40}
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiReader", file: !10, line: 7, size: 128, align: 8, elements: !494)
!494 = !{!495, !155}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 7, baseType: !496, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,int64,int)struct{int64,error},*func(*void)struct{int64,error},*func(*void,Writer)struct{int64,error}}", file: !18, size: 384, align: 8, elements: !498)
!498 = !{!102, !140, !144, !499, !506, !510}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Seek", file: !18, line: 7, baseType: !500, size: 64, align: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!503, !40, !157, !59}
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !18, size: 192, align: 8, elements: !504)
!504 = !{!505, !435}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 7, baseType: !157, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "TotalSize", file: !18, line: 7, baseType: !507, size: 64, align: 64, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!503, !40}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "WriteTo", file: !18, line: 7, baseType: !511, size: 64, align: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!514, !40, !518}
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !18, size: 192, align: 8, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !18, line: 7, baseType: !157, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !18, line: 7, baseType: !13, size: 128, align: 64, offset: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !10, line: 5, size: 128, align: 8, elements: !519)
!519 = !{!520, !155}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 5, baseType: !521, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !18, size: 128, align: 8, elements: !523)
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 5, baseType: !21, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !18, line: 5, baseType: !145, size: 64, align: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "GetHttpRequest", file: !18, line: 7, baseType: !527, size: 64, align: 64, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!166, !40}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "GetId", file: !18, line: 7, baseType: !531, size: 64, align: 64, offset: 384)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!157, !40}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "GetLastAttempt", file: !18, line: 7, baseType: !535, size: 64, align: 64, offset: 448)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!446, !40}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserData", file: !18, line: 7, baseType: !539, size: 64, align: 64, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!542, !40, !55}
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*_type,*void},bool}", file: !18, size: 192, align: 8, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 7, baseType: !246, size: 128, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 7, baseType: !50, size: 8, align: 8, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "SetBody", file: !18, line: 7, baseType: !547, size: 64, align: 64, offset: 576)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!41, !40, !493}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "SetHttpRequest", file: !18, line: 7, baseType: !551, size: 64, align: 64, offset: 640)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!41, !40, !166}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "SetUserData", file: !18, line: 7, baseType: !555, size: 64, align: 64, offset: 704)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!41, !40, !55, !246}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !18, line: 7, baseType: !80, size: 64, align: 64, offset: 768)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "expression", file: !10, line: 18, baseType: !560, size: 64, align: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "Regexp", file: !10, line: 9, size: 1280, align: 8, elements: !562)
!562 = !{!563, !617, !622}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "regexpRO", file: !10, line: 9, baseType: !564, size: 1024, align: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.regexpRO", file: !10, line: 9, size: 1024, align: 8, elements: !565)
!565 = !{!566, !567, !590, !607, !608, !609, !610, !611, !612, !614, !615, !616}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "expr", file: !10, line: 9, baseType: !55, size: 128, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "prog", file: !10, line: 9, baseType: !568, size: 64, align: 64, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "Prog", file: !10, line: 9, size: 320, align: 8, elements: !570)
!570 = !{!571, !588, !589}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Inst", file: !10, line: 9, baseType: !572, size: 192, align: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Inst,int,int}", file: !18, size: 192, align: 8, elements: !573)
!573 = !{!574, !76, !77}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !575, size: 64, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inst", file: !10, line: 9, size: 320, align: 8, elements: !577)
!577 = !{!578, !580, !581, !582}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Op", file: !10, line: 9, baseType: !579, size: 8, align: 8)
!579 = !DIBasicType(name: "InstOp", size: 8, encoding: DW_ATE_unsigned)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !10, line: 9, baseType: !8, size: 32, align: 32, offset: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Arg", file: !10, line: 9, baseType: !8, size: 32, align: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Rune", file: !10, line: 9, baseType: !583, size: 192, align: 64, offset: 128)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int32,int,int}", file: !18, size: 192, align: 8, elements: !584)
!584 = !{!585, !76, !77}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !586, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Start", file: !10, line: 9, baseType: !59, size: 64, align: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "NumCap", file: !10, line: 9, baseType: !59, size: 64, align: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "onepass", file: !10, line: 9, baseType: !591, size: 64, align: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.onePassProg", file: !10, line: 9, size: 320, align: 8, elements: !593)
!593 = !{!594, !588, !589}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Inst", file: !10, line: 9, baseType: !595, size: 192, align: 64)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.regexp.onePassInst,int,int}", file: !18, size: 192, align: 8, elements: !596)
!596 = !{!597, !76, !77}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.onePassInst", file: !10, line: 9, size: 512, align: 8, elements: !600)
!600 = !{!601, !602}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Inst", file: !10, line: 9, baseType: !576, size: 320, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !10, line: 9, baseType: !603, size: 192, align: 64, offset: 320)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint32,int,int}", file: !18, size: 192, align: 8, elements: !604)
!604 = !{!605, !76, !77}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !606, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", file: !10, line: 9, baseType: !55, size: 128, align: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "prefixBytes", file: !10, line: 9, baseType: !152, size: 192, align: 64, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "prefixComplete", file: !10, line: 9, baseType: !50, size: 8, align: 8, offset: 576)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "prefixRune", file: !10, line: 9, baseType: !587, size: 32, align: 32, offset: 608)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "prefixEnd", file: !10, line: 9, baseType: !8, size: 32, align: 32, offset: 640)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "cond", file: !10, line: 9, baseType: !613, size: 8, align: 8, offset: 672)
!613 = !DIBasicType(name: "EmptyOp", size: 8, encoding: DW_ATE_unsigned)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "numSubexp", file: !10, line: 9, baseType: !59, size: 64, align: 64, offset: 704)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "subexpNames", file: !10, line: 9, baseType: !159, size: 192, align: 64, offset: 768)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "longest", file: !10, line: 9, baseType: !50, size: 8, align: 8, offset: 960)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !10, line: 9, baseType: !618, size: 64, align: 32, offset: 1024)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !10, line: 8, size: 64, align: 8, elements: !619)
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !10, line: 8, baseType: !587, size: 32, align: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !10, line: 8, baseType: !8, size: 32, align: 32, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "machine", file: !10, line: 9, baseType: !623, size: 192, align: 64, offset: 1088)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**.regexp.machine,int,int}", file: !18, size: 192, align: 8, elements: !624)
!624 = !{!625, !76, !77}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !626, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.machine", file: !10, line: 9, size: 2112, align: 8, elements: !629)
!629 = !{!630, !631, !632, !633, !634, !655, !672, !673, !678, !679, !680, !684, !688}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "re", file: !10, line: 9, baseType: !40, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !10, line: 9, baseType: !568, size: 64, align: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "op", file: !10, line: 9, baseType: !591, size: 64, align: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "maxBitStateLen", file: !10, line: 9, baseType: !59, size: 64, align: 64, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !10, line: 9, baseType: !635, size: 64, align: 64, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.bitState", file: !10, line: 9, size: 704, align: 8, elements: !637)
!637 = !{!638, !639, !640, !644, !654}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "prog", file: !10, line: 9, baseType: !568, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "end", file: !10, line: 9, baseType: !59, size: 64, align: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "cap", file: !10, line: 9, baseType: !641, size: 192, align: 64, offset: 128)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !18, size: 192, align: 8, elements: !642)
!642 = !{!643, !76, !77}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !286, size: 64, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", file: !10, line: 9, baseType: !645, size: 192, align: 64, offset: 320)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.regexp.job,int,int}", file: !18, size: 192, align: 8, elements: !646)
!646 = !{!647, !76, !77}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !648, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.job", file: !10, line: 9, size: 128, align: 8, elements: !650)
!650 = !{!651, !652, !653}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !10, line: 9, baseType: !8, size: 32, align: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !10, line: 9, baseType: !50, size: 8, align: 8, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pos", file: !10, line: 9, baseType: !59, size: 64, align: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "visited", file: !10, line: 9, baseType: !603, size: 192, align: 64, offset: 512)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "q0", file: !10, line: 9, baseType: !656, size: 384, align: 64, offset: 320)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.queue", file: !10, line: 9, size: 384, align: 8, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "sparse", file: !10, line: 9, baseType: !603, size: 192, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "dense", file: !10, line: 9, baseType: !660, size: 192, align: 64, offset: 192)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.regexp.entry,int,int}", file: !18, size: 192, align: 8, elements: !661)
!661 = !{!662, !76, !77}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !663, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.entry", file: !10, line: 9, size: 128, align: 8, elements: !665)
!665 = !{!651, !666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "t", file: !10, line: 9, baseType: !667, size: 64, align: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.thread", file: !10, line: 9, size: 256, align: 8, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "inst", file: !10, line: 9, baseType: !575, size: 64, align: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "cap", file: !10, line: 9, baseType: !641, size: 192, align: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "q1", file: !10, line: 9, baseType: !656, size: 384, align: 64, offset: 704)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "pool", file: !10, line: 9, baseType: !674, size: 192, align: 64, offset: 1088)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**.regexp.thread,int,int}", file: !18, size: 192, align: 8, elements: !675)
!675 = !{!676, !76, !77}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !18, line: 1, baseType: !677, size: 64, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "matched", file: !10, line: 9, baseType: !50, size: 8, align: 8, offset: 1280)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "matchcap", file: !10, line: 9, baseType: !641, size: 192, align: 64, offset: 1344)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "inputBytes", file: !10, line: 9, baseType: !681, size: 192, align: 64, offset: 1536)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.inputBytes", file: !10, line: 9, size: 192, align: 8, elements: !682)
!682 = !{!683}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "str", file: !10, line: 9, baseType: !152, size: 192, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "inputString", file: !10, line: 9, baseType: !685, size: 128, align: 64, offset: 1728)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.inputString", file: !10, line: 9, size: 128, align: 8, elements: !686)
!686 = !{!687}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "str", file: !10, line: 9, baseType: !55, size: 128, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "inputReader", file: !10, line: 9, baseType: !689, size: 256, align: 64, offset: 1856)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.inputReader", file: !10, line: 9, size: 256, align: 8, elements: !690)
!690 = !{!691, !708, !709}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !10, line: 9, baseType: !692, size: 128, align: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "RuneReader", file: !10, line: 9, size: 128, align: 8, elements: !693)
!693 = !{!694, !155}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 9, baseType: !695, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{int32,int,error}}", file: !18, size: 128, align: 8, elements: !697)
!697 = !{!698, !699}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !18, line: 9, baseType: !21, size: 64, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ReadRune", file: !18, line: 9, baseType: !700, size: 64, align: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!703, !40}
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int32,int,error}", file: !18, size: 256, align: 8, elements: !704)
!704 = !{!705, !706, !707}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !18, line: 9, baseType: !587, size: 32, align: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !18, line: 9, baseType: !59, size: 64, align: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !18, line: 9, baseType: !13, size: 128, align: 64, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "atEOT", file: !10, line: 9, baseType: !50, size: 8, align: 8, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "pos", file: !10, line: 9, baseType: !59, size: 64, align: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !10, line: 19, baseType: !711, size: 64, align: 64, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!712 = !DILocalVariable(name: "m", arg: 1, scope: !9, file: !10, line: 68, type: !84)
!713 = !DILocation(line: 68, column: 1, scope: !9)
!714 = !DILocalVariable(name: "pattern", arg: 2, scope: !9, file: !10, line: 68, type: !55)
!715 = !DILocation(line: 68, column: 34, scope: !9)
!716 = !DILocalVariable(name: "location", arg: 3, scope: !9, file: !10, line: 68, type: !96)
!717 = !DILocation(line: 68, column: 50, scope: !9)
!718 = !DILocalVariable(name: "$ret5", scope: !9, file: !10, line: 68, type: !13)
!719 = !DILocation(line: 68, column: 69, scope: !9)
!720 = !DILocation(line: 69, column: 3, scope: !721)
!721 = distinct !DILexicalBlock(scope: !9, file: !10, line: 68, column: 1)
!722 = !DILocation(line: 95, column: 1, scope: !9)
!723 = !DILocation(line: 69, column: 9, scope: !721)
!724 = !DILocation(line: 70, column: 9, scope: !721)
!725 = !DILocation(line: 70, column: 2, scope: !721)
!726 = !DILocation(line: 72, column: 19, scope: !721)
!727 = !DILocalVariable(name: "sink$0", scope: !721, file: !10, line: 72, type: !560)
!728 = !DILocation(line: 72, column: 2, scope: !9)
!729 = !DILocalVariable(name: "err", scope: !721, file: !10, line: 72, type: !13)
!730 = !DILocation(line: 73, column: 9, scope: !721)
!731 = !DILocation(line: 74, column: 14, scope: !721)
!732 = !DILocation(line: 74, column: 91, scope: !721)
!733 = !DILocation(line: 77, column: 2, scope: !734)
!734 = distinct !DILexicalBlock(scope: !721, file: !10, line: 77, column: 2)
!735 = !DILocalVariable(name: "p", scope: !734, file: !10, line: 77, type: !92)
!736 = !DILocation(line: 77, column: 6, scope: !721)
!737 = !DILocation(line: 78, column: 16, scope: !734)
!738 = !DILocation(line: 79, column: 15, scope: !734)
!739 = !DILocation(line: 83, column: 23, scope: !721)
!740 = !DILocation(line: 83, column: 15, scope: !721)
!741 = !DILocation(line: 83, column: 35, scope: !721)
!742 = !DILocation(line: 85, column: 21, scope: !721)
!743 = !DILocation(line: 85, column: 7, scope: !721)
!744 = !DILocation(line: 86, column: 21, scope: !721)
!745 = !DILocalVariable(name: "expression", scope: !721, file: !10, line: 86, type: !560)
!746 = !DILocation(line: 86, column: 2, scope: !9)
!747 = !DILocation(line: 87, column: 9, scope: !721)
!748 = !DILocation(line: 88, column: 3, scope: !721)
!749 = !DILocation(line: 91, column: 14, scope: !721)
!750 = !DILocation(line: 92, column: 3, scope: !721)
!751 = !DILocation(line: 92, column: 15, scope: !721)
!752 = !DILocation(line: 74, column: 3, scope: !9)
!753 = distinct !DISubprogram(name: "pathroute.GetLocationById..1command_line_arguments.PathRouter", linkageName: "command_line_arguments.PathRouter.GetLocationById", scope: null, file: !10, line: 109, type: !754, isLocal: false, isDefinition: true, scopeLine: 109, isOptimized: false, unit: !1, retainedNodes: !3)
!754 = !DISubroutineType(types: !755)
!755 = !{!96, !84, !84, !55}
!756 = !DILocalVariable(name: "m", arg: 1, scope: !753, file: !10, line: 109, type: !84)
!757 = !DILocation(line: 109, column: 1, scope: !753)
!758 = !DILocalVariable(name: "id", arg: 2, scope: !753, file: !10, line: 109, type: !55)
!759 = !DILocation(line: 109, column: 38, scope: !753)
!760 = !DILocalVariable(name: "$ret7", scope: !753, file: !10, line: 109, type: !96)
!761 = !DILocation(line: 109, column: 49, scope: !753)
!762 = !DILocation(line: 110, column: 3, scope: !753)
!763 = !DILocation(line: 119, column: 1, scope: !753)
!764 = !DILocation(line: 110, column: 9, scope: !753)
!765 = !DILocation(line: 111, column: 9, scope: !753)
!766 = !DILocation(line: 111, column: 2, scope: !753)
!767 = !DILocation(line: 113, column: 2, scope: !768)
!768 = distinct !DILexicalBlock(scope: !753, file: !10, line: 113, column: 2)
!769 = !DILocation(line: 114, column: 16, scope: !768)
!770 = !DILocalVariable(name: "p", scope: !768, file: !10, line: 113, type: !92)
!771 = !DILocation(line: 113, column: 6, scope: !753)
!772 = !DILocation(line: 114, column: 25, scope: !768)
!773 = !DILocation(line: 115, column: 4, scope: !768)
!774 = !DILocation(line: 115, column: 4, scope: !753)
!775 = distinct !DISubprogram(name: "pathroute.GetLocationByPattern..1command_line_arguments.PathRouter", linkageName: "command_line_arguments.PathRouter.GetLocationByPattern", scope: null, file: !10, line: 97, type: !754, isLocal: false, isDefinition: true, scopeLine: 97, isOptimized: false, unit: !1, retainedNodes: !3)
!776 = !DILocalVariable(name: "m", arg: 1, scope: !775, file: !10, line: 97, type: !84)
!777 = !DILocation(line: 97, column: 1, scope: !775)
!778 = !DILocalVariable(name: "pattern", arg: 2, scope: !775, file: !10, line: 97, type: !55)
!779 = !DILocation(line: 97, column: 43, scope: !775)
!780 = !DILocalVariable(name: "$ret6", scope: !775, file: !10, line: 97, type: !96)
!781 = !DILocation(line: 97, column: 59, scope: !775)
!782 = !DILocation(line: 98, column: 3, scope: !775)
!783 = !DILocation(line: 107, column: 1, scope: !775)
!784 = !DILocation(line: 98, column: 9, scope: !775)
!785 = !DILocation(line: 99, column: 9, scope: !775)
!786 = !DILocation(line: 99, column: 2, scope: !775)
!787 = !DILocation(line: 101, column: 2, scope: !788)
!788 = distinct !DILexicalBlock(scope: !775, file: !10, line: 101, column: 2)
!789 = !DILocalVariable(name: "p", scope: !788, file: !10, line: 101, type: !92)
!790 = !DILocation(line: 101, column: 6, scope: !775)
!791 = !DILocation(line: 102, column: 16, scope: !788)
!792 = !DILocation(line: 103, column: 4, scope: !775)
!793 = distinct !DISubprogram(name: "pathroute.RemoveLocation..1command_line_arguments.PathRouter", linkageName: "command_line_arguments.PathRouter.RemoveLocation", scope: null, file: !10, line: 121, type: !794, isLocal: false, isDefinition: true, scopeLine: 121, isOptimized: false, unit: !1, retainedNodes: !3)
!794 = !DISubroutineType(types: !795)
!795 = !{!13, !84, !84, !96}
!796 = !DILocalVariable(name: "m", arg: 1, scope: !793, file: !10, line: 121, type: !84)
!797 = !DILocation(line: 121, column: 1, scope: !793)
!798 = !DILocalVariable(name: "location", arg: 2, scope: !793, file: !10, line: 121, type: !96)
!799 = !DILocation(line: 121, column: 37, scope: !793)
!800 = !DILocalVariable(name: "$ret8", scope: !793, file: !10, line: 121, type: !13)
!801 = !DILocation(line: 121, column: 56, scope: !793)
!802 = !DILocation(line: 122, column: 3, scope: !803)
!803 = distinct !DILexicalBlock(scope: !793, file: !10, line: 121, column: 1)
!804 = !DILocation(line: 147, column: 1, scope: !793)
!805 = !DILocation(line: 122, column: 9, scope: !803)
!806 = !DILocation(line: 123, column: 9, scope: !803)
!807 = !DILocation(line: 123, column: 2, scope: !803)
!808 = !DILocation(line: 125, column: 14, scope: !803)
!809 = !DILocation(line: 126, column: 14, scope: !803)
!810 = !DILocation(line: 129, column: 2, scope: !811)
!811 = distinct !DILexicalBlock(scope: !803, file: !10, line: 129, column: 2)
!812 = !DILocalVariable(name: "i", scope: !811, file: !10, line: 129, type: !59)
!813 = !DILocation(line: 129, column: 6, scope: !803)
!814 = !DILocalVariable(name: "p", scope: !811, file: !10, line: 129, type: !92)
!815 = !DILocation(line: 130, column: 17, scope: !811)
!816 = !DILocation(line: 132, column: 5, scope: !811)
!817 = !DILocation(line: 132, column: 26, scope: !811)
!818 = !DILocation(line: 132, column: 43, scope: !811)
!819 = !DILocation(line: 132, column: 55, scope: !811)
!820 = !DILocation(line: 132, column: 36, scope: !811)
!821 = !DILocation(line: 132, column: 53, scope: !811)
!822 = !DILocation(line: 132, column: 18, scope: !811)
!823 = !DILocation(line: 132, column: 16, scope: !811)
!824 = !DILocation(line: 136, column: 10, scope: !803)
!825 = !DILocation(line: 136, column: 22, scope: !803)
!826 = !DILocation(line: 137, column: 22, scope: !803)
!827 = !DILocation(line: 137, column: 8, scope: !803)
!828 = !DILocation(line: 140, column: 21, scope: !803)
!829 = !DILocalVariable(name: "expression", scope: !803, file: !10, line: 140, type: !560)
!830 = !DILocation(line: 140, column: 2, scope: !793)
!831 = !DILocalVariable(name: "err", scope: !803, file: !10, line: 140, type: !13)
!832 = !DILocation(line: 141, column: 9, scope: !803)
!833 = !DILocation(line: 0, scope: !803)
!834 = !DILocation(line: 146, column: 2, scope: !803)
!835 = !DILocation(line: 142, column: 16, scope: !803)
!836 = !DILocation(line: 144, column: 16, scope: !803)
!837 = !DILocation(line: 126, column: 3, scope: !793)
!838 = distinct !DISubprogram(name: "pathroute.Route..1command_line_arguments.PathRouter", linkageName: "command_line_arguments.PathRouter.Route", scope: null, file: !10, line: 39, type: !839, isLocal: false, isDefinition: true, scopeLine: 39, isOptimized: false, unit: !1, retainedNodes: !3)
!839 = !DISubroutineType(types: !840)
!840 = !{!841, !84, !84, !436}
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Location,error}", file: !18, size: 256, align: 8, elements: !842)
!842 = !{!843, !844}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 39, baseType: !96, size: 128, align: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 39, baseType: !13, size: 128, align: 64, offset: 128)
!845 = !DILocalVariable(name: "m", arg: 1, scope: !838, file: !10, line: 39, type: !84)
!846 = !DILocation(line: 39, column: 1, scope: !838)
!847 = !DILocalVariable(name: "req", arg: 2, scope: !838, file: !10, line: 39, type: !436)
!848 = !DILocation(line: 39, column: 28, scope: !838)
!849 = !DILocalVariable(name: "$ret4", scope: !838, file: !10, line: 39, type: !13)
!850 = !DILocation(line: 39, column: 52, scope: !838)
!851 = !DILocation(line: 40, column: 3, scope: !852)
!852 = distinct !DILexicalBlock(scope: !838, file: !10, line: 39, column: 1)
!853 = !DILocation(line: 66, column: 1, scope: !838)
!854 = !DILocation(line: 40, column: 9, scope: !852)
!855 = !DILocation(line: 41, column: 9, scope: !852)
!856 = !DILocation(line: 41, column: 2, scope: !852)
!857 = !DILocation(line: 43, column: 6, scope: !852)
!858 = !DILocation(line: 43, column: 18, scope: !852)
!859 = !DILocation(line: 44, column: 3, scope: !852)
!860 = !DILocation(line: 47, column: 13, scope: !852)
!861 = !DILocation(line: 47, column: 30, scope: !852)
!862 = !DILocation(line: 47, column: 34, scope: !852)
!863 = !DILocalVariable(name: "path", scope: !852, file: !10, line: 47, type: !55)
!864 = !DILocation(line: 47, column: 2, scope: !838)
!865 = !DILocation(line: 48, column: 15, scope: !852)
!866 = !DILocation(line: 52, column: 14, scope: !852)
!867 = !DILocation(line: 52, column: 25, scope: !852)
!868 = !DILocalVariable(name: "matches", scope: !852, file: !10, line: 52, type: !641)
!869 = !DILocation(line: 52, column: 2, scope: !838)
!870 = !DILocation(line: 53, column: 18, scope: !852)
!871 = !DILocalVariable(name: "i", scope: !872, file: !10, line: 56, type: !59)
!872 = distinct !DILexicalBlock(scope: !852, file: !10, line: 56, column: 2)
!873 = !DILocation(line: 56, column: 6, scope: !852)
!874 = !DILocation(line: 56, column: 16, scope: !872)
!875 = !DILocation(line: 54, column: 3, scope: !852)
!876 = !DILocation(line: 57, column: 13, scope: !872)
!877 = !DILocation(line: 57, column: 17, scope: !872)
!878 = !DILocation(line: 56, column: 34, scope: !872)
!879 = !DILocation(line: 58, column: 8, scope: !872)
!880 = !DILocation(line: 58, column: 10, scope: !872)
!881 = !DILocation(line: 58, column: 21, scope: !872)
!882 = !DILocation(line: 58, column: 13, scope: !872)
!883 = !DILocation(line: 59, column: 21, scope: !872)
!884 = !DILocation(line: 59, column: 5, scope: !872)
!885 = !DILocation(line: 61, column: 22, scope: !872)
!886 = !DILocation(line: 61, column: 29, scope: !872)
!887 = !DILocation(line: 65, column: 2, scope: !852)
!888 = !DILocation(line: 44, column: 3, scope: !838)
!889 = distinct !DISubprogram(name: "pathroute.command_line_arguments.locPair..hash", linkageName: "command_line_arguments.command_line_arguments.locPair..hash", scope: null, file: !7, line: 1, type: !38, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!890 = !DILocalVariable(name: "key", arg: 1, scope: !889, file: !7, line: 1, type: !40)
!891 = !DILocation(line: 1, column: 1, scope: !889)
!892 = !DILocalVariable(name: "seed", arg: 2, scope: !889, file: !7, line: 1, type: !25)
!893 = !DILocalVariable(name: "$ret16", scope: !889, file: !7, line: 1, type: !25)
!894 = distinct !DISubprogram(name: "pathroute.command_line_arguments.locPair..eq", linkageName: "command_line_arguments.command_line_arguments.locPair..eq", scope: null, file: !7, line: 1, type: !48, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!895 = !DILocalVariable(name: "key1", arg: 1, scope: !894, file: !7, line: 1, type: !40)
!896 = !DILocation(line: 1, column: 1, scope: !894)
!897 = !DILocalVariable(name: "key2", arg: 2, scope: !894, file: !7, line: 1, type: !40)
!898 = !DILocalVariable(name: "$ret17", scope: !894, file: !7, line: 1, type: !50)
!899 = distinct !DISubprogram(name: "pathroute.Len.command_line_arguments.ByPattern", linkageName: "command_line_arguments.ByPattern.Len", scope: null, file: !10, line: 29, type: !900, isLocal: false, isDefinition: true, scopeLine: 29, isOptimized: false, unit: !1, retainedNodes: !3)
!900 = !DISubroutineType(types: !901)
!901 = !{!59, !902, !902}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByPattern", file: !10, line: 27, size: 192, align: 8, elements: !904)
!904 = !{!905, !261, !262}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !91, size: 64, align: 64)
!906 = !DILocalVariable(name: "pointer", arg: 1, scope: !899, file: !10, line: 29, type: !902)
!907 = !DILocation(line: 29, column: 1, scope: !899)
!908 = !DILocalVariable(name: "a", scope: !899, file: !10, line: 29, type: !903)
!909 = !DILocalVariable(name: "$ret0", scope: !899, file: !10, line: 29, type: !59)
!910 = !DILocation(line: 29, column: 26, scope: !899)
!911 = !DILocation(line: 29, column: 42, scope: !899)
!912 = distinct !DISubprogram(name: "pathroute.Less.command_line_arguments.ByPattern", linkageName: "command_line_arguments.ByPattern.Less", scope: null, file: !10, line: 31, type: !913, isLocal: false, isDefinition: true, scopeLine: 31, isOptimized: false, unit: !1, retainedNodes: !3)
!913 = !DISubroutineType(types: !914)
!914 = !{!50, !902, !902, !59, !59}
!915 = !DILocalVariable(name: "pointer", arg: 1, scope: !912, file: !10, line: 31, type: !902)
!916 = !DILocation(line: 31, column: 1, scope: !912)
!917 = !DILocalVariable(name: "i", arg: 2, scope: !912, file: !10, line: 31, type: !59)
!918 = !DILocation(line: 31, column: 25, scope: !912)
!919 = !DILocalVariable(name: "j", arg: 3, scope: !912, file: !10, line: 31, type: !59)
!920 = !DILocation(line: 31, column: 28, scope: !912)
!921 = !DILocalVariable(name: "a", scope: !912, file: !10, line: 31, type: !903)
!922 = !DILocalVariable(name: "$ret1", scope: !912, file: !10, line: 31, type: !50)
!923 = !DILocation(line: 31, column: 35, scope: !912)
!924 = !DILocation(line: 31, column: 54, scope: !912)
!925 = !DILocation(line: 31, column: 74, scope: !912)
!926 = !DILocation(line: 31, column: 49, scope: !912)
!927 = !DILocation(line: 31, column: 69, scope: !912)
!928 = !DILocation(line: 31, column: 67, scope: !912)
!929 = !DILocation(line: 31, column: 42, scope: !912)
!930 = distinct !DISubprogram(name: "pathroute.Swap.command_line_arguments.ByPattern", linkageName: "command_line_arguments.ByPattern.Swap", scope: null, file: !10, line: 30, type: !931, isLocal: false, isDefinition: true, scopeLine: 30, isOptimized: false, unit: !1, retainedNodes: !3)
!931 = !DISubroutineType(types: !932)
!932 = !{!41, !902, !902, !59, !59}
!933 = !DILocalVariable(name: "pointer", arg: 1, scope: !930, file: !10, line: 30, type: !902)
!934 = !DILocation(line: 30, column: 1, scope: !930)
!935 = !DILocalVariable(name: "i", arg: 2, scope: !930, file: !10, line: 30, type: !59)
!936 = !DILocation(line: 30, column: 25, scope: !930)
!937 = !DILocalVariable(name: "j", arg: 3, scope: !930, file: !10, line: 30, type: !59)
!938 = !DILocation(line: 30, column: 28, scope: !930)
!939 = !DILocalVariable(name: "a", scope: !930, file: !10, line: 30, type: !903)
!940 = !DILocation(line: 30, column: 56, scope: !930)
!941 = !DILocation(line: 30, column: 62, scope: !930)
!942 = !DILocation(line: 30, column: 53, scope: !930)
!943 = distinct !DISubprogram(name: "pathroute.NewPathRouter", linkageName: "command_line_arguments.NewPathRouter", scope: null, file: !10, line: 33, type: !944, isLocal: false, isDefinition: true, scopeLine: 33, isOptimized: false, unit: !1, retainedNodes: !3)
!944 = !DISubroutineType(types: !945)
!945 = !{!84}
!946 = !DILocalVariable(name: "$ret2", scope: !943, file: !10, line: 33, type: !84)
!947 = !DILocation(line: 33, column: 22, scope: !943)
!948 = !DILocation(line: 35, column: 10, scope: !943)
!949 = !DILocation(line: 34, column: 9, scope: !943)
!950 = !DILocation(line: 34, column: 10, scope: !943)
!951 = !DILocation(line: 34, column: 2, scope: !943)
!952 = distinct !DISubprogram(name: "pathroute.command_line_arguments..thunk0", scope: null, file: !10, line: 41, type: !953, isLocal: true, isDefinition: true, scopeLine: 41, isOptimized: false, unit: !1, retainedNodes: !3)
!953 = !DISubroutineType(types: !954)
!954 = !{!50, !955}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Mutex}", file: !18, size: 64, align: 8, elements: !957)
!957 = !{!958}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "a0", file: !18, line: 41, baseType: !711, size: 64, align: 64)
!959 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !952, file: !10, line: 41, type: !955)
!960 = !DILocation(line: 41, column: 2, scope: !952)
!961 = !DILocalVariable(name: "$ret11", scope: !952, file: !10, line: 41, type: !50)
!962 = distinct !DISubprogram(name: "pathroute.command_line_arguments..thunk1", scope: null, file: !10, line: 70, type: !953, isLocal: true, isDefinition: true, scopeLine: 70, isOptimized: false, unit: !1, retainedNodes: !3)
!963 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !962, file: !10, line: 70, type: !955)
!964 = !DILocation(line: 70, column: 2, scope: !962)
!965 = !DILocalVariable(name: "$ret12", scope: !962, file: !10, line: 70, type: !50)
!966 = distinct !DISubprogram(name: "pathroute.buildMapping", scope: null, file: !10, line: 149, type: !967, isLocal: true, isDefinition: true, scopeLine: 149, isOptimized: false, unit: !1, retainedNodes: !3)
!967 = !DISubroutineType(types: !968)
!968 = !{!969, !88}
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Regexp,error}", file: !18, size: 192, align: 8, elements: !970)
!970 = !{!971, !972}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 9, baseType: !560, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !18, line: 9, baseType: !13, size: 128, align: 64, offset: 64)
!973 = !DILocalVariable(name: "locations", arg: 1, scope: !966, file: !10, line: 149, type: !88)
!974 = !DILocation(line: 149, column: 19, scope: !966)
!975 = !DILocalVariable(name: "$ret9", scope: !966, file: !10, line: 149, type: !560)
!976 = !DILocation(line: 149, column: 41, scope: !966)
!977 = !DILocation(line: 150, column: 9, scope: !978)
!978 = distinct !DILexicalBlock(scope: !966, file: !10, line: 149, column: 1)
!979 = !DILocation(line: 150, column: 20, scope: !978)
!980 = !DILocation(line: 151, column: 3, scope: !978)
!981 = !DILocation(line: 153, column: 9, scope: !978)
!982 = !DILocalVariable(name: "out", scope: !978, file: !10, line: 153, type: !983)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", file: !10, line: 5, size: 832, align: 8, elements: !985)
!985 = !{!986, !987, !988, !992}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !10, line: 5, baseType: !152, size: 192, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "off", file: !10, line: 5, baseType: !59, size: 64, align: 64, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "bootstrap", file: !10, line: 5, baseType: !989, size: 512, align: 8, offset: 256)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 512, align: 1, elements: !990)
!990 = !{!991}
!991 = !DISubrange(count: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "lastRead", file: !10, line: 5, baseType: !993, size: 8, align: 8, offset: 768)
!993 = !DIBasicType(name: ".bytes.readOp", size: 8, encoding: DW_ATE_signed)
!994 = !DILocation(line: 153, column: 2, scope: !966)
!995 = !DILocation(line: 154, column: 5, scope: !978)
!996 = !DILocalVariable(name: "i", scope: !997, file: !10, line: 155, type: !59)
!997 = distinct !DILexicalBlock(scope: !978, file: !10, line: 155, column: 2)
!998 = !DILocation(line: 155, column: 6, scope: !978)
!999 = !DILocation(line: 155, column: 2, scope: !997)
!1000 = !DILocalVariable(name: "p", scope: !997, file: !10, line: 155, type: !92)
!1001 = !DILocation(line: 156, column: 6, scope: !997)
!1002 = !DILocation(line: 157, column: 6, scope: !997)
!1003 = !DILocation(line: 158, column: 6, scope: !997)
!1004 = !DILocation(line: 159, column: 8, scope: !997)
!1005 = !DILocation(line: 160, column: 7, scope: !997)
!1006 = !DILocation(line: 164, column: 5, scope: !978)
!1007 = !DILocation(line: 165, column: 27, scope: !978)
!1008 = !DILocation(line: 165, column: 16, scope: !978)
!1009 = !DILocation(line: 165, column: 2, scope: !978)
!1010 = distinct !DISubprogram(name: "pathroute.command_line_arguments..thunk2", scope: null, file: !10, line: 99, type: !953, isLocal: true, isDefinition: true, scopeLine: 99, isOptimized: false, unit: !1, retainedNodes: !3)
!1011 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !1010, file: !10, line: 99, type: !955)
!1012 = !DILocation(line: 99, column: 2, scope: !1010)
!1013 = !DILocalVariable(name: "$ret13", scope: !1010, file: !10, line: 99, type: !50)
!1014 = distinct !DISubprogram(name: "pathroute.command_line_arguments..thunk3", scope: null, file: !10, line: 111, type: !953, isLocal: true, isDefinition: true, scopeLine: 111, isOptimized: false, unit: !1, retainedNodes: !3)
!1015 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !1014, file: !10, line: 111, type: !955)
!1016 = !DILocation(line: 111, column: 2, scope: !1014)
!1017 = !DILocalVariable(name: "$ret14", scope: !1014, file: !10, line: 111, type: !50)
!1018 = distinct !DISubprogram(name: "pathroute.command_line_arguments..thunk4", scope: null, file: !10, line: 123, type: !953, isLocal: true, isDefinition: true, scopeLine: 123, isOptimized: false, unit: !1, retainedNodes: !3)
!1019 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !1018, file: !10, line: 123, type: !955)
!1020 = !DILocation(line: 123, column: 2, scope: !1018)
!1021 = !DILocalVariable(name: "$ret15", scope: !1018, file: !10, line: 123, type: !50)
!1022 = distinct !DISubprogram(name: "pathroute.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !10, line: 2, type: !1023, isLocal: false, isDefinition: true, scopeLine: 2, isOptimized: false, unit: !1, retainedNodes: !3)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!41}
!1025 = !DILocation(line: 1, column: 1, scope: !1026)
!1026 = !DILexicalBlockFile(scope: !1022, file: !7, discriminator: 0)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "pathroute"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "command-line-arguments"
	.ascii ";\n"
	.ascii "import "
	.ascii "bytes"
	.ascii " "
	.ascii "bytes"
	.ascii " \""
	.ascii "bytes"
	.ascii "\";\n"
	.ascii "import "
	.ascii "fmt"
	.ascii " "
	.ascii "fmt"
	.ascii " \""
	.ascii "fmt"
	.ascii "\";\n"
	.ascii "import "
	.ascii "location"
	.ascii " "
	.ascii "github.com/mailgun/vulcan/location"
	.ascii " \""
	.ascii "github.com/mailgun/vulcan/location"
	.ascii "\";\n"
	.ascii "import "
	.ascii "request"
	.ascii " "
	.ascii "github.com/mailgun/vulcan/request"
	.ascii " \""
	.ascii "github.com/mailgun/vulcan/request"
	.ascii "\";\n"
	.ascii "import "
	.ascii "regexp"
	.ascii " "
	.ascii "regexp"
	.ascii " \""
	.ascii "regexp"
	.ascii "\";\n"
	.ascii "import "
	.ascii "sort"
	.ascii " "
	.ascii "sort"
	.ascii " \""
	.ascii "sort"
	.ascii "\";\n"
