; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22route\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22location\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/vulcan/location\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/mailgun/vulcan/location\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22request\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/vulcan/request\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/mailgun/vulcan/request\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22flate\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3)
!2 = !DIFile(filename: "./router.go", directory: "/home/wangcong/go_path/src/github.com/vulcand/vulcan/route")
!3 = !{}
!4 = distinct !DISubprogram(name: "route.command_line_arguments.ConstRouter..hash", linkageName: "command_line_arguments.command_line_arguments.ConstRouter..hash", scope: null, file: !5, line: 1, type: !6, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!5 = !DIFile(filename: "<built-in>", directory: "")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !9, !8}
!8 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "void")
!11 = !DILocalVariable(name: "key", arg: 1, scope: !4, file: !5, line: 1, type: !9)
!12 = !DILocation(line: 1, column: 1, scope: !4)
!13 = !DILocalVariable(name: "seed", arg: 2, scope: !4, file: !5, line: 1, type: !8)
!14 = !DILocalVariable(name: "$ret2", scope: !4, file: !5, line: 1, type: !8)
!15 = distinct !DISubprogram(name: "route.command_line_arguments.ConstRouter..eq", linkageName: "command_line_arguments.command_line_arguments.ConstRouter..eq", scope: null, file: !5, line: 1, type: !16, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !9, !9}
!18 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!19 = !DILocalVariable(name: "key1", arg: 1, scope: !15, file: !5, line: 1, type: !9)
!20 = !DILocation(line: 1, column: 1, scope: !15)
!21 = !DILocalVariable(name: "key2", arg: 2, scope: !15, file: !5, line: 1, type: !9)
!22 = !DILocalVariable(name: "$ret3", scope: !15, file: !5, line: 1, type: !18)
!23 = distinct !DISubprogram(name: "route.Route..1command_line_arguments.ConstRouter", linkageName: "command_line_arguments.ConstRouter.Route", scope: null, file: !24, line: 21, type: !25, isLocal: false, isDefinition: true, scopeLine: 21, isOptimized: false, unit: !1, retainedNodes: !3)
!24 = !DIFile(filename: "router.go", directory: ".")
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !556, !556, !434}
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Location,error}", file: !28, size: 256, align: 8, elements: !29)
!28 = !DIFile(filename: "", directory: "")
!29 = !{!30, !555}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !28, line: 13, baseType: !31, size: 128, align: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !24, line: 5, size: 128, align: 8, elements: !32)
!32 = !{!33, !153}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 5, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void,Request)struct{*Response,error}}", file: !28, size: 192, align: 8, elements: !36)
!36 = !{!37, !89, !93}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !28, line: 5, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !5, line: 1, size: 576, align: 8, elements: !40)
!40 = !{!41, !42, !43, !45, !47, !48, !49, !55, !61, !63, !70, !88}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !5, line: 1, baseType: !8, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !5, line: 1, baseType: !8, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !5, line: 1, baseType: !44, size: 32, align: 32, offset: 128)
!44 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !5, line: 1, baseType: !46, size: 8, align: 8, offset: 160)
!46 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !5, line: 1, baseType: !46, size: 8, align: 8, offset: 168)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !5, line: 1, baseType: !46, size: 8, align: 8, offset: 176)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !5, line: 1, baseType: !50, size: 64, align: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 1, size: 64, align: 8, elements: !52)
!52 = !{!53}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 1, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !5, line: 1, baseType: !56, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 1, size: 64, align: 8, elements: !58)
!58 = !{!59}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 1, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !5, line: 1, baseType: !62, size: 64, align: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !5, line: 1, baseType: !64, size: 64, align: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !5, line: 1, size: 128, align: 8, elements: !66)
!66 = !{!67, !68}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !5, line: 1, baseType: !62, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !5, line: 1, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !5, line: 1, baseType: !71, size: 64, align: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !5, line: 1, size: 320, align: 8, elements: !73)
!73 = !{!74, !75, !76}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !5, line: 1, baseType: !64, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !5, line: 1, baseType: !64, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !5, line: 1, baseType: !77, size: 192, align: 64, offset: 128)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !28, size: 192, align: 8, elements: !78)
!78 = !{!79, !86, !87}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !28, line: 1, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !5, line: 1, size: 320, align: 8, elements: !82)
!82 = !{!74, !75, !83, !84, !85}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !28, line: 1, baseType: !69, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !28, line: 1, baseType: !69, size: 64, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "GetId", file: !28, line: 5, baseType: !90, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!65, !9}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "RoundTrip", file: !28, line: 5, baseType: !94, size: 64, align: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!97, !9, !434}
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Response,error}", file: !28, size: 192, align: 8, elements: !98)
!98 = !{!99, !433}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !28, line: 5, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !24, line: 5, size: 1152, align: 8, elements: !102)
!102 = !{!103, !104, !105, !106, !107, !108, !122, !154, !156, !160, !161, !162, !163, !432}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !24, line: 5, baseType: !65, size: 128, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "StatusCode", file: !24, line: 5, baseType: !69, size: 64, align: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Proto", file: !24, line: 5, baseType: !65, size: 128, align: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMajor", file: !24, line: 5, baseType: !69, size: 64, align: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMinor", file: !24, line: 5, baseType: !69, size: 64, align: 64, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !24, line: 5, baseType: !109, size: 64, align: 64, offset: 448)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !5, line: 1, size: 384, align: 8, elements: !111)
!111 = !{!112, !113, !114, !115, !117, !118, !119, !120, !121}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !5, line: 1, baseType: !69, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !5, line: 1, baseType: !46, size: 8, align: 8, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !5, line: 1, baseType: !46, size: 8, align: 8, offset: 72)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !5, line: 1, baseType: !116, size: 16, align: 16, offset: 80)
!116 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !5, line: 1, baseType: !44, size: 32, align: 32, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !5, line: 1, baseType: !8, size: 64, align: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !24, line: 5, baseType: !123, size: 128, align: 64, offset: 512)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !24, line: 5, size: 128, align: 8, elements: !124)
!124 = !{!125, !153}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 5, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !28, size: 192, align: 8, elements: !128)
!128 = !{!37, !129, !142}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !28, line: 5, baseType: !130, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!133, !9}
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !5, line: 1, size: 128, align: 8, elements: !134)
!134 = !{!135, !141}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 1, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !28, size: 128, align: 8, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !28, line: 1, baseType: !38, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !28, line: 1, baseType: !90, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !5, line: 1, baseType: !9, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !28, line: 5, baseType: !143, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!146, !9, !150}
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !28, size: 192, align: 8, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !28, line: 5, baseType: !69, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !28, line: 5, baseType: !133, size: 128, align: 64, offset: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !28, size: 192, align: 8, elements: !151)
!151 = !{!152, !86, !87}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !28, line: 1, baseType: !62, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !24, line: 1, baseType: !9, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !24, line: 5, baseType: !155, size: 64, align: 64, offset: 640)
!155 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !24, line: 5, baseType: !157, size: 192, align: 64, offset: 704)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !28, size: 192, align: 8, elements: !158)
!158 = !{!159, !86, !87}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !28, line: 1, baseType: !64, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !24, line: 5, baseType: !18, size: 8, align: 8, offset: 896)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Uncompressed", file: !24, line: 5, baseType: !18, size: 8, align: 8, offset: 904)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !24, line: 5, baseType: !109, size: 64, align: 64, offset: 960)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Request", file: !24, line: 5, baseType: !164, size: 64, align: 64, offset: 1024)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !24, line: 5, size: 1984, align: 8, elements: !166)
!166 = !{!167, !168, !105, !106, !107, !108, !122, !187, !199, !200, !201, !202, !203, !204, !205, !211, !212, !213, !214, !404, !407, !408}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !24, line: 5, baseType: !65, size: 128, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !24, line: 5, baseType: !169, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !24, line: 5, size: 1024, align: 8, elements: !171)
!171 = !{!172, !173, !174, !181, !182, !183, !184, !185, !186}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !24, line: 5, baseType: !65, size: 128, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !24, line: 5, baseType: !65, size: 128, align: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !24, line: 5, baseType: !175, size: 64, align: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !24, line: 5, size: 320, align: 8, elements: !177)
!177 = !{!178, !179, !180}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !24, line: 5, baseType: !65, size: 128, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !24, line: 5, baseType: !65, size: 128, align: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !24, line: 5, baseType: !18, size: 8, align: 8, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !24, line: 5, baseType: !65, size: 128, align: 64, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !24, line: 5, baseType: !65, size: 128, align: 64, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !24, line: 5, baseType: !65, size: 128, align: 64, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !24, line: 5, baseType: !18, size: 8, align: 8, offset: 704)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !24, line: 5, baseType: !65, size: 128, align: 64, offset: 768)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !24, line: 5, baseType: !65, size: 128, align: 64, offset: 896)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !24, line: 5, baseType: !188, size: 64, align: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !24, line: 5, size: 64, align: 8, elements: !190)
!190 = !{!191}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !24, line: 5, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!195}
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !28, size: 256, align: 8, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !28, line: 5, baseType: !123, size: 128, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !28, line: 5, baseType: !133, size: 128, align: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !24, line: 5, baseType: !155, size: 64, align: 64, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !24, line: 5, baseType: !157, size: 192, align: 64, offset: 768)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !24, line: 5, baseType: !18, size: 8, align: 8, offset: 960)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !24, line: 5, baseType: !65, size: 128, align: 64, offset: 1024)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Form", file: !24, line: 5, baseType: !109, size: 64, align: 64, offset: 1152)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "PostForm", file: !24, line: 5, baseType: !109, size: 64, align: 64, offset: 1216)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "MultipartForm", file: !24, line: 5, baseType: !206, size: 64, align: 64, offset: 1280)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", file: !24, line: 5, size: 128, align: 8, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !24, line: 5, baseType: !109, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !24, line: 5, baseType: !109, size: 64, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !24, line: 5, baseType: !109, size: 64, align: 64, offset: 1344)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !24, line: 5, baseType: !65, size: 128, align: 64, offset: 1408)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "RequestURI", file: !24, line: 5, baseType: !65, size: 128, align: 64, offset: 1536)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !24, line: 5, baseType: !215, size: 64, align: 64, offset: 1664)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionState", file: !24, line: 5, size: 1344, align: 8, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223, !224, !225, !392, !397, !402, !403}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !24, line: 5, baseType: !116, size: 16, align: 16)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "HandshakeComplete", file: !24, line: 5, baseType: !18, size: 8, align: 8, offset: 16)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "DidResume", file: !24, line: 5, baseType: !18, size: 8, align: 8, offset: 24)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuite", file: !24, line: 5, baseType: !116, size: 16, align: 16, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocol", file: !24, line: 5, baseType: !65, size: 128, align: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocolIsMutual", file: !24, line: 5, baseType: !18, size: 8, align: 8, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !24, line: 5, baseType: !65, size: 128, align: 64, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "PeerCertificates", file: !24, line: 5, baseType: !226, size: 192, align: 64, offset: 384)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !28, size: 192, align: 8, elements: !227)
!227 = !{!228, !86, !87}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !28, line: 1, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !24, line: 5, size: 10624, align: 8, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !238, !239, !241, !243, !247, !248, !261, !287, !288, !322, !323, !325, !335, !336, !341, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !366, !371, !372, !373, !374, !385, !386, !387, !388, !389, !390, !391}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !24, line: 5, baseType: !150, size: 192, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !24, line: 5, baseType: !150, size: 192, align: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !24, line: 5, baseType: !150, size: 192, align: 64, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !24, line: 5, baseType: !150, size: 192, align: 64, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !24, line: 5, baseType: !150, size: 192, align: 64, offset: 768)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !24, line: 5, baseType: !150, size: 192, align: 64, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !24, line: 5, baseType: !240, size: 64, align: 64, offset: 1152)
!240 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !24, line: 5, baseType: !242, size: 64, align: 64, offset: 1216)
!242 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !24, line: 5, baseType: !244, size: 128, align: 64, offset: 1280)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !28, size: 128, align: 8, elements: !245)
!245 = !{!139, !246}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !28, line: 1, baseType: !9, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !24, line: 5, baseType: !69, size: 64, align: 64, offset: 1408)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !24, line: 5, baseType: !249, size: 64, align: 64, offset: 1472)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !24, line: 5, size: 256, align: 8, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !24, line: 5, baseType: !18, size: 8, align: 8)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !24, line: 5, baseType: !254, size: 192, align: 64, offset: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !24, line: 5, size: 192, align: 8, elements: !255)
!255 = !{!256, !259, !260}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !24, line: 1, baseType: !69, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !24, line: 1, baseType: !69, size: 64, align: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !24, line: 5, baseType: !262, size: 1984, align: 64, offset: 1536)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !24, line: 5, size: 1984, align: 8, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !286}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !24, line: 5, baseType: !157, size: 192, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !24, line: 5, baseType: !157, size: 192, align: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !24, line: 5, baseType: !157, size: 192, align: 64, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !24, line: 5, baseType: !157, size: 192, align: 64, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !24, line: 5, baseType: !157, size: 192, align: 64, offset: 768)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !24, line: 5, baseType: !157, size: 192, align: 64, offset: 960)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !24, line: 5, baseType: !157, size: 192, align: 64, offset: 1152)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !24, line: 5, baseType: !65, size: 128, align: 64, offset: 1344)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !24, line: 5, baseType: !65, size: 128, align: 64, offset: 1472)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !24, line: 5, baseType: !274, size: 192, align: 64, offset: 1600)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !28, size: 192, align: 8, elements: !275)
!275 = !{!276, !86, !87}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !28, line: 1, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !24, line: 5, size: 320, align: 8, elements: !279)
!279 = !{!280, !285}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !24, line: 5, baseType: !281, size: 192, align: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !24, line: 5, size: 192, align: 8, elements: !282)
!282 = !{!283, !259, !260}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !24, line: 5, baseType: !244, size: 128, align: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !24, line: 5, baseType: !274, size: 192, align: 64, offset: 1792)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !24, line: 5, baseType: !262, size: 1984, align: 64, offset: 3520)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !24, line: 5, baseType: !289, size: 192, align: 64, offset: 5504)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !24, line: 5, size: 192, align: 8, elements: !290)
!290 = !{!291, !293, !294}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !24, line: 5, baseType: !292, size: 64, align: 64)
!292 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !24, line: 5, baseType: !155, size: 64, align: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !24, line: 5, baseType: !295, size: 64, align: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !24, line: 5, size: 704, align: 8, elements: !297)
!297 = !{!298, !299, !308, !319, !320, !321}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !24, line: 5, baseType: !65, size: 128, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !24, line: 5, baseType: !300, size: 192, align: 64, offset: 128)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !28, size: 192, align: 8, elements: !301)
!301 = !{!302, !86, !87}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !28, line: 1, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !24, line: 5, size: 256, align: 8, elements: !305)
!305 = !{!298, !306, !307}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !24, line: 5, baseType: !69, size: 64, align: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !24, line: 5, baseType: !18, size: 8, align: 8, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !24, line: 5, baseType: !309, size: 192, align: 64, offset: 320)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !28, size: 192, align: 8, elements: !310)
!310 = !{!311, !86, !87}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !28, line: 1, baseType: !312, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !24, line: 5, size: 128, align: 8, elements: !314)
!314 = !{!315, !316, !317, !318}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !24, line: 5, baseType: !155, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !24, line: 5, baseType: !46, size: 8, align: 8, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !24, line: 5, baseType: !18, size: 8, align: 8, offset: 72)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !24, line: 5, baseType: !18, size: 8, align: 8, offset: 80)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !24, line: 5, baseType: !155, size: 64, align: 64, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !24, line: 5, baseType: !155, size: 64, align: 64, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !24, line: 5, baseType: !303, size: 64, align: 64, offset: 640)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !24, line: 5, baseType: !289, size: 192, align: 64, offset: 5696)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !24, line: 5, baseType: !324, size: 64, align: 64, offset: 5888)
!324 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !24, line: 5, baseType: !326, size: 192, align: 64, offset: 5952)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !28, size: 192, align: 8, elements: !327)
!327 = !{!328, !86, !87}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !28, line: 1, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !24, line: 5, size: 448, align: 8, elements: !331)
!331 = !{!332, !333, !334}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !24, line: 5, baseType: !281, size: 192, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !24, line: 5, baseType: !18, size: 8, align: 8, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !24, line: 5, baseType: !150, size: 192, align: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !24, line: 5, baseType: !326, size: 192, align: 64, offset: 6144)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !24, line: 5, baseType: !337, size: 192, align: 64, offset: 6336)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !28, size: 192, align: 8, elements: !338)
!338 = !{!339, !86, !87}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !28, line: 1, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !24, line: 5, baseType: !342, size: 192, align: 64, offset: 6528)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !28, size: 192, align: 8, elements: !343)
!343 = !{!344, !86, !87}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !28, line: 1, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !24, line: 5, baseType: !337, size: 192, align: 64, offset: 6720)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !24, line: 5, baseType: !18, size: 8, align: 8, offset: 6912)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !24, line: 5, baseType: !18, size: 8, align: 8, offset: 6920)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !24, line: 5, baseType: !69, size: 64, align: 64, offset: 6976)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !24, line: 5, baseType: !18, size: 8, align: 8, offset: 7040)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !24, line: 5, baseType: !150, size: 192, align: 64, offset: 7104)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !24, line: 5, baseType: !150, size: 192, align: 64, offset: 7296)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !24, line: 5, baseType: !157, size: 192, align: 64, offset: 7488)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !24, line: 5, baseType: !157, size: 192, align: 64, offset: 7680)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !24, line: 5, baseType: !157, size: 192, align: 64, offset: 7872)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !24, line: 5, baseType: !157, size: 192, align: 64, offset: 8064)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !24, line: 5, baseType: !359, size: 192, align: 64, offset: 8256)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !28, size: 192, align: 8, elements: !360)
!360 = !{!361, !86, !87}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !28, line: 1, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !24, line: 5, size: 192, align: 8, elements: !364)
!364 = !{!365, !259, !260}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !24, line: 1, baseType: !62, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !24, line: 5, baseType: !367, size: 192, align: 64, offset: 8448)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !28, size: 192, align: 8, elements: !368)
!368 = !{!369, !86, !87}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !28, line: 1, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !24, line: 5, baseType: !18, size: 8, align: 8, offset: 8640)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !24, line: 5, baseType: !157, size: 192, align: 64, offset: 8704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !24, line: 5, baseType: !157, size: 192, align: 64, offset: 8896)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !24, line: 5, baseType: !375, size: 192, align: 64, offset: 9088)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !28, size: 192, align: 8, elements: !376)
!376 = !{!377, !86, !87}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !28, line: 1, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !24, line: 5, size: 384, align: 8, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !24, line: 5, baseType: !363, size: 192, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !24, line: 5, baseType: !384, size: 192, align: 64, offset: 192)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !24, line: 5, size: 192, align: 8, elements: !364)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !24, line: 5, baseType: !375, size: 192, align: 64, offset: 9280)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !24, line: 5, baseType: !157, size: 192, align: 64, offset: 9472)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !24, line: 5, baseType: !157, size: 192, align: 64, offset: 9664)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !24, line: 5, baseType: !157, size: 192, align: 64, offset: 9856)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !24, line: 5, baseType: !157, size: 192, align: 64, offset: 10048)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !24, line: 5, baseType: !157, size: 192, align: 64, offset: 10240)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !24, line: 5, baseType: !337, size: 192, align: 64, offset: 10432)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "VerifiedChains", file: !24, line: 5, baseType: !393, size: 192, align: 64, offset: 576)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !28, size: 192, align: 8, elements: !394)
!394 = !{!395, !86, !87}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !28, line: 1, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !24, line: 5, baseType: !398, size: 192, align: 64, offset: 768)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !28, size: 192, align: 8, elements: !399)
!399 = !{!400, !86, !87}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !28, line: 1, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPResponse", file: !24, line: 5, baseType: !150, size: 192, align: 64, offset: 960)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "TLSUnique", file: !24, line: 5, baseType: !150, size: 192, align: 64, offset: 1152)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", file: !24, line: 5, baseType: !405, size: 64, align: 64, offset: 1728)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !5, line: 1, align: 8, elements: !3)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !24, line: 5, baseType: !9, size: 64, align: 64, offset: 1792)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !24, line: 5, baseType: !409, size: 128, align: 64, offset: 1856)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !24, line: 5, size: 128, align: 8, elements: !410)
!410 = !{!411, !153}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 5, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,struct{*_type,*void})struct{*_type,*void}}", file: !28, size: 320, align: 8, elements: !414)
!414 = !{!37, !415, !423, !427, !428}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !28, line: 5, baseType: !416, size: 64, align: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!419, !9}
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !28, size: 256, align: 8, elements: !420)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !28, line: 5, baseType: !289, size: 192, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !28, line: 5, baseType: !18, size: 8, align: 8, offset: 192)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !28, line: 5, baseType: !424, size: 64, align: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!405, !9}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !28, line: 5, baseType: !130, size: 64, align: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !28, line: 5, baseType: !429, size: 64, align: 64, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!244, !9, !244}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !24, line: 5, baseType: !215, size: 64, align: 64, offset: 1088)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !28, line: 5, baseType: !133, size: 128, align: 64, offset: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !24, line: 5, size: 128, align: 8, elements: !435)
!435 = !{!436, !153}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 5, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,Attempt)void,*func(*void,string)void,*func(*void)struct{*Attempt,int,int},*func(*void)MultiReader,*func(*void)*Request,*func(*void)int64,*func(*void)Attempt,*func(*void,string)struct{struct{*_type,*void},bool},*func(*void,MultiReader)void,*func(*void,*Request)void,*func(*void,string,struct{*_type,*void})void,*func(*void)string}", file: !28, size: 832, align: 8, elements: !439)
!439 = !{!37, !440, !475, !479, !487, !522, !526, !530, !534, !542, !546, !550, !554}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "AddAttempt", file: !28, line: 5, baseType: !441, size: 64, align: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!10, !9, !444}
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "Attempt", file: !24, line: 5, size: 128, align: 8, elements: !445)
!445 = !{!446, !153}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 5, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Duration,*func(*void)Endpoint,*func(*void)error,*func(*void)*Response}", file: !28, size: 320, align: 8, elements: !449)
!449 = !{!37, !450, !455, !470, !471}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "GetDuration", file: !28, line: 5, baseType: !451, size: 64, align: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!454, !9}
!454 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "GetEndpoint", file: !28, line: 5, baseType: !456, size: 64, align: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!459, !9}
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "Endpoint", file: !24, line: 5, size: 128, align: 8, elements: !460)
!460 = !{!461, !153}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 5, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)*URL,*func(*void)string}", file: !28, size: 256, align: 8, elements: !464)
!464 = !{!37, !89, !465, !469}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "GetUrl", file: !28, line: 5, baseType: !466, size: 64, align: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!169, !9}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !28, line: 5, baseType: !90, size: 64, align: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "GetError", file: !28, line: 5, baseType: !130, size: 64, align: 64, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "GetResponse", file: !28, line: 5, baseType: !472, size: 64, align: 64, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!100, !9}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteUserData", file: !28, line: 5, baseType: !476, size: 64, align: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!10, !9, !65}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "GetAttempts", file: !28, line: 5, baseType: !480, size: 64, align: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!483, !9}
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Attempt,int,int}", file: !28, size: 192, align: 8, elements: !484)
!484 = !{!485, !86, !87}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !28, line: 1, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !28, line: 5, baseType: !488, size: 64, align: 64, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!491, !9}
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiReader", file: !24, line: 5, size: 128, align: 8, elements: !492)
!492 = !{!493, !153}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 5, baseType: !494, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,int64,int)struct{int64,error},*func(*void)struct{int64,error},*func(*void,Writer)struct{int64,error}}", file: !28, size: 384, align: 8, elements: !496)
!496 = !{!37, !129, !142, !497, !504, !508}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Seek", file: !28, line: 5, baseType: !498, size: 64, align: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!501, !9, !155, !69}
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !28, size: 192, align: 8, elements: !502)
!502 = !{!503, !433}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !28, line: 5, baseType: !155, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "TotalSize", file: !28, line: 5, baseType: !505, size: 64, align: 64, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!501, !9}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "WriteTo", file: !28, line: 5, baseType: !509, size: 64, align: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!512, !9, !515}
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !28, size: 192, align: 8, elements: !513)
!513 = !{!514, !149}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !28, line: 5, baseType: !155, size: 64, align: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !24, line: 5, size: 128, align: 8, elements: !516)
!516 = !{!517, !153}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !24, line: 5, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !28, size: 128, align: 8, elements: !520)
!520 = !{!37, !521}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !28, line: 5, baseType: !143, size: 64, align: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "GetHttpRequest", file: !28, line: 5, baseType: !523, size: 64, align: 64, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!164, !9}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "GetId", file: !28, line: 5, baseType: !527, size: 64, align: 64, offset: 384)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!155, !9}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "GetLastAttempt", file: !28, line: 5, baseType: !531, size: 64, align: 64, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!444, !9}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "GetUserData", file: !28, line: 5, baseType: !535, size: 64, align: 64, offset: 512)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!538, !9, !65}
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*_type,*void},bool}", file: !28, size: 192, align: 8, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !28, line: 5, baseType: !244, size: 128, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !28, line: 5, baseType: !18, size: 8, align: 8, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "SetBody", file: !28, line: 5, baseType: !543, size: 64, align: 64, offset: 576)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!10, !9, !491}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "SetHttpRequest", file: !28, line: 5, baseType: !547, size: 64, align: 64, offset: 640)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!10, !9, !164}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "SetUserData", file: !28, line: 5, baseType: !551, size: 64, align: 64, offset: 704)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!10, !9, !65, !244}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !28, line: 5, baseType: !90, size: 64, align: 64, offset: 768)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !28, line: 13, baseType: !133, size: 128, align: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstRouter", file: !24, line: 17, size: 128, align: 8, elements: !558)
!558 = !{!559}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Location", file: !24, line: 18, baseType: !31, size: 128, align: 64)
!560 = !DILocalVariable(name: "m", arg: 1, scope: !23, file: !24, line: 21, type: !556)
!561 = !DILocation(line: 21, column: 1, scope: !23)
!562 = !DILocalVariable(name: "req", arg: 2, scope: !23, file: !24, line: 21, type: !434)
!563 = !DILocation(line: 21, column: 29, scope: !23)
!564 = !DILocation(line: 22, column: 10, scope: !23)
!565 = !DILocation(line: 22, column: 2, scope: !23)
!566 = distinct !DISubprogram(name: "route.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !24, line: 2, type: !567, isLocal: false, isDefinition: true, scopeLine: 2, isOptimized: false, unit: !1, retainedNodes: !3)
!567 = !DISubroutineType(types: !568)
!568 = !{!10}
!569 = !DILocation(line: 1, column: 1, scope: !570)
!570 = !DILexicalBlockFile(scope: !566, file: !5, discriminator: 0)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "route"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "command-line-arguments"
	.ascii ";\n"
	.ascii "import "
	.ascii "location"
	.ascii " "
	.ascii "github.com/mailgun/vulcan/location"
	.ascii " \""
	.ascii "github.com/mailgun/vulcan/location"
	.ascii "\";\n"
	.ascii "import "
	.ascii "request"
	.ascii " "
	.ascii "github.com/mailgun/vulcan/request"
	.ascii " \""
	.ascii "github.com/mailgun/vulcan/request"
	.ascii "\";\n"
	.ascii "init"
	.ascii " "
	.ascii "bufio"
	.ascii " "
	.ascii "bufio..import"
	.ascii " "
	.ascii "bytes"
	.ascii " "
	.ascii "bytes..import"
	.ascii " "
	.ascii "flate"
	.ascii " "
	.ascii "compress_flate..import"
	.ascii " "
	.ascii "gzip"
	.ascii " "
	.ascii "compress_gzip..import"
	.ascii " "
	.ascii "context"
	.ascii " "
	.ascii "context..import"
	.ascii " "
	.ascii "crypto"
	.ascii " "
	.ascii "crypto..import"
	.ascii " "
	.ascii "cipher"
	.ascii " "
	.ascii "crypto_cipher..import"
	.ascii " "
	.ascii "des"
	.ascii " "
	.ascii "crypto_des..import"
	.ascii " "
	.ascii "dsa"
	.ascii " "
	.ascii "crypto_dsa..import"
	.ascii " "
	.ascii "ecdsa"
	.ascii " "
	.ascii "crypto_ecdsa..import"
	.ascii " "
	.ascii "elliptic"
	.ascii " "
	.ascii "crypto_elliptic..import"
	.ascii " "
	.ascii "md5"
	.ascii " "
	.ascii "crypto_md5..import"
	.ascii " "
	.ascii "rand"
	.ascii " "
	.ascii "crypto_rand..import"
	.ascii " "
	.ascii "rsa"
	.ascii " "
	.ascii "crypto_rsa..import"
	.ascii " "
	.ascii "sha1"
	.ascii " "
	.ascii "crypto_sha1..import"
	.ascii " "
	.ascii "sha256"
	.ascii " "
	.ascii "crypto_sha256..import"
	.ascii " "
	.ascii "sha512"
	.ascii " "
	.ascii "crypto_sha512..import"
	.ascii " "
	.ascii "tls"
	.ascii " "
	.ascii "crypto_tls..import"
	.ascii " "
	.ascii "x509"
	.ascii " "
	.ascii "crypto_x509..import"
	.ascii " "
	.ascii "pkix"
	.ascii " "
	.ascii "crypto_x509_pkix..import"
	.ascii " "
	.ascii "asn1"
	.ascii " "
	.ascii "encoding_asn1..import"
	.ascii " "
	.ascii "base64"
	.ascii " "
	.ascii "encoding_base64..import"
	.ascii " "
	.ascii "binary"
	.ascii " "
	.ascii "encoding_binary..import"
	.ascii " "
	.ascii "hex"
	.ascii " "
	.ascii "encoding_hex..import"
	.ascii " "
	.ascii "json"
	.ascii " "
	.ascii "encoding_json..import"
	.ascii " "
	.ascii "pem"
	.ascii " "
	.ascii "encoding_pem..import"
	.ascii " "
	.ascii "fmt"
	.ascii " "
	.ascii "fmt..import"
	.ascii " "
	.ascii "crc32"
	.ascii " "
	.ascii "hash_crc32..import"
	.ascii " "
	.ascii "poll"
	.ascii " "
	.ascii "internal_poll..import"
	.ascii " "
	.ascii "testlog"
	.ascii " "
	.ascii "internal_testlog..import"
	.ascii " "
	.ascii "io"
	.ascii " "
	.ascii "io..import"
	.ascii " "
	.ascii "ioutil"
