; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22template\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22io\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22io\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22io\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22ioutil\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22io/ioutil\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22io/ioutil\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22http\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22net/http\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22net/http\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22template\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22text/template\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22text/template\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3)
!2 = !DIFile(filename: "./template.go", directory: "/home/wangcong/go_path/src/github.com/vulcand/vulcan/template")
!3 = !{}
!4 = distinct !DISubprogram(name: "template.Apply", linkageName: "command_line_arguments.Apply", scope: null, file: !5, line: 22, type: !6, isLocal: false, isDefinition: true, scopeLine: 22, isOptimized: false, unit: !1, retainedNodes: !3)
!5 = !DIFile(filename: "template.go", directory: ".")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !81, !100, !107}
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !9, line: 1, size: 128, align: 8, elements: !10)
!9 = !DIFile(filename: "<built-in>", directory: "")
!10 = !{!11, !80}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !9, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !14, size: 128, align: 8, elements: !15)
!14 = !DIFile(filename: "", directory: "")
!15 = !{!16, !76}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 1, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !9, line: 1, size: 576, align: 8, elements: !19)
!19 = !{!20, !22, !23, !25, !27, !28, !29, !39, !48, !50, !57, !75}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !9, line: 1, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !9, line: 1, baseType: !21, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !9, line: 1, baseType: !24, size: 32, align: 32, offset: 128)
!24 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !9, line: 1, baseType: !26, size: 8, align: 8, offset: 160)
!26 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !9, line: 1, baseType: !26, size: 8, align: 8, offset: 168)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !9, line: 1, baseType: !26, size: 8, align: 8, offset: 176)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !9, line: 1, baseType: !30, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !9, line: 1, size: 64, align: 8, elements: !32)
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !9, line: 1, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{!21, !37, !21}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIBasicType(name: "void")
!39 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !9, line: 1, baseType: !40, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !9, line: 1, size: 64, align: 8, elements: !42)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !9, line: 1, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !37, !37}
!47 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !9, line: 1, baseType: !49, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !9, line: 1, baseType: !51, size: 64, align: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !9, line: 1, size: 128, align: 8, elements: !53)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !9, line: 1, baseType: !49, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !9, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !9, line: 1, baseType: !58, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !9, line: 1, size: 320, align: 8, elements: !60)
!60 = !{!61, !62, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !9, line: 1, baseType: !51, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !9, line: 1, baseType: !51, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !9, line: 1, baseType: !64, size: 192, align: 64, offset: 128)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !14, size: 192, align: 8, elements: !65)
!65 = !{!66, !73, !74}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !9, line: 1, size: 320, align: 8, elements: !69)
!69 = !{!61, !62, !70, !71, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !14, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !14, line: 1, baseType: !56, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !14, line: 1, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!52, !37}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !5, line: 6, size: 128, align: 8, elements: !82)
!82 = !{!83, !99}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 6, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !14, size: 128, align: 8, elements: !86)
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 6, baseType: !17, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !14, line: 6, baseType: !89, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!92, !37, !96}
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !14, size: 192, align: 8, elements: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !14, line: 6, baseType: !56, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !14, line: 6, baseType: !8, size: 128, align: 64, offset: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !14, size: 192, align: 8, elements: !97)
!97 = !{!98, !73, !74}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !49, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !5, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !5, line: 6, size: 128, align: 8, elements: !101)
!101 = !{!102, !99}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 6, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !14, size: 128, align: 8, elements: !105)
!105 = !{!87, !106}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !14, line: 6, baseType: !89, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !5, line: 8, size: 1984, align: 8, elements: !109)
!109 = !{!110, !111, !130, !131, !132, !133, !147, !159, !171, !173, !177, !178, !179, !180, !181, !187, !188, !189, !190, !380, !383, !396}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !5, line: 8, baseType: !52, size: 128, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !5, line: 8, baseType: !112, size: 64, align: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !5, line: 8, size: 1024, align: 8, elements: !114)
!114 = !{!115, !116, !117, !124, !125, !126, !127, !128, !129}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !5, line: 8, baseType: !52, size: 128, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !5, line: 8, baseType: !52, size: 128, align: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !5, line: 8, baseType: !118, size: 64, align: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !5, line: 8, size: 320, align: 8, elements: !120)
!120 = !{!121, !122, !123}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !5, line: 8, baseType: !52, size: 128, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !5, line: 8, baseType: !52, size: 128, align: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !5, line: 8, baseType: !47, size: 8, align: 8, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !5, line: 8, baseType: !52, size: 128, align: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !5, line: 8, baseType: !52, size: 128, align: 64, offset: 448)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !5, line: 8, baseType: !52, size: 128, align: 64, offset: 576)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !5, line: 8, baseType: !47, size: 8, align: 8, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !5, line: 8, baseType: !52, size: 128, align: 64, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !5, line: 8, baseType: !52, size: 128, align: 64, offset: 896)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Proto", file: !5, line: 8, baseType: !52, size: 128, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMajor", file: !5, line: 8, baseType: !56, size: 64, align: 64, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMinor", file: !5, line: 8, baseType: !56, size: 64, align: 64, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !5, line: 8, baseType: !134, size: 64, align: 64, offset: 448)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !9, line: 1, size: 384, align: 8, elements: !136)
!136 = !{!137, !138, !139, !140, !142, !143, !144, !145, !146}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !9, line: 1, baseType: !56, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !9, line: 1, baseType: !26, size: 8, align: 8, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !9, line: 1, baseType: !26, size: 8, align: 8, offset: 72)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !9, line: 1, baseType: !141, size: 16, align: 16, offset: 80)
!141 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !9, line: 1, baseType: !24, size: 32, align: 32, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !9, line: 1, baseType: !21, size: 64, align: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !9, line: 1, baseType: !37, size: 64, align: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !5, line: 8, baseType: !148, size: 128, align: 64, offset: 512)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !5, line: 6, size: 128, align: 8, elements: !149)
!149 = !{!150, !99}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 6, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !14, size: 192, align: 8, elements: !153)
!153 = !{!87, !154, !158}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !14, line: 6, baseType: !155, size: 64, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!8, !37}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !14, line: 6, baseType: !89, size: 64, align: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !5, line: 8, baseType: !160, size: 64, align: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !5, line: 8, size: 64, align: 8, elements: !162)
!162 = !{!163}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !5, line: 8, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!167}
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !14, size: 256, align: 8, elements: !168)
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 8, baseType: !148, size: 128, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 8, baseType: !8, size: 128, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !5, line: 8, baseType: !172, size: 64, align: 64, offset: 704)
!172 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !5, line: 8, baseType: !174, size: 192, align: 64, offset: 768)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !14, size: 192, align: 8, elements: !175)
!175 = !{!176, !73, !74}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !51, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !5, line: 8, baseType: !47, size: 8, align: 8, offset: 960)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !5, line: 8, baseType: !52, size: 128, align: 64, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Form", file: !5, line: 8, baseType: !134, size: 64, align: 64, offset: 1152)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "PostForm", file: !5, line: 8, baseType: !134, size: 64, align: 64, offset: 1216)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "MultipartForm", file: !5, line: 8, baseType: !182, size: 64, align: 64, offset: 1280)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", file: !5, line: 8, size: 128, align: 8, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !5, line: 8, baseType: !134, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !5, line: 8, baseType: !134, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !5, line: 8, baseType: !134, size: 64, align: 64, offset: 1344)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !5, line: 8, baseType: !52, size: 128, align: 64, offset: 1408)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "RequestURI", file: !5, line: 8, baseType: !52, size: 128, align: 64, offset: 1536)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !5, line: 8, baseType: !191, size: 64, align: 64, offset: 1664)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionState", file: !5, line: 8, size: 1344, align: 8, elements: !193)
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201, !368, !373, !378, !379}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !5, line: 8, baseType: !141, size: 16, align: 16)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "HandshakeComplete", file: !5, line: 8, baseType: !47, size: 8, align: 8, offset: 16)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "DidResume", file: !5, line: 8, baseType: !47, size: 8, align: 8, offset: 24)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuite", file: !5, line: 8, baseType: !141, size: 16, align: 16, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocol", file: !5, line: 8, baseType: !52, size: 128, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocolIsMutual", file: !5, line: 8, baseType: !47, size: 8, align: 8, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !5, line: 8, baseType: !52, size: 128, align: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "PeerCertificates", file: !5, line: 8, baseType: !202, size: 192, align: 64, offset: 384)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !14, size: 192, align: 8, elements: !203)
!203 = !{!204, !73, !74}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !5, line: 8, size: 10624, align: 8, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !217, !219, !223, !224, !237, !263, !264, !298, !299, !301, !311, !312, !317, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !342, !347, !348, !349, !350, !361, !362, !363, !364, !365, !366, !367}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !5, line: 8, baseType: !96, size: 192, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !5, line: 8, baseType: !96, size: 192, align: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !5, line: 8, baseType: !96, size: 192, align: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !5, line: 8, baseType: !96, size: 192, align: 64, offset: 576)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !5, line: 8, baseType: !96, size: 192, align: 64, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !5, line: 8, baseType: !96, size: 192, align: 64, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !5, line: 8, baseType: !216, size: 64, align: 64, offset: 1152)
!216 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !5, line: 8, baseType: !218, size: 64, align: 64, offset: 1216)
!218 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !5, line: 8, baseType: !220, size: 128, align: 64, offset: 1280)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !5, line: 8, size: 128, align: 8, elements: !221)
!221 = !{!222, !99}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !5, line: 1, baseType: !17, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !5, line: 8, baseType: !56, size: 64, align: 64, offset: 1408)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !5, line: 8, baseType: !225, size: 64, align: 64, offset: 1472)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !5, line: 8, size: 256, align: 8, elements: !227)
!227 = !{!228, !229}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !5, line: 8, baseType: !47, size: 8, align: 8)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !5, line: 8, baseType: !230, size: 192, align: 64, offset: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !5, line: 8, size: 192, align: 8, elements: !231)
!231 = !{!232, !235, !236}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !5, line: 1, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !5, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !5, line: 1, baseType: !56, size: 64, align: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !5, line: 8, baseType: !238, size: 1984, align: 64, offset: 1536)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !5, line: 8, size: 1984, align: 8, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !262}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !5, line: 8, baseType: !174, size: 192, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !5, line: 8, baseType: !174, size: 192, align: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !5, line: 8, baseType: !174, size: 192, align: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !5, line: 8, baseType: !174, size: 192, align: 64, offset: 576)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !5, line: 8, baseType: !174, size: 192, align: 64, offset: 768)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !5, line: 8, baseType: !174, size: 192, align: 64, offset: 960)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !5, line: 8, baseType: !174, size: 192, align: 64, offset: 1152)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !5, line: 8, baseType: !52, size: 128, align: 64, offset: 1344)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !5, line: 8, baseType: !52, size: 128, align: 64, offset: 1472)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !5, line: 8, baseType: !250, size: 192, align: 64, offset: 1600)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !14, size: 192, align: 8, elements: !251)
!251 = !{!252, !73, !74}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !5, line: 8, size: 320, align: 8, elements: !255)
!255 = !{!256, !261}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !5, line: 8, baseType: !257, size: 192, align: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !5, line: 8, size: 192, align: 8, elements: !258)
!258 = !{!259, !235, !236}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !5, line: 1, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !5, line: 8, baseType: !220, size: 128, align: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !5, line: 8, baseType: !250, size: 192, align: 64, offset: 1792)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !5, line: 8, baseType: !238, size: 1984, align: 64, offset: 3520)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !5, line: 8, baseType: !265, size: 192, align: 64, offset: 5504)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !5, line: 7, size: 192, align: 8, elements: !266)
!266 = !{!267, !269, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !5, line: 7, baseType: !268, size: 64, align: 64)
!268 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !5, line: 7, baseType: !172, size: 64, align: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !5, line: 7, baseType: !271, size: 64, align: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !5, line: 7, size: 704, align: 8, elements: !273)
!273 = !{!274, !275, !284, !295, !296, !297}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !5, line: 7, baseType: !52, size: 128, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !5, line: 7, baseType: !276, size: 192, align: 64, offset: 128)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !14, size: 192, align: 8, elements: !277)
!277 = !{!278, !73, !74}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !5, line: 7, size: 256, align: 8, elements: !281)
!281 = !{!274, !282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !5, line: 7, baseType: !56, size: 64, align: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !5, line: 7, baseType: !47, size: 8, align: 8, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !5, line: 7, baseType: !285, size: 192, align: 64, offset: 320)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !14, size: 192, align: 8, elements: !286)
!286 = !{!287, !73, !74}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !5, line: 7, size: 128, align: 8, elements: !290)
!290 = !{!291, !292, !293, !294}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !5, line: 7, baseType: !172, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !5, line: 7, baseType: !26, size: 8, align: 8, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !5, line: 7, baseType: !47, size: 8, align: 8, offset: 72)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !5, line: 7, baseType: !47, size: 8, align: 8, offset: 80)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !5, line: 7, baseType: !172, size: 64, align: 64, offset: 512)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !5, line: 7, baseType: !172, size: 64, align: 64, offset: 576)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !5, line: 7, baseType: !279, size: 64, align: 64, offset: 640)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !5, line: 8, baseType: !265, size: 192, align: 64, offset: 5696)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !5, line: 8, baseType: !300, size: 64, align: 64, offset: 5888)
!300 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !5, line: 8, baseType: !302, size: 192, align: 64, offset: 5952)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !14, size: 192, align: 8, elements: !303)
!303 = !{!304, !73, !74}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !5, line: 8, size: 448, align: 8, elements: !307)
!307 = !{!308, !309, !310}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !5, line: 8, baseType: !257, size: 192, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !5, line: 8, baseType: !47, size: 8, align: 8, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !5, line: 8, baseType: !96, size: 192, align: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !5, line: 8, baseType: !302, size: 192, align: 64, offset: 6144)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !5, line: 8, baseType: !313, size: 192, align: 64, offset: 6336)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !14, size: 192, align: 8, elements: !314)
!314 = !{!315, !73, !74}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !5, line: 8, baseType: !318, size: 192, align: 64, offset: 6528)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !14, size: 192, align: 8, elements: !319)
!319 = !{!320, !73, !74}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !5, line: 8, baseType: !313, size: 192, align: 64, offset: 6720)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !5, line: 8, baseType: !47, size: 8, align: 8, offset: 6912)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !5, line: 8, baseType: !47, size: 8, align: 8, offset: 6920)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !5, line: 8, baseType: !56, size: 64, align: 64, offset: 6976)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !5, line: 8, baseType: !47, size: 8, align: 8, offset: 7040)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !5, line: 8, baseType: !96, size: 192, align: 64, offset: 7104)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !5, line: 8, baseType: !96, size: 192, align: 64, offset: 7296)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !5, line: 8, baseType: !174, size: 192, align: 64, offset: 7488)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !5, line: 8, baseType: !174, size: 192, align: 64, offset: 7680)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !5, line: 8, baseType: !174, size: 192, align: 64, offset: 7872)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !5, line: 8, baseType: !174, size: 192, align: 64, offset: 8064)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !5, line: 8, baseType: !335, size: 192, align: 64, offset: 8256)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !14, size: 192, align: 8, elements: !336)
!336 = !{!337, !73, !74}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !5, line: 8, size: 192, align: 8, elements: !340)
!340 = !{!341, !235, !236}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !5, line: 1, baseType: !49, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !5, line: 8, baseType: !343, size: 192, align: 64, offset: 8448)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !14, size: 192, align: 8, elements: !344)
!344 = !{!345, !73, !74}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !5, line: 8, baseType: !47, size: 8, align: 8, offset: 8640)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !5, line: 8, baseType: !174, size: 192, align: 64, offset: 8704)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !5, line: 8, baseType: !174, size: 192, align: 64, offset: 8896)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !5, line: 8, baseType: !351, size: 192, align: 64, offset: 9088)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !14, size: 192, align: 8, elements: !352)
!352 = !{!353, !73, !74}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !5, line: 8, size: 384, align: 8, elements: !357)
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !5, line: 8, baseType: !339, size: 192, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !5, line: 8, baseType: !360, size: 192, align: 64, offset: 192)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !5, line: 8, size: 192, align: 8, elements: !340)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !5, line: 8, baseType: !351, size: 192, align: 64, offset: 9280)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !5, line: 8, baseType: !174, size: 192, align: 64, offset: 9472)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !5, line: 8, baseType: !174, size: 192, align: 64, offset: 9664)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !5, line: 8, baseType: !174, size: 192, align: 64, offset: 9856)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !5, line: 8, baseType: !174, size: 192, align: 64, offset: 10048)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !5, line: 8, baseType: !174, size: 192, align: 64, offset: 10240)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !5, line: 8, baseType: !313, size: 192, align: 64, offset: 10432)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "VerifiedChains", file: !5, line: 8, baseType: !369, size: 192, align: 64, offset: 576)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !14, size: 192, align: 8, elements: !370)
!370 = !{!371, !73, !74}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !5, line: 8, baseType: !374, size: 192, align: 64, offset: 768)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !14, size: 192, align: 8, elements: !375)
!375 = !{!376, !73, !74}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPResponse", file: !5, line: 8, baseType: !96, size: 192, align: 64, offset: 960)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "TLSUnique", file: !5, line: 8, baseType: !96, size: 192, align: 64, offset: 1152)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", file: !5, line: 8, baseType: !381, size: 64, align: 64, offset: 1728)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !9, line: 1, align: 8, elements: !3)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !5, line: 8, baseType: !384, size: 64, align: 64, offset: 1792)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !5, line: 8, size: 1152, align: 8, elements: !386)
!386 = !{!387, !388, !130, !131, !132, !133, !147, !389, !390, !391, !392, !393, !394, !395}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !5, line: 8, baseType: !52, size: 128, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "StatusCode", file: !5, line: 8, baseType: !56, size: 64, align: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !5, line: 8, baseType: !172, size: 64, align: 64, offset: 640)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !5, line: 8, baseType: !174, size: 192, align: 64, offset: 704)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !5, line: 8, baseType: !47, size: 8, align: 8, offset: 896)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Uncompressed", file: !5, line: 8, baseType: !47, size: 8, align: 8, offset: 904)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !5, line: 8, baseType: !134, size: 64, align: 64, offset: 960)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Request", file: !5, line: 8, baseType: !37, size: 64, align: 64, offset: 1024)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !5, line: 8, baseType: !191, size: 64, align: 64, offset: 1088)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !5, line: 8, baseType: !397, size: 128, align: 64, offset: 1856)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !5, line: 8, size: 128, align: 8, elements: !398)
!398 = !{!399, !99}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 8, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,PrivateKey)PrivateKey}", file: !14, size: 320, align: 8, elements: !402)
!402 = !{!403, !404, !412, !416, !417}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 8, baseType: !17, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !14, line: 8, baseType: !405, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!408, !37}
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !14, size: 256, align: 8, elements: !409)
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !14, line: 8, baseType: !265, size: 192, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !14, line: 8, baseType: !47, size: 8, align: 8, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !14, line: 8, baseType: !413, size: 64, align: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!381, !37}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !14, line: 8, baseType: !155, size: 64, align: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !14, line: 8, baseType: !418, size: 64, align: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!220, !37, !220}
!421 = !DILocalVariable(name: "in", arg: 1, scope: !4, file: !5, line: 22, type: !81)
!422 = !DILocation(line: 22, column: 12, scope: !4)
!423 = !DILocalVariable(name: "out", arg: 2, scope: !4, file: !5, line: 22, type: !100)
!424 = !DILocation(line: 22, column: 26, scope: !4)
!425 = !DILocalVariable(name: "request", arg: 3, scope: !4, file: !5, line: 22, type: !107)
!426 = !DILocation(line: 22, column: 41, scope: !4)
!427 = !DILocation(line: 23, column: 22, scope: !428)
!428 = distinct !DILexicalBlock(scope: !4, file: !5, line: 22, column: 1)
!429 = !DILocalVariable(name: "err", scope: !428, file: !5, line: 23, type: !8)
!430 = !DILocation(line: 23, column: 2, scope: !4)
!431 = !DILocation(line: 24, column: 9, scope: !428)
!432 = !DILocation(line: 25, column: 3, scope: !428)
!433 = !DILocalVariable(name: "$ret0", scope: !4, file: !5, line: 22, type: !8)
!434 = !DILocation(line: 22, column: 64, scope: !4)
!435 = !DILocation(line: 28, column: 21, scope: !428)
!436 = !DILocation(line: 28, column: 9, scope: !428)
!437 = !DILocation(line: 28, column: 2, scope: !428)
!438 = distinct !DISubprogram(name: "template.ApplyString", linkageName: "command_line_arguments.ApplyString", scope: null, file: !5, line: 35, type: !439, isLocal: false, isDefinition: true, scopeLine: 35, isOptimized: false, unit: !1, retainedNodes: !3)
!439 = !DISubroutineType(types: !440)
!440 = !{!8, !52, !100, !107}
!441 = !DILocalVariable(name: "in", arg: 1, scope: !438, file: !5, line: 35, type: !52)
!442 = !DILocation(line: 35, column: 18, scope: !438)
!443 = !DILocalVariable(name: "out", arg: 2, scope: !438, file: !5, line: 35, type: !100)
!444 = !DILocation(line: 35, column: 29, scope: !438)
!445 = !DILocalVariable(name: "request", arg: 3, scope: !438, file: !5, line: 35, type: !107)
!446 = !DILocation(line: 35, column: 44, scope: !438)
!447 = !DILocation(line: 36, column: 21, scope: !448)
!448 = distinct !DILexicalBlock(scope: !438, file: !5, line: 35, column: 1)
!449 = !DILocation(line: 36, column: 29, scope: !448)
!450 = !DILocalVariable(name: "err", scope: !448, file: !5, line: 36, type: !8)
!451 = !DILocation(line: 36, column: 2, scope: !438)
!452 = !DILocation(line: 37, column: 9, scope: !448)
!453 = !DILocalVariable(name: "$ret1", scope: !438, file: !5, line: 35, type: !8)
!454 = !DILocation(line: 35, column: 67, scope: !438)
!455 = !DILocation(line: 38, column: 3, scope: !448)
!456 = !DILocalVariable(name: "t", scope: !448, file: !5, line: 36, type: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "Template", file: !5, line: 9, size: 512, align: 8, elements: !459)
!459 = !{!460, !461, !538, !516, !517}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !5, line: 9, baseType: !52, size: 128, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Tree", file: !5, line: 9, baseType: !462, size: 64, align: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tree", file: !5, line: 9, size: 1984, align: 8, elements: !464)
!464 = !{!465, !466, !467, !505, !506, !511, !524, !535, !536, !537}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !5, line: 9, baseType: !52, size: 128, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ParseName", file: !5, line: 9, baseType: !52, size: 128, align: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Root", file: !5, line: 9, baseType: !468, size: 64, align: 64, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "ListNode", file: !5, line: 9, size: 384, align: 8, elements: !470)
!470 = !{!471, !473, !475, !476}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "NodeType", file: !5, line: 9, baseType: !472, size: 64, align: 64)
!472 = !DIBasicType(name: "NodeType", size: 64, encoding: DW_ATE_signed)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Pos", file: !5, line: 9, baseType: !474, size: 64, align: 64, offset: 64)
!474 = !DIBasicType(name: "Pos", size: 64, encoding: DW_ATE_signed)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tr", file: !5, line: 9, baseType: !37, size: 64, align: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "Nodes", file: !5, line: 9, baseType: !477, size: 192, align: 64, offset: 192)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Node,int,int}", file: !14, size: 192, align: 8, elements: !478)
!478 = !{!479, !73, !74}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !480, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !5, line: 9, size: 128, align: 8, elements: !482)
!482 = !{!483, !99}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !5, line: 9, baseType: !484, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Node,*func(*void)Pos,*func(*void)string,*func(*void)NodeType,*func(*void)*Tree}", file: !14, size: 384, align: 8, elements: !486)
!486 = !{!487, !488, !492, !496, !497, !501}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 9, baseType: !17, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "Copy", file: !14, line: 9, baseType: !489, size: 64, align: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!481, !37}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Position", file: !14, line: 9, baseType: !493, size: 64, align: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!474, !37}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !14, line: 9, baseType: !77, size: 64, align: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !14, line: 9, baseType: !498, size: 64, align: 64, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!472, !37}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tree", file: !14, line: 9, baseType: !502, size: 64, align: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!37, !37}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "text", file: !5, line: 9, baseType: !52, size: 128, align: 64, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", file: !5, line: 9, baseType: !507, size: 192, align: 64, offset: 448)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*FuncMap,int,int}", file: !14, size: 192, align: 8, elements: !508)
!508 = !{!509, !73, !74}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "lex", file: !5, line: 9, baseType: !512, size: 64, align: 64, offset: 640)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: ".text/template/parse.lexer", file: !5, line: 9, size: 896, align: 8, elements: !514)
!514 = !{!460, !515, !516, !517, !518, !519, !520, !521, !522, !523}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "input", file: !5, line: 9, baseType: !52, size: 128, align: 64, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "leftDelim", file: !5, line: 9, baseType: !52, size: 128, align: 64, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rightDelim", file: !5, line: 9, baseType: !52, size: 128, align: 64, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pos", file: !5, line: 9, baseType: !474, size: 64, align: 64, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "start", file: !5, line: 9, baseType: !474, size: 64, align: 64, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "width", file: !5, line: 9, baseType: !474, size: 64, align: 64, offset: 640)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "items", file: !5, line: 9, baseType: !381, size: 64, align: 64, offset: 704)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "parenDepth", file: !5, line: 9, baseType: !56, size: 64, align: 64, offset: 768)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "line", file: !5, line: 9, baseType: !56, size: 64, align: 64, offset: 832)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "token", file: !5, line: 9, baseType: !525, size: 960, align: 64, offset: 704)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 960, align: 8, elements: !533)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: ".text/template/parse.item", file: !5, line: 9, size: 320, align: 8, elements: !527)
!527 = !{!528, !530, !531, !532}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !5, line: 9, baseType: !529, size: 64, align: 64)
!529 = !DIBasicType(name: ".text/template/parse.itemType", size: 64, encoding: DW_ATE_signed)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pos", file: !5, line: 9, baseType: !474, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "val", file: !5, line: 9, baseType: !52, size: 128, align: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "line", file: !5, line: 9, baseType: !56, size: 64, align: 64, offset: 256)
!533 = !{!534}
!534 = !DISubrange(count: 3)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "peekCount", file: !5, line: 9, baseType: !56, size: 64, align: 64, offset: 1664)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "vars", file: !5, line: 9, baseType: !174, size: 192, align: 64, offset: 1728)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "treeSet", file: !5, line: 9, baseType: !134, size: 64, align: 64, offset: 1920)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "common", file: !5, line: 9, baseType: !539, size: 64, align: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: ".text/template.common", file: !5, line: 9, size: 448, align: 8, elements: !541)
!541 = !{!542, !543, !548, !561, !562}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "tmpl", file: !5, line: 9, baseType: !134, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "option", file: !5, line: 9, baseType: !544, size: 64, align: 64, offset: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: ".text/template.option", file: !5, line: 9, size: 64, align: 8, elements: !545)
!545 = !{!546}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "missingKey", file: !5, line: 9, baseType: !547, size: 64, align: 64)
!547 = !DIBasicType(name: ".text/template.missingKeyAction", size: 64, encoding: DW_ATE_signed)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "muFuncs", file: !5, line: 9, baseType: !549, size: 192, align: 32, offset: 128)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !5, line: 8, size: 192, align: 8, elements: !550)
!550 = !{!551, !557, !558, !559, !560}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !5, line: 8, baseType: !552, size: 64, align: 32)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !5, line: 6, size: 64, align: 8, elements: !553)
!553 = !{!554, !556}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !5, line: 6, baseType: !555, size: 32, align: 32)
!555 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !5, line: 6, baseType: !24, size: 32, align: 32, offset: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !5, line: 8, baseType: !24, size: 32, align: 32, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !5, line: 8, baseType: !24, size: 32, align: 32, offset: 96)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !5, line: 8, baseType: !555, size: 32, align: 32, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !5, line: 8, baseType: !555, size: 32, align: 32, offset: 160)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "parseFuncs", file: !5, line: 9, baseType: !134, size: 64, align: 64, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "execFuncs", file: !5, line: 9, baseType: !134, size: 64, align: 64, offset: 384)
!563 = !DILocation(line: 41, column: 26, scope: !448)
!564 = !DILocation(line: 41, column: 12, scope: !448)
!565 = !DILocation(line: 41, column: 46, scope: !448)
!566 = !DILocation(line: 42, column: 3, scope: !448)
!567 = distinct !DISubprogram(name: "template.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !5, line: 3, type: !568, isLocal: false, isDefinition: true, scopeLine: 3, isOptimized: false, unit: !1, retainedNodes: !3)
!568 = !DISubroutineType(types: !569)
!569 = !{!38}
!570 = !DILocation(line: 1, column: 1, scope: !571)
!571 = !DILexicalBlockFile(scope: !567, file: !9, discriminator: 0)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "template"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "command-line-arguments"
	.ascii ";\n"
	.ascii "import "
	.ascii "io"
	.ascii " "
	.ascii "io"
	.ascii " \""
	.ascii "io"
	.ascii "\";\n"
	.ascii "import "
	.ascii "ioutil"
	.ascii " "
	.ascii "io/ioutil"
	.ascii " \""
	.ascii "io/ioutil"
	.ascii "\";\n"
	.ascii "import "
	.ascii "http"
	.ascii " "
	.ascii "net/http"
	.ascii " \""
	.ascii "net/http"
	.ascii "\";\n"
	.ascii "import "
	.ascii "template"
	.ascii " "
	.ascii "text/template"
	.ascii " \""
	.ascii "text/template"
	.ascii "\";\n"
	.ascii "init"
	.ascii " "
	.ascii "bufio"
	.ascii " "
	.ascii "bufio..import"
	.ascii " "
	.ascii "bytes"
	.ascii " "
	.ascii "bytes..import"
	.ascii " "
	.ascii "flate"
	.ascii " "
	.ascii "compress_flate..import"
	.ascii " "
	.ascii "gzip"
	.ascii " "
	.ascii "compress_gzip..import"
	.ascii " "
	.ascii "context"
	.ascii " "
	.ascii "context..import"
	.ascii " "
	.ascii "crypto"
	.ascii " "
	.ascii "crypto..import"
	.ascii " "
	.ascii "cipher"
	.ascii " "
	.ascii "crypto_cipher..import"
	.ascii " "
	.ascii "des"
	.ascii " "
	.ascii "crypto_des..import"
	.ascii " "
	.ascii "dsa"
	.ascii " "
	.ascii "crypto_dsa..import"
	.ascii " "
	.ascii "ecdsa"
	.ascii " "
	.ascii "crypto_ecdsa..import"
	.ascii " "
	.ascii "elliptic"
	.ascii " "
	.ascii "crypto_elliptic..import"
	.ascii " "
	.ascii "md5"
	.ascii " "
	.ascii "crypto_md5..import"
	.ascii " "
	.ascii "rand"
	.ascii " "
	.ascii "crypto_rand..import"
	.ascii " "
	.ascii "rsa"
	.ascii " "
	.ascii "crypto_rsa..import"
	.ascii " "
	.ascii "sha1"
	.ascii " "
	.ascii "crypto_sha1..import"
	.ascii " "
	.ascii "sha256"
	.ascii " "
	.ascii "crypto_sha256..import"
	.ascii " "
	.ascii "sha512"
	.ascii " "
	.ascii "crypto_sha512..import"
	.ascii " "
	.ascii "tls"
	.ascii " "
	.ascii "crypto_tls..import"
	.ascii " "
	.ascii "x509"
	.ascii " "
	.ascii "crypto_x509..import"
	.ascii " "
	.ascii "pkix"
	.ascii " "
	.ascii "crypto_x509_pkix..import"
	.ascii " "
	.ascii "asn1"
	.ascii " "
	.ascii "encoding_asn1..import"
	.ascii " "
	.ascii "base64"
	.ascii " "
	.ascii "encoding_base64..import"
	.ascii " "
	.ascii "binary"
	.ascii " "
	.ascii "encoding_binary..import"
	.ascii " "
	.ascii "hex"
	.ascii " "
	.ascii "encoding_hex..import"
	.ascii " "
	.ascii "pem"
	.ascii " "
	.ascii "encoding_pem..import"
	.ascii " "
	.ascii "fmt"
	.ascii " "
	.ascii "fmt..import"
	.ascii " "
	.ascii "crc32"
	.ascii " "
	.ascii "hash_crc32..import"
	.ascii " "
	.ascii "poll"
	.ascii " "
	.ascii "internal_poll..import"
	.ascii " "
	.ascii "testlog"
	.ascii " "
	.ascii "internal_testlog..import"
	.ascii " "
	.ascii "io"
	.ascii " "
	.ascii "io..import"
	.ascii " "
	.ascii "ioutil"
	.ascii " "
	.ascii "io_ioutil..import"
	.ascii " "
	.ascii "log"
	.ascii " "
	.ascii "log..import"
	.ascii " "
	.ascii "big"
	.ascii " "
	.ascii "math_big..import"
	.ascii " "
	.ascii "rand"
	.ascii " "
	.ascii "math_rand..import"
	.ascii " "
	.ascii "mime"
	.ascii " "
	.ascii "mime..import"
	.ascii " "
	.ascii "multipart"
	.ascii " "
	.ascii "mime_multipart..import"
	.ascii " "
	.ascii "quotedprintable"
	.ascii " "
	.ascii "mime_quotedprintable..import"
