; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22testutils\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22tls\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22crypto/tls\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22crypto/tls\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22netutils\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/mailgun/vulcan/netutils\22"
module asm "\09.ascii \22 \5C\22\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./requests.go", directory: "/home/wangcong/go_path/src/github.com/vulcand/vulcan/testutils")
!3 = !{}
!4 = !{!5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !7, line: 1, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "<built-in>", directory: "")
!8 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DISubprogram(name: "testutils.MakeRequest", linkageName: "command_line_arguments.MakeRequest", scope: null, file: !10, line: 21, type: !11, isLocal: false, isDefinition: true, scopeLine: 21, isOptimized: false, unit: !1, retainedNodes: !3)
!10 = !DIFile(filename: "requests.go", directory: ".")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !21, !415}
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Response,struct{*uint8,int,int},error}", file: !14, size: 384, align: 8, elements: !15)
!14 = !DIFile(filename: "", directory: "")
!15 = !{!16, !413, !414}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 21, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !10, line: 7, size: 1152, align: 8, elements: !19)
!19 = !{!20, !28, !29, !30, !31, !32, !49, !133, !135, !139, !140, !141, !142, !412}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !10, line: 7, baseType: !21, size: 128, align: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !7, line: 1, size: 128, align: 8, elements: !22)
!22 = !{!23, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !7, line: 1, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !7, line: 1, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "StatusCode", file: !10, line: 7, baseType: !27, size: 64, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "Proto", file: !10, line: 7, baseType: !21, size: 128, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMajor", file: !10, line: 7, baseType: !27, size: 64, align: 64, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMinor", file: !10, line: 7, baseType: !27, size: 64, align: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !10, line: 7, baseType: !33, size: 64, align: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !7, line: 1, size: 384, align: 8, elements: !35)
!35 = !{!36, !37, !38, !39, !41, !42, !45, !46, !48}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !7, line: 1, baseType: !27, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !7, line: 1, baseType: !25, size: 8, align: 8, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !7, line: 1, baseType: !25, size: 8, align: 8, offset: 72)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !7, line: 1, baseType: !40, size: 16, align: 16, offset: 80)
!40 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !7, line: 1, baseType: !43, size: 64, align: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "void")
!45 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !7, line: 1, baseType: !43, size: 64, align: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !7, line: 1, baseType: !47, size: 64, align: 64, offset: 256)
!47 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !7, line: 1, baseType: !43, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !10, line: 7, baseType: !50, size: 128, align: 64, offset: 512)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !10, line: 6, size: 128, align: 8, elements: !51)
!51 = !{!52, !132}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 6, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !14, size: 192, align: 8, elements: !55)
!55 = !{!56, !105, !121}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 6, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !7, line: 1, size: 576, align: 8, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !65, !66, !74, !83, !84, !86, !104}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !7, line: 1, baseType: !47, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !7, line: 1, baseType: !47, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !7, line: 1, baseType: !8, size: 32, align: 32, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !7, line: 1, baseType: !25, size: 8, align: 8, offset: 160)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !7, line: 1, baseType: !25, size: 8, align: 8, offset: 168)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !7, line: 1, baseType: !25, size: 8, align: 8, offset: 176)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !7, line: 1, baseType: !67, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !69)
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!47, !43, !47}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !7, line: 1, baseType: !75, size: 64, align: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 1, size: 64, align: 8, elements: !77)
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 1, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!82, !43, !43}
!82 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !7, line: 1, baseType: !24, size: 64, align: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !7, line: 1, baseType: !85, size: 64, align: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !7, line: 1, baseType: !87, size: 64, align: 64, offset: 448)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !7, line: 1, size: 320, align: 8, elements: !89)
!89 = !{!90, !91, !92}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 1, baseType: !85, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !7, line: 1, baseType: !85, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !7, line: 1, baseType: !93, size: 192, align: 64, offset: 128)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !14, size: 192, align: 8, elements: !94)
!94 = !{!95, !102, !103}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !7, line: 1, size: 320, align: 8, elements: !98)
!98 = !{!90, !91, !99, !100, !101}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !7, line: 1, baseType: !43, size: 64, align: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 1, baseType: !43, size: 64, align: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !7, line: 1, baseType: !43, size: 64, align: 64, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !14, line: 1, baseType: !27, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !14, line: 1, baseType: !27, size: 64, align: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !7, line: 1, baseType: !43, size: 64, align: 64, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !14, line: 6, baseType: !106, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!109, !43}
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !7, line: 1, size: 128, align: 8, elements: !110)
!110 = !{!111, !120}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 1, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !14, size: 128, align: 8, elements: !114)
!114 = !{!115, !116}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 1, baseType: !57, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !14, line: 1, baseType: !117, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!21, !43}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !14, line: 6, baseType: !122, size: 64, align: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!125, !43, !129}
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !14, size: 192, align: 8, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !14, line: 4, baseType: !27, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !14, line: 4, baseType: !109, size: 128, align: 64, offset: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !14, size: 192, align: 8, elements: !130)
!130 = !{!131, !102, !103}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !24, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !10, line: 7, baseType: !134, size: 64, align: 64, offset: 640)
!134 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !10, line: 7, baseType: !136, size: 192, align: 64, offset: 704)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !14, size: 192, align: 8, elements: !137)
!137 = !{!138, !102, !103}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !85, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !10, line: 7, baseType: !82, size: 8, align: 8, offset: 896)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Uncompressed", file: !10, line: 7, baseType: !82, size: 8, align: 8, offset: 904)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !10, line: 7, baseType: !33, size: 64, align: 64, offset: 960)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Request", file: !10, line: 7, baseType: !143, size: 64, align: 64, offset: 1024)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !10, line: 7, size: 1984, align: 8, elements: !145)
!145 = !{!146, !147, !29, !30, !31, !32, !49, !166, !178, !179, !180, !181, !182, !183, !184, !190, !191, !192, !193, !383, !386, !387}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !10, line: 7, baseType: !21, size: 128, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !10, line: 7, baseType: !148, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !10, line: 4, size: 1024, align: 8, elements: !150)
!150 = !{!151, !152, !153, !160, !161, !162, !163, !164, !165}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !10, line: 4, baseType: !21, size: 128, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !10, line: 4, baseType: !21, size: 128, align: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !10, line: 4, baseType: !154, size: 64, align: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !10, line: 4, size: 320, align: 8, elements: !156)
!156 = !{!157, !158, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !10, line: 4, baseType: !21, size: 128, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !10, line: 4, baseType: !21, size: 128, align: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !10, line: 4, baseType: !82, size: 8, align: 8, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !10, line: 4, baseType: !21, size: 128, align: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !10, line: 4, baseType: !21, size: 128, align: 64, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !10, line: 4, baseType: !21, size: 128, align: 64, offset: 576)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !10, line: 4, baseType: !82, size: 8, align: 8, offset: 704)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !10, line: 4, baseType: !21, size: 128, align: 64, offset: 768)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !10, line: 4, baseType: !21, size: 128, align: 64, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !10, line: 7, baseType: !167, size: 64, align: 64, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 7, size: 64, align: 8, elements: !169)
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 7, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!174}
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !14, size: 256, align: 8, elements: !175)
!175 = !{!176, !177}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 7, baseType: !50, size: 128, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 7, baseType: !109, size: 128, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !10, line: 7, baseType: !134, size: 64, align: 64, offset: 704)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !10, line: 7, baseType: !136, size: 192, align: 64, offset: 768)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !10, line: 7, baseType: !82, size: 8, align: 8, offset: 960)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !10, line: 7, baseType: !21, size: 128, align: 64, offset: 1024)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Form", file: !10, line: 7, baseType: !33, size: 64, align: 64, offset: 1152)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "PostForm", file: !10, line: 7, baseType: !33, size: 64, align: 64, offset: 1216)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "MultipartForm", file: !10, line: 7, baseType: !185, size: 64, align: 64, offset: 1280)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", file: !10, line: 7, size: 128, align: 8, elements: !187)
!187 = !{!188, !189}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !10, line: 7, baseType: !33, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !10, line: 7, baseType: !33, size: 64, align: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !10, line: 7, baseType: !33, size: 64, align: 64, offset: 1344)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !10, line: 7, baseType: !21, size: 128, align: 64, offset: 1408)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "RequestURI", file: !10, line: 7, baseType: !21, size: 128, align: 64, offset: 1536)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !10, line: 7, baseType: !194, size: 64, align: 64, offset: 1664)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionState", file: !10, line: 4, size: 1344, align: 8, elements: !196)
!196 = !{!197, !198, !199, !200, !201, !202, !203, !204, !371, !376, !381, !382}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !10, line: 4, baseType: !40, size: 16, align: 16)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "HandshakeComplete", file: !10, line: 4, baseType: !82, size: 8, align: 8, offset: 16)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "DidResume", file: !10, line: 4, baseType: !82, size: 8, align: 8, offset: 24)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuite", file: !10, line: 4, baseType: !40, size: 16, align: 16, offset: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocol", file: !10, line: 4, baseType: !21, size: 128, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocolIsMutual", file: !10, line: 4, baseType: !82, size: 8, align: 8, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !10, line: 4, baseType: !21, size: 128, align: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "PeerCertificates", file: !10, line: 4, baseType: !205, size: 192, align: 64, offset: 384)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !14, size: 192, align: 8, elements: !206)
!206 = !{!207, !102, !103}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !10, line: 4, size: 10624, align: 8, elements: !211)
!211 = !{!212, !213, !214, !215, !216, !217, !218, !220, !222, !226, !227, !240, !266, !267, !301, !302, !304, !314, !315, !320, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !345, !350, !351, !352, !353, !364, !365, !366, !367, !368, !369, !370}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !10, line: 4, baseType: !129, size: 192, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !10, line: 4, baseType: !129, size: 192, align: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !10, line: 4, baseType: !129, size: 192, align: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !10, line: 4, baseType: !129, size: 192, align: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !10, line: 4, baseType: !129, size: 192, align: 64, offset: 768)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !10, line: 4, baseType: !129, size: 192, align: 64, offset: 960)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !10, line: 4, baseType: !219, size: 64, align: 64, offset: 1152)
!219 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !10, line: 4, baseType: !221, size: 64, align: 64, offset: 1216)
!221 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !10, line: 4, baseType: !223, size: 128, align: 64, offset: 1280)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !10, line: 4, size: 128, align: 8, elements: !224)
!224 = !{!225, !132}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !10, line: 1, baseType: !57, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !10, line: 4, baseType: !27, size: 64, align: 64, offset: 1408)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !10, line: 4, baseType: !228, size: 64, align: 64, offset: 1472)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !10, line: 4, size: 256, align: 8, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !10, line: 4, baseType: !82, size: 8, align: 8)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !10, line: 4, baseType: !233, size: 192, align: 64, offset: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !10, line: 4, size: 192, align: 8, elements: !234)
!234 = !{!235, !238, !239}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !10, line: 1, baseType: !27, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !10, line: 1, baseType: !27, size: 64, align: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !10, line: 4, baseType: !241, size: 1984, align: 64, offset: 1536)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !10, line: 4, size: 1984, align: 8, elements: !242)
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !265}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !10, line: 4, baseType: !136, size: 192, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !10, line: 4, baseType: !136, size: 192, align: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !10, line: 4, baseType: !136, size: 192, align: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !10, line: 4, baseType: !136, size: 192, align: 64, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !10, line: 4, baseType: !136, size: 192, align: 64, offset: 768)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !10, line: 4, baseType: !136, size: 192, align: 64, offset: 960)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !10, line: 4, baseType: !136, size: 192, align: 64, offset: 1152)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !10, line: 4, baseType: !21, size: 128, align: 64, offset: 1344)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !10, line: 4, baseType: !21, size: 128, align: 64, offset: 1472)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !10, line: 4, baseType: !253, size: 192, align: 64, offset: 1600)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !14, size: 192, align: 8, elements: !254)
!254 = !{!255, !102, !103}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !10, line: 4, size: 320, align: 8, elements: !258)
!258 = !{!259, !264}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !10, line: 4, baseType: !260, size: 192, align: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !10, line: 4, size: 192, align: 8, elements: !261)
!261 = !{!262, !238, !239}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !10, line: 4, baseType: !223, size: 128, align: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !10, line: 4, baseType: !253, size: 192, align: 64, offset: 1792)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !10, line: 4, baseType: !241, size: 1984, align: 64, offset: 3520)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !10, line: 4, baseType: !268, size: 192, align: 64, offset: 5504)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !10, line: 4, size: 192, align: 8, elements: !269)
!269 = !{!270, !272, !273}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !10, line: 4, baseType: !271, size: 64, align: 64)
!271 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !10, line: 4, baseType: !134, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !10, line: 4, baseType: !274, size: 64, align: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !10, line: 4, size: 704, align: 8, elements: !276)
!276 = !{!277, !278, !287, !298, !299, !300}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !10, line: 4, baseType: !21, size: 128, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !10, line: 4, baseType: !279, size: 192, align: 64, offset: 128)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !14, size: 192, align: 8, elements: !280)
!280 = !{!281, !102, !103}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !10, line: 4, size: 256, align: 8, elements: !284)
!284 = !{!277, !285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !10, line: 4, baseType: !27, size: 64, align: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !10, line: 4, baseType: !82, size: 8, align: 8, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !10, line: 4, baseType: !288, size: 192, align: 64, offset: 320)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !14, size: 192, align: 8, elements: !289)
!289 = !{!290, !102, !103}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !10, line: 4, size: 128, align: 8, elements: !293)
!293 = !{!294, !295, !296, !297}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !10, line: 4, baseType: !134, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !10, line: 4, baseType: !25, size: 8, align: 8, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !10, line: 4, baseType: !82, size: 8, align: 8, offset: 72)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !10, line: 4, baseType: !82, size: 8, align: 8, offset: 80)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !10, line: 4, baseType: !134, size: 64, align: 64, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !10, line: 4, baseType: !134, size: 64, align: 64, offset: 576)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !10, line: 4, baseType: !282, size: 64, align: 64, offset: 640)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !10, line: 4, baseType: !268, size: 192, align: 64, offset: 5696)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !10, line: 4, baseType: !303, size: 64, align: 64, offset: 5888)
!303 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !10, line: 4, baseType: !305, size: 192, align: 64, offset: 5952)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !14, size: 192, align: 8, elements: !306)
!306 = !{!307, !102, !103}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !10, line: 4, size: 448, align: 8, elements: !310)
!310 = !{!311, !312, !313}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !10, line: 4, baseType: !260, size: 192, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !10, line: 4, baseType: !82, size: 8, align: 8, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !10, line: 4, baseType: !129, size: 192, align: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !10, line: 4, baseType: !305, size: 192, align: 64, offset: 6144)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !10, line: 4, baseType: !316, size: 192, align: 64, offset: 6336)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !14, size: 192, align: 8, elements: !317)
!317 = !{!318, !102, !103}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !10, line: 4, baseType: !321, size: 192, align: 64, offset: 6528)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !14, size: 192, align: 8, elements: !322)
!322 = !{!323, !102, !103}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !10, line: 4, baseType: !316, size: 192, align: 64, offset: 6720)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !10, line: 4, baseType: !82, size: 8, align: 8, offset: 6912)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !10, line: 4, baseType: !82, size: 8, align: 8, offset: 6920)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !10, line: 4, baseType: !27, size: 64, align: 64, offset: 6976)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !10, line: 4, baseType: !82, size: 8, align: 8, offset: 7040)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !10, line: 4, baseType: !129, size: 192, align: 64, offset: 7104)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !10, line: 4, baseType: !129, size: 192, align: 64, offset: 7296)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !10, line: 4, baseType: !136, size: 192, align: 64, offset: 7488)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !10, line: 4, baseType: !136, size: 192, align: 64, offset: 7680)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !10, line: 4, baseType: !136, size: 192, align: 64, offset: 7872)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !10, line: 4, baseType: !136, size: 192, align: 64, offset: 8064)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !10, line: 4, baseType: !338, size: 192, align: 64, offset: 8256)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !14, size: 192, align: 8, elements: !339)
!339 = !{!340, !102, !103}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !10, line: 4, size: 192, align: 8, elements: !343)
!343 = !{!344, !238, !239}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !10, line: 1, baseType: !24, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !10, line: 4, baseType: !346, size: 192, align: 64, offset: 8448)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !14, size: 192, align: 8, elements: !347)
!347 = !{!348, !102, !103}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !10, line: 4, baseType: !82, size: 8, align: 8, offset: 8640)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !10, line: 4, baseType: !136, size: 192, align: 64, offset: 8704)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !10, line: 4, baseType: !136, size: 192, align: 64, offset: 8896)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !10, line: 4, baseType: !354, size: 192, align: 64, offset: 9088)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !14, size: 192, align: 8, elements: !355)
!355 = !{!356, !102, !103}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !10, line: 4, size: 384, align: 8, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !10, line: 4, baseType: !342, size: 192, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !10, line: 4, baseType: !363, size: 192, align: 64, offset: 192)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !10, line: 4, size: 192, align: 8, elements: !343)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !10, line: 4, baseType: !354, size: 192, align: 64, offset: 9280)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !10, line: 4, baseType: !136, size: 192, align: 64, offset: 9472)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !10, line: 4, baseType: !136, size: 192, align: 64, offset: 9664)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !10, line: 4, baseType: !136, size: 192, align: 64, offset: 9856)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !10, line: 4, baseType: !136, size: 192, align: 64, offset: 10048)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !10, line: 4, baseType: !136, size: 192, align: 64, offset: 10240)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !10, line: 4, baseType: !316, size: 192, align: 64, offset: 10432)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "VerifiedChains", file: !10, line: 4, baseType: !372, size: 192, align: 64, offset: 576)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !14, size: 192, align: 8, elements: !373)
!373 = !{!374, !102, !103}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !10, line: 4, baseType: !377, size: 192, align: 64, offset: 768)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !14, size: 192, align: 8, elements: !378)
!378 = !{!379, !102, !103}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPResponse", file: !10, line: 4, baseType: !129, size: 192, align: 64, offset: 960)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "TLSUnique", file: !10, line: 4, baseType: !129, size: 192, align: 64, offset: 1152)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", file: !10, line: 7, baseType: !384, size: 64, align: 64, offset: 1728)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !7, line: 1, align: 8, elements: !3)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !10, line: 7, baseType: !43, size: 64, align: 64, offset: 1792)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !10, line: 7, baseType: !388, size: 128, align: 64, offset: 1856)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !10, line: 4, size: 128, align: 8, elements: !389)
!389 = !{!390, !132}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void)*__go_channel,*func(*void)error,*func(*void,PrivateKey)PrivateKey}", file: !14, size: 320, align: 8, elements: !393)
!393 = !{!394, !395, !403, !407, !408}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 4, baseType: !57, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !14, line: 4, baseType: !396, size: 64, align: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!399, !43}
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !14, size: 256, align: 8, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !14, line: 4, baseType: !268, size: 192, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !14, line: 4, baseType: !82, size: 8, align: 8, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !14, line: 4, baseType: !404, size: 64, align: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!384, !43}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !14, line: 4, baseType: !106, size: 64, align: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !14, line: 4, baseType: !409, size: 64, align: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!223, !43, !223}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !10, line: 7, baseType: !194, size: 64, align: 64, offset: 1088)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 21, baseType: !129, size: 192, align: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 21, baseType: !109, size: 128, align: 64, offset: 256)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opts", file: !10, line: 14, size: 448, align: 8, elements: !416)
!416 = !{!417, !418, !419, !420}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !10, line: 15, baseType: !21, size: 128, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !10, line: 16, baseType: !21, size: 128, align: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !10, line: 17, baseType: !21, size: 128, align: 64, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "Headers", file: !10, line: 18, baseType: !33, size: 64, align: 64, offset: 384)
!421 = !DILocalVariable(name: "opts", arg: 2, scope: !9, file: !10, line: 21, type: !415)
!422 = !DILocation(line: 21, column: 30, scope: !9)
!423 = !DILocalVariable(name: "url", arg: 1, scope: !9, file: !10, line: 21, type: !21)
!424 = !DILocation(line: 21, column: 18, scope: !9)
!425 = !DILocalVariable(name: "$ret0", scope: !9, file: !10, line: 21, type: !17)
!426 = !DILocation(line: 21, column: 42, scope: !9)
!427 = !DILocalVariable(name: "method", scope: !428, file: !10, line: 22, type: !21)
!428 = distinct !DILexicalBlock(scope: !9, file: !10, line: 21, column: 1)
!429 = !DILocation(line: 22, column: 2, scope: !9)
!430 = !DILocation(line: 23, column: 9, scope: !428)
!431 = !DILocation(line: 23, column: 17, scope: !428)
!432 = !DILocation(line: 26, column: 67, scope: !428)
!433 = !DILocation(line: 26, column: 53, scope: !428)
!434 = !DILocation(line: 26, column: 21, scope: !428)
!435 = !DILocalVariable(name: "request", scope: !428, file: !10, line: 26, type: !143)
!436 = !DILocation(line: 26, column: 2, scope: !9)
!437 = !DILocation(line: 27, column: 9, scope: !428)
!438 = !DILocation(line: 27, column: 18, scope: !428)
!439 = !DILocation(line: 28, column: 31, scope: !428)
!440 = !DILocation(line: 31, column: 5, scope: !428)
!441 = !DILocation(line: 31, column: 20, scope: !428)
!442 = !DILocation(line: 28, column: 12, scope: !428)
!443 = !DILocation(line: 32, column: 10, scope: !428)
!444 = !DILocalVariable(name: "tr", scope: !428, file: !10, line: 35, type: !445)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transport", file: !10, line: 7, size: 1856, align: 8, elements: !447)
!447 = !{!448, !454, !455, !456, !457, !474, !475, !476, !477, !481, !493, !532, !540, !541, !731, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "idleMu", file: !10, line: 7, baseType: !449, size: 64, align: 32)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !10, line: 4, size: 64, align: 8, elements: !450)
!450 = !{!451, !453}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !10, line: 4, baseType: !452, size: 32, align: 32)
!452 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !10, line: 4, baseType: !8, size: 32, align: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "wantIdle", file: !10, line: 7, baseType: !82, size: 8, align: 8, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "idleConn", file: !10, line: 7, baseType: !33, size: 64, align: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "idleConnCh", file: !10, line: 7, baseType: !33, size: 64, align: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "idleLRU", file: !10, line: 7, baseType: !458, size: 128, align: 64, offset: 256)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: ".net/http.connLRU", file: !10, line: 7, size: 128, align: 8, elements: !459)
!459 = !{!460, !473}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ll", file: !10, line: 7, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", file: !10, line: 7, size: 384, align: 8, elements: !463)
!463 = !{!464, !472}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "root", file: !10, line: 7, baseType: !465, size: 320, align: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "Element", file: !10, line: 7, size: 320, align: 8, elements: !466)
!466 = !{!467, !469, !470, !471}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !10, line: 7, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !10, line: 7, baseType: !468, size: 64, align: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "list", file: !10, line: 7, baseType: !43, size: 64, align: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !10, line: 7, baseType: !223, size: 128, align: 64, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "len", file: !10, line: 7, baseType: !27, size: 64, align: 64, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !10, line: 7, baseType: !33, size: 64, align: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "reqMu", file: !10, line: 7, baseType: !449, size: 64, align: 32, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "reqCanceler", file: !10, line: 7, baseType: !33, size: 64, align: 64, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "altMu", file: !10, line: 7, baseType: !449, size: 64, align: 32, offset: 512)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "altProto", file: !10, line: 7, baseType: !478, size: 128, align: 64, offset: 576)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "Value", file: !10, line: 7, size: 128, align: 8, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "v", file: !10, line: 7, baseType: !223, size: 128, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Proxy", file: !10, line: 7, baseType: !482, size: 64, align: 64, offset: 704)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 7, size: 64, align: 8, elements: !484)
!484 = !{!485}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 7, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!489, !143}
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*URL,error}", file: !14, size: 192, align: 8, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 7, baseType: !148, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 7, baseType: !109, size: 128, align: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "DialContext", file: !10, line: 7, baseType: !494, size: 64, align: 64, offset: 768)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 7, size: 64, align: 8, elements: !496)
!496 = !{!497}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 7, baseType: !498, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!501, !388, !21, !21}
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Conn,error}", file: !14, size: 256, align: 8, elements: !502)
!502 = !{!503, !177}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 7, baseType: !504, size: 128, align: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "Conn", file: !10, line: 4, size: 128, align: 8, elements: !505)
!505 = !{!506, !132}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !507, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)Addr,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void)Addr,*func(*void,Time)error,*func(*void,Time)error,*func(*void,Time)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !14, size: 576, align: 8, elements: !509)
!509 = !{!394, !510, !511, !523, !524, !525, !529, !530, !531}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !14, line: 4, baseType: !106, size: 64, align: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "LocalAddr", file: !14, line: 4, baseType: !512, size: 64, align: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!515, !43}
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "Addr", file: !10, line: 4, size: 128, align: 8, elements: !516)
!516 = !{!517, !132}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)string}", file: !14, size: 192, align: 8, elements: !520)
!520 = !{!394, !521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Network", file: !14, line: 4, baseType: !117, size: 64, align: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !14, line: 4, baseType: !117, size: 64, align: 64, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !14, line: 4, baseType: !122, size: 64, align: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !14, line: 4, baseType: !512, size: 64, align: 64, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "SetDeadline", file: !14, line: 4, baseType: !526, size: 64, align: 64, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!109, !43, !268}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "SetReadDeadline", file: !14, line: 4, baseType: !526, size: 64, align: 64, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "SetWriteDeadline", file: !14, line: 4, baseType: !526, size: 64, align: 64, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !14, line: 4, baseType: !122, size: 64, align: 64, offset: 512)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Dial", file: !10, line: 7, baseType: !533, size: 64, align: 64, offset: 832)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 7, size: 64, align: 8, elements: !535)
!535 = !{!536}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 7, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!501, !21, !21}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "DialTLS", file: !10, line: 7, baseType: !533, size: 64, align: 64, offset: 896)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "TLSClientConfig", file: !10, line: 7, baseType: !542, size: 64, align: 64, offset: 960)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "Config", file: !10, line: 4, size: 2944, align: 8, elements: !544)
!544 = !{!545, !553, !561, !573, !574, !611, !624, !635, !643, !650, !651, !652, !654, !655, !656, !657, !658, !659, !663, !691, !692, !693, !694, !695, !697, !705, !710, !718}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Rand", file: !10, line: 4, baseType: !546, size: 128, align: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !10, line: 4, size: 128, align: 8, elements: !547)
!547 = !{!548, !132}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !549, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !14, size: 128, align: 8, elements: !551)
!551 = !{!394, !552}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !14, line: 4, baseType: !122, size: 64, align: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Time", file: !10, line: 4, baseType: !554, size: 64, align: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 4, size: 64, align: 8, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 4, baseType: !558, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!268}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Certificates", file: !10, line: 4, baseType: !562, size: 192, align: 64, offset: 192)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,int,int}", file: !14, size: 192, align: 8, elements: !563)
!563 = !{!564, !102, !103}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !565, size: 64, align: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !10, line: 4, size: 768, align: 8, elements: !567)
!567 = !{!568, !569, !570, !571, !572}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "Certificate", file: !10, line: 4, baseType: !377, size: 192, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "PrivateKey", file: !10, line: 4, baseType: !223, size: 128, align: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPStaple", file: !10, line: 4, baseType: !129, size: 192, align: 64, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !10, line: 4, baseType: !377, size: 192, align: 64, offset: 512)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Leaf", file: !10, line: 4, baseType: !209, size: 64, align: 64, offset: 704)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "NameToCertificate", file: !10, line: 4, baseType: !33, size: 64, align: 64, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "GetCertificate", file: !10, line: 4, baseType: !575, size: 64, align: 64, offset: 448)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 4, size: 64, align: 8, elements: !577)
!577 = !{!578}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 4, baseType: !579, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!582, !586}
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Certificate,error}", file: !14, size: 192, align: 8, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 4, baseType: !565, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 4, baseType: !109, size: 128, align: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientHelloInfo", file: !10, line: 4, size: 1408, align: 8, elements: !588)
!588 = !{!589, !594, !595, !601, !602, !608, !609, !610}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuites", file: !10, line: 4, baseType: !590, size: 192, align: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint16,int,int}", file: !14, size: 192, align: 8, elements: !591)
!591 = !{!592, !102, !103}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !593, size: 64, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !10, line: 4, baseType: !21, size: 128, align: 64, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedCurves", file: !10, line: 4, baseType: !596, size: 192, align: 64, offset: 320)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*CurveID,int,int}", file: !14, size: 192, align: 8, elements: !597)
!597 = !{!598, !102, !103}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !599, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIBasicType(name: "CurveID", size: 16, encoding: DW_ATE_unsigned)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedPoints", file: !10, line: 4, baseType: !129, size: 192, align: 64, offset: 512)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureSchemes", file: !10, line: 4, baseType: !603, size: 192, align: 64, offset: 704)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*SignatureScheme,int,int}", file: !14, size: 192, align: 8, elements: !604)
!604 = !{!605, !102, !103}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !606, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIBasicType(name: "SignatureScheme", size: 16, encoding: DW_ATE_unsigned)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedProtos", file: !10, line: 4, baseType: !136, size: 192, align: 64, offset: 896)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedVersions", file: !10, line: 4, baseType: !590, size: 192, align: 64, offset: 1088)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "Conn", file: !10, line: 4, baseType: !504, size: 128, align: 64, offset: 1280)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "GetClientCertificate", file: !10, line: 4, baseType: !612, size: 64, align: 64, offset: 512)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 4, size: 64, align: 8, elements: !614)
!614 = !{!615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 4, baseType: !616, size: 64, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!582, !619}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertificateRequestInfo", file: !10, line: 4, size: 384, align: 8, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptableCAs", file: !10, line: 4, baseType: !377, size: 192, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureSchemes", file: !10, line: 4, baseType: !603, size: 192, align: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "GetConfigForClient", file: !10, line: 4, baseType: !625, size: 64, align: 64, offset: 576)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 4, size: 64, align: 8, elements: !627)
!627 = !{!628}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 4, baseType: !629, size: 64, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!632, !586}
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Config,error}", file: !14, size: 192, align: 8, elements: !633)
!633 = !{!634, !585}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 4, baseType: !43, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "VerifyPeerCertificate", file: !10, line: 4, baseType: !636, size: 64, align: 64, offset: 640)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 4, size: 64, align: 8, elements: !638)
!638 = !{!639}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 4, baseType: !640, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!109, !377, !372}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "RootCAs", file: !10, line: 4, baseType: !644, size: 64, align: 64, offset: 704)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "CertPool", file: !10, line: 4, size: 320, align: 8, elements: !646)
!646 = !{!647, !648, !649}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "bySubjectKeyId", file: !10, line: 4, baseType: !33, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "byName", file: !10, line: 4, baseType: !33, size: 64, align: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "certs", file: !10, line: 4, baseType: !205, size: 192, align: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "NextProtos", file: !10, line: 4, baseType: !136, size: 192, align: 64, offset: 768)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !10, line: 4, baseType: !21, size: 128, align: 64, offset: 960)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAuth", file: !10, line: 4, baseType: !653, size: 64, align: 64, offset: 1088)
!653 = !DIBasicType(name: "ClientAuthType", size: 64, encoding: DW_ATE_signed)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ClientCAs", file: !10, line: 4, baseType: !644, size: 64, align: 64, offset: 1152)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "InsecureSkipVerify", file: !10, line: 4, baseType: !82, size: 8, align: 8, offset: 1216)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuites", file: !10, line: 4, baseType: !590, size: 192, align: 64, offset: 1280)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "PreferServerCipherSuites", file: !10, line: 4, baseType: !82, size: 8, align: 8, offset: 1472)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "SessionTicketsDisabled", file: !10, line: 4, baseType: !82, size: 8, align: 8, offset: 1480)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "SessionTicketKey", file: !10, line: 4, baseType: !660, size: 256, align: 8, offset: 1488)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 256, align: 1, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ClientSessionCache", file: !10, line: 4, baseType: !664, size: 128, align: 64, offset: 1792)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientSessionCache", file: !10, line: 4, size: 128, align: 8, elements: !665)
!665 = !{!666, !132}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !667, size: 64, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)struct{*ClientSessionState,bool},*func(*void,string,*ClientSessionState)void}", file: !14, size: 192, align: 8, elements: !669)
!669 = !{!394, !670, !687}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Get", file: !14, line: 4, baseType: !671, size: 64, align: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!674, !43, !21}
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ClientSessionState,bool}", file: !14, size: 128, align: 8, elements: !675)
!675 = !{!676, !686}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "session", file: !14, line: 4, baseType: !677, size: 64, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "ClientSessionState", file: !10, line: 4, size: 832, align: 8, elements: !679)
!679 = !{!680, !681, !682, !683, !684, !685}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "sessionTicket", file: !10, line: 4, baseType: !129, size: 192, align: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "vers", file: !10, line: 4, baseType: !40, size: 16, align: 16, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "cipherSuite", file: !10, line: 4, baseType: !40, size: 16, align: 16, offset: 208)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "masterSecret", file: !10, line: 4, baseType: !129, size: 192, align: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "serverCertificates", file: !10, line: 4, baseType: !205, size: 192, align: 64, offset: 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "verifiedChains", file: !10, line: 4, baseType: !372, size: 192, align: 64, offset: 640)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !14, line: 4, baseType: !82, size: 8, align: 8, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Put", file: !14, line: 4, baseType: !688, size: 64, align: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!44, !43, !21, !677}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "MinVersion", file: !10, line: 4, baseType: !40, size: 16, align: 16, offset: 1920)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "MaxVersion", file: !10, line: 4, baseType: !40, size: 16, align: 16, offset: 1936)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "CurvePreferences", file: !10, line: 4, baseType: !596, size: 192, align: 64, offset: 1984)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "DynamicRecordSizingDisabled", file: !10, line: 4, baseType: !82, size: 8, align: 8, offset: 2176)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Renegotiation", file: !10, line: 4, baseType: !696, size: 64, align: 64, offset: 2240)
!696 = !DIBasicType(name: "RenegotiationSupport", size: 64, encoding: DW_ATE_signed)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "KeyLogWriter", file: !10, line: 4, baseType: !698, size: 128, align: 64, offset: 2304)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !10, line: 4, size: 128, align: 8, elements: !699)
!699 = !{!700, !132}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !701, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !14, size: 128, align: 8, elements: !703)
!703 = !{!394, !704}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !14, line: 4, baseType: !122, size: 64, align: 64, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "serverInitOnce", file: !10, line: 4, baseType: !706, size: 96, align: 32, offset: 2432)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once", file: !10, line: 4, size: 96, align: 8, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !10, line: 4, baseType: !449, size: 64, align: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "done", file: !10, line: 4, baseType: !8, size: 32, align: 32, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", file: !10, line: 4, baseType: !711, size: 192, align: 32, offset: 2528)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !10, line: 4, size: 192, align: 8, elements: !712)
!712 = !{!713, !714, !715, !716, !717}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !10, line: 4, baseType: !449, size: 64, align: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !10, line: 4, baseType: !8, size: 32, align: 32, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !10, line: 4, baseType: !8, size: 32, align: 32, offset: 96)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !10, line: 4, baseType: !452, size: 32, align: 32, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !10, line: 4, baseType: !452, size: 32, align: 32, offset: 160)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "sessionTicketKeys", file: !10, line: 4, baseType: !719, size: 192, align: 64, offset: 2752)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.crypto/tls.ticketKey,int,int}", file: !14, size: 192, align: 8, elements: !720)
!720 = !{!721, !102, !103}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !722, size: 64, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: ".crypto/tls.ticketKey", file: !10, line: 4, size: 384, align: 8, elements: !724)
!724 = !{!725, !729, !730}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "keyName", file: !10, line: 4, baseType: !726, size: 128, align: 8)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 128, align: 1, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 16)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "aesKey", file: !10, line: 4, baseType: !726, size: 128, align: 8, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "hmacKey", file: !10, line: 4, baseType: !726, size: 128, align: 8, offset: 256)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "TLSHandshakeTimeout", file: !10, line: 7, baseType: !732, size: 64, align: 64, offset: 1024)
!732 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "DisableKeepAlives", file: !10, line: 7, baseType: !82, size: 8, align: 8, offset: 1088)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "DisableCompression", file: !10, line: 7, baseType: !82, size: 8, align: 8, offset: 1096)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "MaxIdleConns", file: !10, line: 7, baseType: !27, size: 64, align: 64, offset: 1152)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "MaxIdleConnsPerHost", file: !10, line: 7, baseType: !27, size: 64, align: 64, offset: 1216)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "IdleConnTimeout", file: !10, line: 7, baseType: !732, size: 64, align: 64, offset: 1280)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ResponseHeaderTimeout", file: !10, line: 7, baseType: !732, size: 64, align: 64, offset: 1344)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectContinueTimeout", file: !10, line: 7, baseType: !732, size: 64, align: 64, offset: 1408)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "TLSNextProto", file: !10, line: 7, baseType: !33, size: 64, align: 64, offset: 1472)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ProxyConnectHeader", file: !10, line: 7, baseType: !33, size: 64, align: 64, offset: 1536)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "MaxResponseHeaderBytes", file: !10, line: 7, baseType: !134, size: 64, align: 64, offset: 1600)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "nextProtoOnce", file: !10, line: 7, baseType: !706, size: 96, align: 32, offset: 1664)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "h2transport", file: !10, line: 7, baseType: !745, size: 64, align: 64, offset: 1792)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: ".net/http.http2Transport", file: !10, line: 7, size: 640, align: 8, elements: !747)
!747 = !{!748, !756, !757, !1019, !1020, !1021, !1022, !1023, !1024}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "DialTLS", file: !10, line: 7, baseType: !749, size: 64, align: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 7, size: 64, align: 8, elements: !751)
!751 = !{!752}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 7, baseType: !753, size: 64, align: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!501, !21, !21, !542}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "TLSClientConfig", file: !10, line: 7, baseType: !542, size: 64, align: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ConnPool", file: !10, line: 7, baseType: !758, size: 128, align: 64, offset: 128)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: ".net/http.http2ClientConnPool", file: !10, line: 7, size: 128, align: 8, elements: !759)
!759 = !{!760, !132}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 7, baseType: !761, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*Request,string)struct{*.net/http.http2ClientConn,error},*func(*void,*.net/http.http2ClientConn)void}", file: !14, size: 192, align: 8, elements: !763)
!763 = !{!764, !765, !1015}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !14, line: 7, baseType: !57, size: 64, align: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "GetClientConn", file: !14, line: 7, baseType: !766, size: 64, align: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!769, !43, !143, !21}
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.net/http.http2ClientConn,error}", file: !14, size: 192, align: 8, elements: !770)
!770 = !{!771, !492}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !14, line: 7, baseType: !772, size: 64, align: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: ".net/http.http2ClientConn", file: !10, line: 7, size: 3392, align: 8, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782, !804, !805, !833, !839, !840, !841, !842, !860, !861, !862, !863, !864, !865, !873, !884, !997, !998, !999, !1000, !1001, !1002, !1003, !1012, !1013, !1014}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "t", file: !10, line: 7, baseType: !43, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "tconn", file: !10, line: 7, baseType: !504, size: 128, align: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "tlsState", file: !10, line: 7, baseType: !194, size: 64, align: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "singleUse", file: !10, line: 7, baseType: !82, size: 8, align: 8, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "readerDone", file: !10, line: 7, baseType: !384, size: 64, align: 64, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "readerErr", file: !10, line: 7, baseType: !109, size: 128, align: 64, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "idleTimeout", file: !10, line: 7, baseType: !732, size: 64, align: 64, offset: 512)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "idleTimer", file: !10, line: 7, baseType: !783, size: 64, align: 64, offset: 576)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timer", file: !10, line: 7, size: 576, align: 8, elements: !785)
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "C", file: !10, line: 7, baseType: !384, size: 64, align: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !10, line: 7, baseType: !788, size: 512, align: 64, offset: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.runtimeTimer", file: !10, line: 7, size: 512, align: 8, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !802, !803}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "tb", file: !10, line: 7, baseType: !47, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "i", file: !10, line: 7, baseType: !27, size: 64, align: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !10, line: 7, baseType: !134, size: 64, align: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !10, line: 7, baseType: !134, size: 64, align: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !10, line: 7, baseType: !795, size: 64, align: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 7, size: 64, align: 8, elements: !797)
!797 = !{!798}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 7, baseType: !799, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!44, !223, !47}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !10, line: 7, baseType: !223, size: 128, align: 64, offset: 320)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !10, line: 7, baseType: !47, size: 64, align: 64, offset: 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !10, line: 7, baseType: !449, size: 64, align: 32, offset: 640)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "cond", file: !10, line: 7, baseType: !806, size: 64, align: 64, offset: 704)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cond", file: !10, line: 4, size: 448, align: 8, elements: !808)
!808 = !{!809, !811, !823, !831}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "noCopy", file: !10, line: 4, baseType: !810, align: 8)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: ".sync.noCopy", file: !10, line: 4, align: 8, elements: !3)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "L", file: !10, line: 4, baseType: !812, size: 128, align: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "Locker", file: !10, line: 4, size: 128, align: 8, elements: !813)
!813 = !{!814, !132}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 4, baseType: !815, size: 64, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)void,*func(*void)void}", file: !14, size: 192, align: 8, elements: !817)
!817 = !{!394, !818, !822}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", file: !14, line: 4, baseType: !819, size: 64, align: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!44, !43}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "Unlock", file: !14, line: 4, baseType: !819, size: 64, align: 64, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "notify", file: !10, line: 4, baseType: !824, size: 256, align: 64, offset: 128)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: ".sync.notifyList", file: !10, line: 4, size: 256, align: 8, elements: !825)
!825 = !{!826, !827, !828, !829, !830}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "wait", file: !10, line: 4, baseType: !8, size: 32, align: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "notify", file: !10, line: 4, baseType: !8, size: 32, align: 32, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !10, line: 4, baseType: !47, size: 64, align: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !10, line: 4, baseType: !43, size: 64, align: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !10, line: 4, baseType: !43, size: 64, align: 64, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "checker", file: !10, line: 4, baseType: !832, size: 64, align: 64, offset: 384)
!832 = !DIBasicType(name: ".sync.copyChecker", size: 64, encoding: DW_ATE_unsigned)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "flow", file: !10, line: 7, baseType: !834, size: 128, align: 64, offset: 768)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: ".net/http.http2flow", file: !10, line: 7, size: 128, align: 8, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !10, line: 7, baseType: !452, size: 32, align: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "conn", file: !10, line: 7, baseType: !838, size: 64, align: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "inflow", file: !10, line: 7, baseType: !834, size: 128, align: 64, offset: 896)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !10, line: 7, baseType: !82, size: 8, align: 8, offset: 1024)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "wantSettingsAck", file: !10, line: 7, baseType: !82, size: 8, align: 8, offset: 1032)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "goAway", file: !10, line: 7, baseType: !843, size: 64, align: 64, offset: 1088)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: ".net/http.http2GoAwayFrame", file: !10, line: 7, size: 384, align: 8, elements: !845)
!845 = !{!846, !856, !857, !859}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "http2FrameHeader", file: !10, line: 7, baseType: !847, size: 96, align: 32)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: ".net/http.http2FrameHeader", file: !10, line: 7, size: 96, align: 8, elements: !848)
!848 = !{!849, !850, !852, !854, !855}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "valid", file: !10, line: 7, baseType: !82, size: 8, align: 8)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !10, line: 7, baseType: !851, size: 8, align: 8, offset: 8)
!851 = !DIBasicType(name: ".net/http.http2FrameType", size: 8, encoding: DW_ATE_unsigned)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", file: !10, line: 7, baseType: !853, size: 8, align: 8, offset: 16)
!853 = !DIBasicType(name: ".net/http.http2Flags", size: 8, encoding: DW_ATE_unsigned)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Length", file: !10, line: 7, baseType: !8, size: 32, align: 32, offset: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "StreamID", file: !10, line: 7, baseType: !8, size: 32, align: 32, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "LastStreamID", file: !10, line: 7, baseType: !8, size: 32, align: 32, offset: 96)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ErrCode", file: !10, line: 7, baseType: !858, size: 32, align: 32, offset: 128)
!858 = !DIBasicType(name: ".net/http.http2ErrCode", size: 32, encoding: DW_ATE_unsigned)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "debugData", file: !10, line: 7, baseType: !129, size: 192, align: 64, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "goAwayDebug", file: !10, line: 7, baseType: !21, size: 128, align: 64, offset: 1152)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "streams", file: !10, line: 7, baseType: !33, size: 64, align: 64, offset: 1280)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "nextStreamID", file: !10, line: 7, baseType: !8, size: 32, align: 32, offset: 1344)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "pendingRequests", file: !10, line: 7, baseType: !27, size: 64, align: 64, offset: 1408)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "pings", file: !10, line: 7, baseType: !33, size: 64, align: 64, offset: 1472)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "bw", file: !10, line: 7, baseType: !866, size: 64, align: 64, offset: 1536)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !10, line: 7, size: 512, align: 8, elements: !868)
!868 = !{!869, !870, !871, !872}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !10, line: 7, baseType: !109, size: 128, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !10, line: 7, baseType: !129, size: 192, align: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !10, line: 7, baseType: !27, size: 64, align: 64, offset: 320)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "wr", file: !10, line: 7, baseType: !698, size: 128, align: 64, offset: 384)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "br", file: !10, line: 7, baseType: !874, size: 64, align: 64, offset: 1600)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !10, line: 7, size: 704, align: 8, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !10, line: 7, baseType: !129, size: 192, align: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "rd", file: !10, line: 7, baseType: !546, size: 128, align: 64, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !10, line: 7, baseType: !27, size: 64, align: 64, offset: 320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !10, line: 7, baseType: !27, size: 64, align: 64, offset: 384)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !10, line: 7, baseType: !109, size: 128, align: 64, offset: 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "lastByte", file: !10, line: 7, baseType: !27, size: 64, align: 64, offset: 576)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "lastRuneSize", file: !10, line: 7, baseType: !27, size: 64, align: 64, offset: 640)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "fr", file: !10, line: 7, baseType: !885, size: 64, align: 64, offset: 1664)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: ".net/http.http2Framer", file: !10, line: 7, size: 1728, align: 8, elements: !887)
!887 = !{!888, !889, !901, !902, !903, !904, !908, !916, !917, !918, !919, !920, !921, !922, !970, !971, !972, !973, !974, !976, !988, !989}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !10, line: 7, baseType: !546, size: 128, align: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "lastFrame", file: !10, line: 7, baseType: !890, size: 128, align: 64, offset: 128)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: ".net/http.http2Frame", file: !10, line: 7, size: 128, align: 8, elements: !891)
!891 = !{!892, !132}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 7, baseType: !893, size: 64, align: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void).net/http.http2FrameHeader,*func(*void)void}", file: !14, size: 192, align: 8, elements: !895)
!895 = !{!764, !896, !900}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !14, line: 7, baseType: !897, size: 64, align: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!847, !43}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "invalidate", file: !14, line: 7, baseType: !819, size: 64, align: 64, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "errDetail", file: !10, line: 7, baseType: !109, size: 128, align: 64, offset: 256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "lastHeaderStream", file: !10, line: 7, baseType: !8, size: 32, align: 32, offset: 384)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "maxReadSize", file: !10, line: 7, baseType: !8, size: 32, align: 32, offset: 416)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "headerBuf", file: !10, line: 7, baseType: !905, size: 72, align: 8, offset: 448)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 72, align: 1, elements: !906)
!906 = !{!907}
!907 = !DISubrange(count: 9)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "getReadBuf", file: !10, line: 7, baseType: !909, size: 64, align: 64, offset: 576)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 7, size: 64, align: 8, elements: !911)
!911 = !{!912}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 7, baseType: !913, size: 64, align: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!129, !8}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "readBuf", file: !10, line: 7, baseType: !129, size: 192, align: 64, offset: 640)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "maxWriteSize", file: !10, line: 7, baseType: !8, size: 32, align: 32, offset: 832)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !10, line: 7, baseType: !698, size: 128, align: 64, offset: 896)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "wbuf", file: !10, line: 7, baseType: !129, size: 192, align: 64, offset: 1024)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "AllowIllegalWrites", file: !10, line: 7, baseType: !82, size: 8, align: 8, offset: 1216)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "AllowIllegalReads", file: !10, line: 7, baseType: !82, size: 8, align: 8, offset: 1224)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ReadMetaHeaders", file: !10, line: 7, baseType: !923, size: 64, align: 64, offset: 1280)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DICompositeType(tag: DW_TAG_structure_type, name: "Decoder", file: !10, line: 7, size: 1728, align: 8, elements: !925)
!925 = !{!926, !948, !956, !957, !958, !959}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "dynTab", file: !10, line: 7, baseType: !927, size: 512, align: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: ".vendor/golang_org/x/net/http2/hpack.dynamicTable", file: !10, line: 7, size: 512, align: 8, elements: !928)
!928 = !{!929, !945, !946, !947}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "table", file: !10, line: 7, baseType: !930, size: 384, align: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: ".vendor/golang_org/x/net/http2/hpack.headerFieldTable", file: !10, line: 7, size: 384, align: 8, elements: !931)
!931 = !{!932, !942, !943, !944}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ents", file: !10, line: 7, baseType: !933, size: 192, align: 64)
!933 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*HeaderField,int,int}", file: !14, size: 192, align: 8, elements: !934)
!934 = !{!935, !102, !103}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !14, line: 1, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "HeaderField", file: !10, line: 7, size: 320, align: 8, elements: !938)
!938 = !{!939, !940, !941}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !10, line: 7, baseType: !21, size: 128, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !10, line: 7, baseType: !21, size: 128, align: 64, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "Sensitive", file: !10, line: 7, baseType: !82, size: 8, align: 8, offset: 256)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "evictCount", file: !10, line: 7, baseType: !271, size: 64, align: 64, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "byName", file: !10, line: 7, baseType: !33, size: 64, align: 64, offset: 256)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "byNameValue", file: !10, line: 7, baseType: !33, size: 64, align: 64, offset: 320)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !10, line: 7, baseType: !8, size: 32, align: 32, offset: 384)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "maxSize", file: !10, line: 7, baseType: !8, size: 32, align: 32, offset: 416)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "allowedMaxSize", file: !10, line: 7, baseType: !8, size: 32, align: 32, offset: 448)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "emit", file: !10, line: 7, baseType: !949, size: 64, align: 64, offset: 512)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 7, size: 64, align: 8, elements: !951)
!951 = !{!952}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 7, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!44, !937}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "emitEnabled", file: !10, line: 7, baseType: !82, size: 8, align: 8, offset: 576)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "maxStrLen", file: !10, line: 7, baseType: !27, size: 64, align: 64, offset: 640)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !10, line: 7, baseType: !129, size: 192, align: 64, offset: 704)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "saveBuf", file: !10, line: 7, baseType: !960, size: 832, align: 64, offset: 896)
!960 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", file: !10, line: 4, size: 832, align: 8, elements: !961)
!961 = !{!962, !963, !964, !968}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !10, line: 4, baseType: !129, size: 192, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "off", file: !10, line: 4, baseType: !27, size: 64, align: 64, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "bootstrap", file: !10, line: 4, baseType: !965, size: 512, align: 8, offset: 256)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 512, align: 1, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "lastRead", file: !10, line: 4, baseType: !969, size: 8, align: 8, offset: 768)
!969 = !DIBasicType(name: ".bytes.readOp", size: 8, encoding: DW_ATE_signed)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "MaxHeaderListSize", file: !10, line: 7, baseType: !8, size: 32, align: 32, offset: 1344)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "logReads", file: !10, line: 7, baseType: !82, size: 8, align: 8, offset: 1376)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "logWrites", file: !10, line: 7, baseType: !82, size: 8, align: 8, offset: 1384)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "debugFramer", file: !10, line: 7, baseType: !43, size: 64, align: 64, offset: 1408)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "debugFramerBuf", file: !10, line: 7, baseType: !975, size: 64, align: 64, offset: 1472)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "debugReadLoggerf", file: !10, line: 7, baseType: !977, size: 64, align: 64, offset: 1536)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
