; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22flag\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22amber\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22github.com/eknkc/amber\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22github.com/eknkc/amber\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22os\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22os\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22os\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./cli.go", directory: "/home/wangcong/go_path/src/github.com/eknkc/amber/amberc")
!3 = !{}
!4 = !{!5, !9, !11, !78}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "main.prettyPrint", linkageName: "main.prettyPrint", scope: !1, file: !7, line: 11, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "cli.go", directory: ".")
!8 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "main.lineNumbers", linkageName: "main.lineNumbers", scope: !1, file: !7, line: 12, type: !8, isLocal: true, isDefinition: true)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "os.Stderr", linkageName: "os.Stderr", scope: !1, file: !7, line: 6, type: !13, isLocal: false, isDefinition: true)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !7, line: 6, size: 64, align: 8, elements: !15)
!15 = !{!16}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !7, line: 6, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !7, line: 6, size: 640, align: 8, elements: !19)
!19 = !{!20, !59, !65, !76, !77}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !7, line: 6, baseType: !21, size: 384, align: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !7, line: 6, size: 384, align: 8, elements: !22)
!22 = !{!23, !31, !33, !38, !54, !55, !56, !57, !58}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !7, line: 6, baseType: !24, size: 128, align: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !7, line: 6, size: 128, align: 8, elements: !25)
!25 = !{!26, !28, !30}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 6, baseType: !27, size: 64, align: 64)
!27 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !7, line: 6, baseType: !29, size: 32, align: 32, offset: 64)
!29 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !7, line: 6, baseType: !29, size: 32, align: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !7, line: 6, baseType: !32, size: 64, align: 64, offset: 128)
!32 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !7, line: 6, baseType: !34, size: 64, align: 64, offset: 192)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !7, line: 6, size: 64, align: 8, elements: !35)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !7, line: 6, baseType: !37, size: 64, align: 64)
!37 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !7, line: 6, baseType: !39, size: 64, align: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !41, size: 192, align: 8, elements: !42)
!41 = !DIFile(filename: "", directory: "")
!42 = !{!43, !52, !53}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !7, line: 6, size: 128, align: 8, elements: !46)
!46 = !{!47, !50}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !7, line: 6, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !7, line: 6, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !41, line: 1, baseType: !32, size: 64, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !41, line: 1, baseType: !32, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !7, line: 6, baseType: !29, size: 32, align: 32, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !7, line: 6, baseType: !8, size: 8, align: 8, offset: 352)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !7, line: 6, baseType: !8, size: 8, align: 8, offset: 360)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !7, line: 6, baseType: !8, size: 8, align: 8, offset: 368)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !7, line: 6, baseType: !8, size: 8, align: 8, offset: 376)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 6, baseType: !60, size: 128, align: 64, offset: 384)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !61, line: 1, size: 128, align: 8, elements: !62)
!61 = !DIFile(filename: "<built-in>", directory: "")
!62 = !{!63, !64}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !61, line: 1, baseType: !48, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !61, line: 1, baseType: !32, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !7, line: 6, baseType: !66, size: 64, align: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !7, line: 6, size: 256, align: 8, elements: !68)
!68 = !{!69, !73}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 6, baseType: !70, size: 192, align: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !41, size: 192, align: 8, elements: !71)
!71 = !{!72, !52, !53}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !48, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !7, line: 6, baseType: !74, size: 64, align: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !7, line: 6, align: 8, elements: !3)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !7, line: 6, baseType: !8, size: 8, align: 8, offset: 576)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !7, line: 6, baseType: !8, size: 8, align: 8, offset: 584)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "os.Stdout", linkageName: "os.Stdout", scope: !1, file: !7, line: 6, type: !13, isLocal: false, isDefinition: true)
!80 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !7, line: 1, type: !81, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!81 = !DISubroutineType(types: !82)
!82 = !{!83}
!83 = !DIBasicType(name: "void")
!84 = !DILocation(line: 14, column: 1, scope: !80)
!85 = distinct !DISubprogram(name: "main.main..init0", linkageName: "main.main..init0", scope: null, file: !7, line: 14, type: !81, isLocal: false, isDefinition: true, scopeLine: 14, isOptimized: false, unit: !1, retainedNodes: !3)
!86 = !DILocation(line: 15, column: 7, scope: !85)
!87 = !DILocation(line: 16, column: 7, scope: !85)
!88 = !DILocation(line: 18, column: 7, scope: !85)
!89 = !DILocation(line: 19, column: 7, scope: !85)
!90 = !DILocation(line: 21, column: 7, scope: !85)
!91 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !7, line: 24, type: !81, isLocal: false, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !1, retainedNodes: !3)
!92 = !DILocation(line: 25, column: 16, scope: !93)
!93 = distinct !DILexicalBlock(scope: !91, file: !7, line: 24, column: 1)
!94 = !DILocalVariable(name: "input", scope: !93, file: !7, line: 25, type: !60)
!95 = !DILocation(line: 25, column: 2, scope: !91)
!96 = !DILocation(line: 27, column: 16, scope: !93)
!97 = !DILocation(line: 28, column: 7, scope: !93)
!98 = !DILocation(line: 28, column: 19, scope: !93)
!99 = !DILocation(line: 29, column: 6, scope: !93)
!100 = !DILocation(line: 32, column: 15, scope: !93)
!101 = !DILocalVariable(name: "cmp", scope: !93, file: !7, line: 32, type: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "Compiler", file: !7, line: 8, size: 768, align: 8, elements: !104)
!104 = !{!105, !295, !296, !313, !314, !315, !327, !328}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !7, line: 8, baseType: !106, size: 192, align: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "Options", file: !7, line: 8, size: 192, align: 8, elements: !107)
!107 = !{!108, !109, !110}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "PrettyPrint", file: !7, line: 8, baseType: !8, size: 8, align: 8)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "LineNumbers", file: !7, line: 8, baseType: !8, size: 8, align: 8, offset: 8)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "VirtualFilesystem", file: !7, line: 8, baseType: !111, size: 128, align: 64, offset: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileSystem", file: !7, line: 8, size: 128, align: 8, elements: !112)
!112 = !{!113, !277}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 8, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)struct{File,error}}", file: !41, size: 128, align: 8, elements: !116)
!116 = !{!117, !164}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !41, line: 8, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !61, line: 1, size: 576, align: 8, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !136, !144, !145, !147, !163}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !61, line: 1, baseType: !37, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !61, line: 1, baseType: !37, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !61, line: 1, baseType: !29, size: 32, align: 32, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !61, line: 1, baseType: !49, size: 8, align: 8, offset: 160)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !61, line: 1, baseType: !49, size: 8, align: 8, offset: 168)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !61, line: 1, baseType: !49, size: 8, align: 8, offset: 176)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !61, line: 1, baseType: !128, size: 64, align: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !61, line: 1, size: 64, align: 8, elements: !130)
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !61, line: 1, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!37, !135, !37}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !61, line: 1, baseType: !137, size: 64, align: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !61, line: 1, size: 64, align: 8, elements: !139)
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !61, line: 1, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!8, !135, !135}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !61, line: 1, baseType: !48, size: 64, align: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !61, line: 1, baseType: !146, size: 64, align: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !61, line: 1, baseType: !148, size: 64, align: 64, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !61, line: 1, size: 320, align: 8, elements: !150)
!150 = !{!151, !152, !153}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !61, line: 1, baseType: !146, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !61, line: 1, baseType: !146, size: 64, align: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !61, line: 1, baseType: !154, size: 192, align: 64, offset: 128)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !41, size: 192, align: 8, elements: !155)
!155 = !{!156, !52, !53}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !61, line: 1, size: 320, align: 8, elements: !159)
!159 = !{!151, !152, !160, !161, !162}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !61, line: 1, baseType: !135, size: 64, align: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !61, line: 1, baseType: !135, size: 64, align: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !61, line: 1, baseType: !135, size: 64, align: 64, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !61, line: 1, baseType: !135, size: 64, align: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Open", file: !41, line: 8, baseType: !165, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!168, !135, !60}
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{File,error}", file: !41, size: 256, align: 8, elements: !169)
!169 = !{!170, !294}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !41, line: 8, baseType: !171, size: 128, align: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !7, line: 8, size: 128, align: 8, elements: !172)
!172 = !{!173, !277}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 8, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,int)struct{struct{*FileInfo,int,int},error},*func(*void,int64,int)struct{int64,error},*func(*void)struct{FileInfo,error}}", file: !41, size: 384, align: 8, elements: !176)
!176 = !{!117, !177, !193, !201, !279, !287}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !41, line: 8, baseType: !178, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!181, !135}
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !61, line: 1, size: 128, align: 8, elements: !182)
!182 = !{!183, !192}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !61, line: 1, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !41, size: 128, align: 8, elements: !186)
!186 = !{!187, !188}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !41, line: 1, baseType: !118, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !41, line: 1, baseType: !189, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!60, !135}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !61, line: 1, baseType: !135, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !41, line: 8, baseType: !194, size: 64, align: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!197, !135, !70}
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !41, size: 192, align: 8, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !41, line: 5, baseType: !32, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !41, line: 5, baseType: !181, size: 128, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Readdir", file: !41, line: 8, baseType: !202, size: 64, align: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!205, !135, !32}
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*FileInfo,int,int},error}", file: !41, size: 320, align: 8, elements: !206)
!206 = !{!207, !278}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !41, line: 8, baseType: !208, size: 192, align: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*FileInfo,int,int}", file: !41, size: 192, align: 8, elements: !209)
!209 = !{!210, !52, !53}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileInfo", file: !7, line: 6, size: 128, align: 8, elements: !213)
!213 = !{!214, !277}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 6, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)bool,*func(*void)Time,*func(*void)FileMode,*func(*void)string,*func(*void)int64,*func(*void)struct{*_type,*void}}", file: !41, size: 448, align: 8, elements: !217)
!217 = !{!218, !219, !223, !260, !265, !266, !270}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !41, line: 6, baseType: !118, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "IsDir", file: !41, line: 6, baseType: !220, size: 64, align: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!8, !135}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ModTime", file: !41, line: 6, baseType: !224, size: 64, align: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!227, !135}
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 6, size: 192, align: 8, elements: !228)
!228 = !{!229, !230, !232}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 6, baseType: !27, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 6, baseType: !231, size: 64, align: 64, offset: 64)
!231 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 6, baseType: !233, size: 64, align: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 6, size: 704, align: 8, elements: !235)
!235 = !{!236, !237, !246, !257, !258, !259}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 6, baseType: !60, size: 128, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 6, baseType: !238, size: 192, align: 64, offset: 128)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !41, size: 192, align: 8, elements: !239)
!239 = !{!240, !52, !53}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 6, size: 256, align: 8, elements: !243)
!243 = !{!236, !244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 6, baseType: !32, size: 64, align: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 6, baseType: !8, size: 8, align: 8, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 6, baseType: !247, size: 192, align: 64, offset: 320)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !41, size: 192, align: 8, elements: !248)
!248 = !{!249, !52, !53}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !41, line: 1, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 6, size: 128, align: 8, elements: !252)
!252 = !{!253, !254, !255, !256}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 6, baseType: !231, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 6, baseType: !49, size: 8, align: 8, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 6, baseType: !8, size: 8, align: 8, offset: 72)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 6, baseType: !8, size: 8, align: 8, offset: 80)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 6, baseType: !231, size: 64, align: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 6, baseType: !231, size: 64, align: 64, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 6, baseType: !241, size: 64, align: 64, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", file: !41, line: 6, baseType: !261, size: 64, align: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!264, !135}
!264 = !DIBasicType(name: "FileMode", size: 32, encoding: DW_ATE_unsigned)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !41, line: 6, baseType: !189, size: 64, align: 64, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !41, line: 6, baseType: !267, size: 64, align: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!231, !135}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Sys", file: !41, line: 6, baseType: !271, size: 64, align: 64, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !135}
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !41, size: 128, align: 8, elements: !275)
!275 = !{!187, !276}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !41, line: 1, baseType: !135, size: 64, align: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !135, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !41, line: 8, baseType: !181, size: 128, align: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Seek", file: !41, line: 8, baseType: !280, size: 64, align: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!283, !135, !231, !32}
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !41, size: 192, align: 8, elements: !284)
!284 = !{!285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !41, line: 8, baseType: !231, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !41, line: 8, baseType: !181, size: 128, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Stat", file: !41, line: 8, baseType: !288, size: 64, align: 64, offset: 320)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!291, !135}
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{FileInfo,error}", file: !41, size: 256, align: 8, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !41, line: 8, baseType: !212, size: 128, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !41, line: 8, baseType: !181, size: 128, align: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !7, line: 8, baseType: !60, size: 128, align: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "node", file: !7, line: 8, baseType: !297, size: 128, align: 64, offset: 320)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !7, line: 8, size: 128, align: 8, elements: !298)
!298 = !{!299, !277}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 8, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)SourcePosition}", file: !41, size: 128, align: 8, elements: !302)
!302 = !{!117, !303}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Pos", file: !41, line: 8, baseType: !304, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!307, !135}
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourcePosition", file: !7, line: 8, size: 320, align: 8, elements: !308)
!308 = !{!309, !310, !311, !312}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "LineNum", file: !7, line: 8, baseType: !32, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ColNum", file: !7, line: 8, baseType: !32, size: 64, align: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "TokenLength", file: !7, line: 8, baseType: !32, size: 64, align: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Filename", file: !7, line: 8, baseType: !60, size: 128, align: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "indentLevel", file: !7, line: 8, baseType: !32, size: 64, align: 64, offset: 448)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "newline", file: !7, line: 8, baseType: !8, size: 8, align: 8, offset: 512)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", file: !7, line: 8, baseType: !316, size: 64, align: 64, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", file: !7, line: 8, size: 832, align: 8, elements: !318)
!318 = !{!319, !320, !321, !325}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 8, baseType: !70, size: 192, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "off", file: !7, line: 8, baseType: !32, size: 64, align: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "bootstrap", file: !7, line: 8, baseType: !322, size: 512, align: 8, offset: 256)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 512, align: 1, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "lastRead", file: !7, line: 8, baseType: !326, size: 8, align: 8, offset: 768)
!326 = !DIBasicType(name: ".bytes.readOp", size: 8, encoding: DW_ATE_signed)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tempvarIndex", file: !7, line: 8, baseType: !32, size: 64, align: 64, offset: 640)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "mixins", file: !7, line: 8, baseType: !329, size: 64, align: 64, offset: 704)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !61, line: 1, size: 384, align: 8, elements: !331)
!331 = !{!332, !333, !334, !335, !337, !338, !339, !340, !341}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !61, line: 1, baseType: !32, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !61, line: 1, baseType: !49, size: 8, align: 8, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !61, line: 1, baseType: !49, size: 8, align: 8, offset: 72)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !61, line: 1, baseType: !336, size: 16, align: 16, offset: 80)
!336 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !61, line: 1, baseType: !29, size: 32, align: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !61, line: 1, baseType: !135, size: 64, align: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !61, line: 1, baseType: !135, size: 64, align: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !61, line: 1, baseType: !37, size: 64, align: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !61, line: 1, baseType: !135, size: 64, align: 64, offset: 320)
!342 = !DILocation(line: 32, column: 2, scope: !91)
!343 = !DILocation(line: 33, column: 5, scope: !93)
!344 = !DILocation(line: 33, column: 20, scope: !93)
!345 = !DILocation(line: 33, column: 18, scope: !93)
!346 = !DILocation(line: 34, column: 5, scope: !93)
!347 = !DILocation(line: 34, column: 20, scope: !93)
!348 = !DILocation(line: 34, column: 18, scope: !93)
!349 = !DILocation(line: 36, column: 12, scope: !93)
!350 = !DILocalVariable(name: "err", scope: !93, file: !7, line: 36, type: !181)
!351 = !DILocation(line: 36, column: 2, scope: !91)
!352 = !DILocation(line: 38, column: 9, scope: !93)
!353 = !DILocation(line: 43, column: 29, scope: !93)
!354 = !DILocation(line: 43, column: 11, scope: !93)
!355 = !DILocation(line: 45, column: 9, scope: !93)
!356 = !DILocation(line: 39, column: 27, scope: !93)
!357 = !DILocation(line: 39, column: 7, scope: !93)
!358 = !DILocation(line: 39, column: 19, scope: !93)
!359 = !DILocation(line: 40, column: 6, scope: !93)
!360 = !DILocation(line: 46, column: 27, scope: !93)
!361 = !DILocation(line: 46, column: 7, scope: !93)
!362 = !DILocation(line: 46, column: 19, scope: !93)
!363 = !DILocation(line: 47, column: 6, scope: !93)
!364 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..hash", scope: null, file: !61, line: 1, type: !133, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!365 = !DILocalVariable(name: "key", arg: 1, scope: !364, file: !61, line: 1, type: !135)
!366 = !DILocation(line: 1, column: 1, scope: !364)
!367 = !DILocalVariable(name: "seed", arg: 2, scope: !364, file: !61, line: 1, type: !37)
!368 = !DILocalVariable(name: "$ret14", scope: !364, file: !61, line: 1, type: !37)
!369 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", scope: null, file: !61, line: 1, type: !142, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!370 = !DILocalVariable(name: "key1", arg: 1, scope: !369, file: !61, line: 1, type: !135)
!371 = !DILocation(line: 1, column: 1, scope: !369)
!372 = !DILocalVariable(name: "key2", arg: 2, scope: !369, file: !61, line: 1, type: !135)
!373 = !DILocalVariable(name: "$ret15", scope: !369, file: !61, line: 1, type: !8)
	.text
	.file	"gomodule"

	.section ".go_export","e",@progbits
	.ascii "v2;\n"
	.ascii "package "
	.ascii "main"
	.ascii ";\n"
	.ascii "pkgpath "
	.ascii "main"
	.ascii ";\n"
	.ascii "import "
	.ascii "flag"
	.ascii " "
	.ascii "flag"
	.ascii " \""
	.ascii "flag"
	.ascii "\";\n"
	.ascii "import "
	.ascii "fmt"
	.ascii " "
	.ascii "fmt"
	.ascii " \""
	.ascii "fmt"
	.ascii "\";\n"
	.ascii "import "
	.ascii "amber"
	.ascii " "
	.ascii "github.com/eknkc/amber"
	.ascii " \""
	.ascii "github.com/eknkc/amber"
	.ascii "\";\n"
	.ascii "import "
	.ascii "os"
	.ascii " "
	.ascii "os"
	.ascii " \""
	.ascii "os"
	.ascii "\";\n"
	.ascii "import "
	.ascii "runtime"
	.ascii " "
	.ascii "runtime"
	.ascii " \""
	.ascii "runtime"
	.ascii "\";\n"
	.ascii "init"
	.ascii " "
	.ascii "bufio"
	.ascii " "
	.ascii "bufio..import"
	.ascii " "
	.ascii "bytes"
	.ascii " "
	.ascii "bytes..import"
	.ascii " "
	.ascii "flate"
	.ascii " "
	.ascii "compress_flate..import"
	.ascii " "
	.ascii "gzip"
	.ascii " "
	.ascii "compress_gzip..import"
	.ascii " "
	.ascii "context"
	.ascii " "
	.ascii "context..import"
	.ascii " "
	.ascii "crypto"
	.ascii " "
	.ascii "crypto..import"
	.ascii " "
	.ascii "cipher"
	.ascii " "
	.ascii "crypto_cipher..import"
	.ascii " "
	.ascii "des"
	.ascii " "
	.ascii "crypto_des..import"
	.ascii " "
	.ascii "dsa"
	.ascii " "
	.ascii "crypto_dsa..import"
	.ascii " "
	.ascii "ecdsa"
	.ascii " "
