; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22parser\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22list\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22container/list\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22container/list\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22fmt\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./nodes.go", directory: "/home/wangcong/go_path/src/github.com/eknkc/amber/parser")
!3 = !{}
!4 = !{!5, !19, !38, !40, !262, !264, !266, !268, !270, !272, !274, !276, !278, !280, !282, !284, !286, !288, !290, !292, !294}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.selfClosingTags", linkageName: "command_line_arguments.selfClosingTags", scope: !1, file: !7, line: 8, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "nodes.go", directory: ".")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1280, align: 8, elements: !17)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !10, line: 1, size: 128, align: 8, elements: !11)
!10 = !DIFile(filename: "<built-in>", directory: "")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !10, line: 1, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !10, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!17 = !{!18}
!18 = !DISubrange(count: 10)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "command_line_arguments.doctypes", linkageName: "command_line_arguments.doctypes", scope: !1, file: !7, line: 21, type: !21, isLocal: true, isDefinition: true)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !10, line: 1, size: 384, align: 8, elements: !23)
!23 = !{!24, !25, !26, !27, !29, !31, !34, !35, !37}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !10, line: 1, baseType: !16, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 72)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !10, line: 1, baseType: !28, size: 16, align: 16, offset: 80)
!28 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !10, line: 1, baseType: !30, size: 32, align: 32, offset: 96)
!30 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !10, line: 1, baseType: !32, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIBasicType(name: "void")
!34 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !10, line: 1, baseType: !32, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !10, line: 1, baseType: !36, size: 64, align: 64, offset: 256)
!36 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !10, line: 1, baseType: !32, size: 64, align: 64, offset: 320)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !10, line: 1, type: !30, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "command_line_arguments.rgxIndent", linkageName: "command_line_arguments.rgxIndent", scope: !1, file: !42, line: 223, type: !43, isLocal: true, isDefinition: true)
!42 = !DIFile(filename: "scanner.go", directory: ".")
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "Regexp", file: !7, line: 4, size: 1280, align: 8, elements: !45)
!45 = !{!46, !111, !116}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "regexpRO", file: !7, line: 4, baseType: !47, size: 1024, align: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.regexpRO", file: !7, line: 4, size: 1024, align: 8, elements: !48)
!48 = !{!49, !50, !76, !93, !94, !98, !100, !101, !102, !104, !105, !110}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "expr", file: !7, line: 4, baseType: !9, size: 128, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "prog", file: !7, line: 4, baseType: !51, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Prog", file: !7, line: 4, size: 320, align: 8, elements: !53)
!53 = !{!54, !74, !75}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Inst", file: !7, line: 4, baseType: !55, size: 192, align: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Inst,int,int}", file: !56, size: 192, align: 8, elements: !57)
!56 = !DIFile(filename: "", directory: "")
!57 = !{!58, !72, !73}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !56, line: 1, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inst", file: !7, line: 4, size: 320, align: 8, elements: !61)
!61 = !{!62, !64, !65, !66}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "Op", file: !7, line: 4, baseType: !63, size: 8, align: 8)
!63 = !DIBasicType(name: "InstOp", size: 8, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !7, line: 4, baseType: !30, size: 32, align: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Arg", file: !7, line: 4, baseType: !30, size: 32, align: 32, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Rune", file: !7, line: 4, baseType: !67, size: 192, align: 64, offset: 128)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int32,int,int}", file: !56, size: 192, align: 8, elements: !68)
!68 = !{!69, !72, !73}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !56, line: 1, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !56, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !56, line: 1, baseType: !16, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Start", file: !7, line: 4, baseType: !16, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "NumCap", file: !7, line: 4, baseType: !16, size: 64, align: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "onepass", file: !7, line: 4, baseType: !77, size: 64, align: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.onePassProg", file: !7, line: 4, size: 320, align: 8, elements: !79)
!79 = !{!80, !74, !75}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Inst", file: !7, line: 4, baseType: !81, size: 192, align: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.regexp.onePassInst,int,int}", file: !56, size: 192, align: 8, elements: !82)
!82 = !{!83, !72, !73}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !56, line: 1, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.onePassInst", file: !7, line: 4, size: 512, align: 8, elements: !86)
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Inst", file: !7, line: 4, baseType: !60, size: 320, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !7, line: 4, baseType: !89, size: 192, align: 64, offset: 320)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint32,int,int}", file: !56, size: 192, align: 8, elements: !90)
!90 = !{!91, !72, !73}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !56, line: 1, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", file: !7, line: 4, baseType: !9, size: 128, align: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "prefixBytes", file: !7, line: 4, baseType: !95, size: 192, align: 64, offset: 384)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !56, size: 192, align: 8, elements: !96)
!96 = !{!97, !72, !73}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !56, line: 1, baseType: !13, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prefixComplete", file: !7, line: 4, baseType: !99, size: 8, align: 8, offset: 576)
!99 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "prefixRune", file: !7, line: 4, baseType: !71, size: 32, align: 32, offset: 608)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "prefixEnd", file: !7, line: 4, baseType: !30, size: 32, align: 32, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "cond", file: !7, line: 4, baseType: !103, size: 8, align: 8, offset: 672)
!103 = !DIBasicType(name: "EmptyOp", size: 8, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "numSubexp", file: !7, line: 4, baseType: !16, size: 64, align: 64, offset: 704)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "subexpNames", file: !7, line: 4, baseType: !106, size: 192, align: 64, offset: 768)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !56, size: 192, align: 8, elements: !107)
!107 = !{!108, !72, !73}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !56, line: 1, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "longest", file: !7, line: 4, baseType: !99, size: 8, align: 8, offset: 960)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !7, line: 4, baseType: !112, size: 64, align: 32, offset: 1024)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 4, size: 64, align: 8, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 4, baseType: !71, size: 32, align: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 4, baseType: !30, size: 32, align: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "machine", file: !7, line: 4, baseType: !117, size: 192, align: 64, offset: 1088)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**.regexp.machine,int,int}", file: !56, size: 192, align: 8, elements: !118)
!118 = !{!119, !72, !73}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !56, line: 1, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.machine", file: !7, line: 4, size: 2112, align: 8, elements: !123)
!123 = !{!124, !125, !126, !127, !128, !150, !167, !168, !173, !174, !175, !179, !183}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "re", file: !7, line: 4, baseType: !32, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !7, line: 4, baseType: !51, size: 64, align: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "op", file: !7, line: 4, baseType: !77, size: 64, align: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "maxBitStateLen", file: !7, line: 4, baseType: !16, size: 64, align: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !7, line: 4, baseType: !129, size: 64, align: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.bitState", file: !7, line: 4, size: 704, align: 8, elements: !131)
!131 = !{!132, !133, !134, !139, !149}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "prog", file: !7, line: 4, baseType: !51, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "end", file: !7, line: 4, baseType: !16, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "cap", file: !7, line: 4, baseType: !135, size: 192, align: 64, offset: 128)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !56, size: 192, align: 8, elements: !136)
!136 = !{!137, !72, !73}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !56, line: 1, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", file: !7, line: 4, baseType: !140, size: 192, align: 64, offset: 320)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.regexp.job,int,int}", file: !56, size: 192, align: 8, elements: !141)
!141 = !{!142, !72, !73}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !56, line: 1, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.job", file: !7, line: 4, size: 128, align: 8, elements: !145)
!145 = !{!146, !147, !148}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !7, line: 4, baseType: !30, size: 32, align: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !7, line: 4, baseType: !99, size: 8, align: 8, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pos", file: !7, line: 4, baseType: !16, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "visited", file: !7, line: 4, baseType: !89, size: 192, align: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "q0", file: !7, line: 4, baseType: !151, size: 384, align: 64, offset: 320)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.queue", file: !7, line: 4, size: 384, align: 8, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "sparse", file: !7, line: 4, baseType: !89, size: 192, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "dense", file: !7, line: 4, baseType: !155, size: 192, align: 64, offset: 192)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.regexp.entry,int,int}", file: !56, size: 192, align: 8, elements: !156)
!156 = !{!157, !72, !73}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !56, line: 1, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.entry", file: !7, line: 4, size: 128, align: 8, elements: !160)
!160 = !{!146, !161}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "t", file: !7, line: 4, baseType: !162, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.thread", file: !7, line: 4, size: 256, align: 8, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "inst", file: !7, line: 4, baseType: !59, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "cap", file: !7, line: 4, baseType: !135, size: 192, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "q1", file: !7, line: 4, baseType: !151, size: 384, align: 64, offset: 704)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "pool", file: !7, line: 4, baseType: !169, size: 192, align: 64, offset: 1088)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**.regexp.thread,int,int}", file: !56, size: 192, align: 8, elements: !170)
!170 = !{!171, !72, !73}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !56, line: 1, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "matched", file: !7, line: 4, baseType: !99, size: 8, align: 8, offset: 1280)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "matchcap", file: !7, line: 4, baseType: !135, size: 192, align: 64, offset: 1344)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "inputBytes", file: !7, line: 4, baseType: !176, size: 192, align: 64, offset: 1536)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.inputBytes", file: !7, line: 4, size: 192, align: 8, elements: !177)
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "str", file: !7, line: 4, baseType: !95, size: 192, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "inputString", file: !7, line: 4, baseType: !180, size: 128, align: 64, offset: 1728)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.inputString", file: !7, line: 4, size: 128, align: 8, elements: !181)
!181 = !{!182}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "str", file: !7, line: 4, baseType: !9, size: 128, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "inputReader", file: !7, line: 4, baseType: !184, size: 256, align: 64, offset: 1856)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.inputReader", file: !7, line: 4, size: 256, align: 8, elements: !185)
!185 = !{!186, !260, !261}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !7, line: 4, baseType: !187, size: 128, align: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "RuneReader", file: !7, line: 4, size: 128, align: 8, elements: !188)
!188 = !{!189, !259}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 4, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{int32,int,error}}", file: !56, size: 128, align: 8, elements: !192)
!192 = !{!193, !238}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !56, line: 4, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !10, line: 1, size: 576, align: 8, elements: !196)
!196 = !{!197, !198, !199, !200, !201, !202, !203, !211, !219, !220, !221, !237}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !10, line: 1, baseType: !36, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !10, line: 1, baseType: !36, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !10, line: 1, baseType: !30, size: 32, align: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 168)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 176)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !10, line: 1, baseType: !204, size: 64, align: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 1, size: 64, align: 8, elements: !206)
!206 = !{!207}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 1, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!36, !32, !36}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !10, line: 1, baseType: !212, size: 64, align: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 1, size: 64, align: 8, elements: !214)
!214 = !{!215}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 1, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!99, !32, !32}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !10, line: 1, baseType: !13, size: 64, align: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !10, line: 1, baseType: !109, size: 64, align: 64, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !10, line: 1, baseType: !222, size: 64, align: 64, offset: 448)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !10, line: 1, size: 320, align: 8, elements: !224)
!224 = !{!225, !226, !227}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !10, line: 1, baseType: !109, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !10, line: 1, baseType: !109, size: 64, align: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !10, line: 1, baseType: !228, size: 192, align: 64, offset: 128)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !56, size: 192, align: 8, elements: !229)
!229 = !{!230, !72, !73}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !56, line: 1, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !10, line: 1, size: 320, align: 8, elements: !233)
!233 = !{!225, !226, !234, !235, !236}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !10, line: 1, baseType: !32, size: 64, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !10, line: 1, baseType: !32, size: 64, align: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !10, line: 1, baseType: !32, size: 64, align: 64, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !10, line: 1, baseType: !32, size: 64, align: 64, offset: 512)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ReadRune", file: !56, line: 4, baseType: !239, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!242, !32}
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int32,int,error}", file: !56, size: 256, align: 8, elements: !243)
!243 = !{!244, !245, !246}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !56, line: 4, baseType: !71, size: 32, align: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !56, line: 4, baseType: !16, size: 64, align: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !56, line: 4, baseType: !247, size: 128, align: 64, offset: 128)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !10, line: 1, size: 128, align: 8, elements: !248)
!248 = !{!249, !258}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 1, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !56, size: 128, align: 8, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !56, line: 1, baseType: !194, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !56, line: 1, baseType: !255, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!9, !32}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !32, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !32, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "atEOT", file: !7, line: 4, baseType: !99, size: 8, align: 8, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pos", file: !7, line: 4, baseType: !16, size: 64, align: 64, offset: 192)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "command_line_arguments.rgxDoctype", linkageName: "command_line_arguments.rgxDoctype", scope: !1, file: !42, line: 269, type: !43, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "command_line_arguments.rgxIf", linkageName: "command_line_arguments.rgxIf", scope: !1, file: !42, line: 284, type: !43, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "command_line_arguments.rgxElse", linkageName: "command_line_arguments.rgxElse", scope: !1, file: !42, line: 285, type: !43, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "command_line_arguments.rgxEach", linkageName: "command_line_arguments.rgxEach", scope: !1, file: !42, line: 301, type: !43, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "command_line_arguments.rgxAssignment", linkageName: "command_line_arguments.rgxAssignment", scope: !1, file: !42, line: 312, type: !43, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "command_line_arguments.rgxComment", linkageName: "command_line_arguments.rgxComment", scope: !1, file: !42, line: 323, type: !43, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "command_line_arguments.rgxId", linkageName: "command_line_arguments.rgxId", scope: !1, file: !42, line: 339, type: !43, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "command_line_arguments.rgxClassName", linkageName: "command_line_arguments.rgxClassName", scope: !1, file: !42, line: 350, type: !43, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "command_line_arguments.rgxAttribute", linkageName: "command_line_arguments.rgxAttribute", scope: !1, file: !42, line: 361, type: !43, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "command_line_arguments.rgxImport", linkageName: "command_line_arguments.rgxImport", scope: !1, file: !42, line: 377, type: !43, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "command_line_arguments.rgxExtends", linkageName: "command_line_arguments.rgxExtends", scope: !1, file: !42, line: 388, type: !43, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "command_line_arguments.rgxBlock", linkageName: "command_line_arguments.rgxBlock", scope: !1, file: !42, line: 399, type: !43, isLocal: true, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "command_line_arguments.rgxTag", linkageName: "command_line_arguments.rgxTag", scope: !1, file: !42, line: 410, type: !43, isLocal: true, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "command_line_arguments.rgxMixin", linkageName: "command_line_arguments.rgxMixin", scope: !1, file: !42, line: 421, type: !43, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "command_line_arguments.rgxMixinCall", linkageName: "command_line_arguments.rgxMixinCall", scope: !1, file: !42, line: 432, type: !43, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "command_line_arguments.rgxText", linkageName: "command_line_arguments.rgxText", scope: !1, file: !42, line: 443, type: !43, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "io.EOF", linkageName: "io.EOF", scope: !1, file: !296, line: 6, type: !247, isLocal: false, isDefinition: true)
!296 = !DIFile(filename: "parser.go", directory: ".")
!297 = distinct !DISubprogram(name: "parser.command_line_arguments..import", linkageName: "command_line_arguments..import", scope: null, file: !7, line: 1, type: !298, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!298 = !DISubroutineType(types: !299)
!299 = !{!33}
!300 = !DILocation(line: 1, column: 1, scope: !301)
!301 = !DILexicalBlockFile(scope: !297, file: !10, discriminator: 0)
!302 = !DILocation(line: 21, column: 16, scope: !303)
!303 = !DILexicalBlockFile(scope: !297, file: !7, discriminator: 0)
!304 = !DILocation(line: 21, column: 5, scope: !303)
!305 = !DILocation(line: 223, column: 24, scope: !306)
!306 = !DILexicalBlockFile(scope: !297, file: !42, discriminator: 0)
!307 = !DILocation(line: 223, column: 5, scope: !306)
!308 = !DILocation(line: 269, column: 25, scope: !306)
!309 = !DILocation(line: 269, column: 5, scope: !306)
!310 = !DILocation(line: 284, column: 20, scope: !306)
!311 = !DILocation(line: 284, column: 5, scope: !306)
!312 = !DILocation(line: 285, column: 22, scope: !306)
!313 = !DILocation(line: 285, column: 5, scope: !306)
!314 = !DILocation(line: 301, column: 22, scope: !306)
!315 = !DILocation(line: 301, column: 5, scope: !306)
!316 = !DILocation(line: 312, column: 28, scope: !306)
!317 = !DILocation(line: 312, column: 5, scope: !306)
!318 = !DILocation(line: 323, column: 25, scope: !306)
!319 = !DILocation(line: 323, column: 5, scope: !306)
!320 = !DILocation(line: 339, column: 20, scope: !306)
!321 = !DILocation(line: 339, column: 5, scope: !306)
!322 = !DILocation(line: 350, column: 27, scope: !306)
!323 = !DILocation(line: 350, column: 5, scope: !306)
!324 = !DILocation(line: 361, column: 27, scope: !306)
!325 = !DILocation(line: 361, column: 5, scope: !306)
!326 = !DILocation(line: 377, column: 24, scope: !306)
!327 = !DILocation(line: 377, column: 5, scope: !306)
!328 = !DILocation(line: 388, column: 25, scope: !306)
!329 = !DILocation(line: 388, column: 5, scope: !306)
!330 = !DILocation(line: 399, column: 23, scope: !306)
!331 = !DILocation(line: 399, column: 5, scope: !306)
!332 = !DILocation(line: 410, column: 21, scope: !306)
!333 = !DILocation(line: 410, column: 5, scope: !306)
!334 = !DILocation(line: 421, column: 23, scope: !306)
!335 = !DILocation(line: 421, column: 5, scope: !306)
!336 = !DILocation(line: 432, column: 27, scope: !306)
!337 = !DILocation(line: 432, column: 5, scope: !306)
!338 = !DILocation(line: 443, column: 22, scope: !306)
!339 = !DILocation(line: 443, column: 5, scope: !306)
!340 = distinct !DISubprogram(name: "parser.command_line_arguments.SourcePosition..hash", linkageName: "command_line_arguments.command_line_arguments.SourcePosition..hash", scope: null, file: !10, line: 1, type: !209, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!341 = !DILocalVariable(name: "key", arg: 1, scope: !340, file: !10, line: 1, type: !32)
!342 = !DILocation(line: 1, column: 1, scope: !340)
!343 = !DILocalVariable(name: "seed", arg: 2, scope: !340, file: !10, line: 1, type: !36)
!344 = !DILocalVariable(name: "$ret80", scope: !340, file: !10, line: 1, type: !36)
!345 = distinct !DISubprogram(name: "parser.command_line_arguments.SourcePosition..eq", linkageName: "command_line_arguments.command_line_arguments.SourcePosition..eq", scope: null, file: !10, line: 1, type: !217, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!346 = !DILocalVariable(name: "key1", arg: 1, scope: !345, file: !10, line: 1, type: !32)
!347 = !DILocation(line: 1, column: 1, scope: !345)
!348 = !DILocalVariable(name: "key2", arg: 2, scope: !345, file: !10, line: 1, type: !32)
!349 = !DILocalVariable(name: "$ret81", scope: !345, file: !10, line: 1, type: !99)
!350 = distinct !DISubprogram(name: "parser.Pos..1command_line_arguments.SourcePosition", linkageName: "command_line_arguments.SourcePosition.Pos", scope: null, file: !7, line: 44, type: !351, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!351 = !DISubroutineType(types: !352)
!352 = !{!353, !359, !359}
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourcePosition", file: !7, line: 37, size: 320, align: 8, elements: !354)
!354 = !{!355, !356, !357, !358}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "LineNum", file: !7, line: 38, baseType: !16, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ColNum", file: !7, line: 39, baseType: !16, size: 64, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "TokenLength", file: !7, line: 40, baseType: !16, size: 64, align: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Filename", file: !7, line: 41, baseType: !9, size: 128, align: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!360 = !DILocalVariable(name: "s", arg: 1, scope: !350, file: !7, line: 44, type: !359)
!361 = !DILocation(line: 44, column: 1, scope: !350)
!362 = !DILocation(line: 45, column: 9, scope: !350)
!363 = !DILocation(line: 45, column: 2, scope: !350)
!364 = distinct !DISubprogram(name: "parser.command_line_arguments.Doctype..hash", linkageName: "command_line_arguments.command_line_arguments.Doctype..hash", scope: null, file: !10, line: 1, type: !209, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!365 = !DILocalVariable(name: "key", arg: 1, scope: !364, file: !10, line: 1, type: !32)
!366 = !DILocation(line: 1, column: 1, scope: !364)
!367 = !DILocalVariable(name: "seed", arg: 2, scope: !364, file: !10, line: 1, type: !36)
!368 = !DILocalVariable(name: "$ret82", scope: !364, file: !10, line: 1, type: !36)
!369 = distinct !DISubprogram(name: "parser.command_line_arguments.Doctype..eq", linkageName: "command_line_arguments.command_line_arguments.Doctype..eq", scope: null, file: !10, line: 1, type: !217, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!370 = !DILocalVariable(name: "key1", arg: 1, scope: !369, file: !10, line: 1, type: !32)
!371 = !DILocation(line: 1, column: 1, scope: !369)
!372 = !DILocalVariable(name: "key2", arg: 2, scope: !369, file: !10, line: 1, type: !32)
!373 = !DILocalVariable(name: "$ret83", scope: !369, file: !10, line: 1, type: !99)
!374 = distinct !DISubprogram(name: "parser.Pos..stub..1command_line_arguments.Doctype", linkageName: "command_line_arguments.Doctype.Pos..stub", scope: null, file: !7, line: 44, type: !375, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!375 = !DISubroutineType(types: !376)
!376 = !{!353, !377, !377}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "Doctype", file: !7, line: 48, size: 448, align: 8, elements: !379)
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "SourcePosition", file: !7, line: 49, baseType: !353, size: 320, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 50, baseType: !9, size: 128, align: 64, offset: 320)
!382 = !DILocalVariable(name: "$this0", arg: 1, scope: !374, file: !7, line: 44, type: !377)
!383 = !DILocation(line: 44, column: 29, scope: !374)
!384 = !DILocation(line: 48, column: 6, scope: !374)
!385 = !DILocation(line: 44, column: 1, scope: !350, inlinedAt: !386)
!386 = distinct !DILocation(line: 48, column: 6, scope: !374)
!387 = !DILocation(line: 45, column: 2, scope: !350, inlinedAt: !386)
!388 = distinct !DISubprogram(name: "parser.String..1command_line_arguments.Doctype", linkageName: "command_line_arguments.Doctype.String", scope: null, file: !7, line: 59, type: !389, isLocal: false, isDefinition: true, scopeLine: 59, isOptimized: false, unit: !1, retainedNodes: !3)
!389 = !DISubroutineType(types: !390)
!390 = !{!9, !377, !377}
!391 = !DILocalVariable(name: "d", arg: 1, scope: !388, file: !7, line: 59, type: !377)
!392 = !DILocation(line: 59, column: 1, scope: !388)
!393 = !DILocation(line: 60, column: 26, scope: !394)
!394 = distinct !DILexicalBlock(scope: !388, file: !7, line: 60, column: 2)
!395 = !DILocation(line: 60, column: 16, scope: !394)
!396 = !DILocation(line: 60, column: 24, scope: !394)
!397 = !DILocalVariable(name: "defined", scope: !394, file: !7, line: 60, type: !9)
!398 = !DILocation(line: 60, column: 5, scope: !388)
!399 = !DILocation(line: 60, column: 48, scope: !394)
!400 = !DILocalVariable(name: "$ret2", scope: !388, file: !7, line: 59, type: !9)
!401 = !DILocation(line: 59, column: 28, scope: !388)
!402 = !DILocation(line: 61, column: 3, scope: !394)
!403 = !DILocation(line: 64, column: 9, scope: !388)
!404 = !DILocation(line: 64, column: 2, scope: !388)
!405 = distinct !DISubprogram(name: "parser.command_line_arguments.Comment..hash", linkageName: "command_line_arguments.command_line_arguments.Comment..hash", scope: null, file: !10, line: 1, type: !209, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!406 = !DILocalVariable(name: "key", arg: 1, scope: !405, file: !10, line: 1, type: !32)
!407 = !DILocation(line: 1, column: 1, scope: !405)
!408 = !DILocalVariable(name: "seed", arg: 2, scope: !405, file: !10, line: 1, type: !36)
!409 = !DILocalVariable(name: "$ret84", scope: !405, file: !10, line: 1, type: !36)
!410 = distinct !DISubprogram(name: "parser.command_line_arguments.Comment..eq", linkageName: "command_line_arguments.command_line_arguments.Comment..eq", scope: null, file: !10, line: 1, type: !217, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!411 = !DILocalVariable(name: "key1", arg: 1, scope: !410, file: !10, line: 1, type: !32)
!412 = !DILocation(line: 1, column: 1, scope: !410)
!413 = !DILocalVariable(name: "key2", arg: 2, scope: !410, file: !10, line: 1, type: !32)
!414 = !DILocalVariable(name: "$ret85", scope: !410, file: !10, line: 1, type: !99)
!415 = distinct !DISubprogram(name: "parser.Pos..stub..1command_line_arguments.Comment", linkageName: "command_line_arguments.Comment.Pos..stub", scope: null, file: !7, line: 44, type: !416, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!416 = !DISubroutineType(types: !417)
!417 = !{!353, !418, !418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "Comment", file: !7, line: 67, size: 576, align: 8, elements: !420)
!420 = !{!421, !422, !423, !444}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "SourcePosition", file: !7, line: 68, baseType: !353, size: 320, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 69, baseType: !9, size: 128, align: 64, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Block", file: !7, line: 70, baseType: !424, size: 64, align: 64, offset: 448)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "Block", file: !7, line: 95, size: 512, align: 8, elements: !426)
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "SourcePosition", file: !7, line: 96, baseType: !353, size: 320, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "Children", file: !7, line: 97, baseType: !429, size: 192, align: 64, offset: 320)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Node,int,int}", file: !56, size: 192, align: 8, elements: !430)
!430 = !{!431, !72, !73}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !56, line: 1, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !7, line: 33, size: 128, align: 8, elements: !434)
!434 = !{!435, !259}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 33, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)SourcePosition}", file: !56, size: 128, align: 8, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !56, line: 33, baseType: !194, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Pos", file: !56, line: 33, baseType: !441, size: 64, align: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!353, !32}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Silent", file: !7, line: 71, baseType: !99, size: 8, align: 8, offset: 512)
!445 = !DILocalVariable(name: "$this1", arg: 1, scope: !415, file: !7, line: 44, type: !418)
!446 = !DILocation(line: 44, column: 29, scope: !415)
!447 = !DILocation(line: 67, column: 6, scope: !415)
!448 = !DILocation(line: 44, column: 1, scope: !350, inlinedAt: !449)
!449 = distinct !DILocation(line: 67, column: 6, scope: !415)
!450 = !DILocation(line: 45, column: 2, scope: !350, inlinedAt: !449)
!451 = distinct !DISubprogram(name: "parser.CanInline..1command_line_arguments.Block", linkageName: "command_line_arguments.Block.CanInline", scope: null, file: !7, line: 114, type: !452, isLocal: false, isDefinition: true, scopeLine: 114, isOptimized: false, unit: !1, retainedNodes: !3)
!452 = !DISubroutineType(types: !453)
!453 = !{!99, !424, !424}
!454 = !DILocalVariable(name: "b", arg: 1, scope: !451, file: !7, line: 114, type: !424)
!455 = !DILocation(line: 114, column: 1, scope: !451)
!456 = !DILocalVariable(name: "$ret6", scope: !451, file: !7, line: 114, type: !99)
!457 = !DILocation(line: 114, column: 29, scope: !451)
!458 = !DILocation(line: 115, column: 10, scope: !459)
!459 = distinct !DILexicalBlock(scope: !451, file: !7, line: 114, column: 1)
!460 = !DILocation(line: 115, column: 21, scope: !459)
!461 = !DILocation(line: 116, column: 3, scope: !459)
!462 = !DILocalVariable(name: "allText", scope: !459, file: !7, line: 119, type: !99)
!463 = !DILocation(line: 119, column: 2, scope: !451)
!464 = !DILocation(line: 121, column: 2, scope: !465)
!465 = distinct !DILexicalBlock(scope: !459, file: !7, line: 121, column: 2)
!466 = !DILocalVariable(name: "child", scope: !465, file: !7, line: 121, type: !433)
!467 = !DILocation(line: 121, column: 6, scope: !459)
!468 = !DILocalVariable(name: "txt", scope: !469, file: !7, line: 122, type: !470)
!469 = distinct !DILexicalBlock(scope: !465, file: !7, line: 122, column: 3)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "Text", file: !7, line: 82, size: 512, align: 8, elements: !472)
!472 = !{!473, !474, !475}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "SourcePosition", file: !7, line: 83, baseType: !353, size: 320, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 84, baseType: !9, size: 128, align: 64, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !7, line: 85, baseType: !99, size: 8, align: 8, offset: 448)
!476 = !DILocation(line: 122, column: 6, scope: !465)
!477 = !DILocalVariable(name: "ok", scope: !469, file: !7, line: 122, type: !99)
!478 = !DILocation(line: 122, column: 6, scope: !469)
!479 = !DILocation(line: 122, column: 32, scope: !469)
!480 = !DILocation(line: 122, column: 42, scope: !469)
!481 = !DILocation(line: 122, column: 3, scope: !469)
!482 = distinct !DISubprogram(name: "parser.Pos..stub..1command_line_arguments.Block", linkageName: "command_line_arguments.Block.Pos..stub", scope: null, file: !7, line: 44, type: !483, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!483 = !DISubroutineType(types: !484)
!484 = !{!353, !424, !424}
!485 = !DILocalVariable(name: "$this2", arg: 1, scope: !482, file: !7, line: 44, type: !424)
!486 = !DILocation(line: 44, column: 29, scope: !482)
!487 = !DILocation(line: 95, column: 6, scope: !482)
!488 = !DILocation(line: 44, column: 1, scope: !350, inlinedAt: !489)
!489 = distinct !DILocation(line: 95, column: 6, scope: !482)
!490 = !DILocation(line: 45, column: 2, scope: !350, inlinedAt: !489)
!491 = distinct !DISubprogram(name: "parser.push..1command_line_arguments.Block", linkageName: "command_line_arguments.Block.push", scope: null, file: !7, line: 106, type: !492, isLocal: false, isDefinition: true, scopeLine: 106, isOptimized: false, unit: !1, retainedNodes: !3)
!492 = !DISubroutineType(types: !493)
!493 = !{!33, !424, !424, !433}
!494 = !DILocalVariable(name: "b", arg: 1, scope: !491, file: !7, line: 106, type: !424)
!495 = !DILocation(line: 106, column: 1, scope: !491)
!496 = !DILocation(line: 107, column: 3, scope: !491)
!497 = !DILocation(line: 107, column: 15, scope: !491)
!498 = !DILocation(line: 107, column: 13, scope: !491)
!499 = distinct !DISubprogram(name: "parser.pushFront..1command_line_arguments.Block", linkageName: "command_line_arguments.Block.pushFront", scope: null, file: !7, line: 110, type: !492, isLocal: false, isDefinition: true, scopeLine: 110, isOptimized: false, unit: !1, retainedNodes: !3)
!500 = !DILocalVariable(name: "b", arg: 1, scope: !499, file: !7, line: 110, type: !424)
!501 = !DILocation(line: 110, column: 1, scope: !499)
!502 = !DILocalVariable(name: "node", arg: 2, scope: !499, file: !7, line: 110, type: !433)
!503 = !DILocation(line: 110, column: 27, scope: !499)
!504 = !DILocation(line: 111, column: 3, scope: !499)
!505 = !DILocation(line: 111, column: 22, scope: !499)
!506 = !DILocation(line: 111, column: 15, scope: !499)
!507 = !DILocation(line: 111, column: 13, scope: !499)
!508 = distinct !DISubprogram(name: "parser.command_line_arguments.Text..hash", linkageName: "command_line_arguments.command_line_arguments.Text..hash", scope: null, file: !10, line: 1, type: !209, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!509 = !DILocalVariable(name: "key", arg: 1, scope: !508, file: !10, line: 1, type: !32)
!510 = !DILocation(line: 1, column: 1, scope: !508)
!511 = !DILocalVariable(name: "seed", arg: 2, scope: !508, file: !10, line: 1, type: !36)
!512 = !DILocalVariable(name: "$ret86", scope: !508, file: !10, line: 1, type: !36)
!513 = distinct !DISubprogram(name: "parser.command_line_arguments.Text..eq", linkageName: "command_line_arguments.command_line_arguments.Text..eq", scope: null, file: !10, line: 1, type: !217, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!514 = !DILocalVariable(name: "key1", arg: 1, scope: !513, file: !10, line: 1, type: !32)
!515 = !DILocation(line: 1, column: 1, scope: !513)
!516 = !DILocalVariable(name: "key2", arg: 2, scope: !513, file: !10, line: 1, type: !32)
!517 = !DILocalVariable(name: "$ret87", scope: !513, file: !10, line: 1, type: !99)
!518 = distinct !DISubprogram(name: "parser.Pos..stub..1command_line_arguments.Text", linkageName: "command_line_arguments.Text.Pos..stub", scope: null, file: !7, line: 44, type: !519, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!519 = !DISubroutineType(types: !520)
!520 = !{!353, !470, !470}
!521 = !DILocalVariable(name: "$this3", arg: 1, scope: !518, file: !7, line: 44, type: !470)
!522 = !DILocation(line: 44, column: 29, scope: !518)
!523 = !DILocation(line: 82, column: 6, scope: !518)
!524 = !DILocation(line: 44, column: 1, scope: !350, inlinedAt: !525)
!525 = distinct !DILocation(line: 82, column: 6, scope: !518)
!526 = !DILocation(line: 45, column: 2, scope: !350, inlinedAt: !525)
!527 = distinct !DISubprogram(name: "parser.newBlock", scope: null, file: !7, line: 100, type: !528, isLocal: true, isDefinition: true, scopeLine: 100, isOptimized: false, unit: !1, retainedNodes: !3)
!528 = !DISubroutineType(types: !529)
!529 = !{!424}
!530 = !DILocalVariable(name: "$ret5", scope: !527, file: !7, line: 100, type: !424)
!531 = !DILocation(line: 100, column: 17, scope: !527)
!532 = !DILocation(line: 101, column: 11, scope: !533)
!533 = distinct !DILexicalBlock(scope: !527, file: !7, line: 100, column: 1)
!534 = !DILocalVariable(name: "block", scope: !533, file: !7, line: 101, type: !424)
!535 = !DILocation(line: 101, column: 2, scope: !527)
!536 = !DILocation(line: 102, column: 19, scope: !533)
!537 = !DILocation(line: 102, column: 7, scope: !533)
!538 = !DILocation(line: 102, column: 17, scope: !533)
!539 = !DILocation(line: 103, column: 2, scope: !533)
!540 = distinct !DISubprogram(name: "parser.CanInline..stub..1command_line_arguments.NamedBlock", linkageName: "command_line_arguments.NamedBlock.CanInline..stub", scope: null, file: !7, line: 114, type: !541, isLocal: false, isDefinition: true, scopeLine: 114, isOptimized: false, unit: !1, retainedNodes: !3)
!541 = !DISubroutineType(types: !542)
!542 = !{!99, !543, !543}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "NamedBlock", file: !7, line: 137, size: 704, align: 8, elements: !545)
!545 = !{!546, !547, !548}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Block", file: !7, line: 138, baseType: !425, size: 512, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !7, line: 139, baseType: !9, size: 128, align: 64, offset: 512)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Modifier", file: !7, line: 140, baseType: !16, size: 64, align: 64, offset: 640)
!549 = !DILocalVariable(name: "$this4", arg: 1, scope: !540, file: !7, line: 114, type: !543)
!550 = !DILocation(line: 114, column: 26, scope: !540)
!551 = !DILocalVariable(name: "$ret68", scope: !540, file: !7, line: 114, type: !99)
!552 = !DILocation(line: 114, column: 29, scope: !540)
!553 = !DILocation(line: 137, column: 6, scope: !540)
!554 = distinct !DISubprogram(name: "parser.Pos..stub..1command_line_arguments.NamedBlock", linkageName: "command_line_arguments.NamedBlock.Pos..stub", scope: null, file: !7, line: 44, type: !555, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!555 = !DISubroutineType(types: !556)
!556 = !{!353, !543, !543}
!557 = !DILocalVariable(name: "$this5", arg: 1, scope: !554, file: !7, line: 44, type: !543)
!558 = !DILocation(line: 44, column: 29, scope: !554)
!559 = !DILocation(line: 137, column: 6, scope: !554)
!560 = !DILocation(line: 44, column: 1, scope: !350, inlinedAt: !561)
!561 = distinct !DILocation(line: 137, column: 6, scope: !554)
!562 = !DILocation(line: 45, column: 2, scope: !350, inlinedAt: !561)
!563 = distinct !DISubprogram(name: "parser.push..stub..1command_line_arguments.NamedBlock", linkageName: "command_line_arguments.NamedBlock.push..stub", scope: null, file: !7, line: 106, type: !564, isLocal: false, isDefinition: true, scopeLine: 106, isOptimized: false, unit: !1, retainedNodes: !3)
!564 = !DISubroutineType(types: !565)
!565 = !{!33, !543, !543, !433}
!566 = !DILocalVariable(name: "$this8", arg: 1, scope: !563, file: !7, line: 106, type: !543)
!567 = !DILocation(line: 106, column: 21, scope: !563)
!568 = !DILocalVariable(name: "$p9", arg: 2, scope: !563, file: !7, line: 106, type: !433)
!569 = !DILocation(line: 106, column: 22, scope: !563)
!570 = !DILocation(line: 137, column: 6, scope: !563)
!571 = distinct !DISubprogram(name: "parser.pushFront..stub..1command_line_arguments.NamedBlock", linkageName: "command_line_arguments.NamedBlock.pushFront..stub", scope: null, file: !7, line: 110, type: !564, isLocal: false, isDefinition: true, scopeLine: 110, isOptimized: false, unit: !1, retainedNodes: !3)
!572 = !DILocalVariable(name: "$this6", arg: 1, scope: !571, file: !7, line: 110, type: !543)
!573 = !DILocation(line: 110, column: 26, scope: !571)
!574 = !DILocalVariable(name: "$p7", arg: 2, scope: !571, file: !7, line: 110, type: !433)
!575 = !DILocation(line: 110, column: 27, scope: !571)
!576 = !DILocation(line: 137, column: 6, scope: !571)
!577 = distinct !DISubprogram(name: "parser.command_line_arguments.Attribute..hash", linkageName: "command_line_arguments.command_line_arguments.Attribute..hash", scope: null, file: !10, line: 1, type: !209, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!578 = !DILocalVariable(name: "key", arg: 1, scope: !577, file: !10, line: 1, type: !32)
!579 = !DILocation(line: 1, column: 1, scope: !577)
!580 = !DILocalVariable(name: "seed", arg: 2, scope: !577, file: !10, line: 1, type: !36)
!581 = !DILocalVariable(name: "$ret88", scope: !577, file: !10, line: 1, type: !36)
!582 = distinct !DISubprogram(name: "parser.command_line_arguments.Attribute..eq", linkageName: "command_line_arguments.command_line_arguments.Attribute..eq", scope: null, file: !10, line: 1, type: !217, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!583 = !DILocalVariable(name: "key1", arg: 1, scope: !582, file: !10, line: 1, type: !32)
!584 = !DILocation(line: 1, column: 1, scope: !582)
!585 = !DILocalVariable(name: "key2", arg: 2, scope: !582, file: !10, line: 1, type: !32)
!586 = !DILocalVariable(name: "$ret89", scope: !582, file: !10, line: 1, type: !99)
!587 = distinct !DISubprogram(name: "parser.Pos..stub..1command_line_arguments.Attribute", linkageName: "command_line_arguments.Attribute.Pos..stub", scope: null, file: !7, line: 44, type: !588, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!588 = !DISubroutineType(types: !589)
!589 = !{!353, !590, !590}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "Attribute", file: !7, line: 151, size: 768, align: 8, elements: !592)
!592 = !{!593, !594, !595, !596, !597}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "SourcePosition", file: !7, line: 152, baseType: !353, size: 320, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !7, line: 153, baseType: !9, size: 128, align: 64, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 154, baseType: !9, size: 128, align: 64, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "IsRaw", file: !7, line: 155, baseType: !99, size: 8, align: 8, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Condition", file: !7, line: 156, baseType: !9, size: 128, align: 64, offset: 640)
!598 = !DILocalVariable(name: "$this10", arg: 1, scope: !587, file: !7, line: 44, type: !590)
!599 = !DILocation(line: 44, column: 29, scope: !587)
!600 = !DILocation(line: 151, column: 6, scope: !587)
!601 = !DILocation(line: 44, column: 1, scope: !350, inlinedAt: !602)
!602 = distinct !DILocation(line: 151, column: 6, scope: !587)
!603 = !DILocation(line: 45, column: 2, scope: !350, inlinedAt: !602)
!604 = distinct !DISubprogram(name: "parser.IsRawText..1command_line_arguments.Tag", linkageName: "command_line_arguments.Tag.IsRawText", scope: null, file: !7, line: 187, type: !605, isLocal: false, isDefinition: true, scopeLine: 187, isOptimized: false, unit: !1, retainedNodes: !3)
!605 = !DISubroutineType(types: !606)
!606 = !{!99, !607, !607}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tag", file: !7, line: 159, size: 768, align: 8, elements: !609)
!609 = !{!610, !611, !612, !613, !614}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "SourcePosition", file: !7, line: 160, baseType: !353, size: 320, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "Block", file: !7, line: 161, baseType: !424, size: 64, align: 64, offset: 320)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !7, line: 162, baseType: !9, size: 128, align: 64, offset: 384)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "IsInterpolated", file: !7, line: 163, baseType: !99, size: 8, align: 8, offset: 512)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", file: !7, line: 164, baseType: !615, size: 192, align: 64, offset: 576)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Attribute,int,int}", file: !56, size: 192, align: 8, elements: !616)
!616 = !{!617, !72, !73}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !56, line: 1, baseType: !590, size: 64, align: 64)
!618 = !DILocalVariable(name: "t", arg: 1, scope: !604, file: !7, line: 187, type: !607)
!619 = !DILocation(line: 187, column: 1, scope: !604)
!620 = !DILocalVariable(name: "$ret10", scope: !604, file: !7, line: 187, type: !99)
!621 = !DILocation(line: 187, column: 27, scope: !604)
!622 = !DILocation(line: 188, column: 10, scope: !604)
!623 = !DILocation(line: 188, column: 16, scope: !604)
!624 = !DILocation(line: 188, column: 2, scope: !604)
!625 = !DILocation(line: 188, column: 37, scope: !604)
!626 = distinct !DISubprogram(name: "parser.IsSelfClosing..1command_line_arguments.Tag", linkageName: "command_line_arguments.Tag.IsSelfClosing", scope: null, file: !7, line: 177, type: !605, isLocal: false, isDefinition: true, scopeLine: 177, isOptimized: false, unit: !1, retainedNodes: !3)
!627 = !DILocalVariable(name: "t", arg: 1, scope: !626, file: !7, line: 177, type: !607)
!628 = !DILocation(line: 177, column: 1, scope: !626)
!629 = !DILocalVariable(name: "$ret9", scope: !626, file: !7, line: 177, type: !99)
!630 = !DILocation(line: 177, column: 31, scope: !626)
!631 = !DILocation(line: 178, column: 2, scope: !632)
!632 = distinct !DILexicalBlock(scope: !626, file: !7, line: 178, column: 2)
!633 = !DILocation(line: 179, column: 14, scope: !632)
!634 = !DILocalVariable(name: "tag", scope: !632, file: !7, line: 178, type: !9)
!635 = !DILocation(line: 178, column: 6, scope: !626)
!636 = !DILocation(line: 179, column: 10, scope: !632)
!637 = !DILocation(line: 180, column: 4, scope: !632)
!638 = distinct !DISubprogram(name: "parser.Pos..stub..1command_line_arguments.Tag", linkageName: "command_line_arguments.Tag.Pos..stub", scope: null, file: !7, line: 44, type: !639, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!639 = !DISubroutineType(types: !640)
!640 = !{!353, !607, !607}
!641 = !DILocalVariable(name: "$this11", arg: 1, scope: !638, file: !7, line: 44, type: !607)
!642 = !DILocation(line: 44, column: 29, scope: !638)
!643 = !DILocation(line: 159, column: 6, scope: !638)
!644 = !DILocation(line: 44, column: 1, scope: !350, inlinedAt: !645)
!645 = distinct !DILocation(line: 159, column: 6, scope: !638)
!646 = !DILocation(line: 45, column: 2, scope: !350, inlinedAt: !645)
!647 = distinct !DISubprogram(name: "parser.command_line_arguments.Condition..hash", linkageName: "command_line_arguments.command_line_arguments.Condition..hash", scope: null, file: !10, line: 1, type: !209, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!648 = !DILocalVariable(name: "key", arg: 1, scope: !647, file: !10, line: 1, type: !32)
!649 = !DILocation(line: 1, column: 1, scope: !647)
!650 = !DILocalVariable(name: "seed", arg: 2, scope: !647, file: !10, line: 1, type: !36)
!651 = !DILocalVariable(name: "$ret90", scope: !647, file: !10, line: 1, type: !36)
!652 = distinct !DISubprogram(name: "parser.command_line_arguments.Condition..eq", linkageName: "command_line_arguments.command_line_arguments.Condition..eq", scope: null, file: !10, line: 1, type: !217, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!653 = !DILocalVariable(name: "key1", arg: 1, scope: !652, file: !10, line: 1, type: !32)
!654 = !DILocation(line: 1, column: 1, scope: !652)
!655 = !DILocalVariable(name: "key2", arg: 2, scope: !652, file: !10, line: 1, type: !32)
!656 = !DILocalVariable(name: "$ret91", scope: !652, file: !10, line: 1, type: !99)
!657 = distinct !DISubprogram(name: "parser.Pos..stub..1command_line_arguments.Condition", linkageName: "command_line_arguments.Condition.Pos..stub", scope: null, file: !7, line: 44, type: !658, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!658 = !DISubroutineType(types: !659)
!659 = !{!353, !660, !660}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "Condition", file: !7, line: 191, size: 576, align: 8, elements: !662)
!662 = !{!663, !664, !665, !666}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "SourcePosition", file: !7, line: 192, baseType: !353, size: 320, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Positive", file: !7, line: 193, baseType: !424, size: 64, align: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Negative", file: !7, line: 194, baseType: !424, size: 64, align: 64, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Expression", file: !7, line: 195, baseType: !9, size: 128, align: 64, offset: 448)
!667 = !DILocalVariable(name: "$this12", arg: 1, scope: !657, file: !7, line: 44, type: !660)
!668 = !DILocation(line: 44, column: 29, scope: !657)
!669 = !DILocation(line: 191, column: 6, scope: !657)
!670 = !DILocation(line: 44, column: 1, scope: !350, inlinedAt: !671)
!671 = distinct !DILocation(line: 191, column: 6, scope: !657)
!672 = !DILocation(line: 45, column: 2, scope: !350, inlinedAt: !671)
!673 = distinct !DISubprogram(name: "parser.command_line_arguments.Each..hash", linkageName: "command_line_arguments.command_line_arguments.Each..hash", scope: null, file: !10, line: 1, type: !209, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!674 = !DILocalVariable(name: "key", arg: 1, scope: !673, file: !10, line: 1, type: !32)
!675 = !DILocation(line: 1, column: 1, scope: !673)
!676 = !DILocalVariable(name: "seed", arg: 2, scope: !673, file: !10, line: 1, type: !36)
!677 = !DILocalVariable(name: "$ret92", scope: !673, file: !10, line: 1, type: !36)
!678 = distinct !DISubprogram(name: "parser.command_line_arguments.Each..eq", linkageName: "command_line_arguments.command_line_arguments.Each..eq", scope: null, file: !10, line: 1, type: !217, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!679 = !DILocalVariable(name: "key1", arg: 1, scope: !678, file: !10, line: 1, type: !32)
!680 = !DILocation(line: 1, column: 1, scope: !678)
!681 = !DILocalVariable(name: "key2", arg: 2, scope: !678, file: !10, line: 1, type: !32)
!682 = !DILocalVariable(name: "$ret93", scope: !678, file: !10, line: 1, type: !99)
!683 = distinct !DISubprogram(name: "parser.Pos..stub..1command_line_arguments.Each", linkageName: "command_line_arguments.Each.Pos..stub", scope: null, file: !7, line: 44, type: !684, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!684 = !DISubroutineType(types: !685)
!685 = !{!353, !686, !686}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "Each", file: !7, line: 204, size: 768, align: 8, elements: !688)
!688 = !{!689, !690, !691, !692, !693}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "SourcePosition", file: !7, line: 205, baseType: !353, size: 320, align: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "X", file: !7, line: 206, baseType: !9, size: 128, align: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Y", file: !7, line: 207, baseType: !9, size: 128, align: 64, offset: 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Expression", file: !7, line: 208, baseType: !9, size: 128, align: 64, offset: 576)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Block", file: !7, line: 209, baseType: !424, size: 64, align: 64, offset: 704)
!694 = !DILocalVariable(name: "$this13", arg: 1, scope: !683, file: !7, line: 44, type: !686)
!695 = !DILocation(line: 44, column: 29, scope: !683)
!696 = !DILocation(line: 204, column: 6, scope: !683)
!697 = !DILocation(line: 44, column: 1, scope: !350, inlinedAt: !698)
!698 = distinct !DILocation(line: 204, column: 6, scope: !683)
!699 = !DILocation(line: 45, column: 2, scope: !350, inlinedAt: !698)
!700 = distinct !DISubprogram(name: "parser.command_line_arguments.Assignment..hash", linkageName: "command_line_arguments.command_line_arguments.Assignment..hash", scope: null, file: !10, line: 1, type: !209, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!701 = !DILocalVariable(name: "key", arg: 1, scope: !700, file: !10, line: 1, type: !32)
!702 = !DILocation(line: 1, column: 1, scope: !700)
!703 = !DILocalVariable(name: "seed", arg: 2, scope: !700, file: !10, line: 1, type: !36)
!704 = !DILocalVariable(name: "$ret94", scope: !700, file: !10, line: 1, type: !36)
!705 = distinct !DISubprogram(name: "parser.command_line_arguments.Assignment..eq", linkageName: "command_line_arguments.command_line_arguments.Assignment..eq", scope: null, file: !10, line: 1, type: !217, isLocal: false, isDefinition: true, scopeLine: 1, isOptimized: false, unit: !1, retainedNodes: !3)
!706 = !DILocalVariable(name: "key1", arg: 1, scope: !705, file: !10, line: 1, type: !32)
!707 = !DILocation(line: 1, column: 1, scope: !705)
!708 = !DILocalVariable(name: "key2", arg: 2, scope: !705, file: !10, line: 1, type: !32)
!709 = !DILocalVariable(name: "$ret95", scope: !705, file: !10, line: 1, type: !99)
!710 = distinct !DISubprogram(name: "parser.Pos..stub..1command_line_arguments.Assignment", linkageName: "command_line_arguments.Assignment.Pos..stub", scope: null, file: !7, line: 44, type: !711, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!711 = !DISubroutineType(types: !712)
!712 = !{!353, !713, !713}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "Assignment", file: !7, line: 218, size: 576, align: 8, elements: !715)
!715 = !{!716, !717, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "SourcePosition", file: !7, line: 219, baseType: !353, size: 320, align: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "X", file: !7, line: 220, baseType: !9, size: 128, align: 64, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Expression", file: !7, line: 221, baseType: !9, size: 128, align: 64, offset: 448)
!719 = !DILocalVariable(name: "$this14", arg: 1, scope: !710, file: !7, line: 44, type: !713)
!720 = !DILocation(line: 44, column: 29, scope: !710)
!721 = !DILocation(line: 218, column: 6, scope: !710)
!722 = !DILocation(line: 44, column: 1, scope: !350, inlinedAt: !723)
!723 = distinct !DILocation(line: 218, column: 6, scope: !710)
!724 = !DILocation(line: 45, column: 2, scope: !350, inlinedAt: !723)
!725 = distinct !DISubprogram(name: "parser.Pos..stub..1command_line_arguments.Mixin", linkageName: "command_line_arguments.Mixin.Pos..stub", scope: null, file: !7, line: 44, type: !726, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!726 = !DISubroutineType(types: !727)
!727 = !{!353, !728, !728}
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mixin", file: !7, line: 231, size: 704, align: 8, elements: !730)
!730 = !{!731, !732, !733, !734}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "SourcePosition", file: !7, line: 232, baseType: !353, size: 320, align: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Block", file: !7, line: 233, baseType: !424, size: 64, align: 64, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !7, line: 234, baseType: !9, size: 128, align: 64, offset: 384)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Args", file: !7, line: 235, baseType: !106, size: 192, align: 64, offset: 512)
!735 = !DILocalVariable(name: "$this15", arg: 1, scope: !725, file: !7, line: 44, type: !728)
!736 = !DILocation(line: 44, column: 29, scope: !725)
!737 = !DILocation(line: 231, column: 6, scope: !725)
!738 = !DILocation(line: 44, column: 1, scope: !350, inlinedAt: !739)
!739 = distinct !DILocation(line: 231, column: 6, scope: !725)
!740 = !DILocation(line: 45, column: 2, scope: !350, inlinedAt: !739)
!741 = distinct !DISubprogram(name: "parser.Pos..stub..1command_line_arguments.MixinCall", linkageName: "command_line_arguments.MixinCall.Pos..stub", scope: null, file: !7, line: 44, type: !742, isLocal: false, isDefinition: true, scopeLine: 44, isOptimized: false, unit: !1, retainedNodes: !3)
!742 = !DISubroutineType(types: !743)
!743 = !{!353, !744, !744}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "MixinCall", file: !7, line: 256, size: 640, align: 8, elements: !746)
!746 = !{!747, !748, !749}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "SourcePosition", file: !7, line: 257, baseType: !353, size: 320, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !7, line: 258, baseType: !9, size: 128, align: 64, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Args", file: !7, line: 259, baseType: !106, size: 192, align: 64, offset: 448)
!750 = !DILocalVariable(name: "$this16", arg: 1, scope: !741, file: !7, line: 44, type: !744)
!751 = !DILocation(line: 44, column: 29, scope: !741)
!752 = !DILocation(line: 256, column: 6, scope: !741)
!753 = !DILocation(line: 44, column: 1, scope: !350, inlinedAt: !754)
!754 = distinct !DILocation(line: 256, column: 6, scope: !741)
!755 = !DILocation(line: 45, column: 2, scope: !350, inlinedAt: !754)
!756 = distinct !DISubprogram(name: "parser.Parse..1command_line_arguments.Parser", linkageName: "command_line_arguments.Parser.Parse", scope: null, file: !296, line: 75, type: !757, isLocal: false, isDefinition: true, scopeLine: 75, isOptimized: false, unit: !1, retainedNodes: !3)
!757 = !DISubroutineType(types: !758)
!758 = !{!424, !759, !759}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "Parser", file: !296, line: 13, size: 576, align: 8, elements: !761)
!761 = !{!762, !817, !818, !935, !942, !943, !944}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "scanner", file: !296, line: 14, baseType: !763, size: 64, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.scanner", file: !42, line: 40, size: 768, align: 8, elements: !765)
!765 = !{!766, !792, !808, !809, !810, !811, !812, !813, !814, !815, !816}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "reader", file: !42, line: 41, baseType: !767, size: 64, align: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !296, line: 8, size: 704, align: 8, elements: !769)
!769 = !{!770, !771, !787, !788, !789, !790, !791}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !296, line: 8, baseType: !95, size: 192, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "rd", file: !296, line: 8, baseType: !772, size: 128, align: 64, offset: 192)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !296, line: 4, size: 128, align: 8, elements: !773)
!773 = !{!774, !786}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !296, line: 4, baseType: !775, size: 64, align: 64)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !56, size: 128, align: 8, elements: !777)
!777 = !{!193, !778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !56, line: 4, baseType: !779, size: 64, align: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!782, !32, !95}
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !56, size: 192, align: 8, elements: !783)
!783 = !{!784, !785}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !56, line: 4, baseType: !16, size: 64, align: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !56, line: 4, baseType: !247, size: 128, align: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !296, line: 1, baseType: !32, size: 64, align: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !296, line: 8, baseType: !16, size: 64, align: 64, offset: 320)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !296, line: 8, baseType: !16, size: 64, align: 64, offset: 384)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !296, line: 8, baseType: !247, size: 128, align: 64, offset: 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lastByte", file: !296, line: 8, baseType: !16, size: 64, align: 64, offset: 576)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "lastRuneSize", file: !296, line: 8, baseType: !16, size: 64, align: 64, offset: 640)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "indentStack", file: !42, line: 42, baseType: !793, size: 64, align: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", file: !296, line: 8, size: 384, align: 8, elements: !795)
!795 = !{!796, !807}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "root", file: !296, line: 8, baseType: !797, size: 320, align: 64)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "Element", file: !296, line: 8, size: 320, align: 8, elements: !798)
!798 = !{!799, !801, !802, !803}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !296, line: 8, baseType: !800, size: 64, align: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !296, line: 8, baseType: !800, size: 64, align: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "list", file: !296, line: 8, baseType: !32, size: 64, align: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !296, line: 8, baseType: !804, size: 128, align: 64, offset: 192)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !296, line: 8, size: 128, align: 8, elements: !805)
!805 = !{!806, !786}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !296, line: 1, baseType: !194, size: 64, align: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "len", file: !296, line: 8, baseType: !16, size: 64, align: 64, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "stash", file: !42, line: 43, baseType: !793, size: 64, align: 64, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !42, line: 45, baseType: !71, size: 32, align: 32, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", file: !42, line: 46, baseType: !9, size: 128, align: 64, offset: 256)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "line", file: !42, line: 48, baseType: !16, size: 64, align: 64, offset: 384)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "col", file: !42, line: 49, baseType: !16, size: 64, align: 64, offset: 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "lastTokenLine", file: !42, line: 50, baseType: !16, size: 64, align: 64, offset: 512)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "lastTokenCol", file: !42, line: 51, baseType: !16, size: 64, align: 64, offset: 576)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "lastTokenSize", file: !42, line: 52, baseType: !16, size: 64, align: 64, offset: 640)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "readRaw", file: !42, line: 54, baseType: !99, size: 8, align: 8, offset: 704)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !296, line: 15, baseType: !9, size: 128, align: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fs", file: !296, line: 16, baseType: !819, size: 128, align: 64, offset: 192)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileSystem", file: !296, line: 8, size: 128, align: 8, elements: !820)
!820 = !{!821, !786}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !296, line: 8, baseType: !822, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)struct{File,error}}", file: !56, size: 128, align: 8, elements: !824)
!824 = !{!825, !826}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !56, line: 8, baseType: !194, size: 64, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Open", file: !56, line: 8, baseType: !827, size: 64, align: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!830, !32, !9}
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{File,error}", file: !56, size: 256, align: 8, elements: !831)
!831 = !{!832, !934}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !56, line: 8, baseType: !833, size: 128, align: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !296, line: 8, size: 128, align: 8, elements: !834)
!834 = !{!835, !786}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !296, line: 8, baseType: !836, size: 64, align: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,int)struct{struct{*FileInfo,int,int},error},*func(*void,int64,int)struct{int64,error},*func(*void)struct{FileInfo,error}}", file: !56, size: 384, align: 8, elements: !838)
!838 = !{!825, !839, !843, !844, !919, !927}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !56, line: 8, baseType: !840, size: 64, align: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!247, !32}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !56, line: 8, baseType: !779, size: 64, align: 64, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "Readdir", file: !56, line: 8, baseType: !845, size: 64, align: 64, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!848, !32, !16}
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*FileInfo,int,int},error}", file: !56, size: 320, align: 8, elements: !849)
!849 = !{!850, !918}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !56, line: 8, baseType: !851, size: 192, align: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*FileInfo,int,int}", file: !56, size: 192, align: 8, elements: !852)
!852 = !{!853, !72, !73}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !56, line: 1, baseType: !854, size: 64, align: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileInfo", file: !296, line: 7, size: 128, align: 8, elements: !856)
!856 = !{!857, !786}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !296, line: 7, baseType: !858, size: 64, align: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)bool,*func(*void)Time,*func(*void)FileMode,*func(*void)string,*func(*void)int64,*func(*void)PrivateKey}", file: !56, size: 448, align: 8, elements: !860)
!860 = !{!861, !862, !866, !904, !909, !910, !914}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !56, line: 7, baseType: !194, size: 64, align: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "IsDir", file: !56, line: 7, baseType: !863, size: 64, align: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!99, !32}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ModTime", file: !56, line: 7, baseType: !867, size: 64, align: 64, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!870, !32}
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !296, line: 7, size: 192, align: 8, elements: !871)
!871 = !{!872, !874, !876}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !296, line: 7, baseType: !873, size: 64, align: 64)
!873 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !296, line: 7, baseType: !875, size: 64, align: 64, offset: 64)
!875 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !296, line: 7, baseType: !877, size: 64, align: 64, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !296, line: 7, size: 704, align: 8, elements: !879)
!879 = !{!880, !881, !890, !901, !902, !903}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !296, line: 7, baseType: !9, size: 128, align: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !296, line: 7, baseType: !882, size: 192, align: 64, offset: 128)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !56, size: 192, align: 8, elements: !883)
!883 = !{!884, !72, !73}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !56, line: 1, baseType: !885, size: 64, align: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !296, line: 7, size: 256, align: 8, elements: !887)
!887 = !{!880, !888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !296, line: 7, baseType: !16, size: 64, align: 64, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !296, line: 7, baseType: !99, size: 8, align: 8, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !296, line: 7, baseType: !891, size: 192, align: 64, offset: 320)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !56, size: 192, align: 8, elements: !892)
!892 = !{!893, !72, !73}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !56, line: 1, baseType: !894, size: 64, align: 64)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !296, line: 7, size: 128, align: 8, elements: !896)
!896 = !{!897, !898, !899, !900}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !296, line: 7, baseType: !875, size: 64, align: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !296, line: 7, baseType: !14, size: 8, align: 8, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !296, line: 7, baseType: !99, size: 8, align: 8, offset: 72)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !296, line: 7, baseType: !99, size: 8, align: 8, offset: 80)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !296, line: 7, baseType: !875, size: 64, align: 64, offset: 512)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !296, line: 7, baseType: !875, size: 64, align: 64, offset: 576)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !296, line: 7, baseType: !885, size: 64, align: 64, offset: 640)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", file: !56, line: 7, baseType: !905, size: 64, align: 64, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!908, !32}
!908 = !DIBasicType(name: "FileMode", size: 32, encoding: DW_ATE_unsigned)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !56, line: 7, baseType: !255, size: 64, align: 64, offset: 256)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !56, line: 7, baseType: !911, size: 64, align: 64, offset: 320)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!875, !32}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "Sys", file: !56, line: 7, baseType: !915, size: 64, align: 64, offset: 384)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!804, !32}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !56, line: 8, baseType: !247, size: 128, align: 64, offset: 192)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "Seek", file: !56, line: 8, baseType: !920, size: 64, align: 64, offset: 256)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!923, !32, !875, !16}
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !56, size: 192, align: 8, elements: !924)
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !56, line: 6, baseType: !875, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !56, line: 6, baseType: !247, size: 128, align: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "Stat", file: !56, line: 8, baseType: !928, size: 64, align: 64, offset: 320)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!931, !32}
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{FileInfo,error}", file: !56, size: 256, align: 8, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !56, line: 8, baseType: !855, size: 128, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !56, line: 8, baseType: !247, size: 128, align: 64, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "currenttoken", file: !296, line: 17, baseType: !936, size: 64, align: 64, offset: 320)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: ".command-line-arguments.token", file: !42, line: 57, size: 256, align: 8, elements: !938)
!938 = !{!939, !940, !941}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !42, line: 58, baseType: !71, size: 32, align: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !42, line: 59, baseType: !9, size: 128, align: 64, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "Data", file: !42, line: 60, baseType: !21, size: 64, align: 64, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "namedBlocks", file: !296, line: 18, baseType: !21, size: 64, align: 64, offset: 384)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !296, line: 19, baseType: !32, size: 64, align: 64, offset: 448)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "result", file: !296, line: 20, baseType: !424, size: 64, align: 64, offset: 512)
!945 = !DILocalVariable(name: "p", arg: 1, scope: !756, file: !296, line: 75, type: !759)
!946 = !DILocation(line: 75, column: 1, scope: !756)
!947 = !DILocalVariable(name: "$ret25", scope: !756, file: !296, line: 75, type: !424)
!948 = !DILocation(line: 75, column: 26, scope: !756)
!949 = !DILocation(line: 76, column: 6, scope: !950)
!950 = distinct !DILexicalBlock(scope: !756, file: !296, line: 75, column: 1)
!951 = !DILocation(line: 145, column: 1, scope: !756)
!952 = !DILocation(line: 76, column: 14, scope: !950)
!953 = !DILocation(line: 77, column: 10, scope: !950)
!954 = !DILocation(line: 77, column: 11, scope: !950)
!955 = !DILocation(line: 80, column: 8, scope: !950)
!956 = !DILocation(line: 80, column: 2, scope: !950)
!957 = !DILocation(line: 96, column: 11, scope: !950)
!958 = !DILocalVariable(name: "block", scope: !950, file: !296, line: 96, type: !424)
!959 = !DILocation(line: 96, column: 2, scope: !756)
!960 = !DILocation(line: 97, column: 2, scope: !950)
!961 = !DILocation(line: 97, column: 3, scope: !950)
!962 = !DILocation(line: 100, column: 6, scope: !950)
!963 = !DILocation(line: 100, column: 7, scope: !950)
!964 = !DILocation(line: 0, scope: !950)
!965 = !DILocation(line: 100, column: 21, scope: !950)
!966 = !DILocation(line: 100, column: 45, scope: !950)
!967 = !DILocation(line: 100, column: 51, scope: !950)
!968 = !DILocation(line: 100, column: 32, scope: !950)
!969 = !DILocation(line: 104, column: 7, scope: !950)
!970 = !DILocation(line: 104, column: 20, scope: !950)
!971 = !DILocation(line: 104, column: 26, scope: !950)
!972 = !DILocation(line: 105, column: 5, scope: !950)
!973 = !DILocation(line: 109, column: 15, scope: !950)
!974 = !DILocation(line: 109, column: 8, scope: !950)
!975 = !DILocation(line: 112, column: 6, scope: !950)
!976 = !DILocation(line: 112, column: 14, scope: !950)
!977 = !DILocation(line: 113, column: 3, scope: !950)
!978 = !DILocation(line: 113, column: 4, scope: !950)
!979 = !DILocation(line: 143, column: 2, scope: !950)
!980 = !DILocation(line: 143, column: 3, scope: !950)
!981 = !DILocation(line: 113, column: 11, scope: !950)
!982 = !DILocalVariable(name: "prev", scope: !983, file: !296, line: 115, type: !543)
!983 = distinct !DILexicalBlock(scope: !950, file: !296, line: 115, column: 3)
!984 = !DILocation(line: 115, column: 7, scope: !950)
!985 = !DILocation(line: 115, column: 24, scope: !983)
!986 = !DILocation(line: 115, column: 25, scope: !983)
!987 = !DILocation(line: 115, column: 32, scope: !983)
!988 = !DILocation(line: 115, column: 3, scope: !983)
!989 = !DILocation(line: 116, column: 30, scope: !990)
!990 = distinct !DILexicalBlock(scope: !983, file: !296, line: 115, column: 45)
!991 = !DILocation(line: 116, column: 12, scope: !990)
!992 = !DILocation(line: 116, column: 13, scope: !990)
!993 = !DILocation(line: 116, column: 25, scope: !990)
!994 = !DILocalVariable(name: "ours", scope: !990, file: !296, line: 116, type: !543)
!995 = !DILocation(line: 116, column: 4, scope: !983)
!996 = !DILocation(line: 118, column: 12, scope: !990)
!997 = !DILocation(line: 0, scope: !990)
!998 = !DILocation(line: 120, column: 23, scope: !990)
!999 = !DILocation(line: 120, column: 6, scope: !990)
!1000 = !DILocation(line: 120, column: 30, scope: !990)
!1001 = !DILocation(line: 124, column: 50, scope: !990)
!1002 = !DILocation(line: 124, column: 11, scope: !990)
!1003 = !DILocation(line: 466, column: 38, scope: !1004, inlinedAt: !1007)
!1004 = distinct !DISubprogram(name: "parser.findTopmostParentWithNamedBlock", scope: null, file: !296, line: 466, type: !1005, isLocal: true, isDefinition: true, scopeLine: 466, isOptimized: false, unit: !1, retainedNodes: !3)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!759, !759, !9}
!1007 = distinct !DILocation(line: 124, column: 11, scope: !990)
!1008 = !DILocalVariable(name: "p", arg: 1, scope: !1004, file: !296, line: 466, type: !759)
!1009 = !DILocalVariable(name: "$ret43", scope: !1004, file: !296, line: 466, type: !759)
!1010 = !DILocation(line: 466, column: 62, scope: !1004, inlinedAt: !1007)
!1011 = !DILocalVariable(name: "top", scope: !1012, file: !296, line: 467, type: !759)
!1012 = distinct !DILexicalBlock(scope: !1004, file: !296, line: 466, column: 1)
!1013 = !DILocation(line: 467, column: 2, scope: !1004, inlinedAt: !1007)
!1014 = !DILocation(line: 470, column: 9, scope: !1012, inlinedAt: !1007)
!1015 = !DILocation(line: 470, column: 21, scope: !1012, inlinedAt: !1007)
!1016 = !DILocation(line: 470, column: 28, scope: !1012, inlinedAt: !1007)
!1017 = !DILocation(line: 473, column: 9, scope: !1012, inlinedAt: !1007)
!1018 = !DILocation(line: 473, column: 17, scope: !1012, inlinedAt: !1007)
!1019 = !DILocation(line: 476, column: 16, scope: !1012, inlinedAt: !1007)
!1020 = !DILocation(line: 476, column: 28, scope: !1012, inlinedAt: !1007)
!1021 = !DILocation(line: 476, column: 35, scope: !1012, inlinedAt: !1007)
!1022 = !DILocation(line: 477, column: 13, scope: !1012, inlinedAt: !1007)
!1023 = !DILocation(line: 471, column: 4, scope: !1012, inlinedAt: !1007)
!1024 = !DILocalVariable(name: "top", scope: !990, file: !296, line: 124, type: !759)
!1025 = !DILocation(line: 124, column: 4, scope: !983)
!1026 = !DILocation(line: 125, column: 30, scope: !990)
!1027 = !DILocation(line: 125, column: 13, scope: !990)
!1028 = !DILocation(line: 125, column: 25, scope: !990)
!1029 = !DILocalVariable(name: "nb", scope: !990, file: !296, line: 125, type: !543)
!1030 = !DILocation(line: 125, column: 4, scope: !983)
!1031 = !DILocation(line: 126, column: 15, scope: !990)
!1032 = !DILocalVariable(name: "i", scope: !1033, file: !296, line: 128, type: !16)
!1033 = distinct !DILexicalBlock(scope: !990, file: !296, line: 128, column: 5)
!1034 = !DILocation(line: 128, column: 9, scope: !990)
!1035 = !DILocation(line: 128, column: 29, scope: !1033)
!1036 = !DILocation(line: 128, column: 19, scope: !1033)
!1037 = !DILocation(line: 136, column: 7, scope: !990)
!1038 = !DILocation(line: 129, column: 27, scope: !1033)
!1039 = !DILocation(line: 129, column: 8, scope: !1033)
!1040 = !DILocation(line: 128, column: 41, scope: !1033)
!1041 = !DILocation(line: 132, column: 22, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !990, file: !296, line: 132, column: 5)
!1043 = !DILocalVariable(name: "i", scope: !1042, file: !296, line: 132, type: !16)
!1044 = !DILocation(line: 132, column: 9, scope: !990)
!1045 = !DILocation(line: 0, scope: !1042)
!1046 = !DILocation(line: 132, column: 40, scope: !1042)
!1047 = !DILocation(line: 133, column: 32, scope: !1042)
!1048 = !DILocation(line: 133, column: 8, scope: !1042)
!1049 = !DILocation(line: 136, column: 23, scope: !990)
!1050 = !DILocation(line: 136, column: 17, scope: !990)
!1051 = !DILocation(line: 140, column: 11, scope: !950)
!1052 = !DILocation(line: 140, column: 12, scope: !950)
!1053 = !DILocation(line: 140, column: 19, scope: !950)
!1054 = !DILocation(line: 143, column: 11, scope: !950)
!1055 = !DILocation(line: 77, column: 3, scope: !756)
!1056 = distinct !DISubprogram(name: "parser.SetFilename..1command_line_arguments.Parser", linkageName: "command_line_arguments.Parser.SetFilename", scope: null, file: !296, line: 38, type: !1057, isLocal: false, isDefinition: true, scopeLine: 38, isOptimized: false, unit: !1, retainedNodes: !3)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!33, !759, !759, !9}
!1059 = !DILocalVariable(name: "p", arg: 1, scope: !1056, file: !296, line: 38, type: !759)
!1060 = !DILocation(line: 38, column: 1, scope: !1056)
!1061 = !DILocation(line: 39, column: 3, scope: !1056)
!1062 = !DILocation(line: 39, column: 13, scope: !1056)
!1063 = distinct !DISubprogram(name: "parser.SetVirtualFilesystem..1command_line_arguments.Parser", linkageName: "command_line_arguments.Parser.SetVirtualFilesystem", scope: null, file: !296, line: 42, type: !1064, isLocal: false, isDefinition: true, scopeLine: 42, isOptimized: false, unit: !1, retainedNodes: !3)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!33, !759, !759, !819}
!1066 = !DILocalVariable(name: "p", arg: 1, scope: !1063, file: !296, line: 42, type: !759)
!1067 = !DILocation(line: 42, column: 1, scope: !1063)
!1068 = !DILocation(line: 43, column: 3, scope: !1063)
!1069 = !DILocation(line: 43, column: 7, scope: !1063)
!1070 = distinct !DISubprogram(name: "parser.advance..1command_line_arguments.Parser", linkageName: "command_line_arguments.Parser.advance", scope: null, file: !296, line: 217, type: !1071, isLocal: false, isDefinition: true, scopeLine: 217, isOptimized: false, unit: !1, retainedNodes: !3)
!1071 = !DISubroutineType(types: !1072)
