; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v2;\5Cn\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22amber\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22command-line-arguments\22"
module asm "\09.ascii \22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22list\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22container/list\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22container/list\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\5C\22;\5Cn\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22errors\22"
module asm "\09.ascii \22 \5C\22\22"
module asm "\09.ascii \22errors\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = distinct !DICompileUnit(language: DW_LANG_Go, file: !2, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, globals: !4)
!2 = !DIFile(filename: "./compiler.go", directory: "/home/wangcong/go_path/src/github.com/eknkc/amber")
!3 = !{}
!4 = !{!5, !19, !22, !225, !231, !246, !402}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "command_line_arguments.builtinFunctions", linkageName: "command_line_arguments.builtinFunctions", scope: !1, file: !7, line: 25, type: !8, isLocal: true, isDefinition: true)
!7 = !DIFile(filename: "compiler.go", directory: ".")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1280, align: 8, elements: !17)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !10, line: 1, size: 128, align: 8, elements: !11)
!10 = !DIFile(filename: "<built-in>", directory: "")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !10, line: 1, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !10, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!17 = !{!18}
!18 = !DISubrange(count: 10)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !1, file: !10, line: 1, type: !21, isLocal: false, isDefinition: true)
!21 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "command_line_arguments.DefaultOptions", linkageName: "command_line_arguments.DefaultOptions", scope: !1, file: !7, line: 106, type: !24, isLocal: false, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "Options", file: !7, line: 81, size: 192, align: 8, elements: !25)
!25 = !{!26, !28, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "PrettyPrint", file: !7, line: 86, baseType: !27, size: 8, align: 8)
!27 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "LineNumbers", file: !7, line: 90, baseType: !27, size: 8, align: 8, offset: 8)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "VirtualFilesystem", file: !7, line: 94, baseType: !30, size: 128, align: 64, offset: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileSystem", file: !7, line: 13, size: 128, align: 8, elements: !31)
!31 = !{!32, !207}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 13, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,string)struct{File,error}}", file: !35, size: 128, align: 8, elements: !36)
!35 = !DIFile(filename: "", directory: "")
!36 = !{!37, !88}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !35, line: 13, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !10, line: 1, size: 576, align: 8, elements: !40)
!40 = !{!41, !43, !44, !45, !46, !47, !48, !58, !66, !67, !69, !87}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !10, line: 1, baseType: !42, size: 64, align: 64)
!42 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !10, line: 1, baseType: !42, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !10, line: 1, baseType: !21, size: 32, align: 32, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 160)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 168)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 176)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", file: !10, line: 1, baseType: !49, size: 64, align: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 1, size: 64, align: 8, elements: !51)
!51 = !{!52}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 1, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!42, !56, !42}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIBasicType(name: "void")
!58 = !DIDerivedType(tag: DW_TAG_member, name: "equalfn", file: !10, line: 1, baseType: !59, size: 64, align: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 1, size: 64, align: 8, elements: !61)
!61 = !{!62}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 1, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!27, !56, !56}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !10, line: 1, baseType: !13, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !10, line: 1, baseType: !68, size: 64, align: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !10, line: 1, baseType: !70, size: 64, align: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !10, line: 1, size: 320, align: 8, elements: !72)
!72 = !{!73, !74, !75}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !10, line: 1, baseType: !68, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !10, line: 1, baseType: !68, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !10, line: 1, baseType: !76, size: 192, align: 64, offset: 128)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !35, size: 192, align: 8, elements: !77)
!77 = !{!78, !85, !86}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !10, line: 1, size: 320, align: 8, elements: !81)
!81 = !{!73, !74, !82, !83, !84}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !10, line: 1, baseType: !56, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !10, line: 1, baseType: !56, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !10, line: 1, baseType: !56, size: 64, align: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !35, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !35, line: 1, baseType: !16, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !10, line: 1, baseType: !56, size: 64, align: 64, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Open", file: !35, line: 13, baseType: !89, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!92, !56, !9}
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{File,error}", file: !35, size: 256, align: 8, elements: !93)
!93 = !{!94, !224}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !35, line: 13, baseType: !95, size: 128, align: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !7, line: 13, size: 128, align: 8, elements: !96)
!96 = !{!97, !207}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 13, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,int)struct{struct{*FileInfo,int,int},error},*func(*void,int64,int)struct{int64,error},*func(*void)struct{FileInfo,error}}", file: !35, size: 384, align: 8, elements: !100)
!100 = !{!37, !101, !117, !128, !209, !217}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !35, line: 13, baseType: !102, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!105, !56}
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !10, line: 1, size: 128, align: 8, elements: !106)
!106 = !{!107, !116}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !10, line: 1, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !35, size: 128, align: 8, elements: !110)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !35, line: 1, baseType: !38, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !35, line: 1, baseType: !113, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!9, !56}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !10, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !35, line: 13, baseType: !118, size: 64, align: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!121, !56, !125}
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !35, size: 192, align: 8, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !35, line: 4, baseType: !16, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !35, line: 4, baseType: !105, size: 128, align: 64, offset: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !35, size: 192, align: 8, elements: !126)
!126 = !{!127, !85, !86}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !13, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Readdir", file: !35, line: 13, baseType: !129, size: 64, align: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !56, !16}
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*FileInfo,int,int},error}", file: !35, size: 320, align: 8, elements: !133)
!133 = !{!134, !208}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !35, line: 13, baseType: !135, size: 192, align: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*FileInfo,int,int}", file: !35, size: 192, align: 8, elements: !136)
!136 = !{!137, !85, !86}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileInfo", file: !7, line: 9, size: 128, align: 8, elements: !140)
!140 = !{!141, !207}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 9, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)bool,*func(*void)Time,*func(*void)FileMode,*func(*void)string,*func(*void)int64,*func(*void)Token}", file: !35, size: 448, align: 8, elements: !144)
!144 = !{!145, !146, !150, !188, !193, !194, !198}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !35, line: 9, baseType: !38, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "IsDir", file: !35, line: 9, baseType: !147, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!27, !56}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ModTime", file: !35, line: 9, baseType: !151, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!154, !56}
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !7, line: 9, size: 192, align: 8, elements: !155)
!155 = !{!156, !158, !160}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !7, line: 9, baseType: !157, size: 64, align: 64)
!157 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !7, line: 9, baseType: !159, size: 64, align: 64, offset: 64)
!159 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !7, line: 9, baseType: !161, size: 64, align: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !7, line: 9, size: 704, align: 8, elements: !163)
!163 = !{!164, !165, !174, !185, !186, !187}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 9, baseType: !9, size: 128, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !7, line: 9, baseType: !166, size: 192, align: 64, offset: 128)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !35, size: 192, align: 8, elements: !167)
!167 = !{!168, !85, !86}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !7, line: 9, size: 256, align: 8, elements: !171)
!171 = !{!164, !172, !173}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !7, line: 9, baseType: !16, size: 64, align: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !7, line: 9, baseType: !27, size: 8, align: 8, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !7, line: 9, baseType: !175, size: 192, align: 64, offset: 320)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !35, size: 192, align: 8, elements: !176)
!176 = !{!177, !85, !86}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !7, line: 9, size: 128, align: 8, elements: !180)
!180 = !{!181, !182, !183, !184}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !7, line: 9, baseType: !159, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !7, line: 9, baseType: !14, size: 8, align: 8, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !7, line: 9, baseType: !27, size: 8, align: 8, offset: 72)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !7, line: 9, baseType: !27, size: 8, align: 8, offset: 80)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !7, line: 9, baseType: !159, size: 64, align: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !7, line: 9, baseType: !159, size: 64, align: 64, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !7, line: 9, baseType: !169, size: 64, align: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", file: !35, line: 9, baseType: !189, size: 64, align: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!192, !56}
!192 = !DIBasicType(name: "FileMode", size: 32, encoding: DW_ATE_unsigned)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !35, line: 9, baseType: !113, size: 64, align: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Size", file: !35, line: 9, baseType: !195, size: 64, align: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!159, !56}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Sys", file: !35, line: 9, baseType: !199, size: 64, align: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!202, !56}
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "Token", file: !203, line: 4, size: 128, align: 8, elements: !204)
!203 = !DIFile(filename: "runtime.go", directory: ".")
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !203, line: 1, baseType: !38, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !203, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !7, line: 1, baseType: !56, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !35, line: 13, baseType: !105, size: 128, align: 64, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Seek", file: !35, line: 13, baseType: !210, size: 64, align: 64, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !56, !159, !16}
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int64,error}", file: !35, size: 192, align: 8, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !35, line: 12, baseType: !159, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !35, line: 12, baseType: !105, size: 128, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Stat", file: !35, line: 13, baseType: !218, size: 64, align: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!221, !56}
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{FileInfo,error}", file: !35, size: 256, align: 8, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !35, line: 13, baseType: !139, size: 128, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !35, line: 13, baseType: !105, size: 128, align: 64, offset: 128)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "command_line_arguments.DefaultDirOptions", linkageName: "command_line_arguments.DefaultDirOptions", scope: !1, file: !7, line: 109, type: !227, isLocal: false, isDefinition: true)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "DirOptions", file: !7, line: 98, size: 192, align: 8, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Ext", file: !7, line: 100, baseType: !9, size: 128, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Recursive", file: !7, line: 102, baseType: !27, size: 8, align: 8, offset: 128)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "command_line_arguments.FuncMap", linkageName: "command_line_arguments.FuncMap", scope: !1, file: !203, line: 10, type: !233, isLocal: false, isDefinition: true)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !10, line: 1, size: 384, align: 8, elements: !235)
!235 = !{!236, !237, !238, !239, !241, !242, !243, !244, !245}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !10, line: 1, baseType: !16, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !10, line: 1, baseType: !14, size: 8, align: 8, offset: 72)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !10, line: 1, baseType: !240, size: 16, align: 16, offset: 80)
!240 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !10, line: 1, baseType: !21, size: 32, align: 32, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !10, line: 1, baseType: !56, size: 64, align: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !10, line: 1, baseType: !56, size: 64, align: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !10, line: 1, baseType: !42, size: 64, align: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !10, line: 1, baseType: !56, size: 64, align: 64, offset: 320)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "command_line_arguments.textInterpolateRegexp", linkageName: "command_line_arguments.textInterpolateRegexp", scope: !1, file: !7, line: 591, type: !248, isLocal: true, isDefinition: true)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "Regexp", file: !7, line: 17, size: 1280, align: 8, elements: !250)
!250 = !{!251, !308, !313}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "regexpRO", file: !7, line: 17, baseType: !252, size: 1024, align: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.regexpRO", file: !7, line: 17, size: 1024, align: 8, elements: !253)
!253 = !{!254, !255, !278, !295, !296, !297, !298, !299, !300, !302, !303, !307}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "expr", file: !7, line: 17, baseType: !9, size: 128, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "prog", file: !7, line: 17, baseType: !256, size: 64, align: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "Prog", file: !7, line: 17, size: 320, align: 8, elements: !258)
!258 = !{!259, !276, !277}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Inst", file: !7, line: 17, baseType: !260, size: 192, align: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Inst,int,int}", file: !35, size: 192, align: 8, elements: !261)
!261 = !{!262, !85, !86}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inst", file: !7, line: 17, size: 320, align: 8, elements: !265)
!265 = !{!266, !268, !269, !270}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Op", file: !7, line: 17, baseType: !267, size: 8, align: 8)
!267 = !DIBasicType(name: "InstOp", size: 8, encoding: DW_ATE_unsigned)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Out", file: !7, line: 17, baseType: !21, size: 32, align: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Arg", file: !7, line: 17, baseType: !21, size: 32, align: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Rune", file: !7, line: 17, baseType: !271, size: 192, align: 64, offset: 128)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int32,int,int}", file: !35, size: 192, align: 8, elements: !272)
!272 = !{!273, !85, !86}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Start", file: !7, line: 17, baseType: !16, size: 64, align: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "NumCap", file: !7, line: 17, baseType: !16, size: 64, align: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "onepass", file: !7, line: 17, baseType: !279, size: 64, align: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.onePassProg", file: !7, line: 17, size: 320, align: 8, elements: !281)
!281 = !{!282, !276, !277}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Inst", file: !7, line: 17, baseType: !283, size: 192, align: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.regexp.onePassInst,int,int}", file: !35, size: 192, align: 8, elements: !284)
!284 = !{!285, !85, !86}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.onePassInst", file: !7, line: 17, size: 512, align: 8, elements: !288)
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Inst", file: !7, line: 17, baseType: !264, size: 320, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Next", file: !7, line: 17, baseType: !291, size: 192, align: 64, offset: 320)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint32,int,int}", file: !35, size: 192, align: 8, elements: !292)
!292 = !{!293, !85, !86}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", file: !7, line: 17, baseType: !9, size: 128, align: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "prefixBytes", file: !7, line: 17, baseType: !125, size: 192, align: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "prefixComplete", file: !7, line: 17, baseType: !27, size: 8, align: 8, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "prefixRune", file: !7, line: 17, baseType: !275, size: 32, align: 32, offset: 608)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "prefixEnd", file: !7, line: 17, baseType: !21, size: 32, align: 32, offset: 640)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "cond", file: !7, line: 17, baseType: !301, size: 8, align: 8, offset: 672)
!301 = !DIBasicType(name: "EmptyOp", size: 8, encoding: DW_ATE_unsigned)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "numSubexp", file: !7, line: 17, baseType: !16, size: 64, align: 64, offset: 704)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "subexpNames", file: !7, line: 17, baseType: !304, size: 192, align: 64, offset: 768)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !35, size: 192, align: 8, elements: !305)
!305 = !{!306, !85, !86}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !68, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "longest", file: !7, line: 17, baseType: !27, size: 8, align: 8, offset: 960)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !7, line: 17, baseType: !309, size: 64, align: 32, offset: 1024)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !7, line: 8, size: 64, align: 8, elements: !310)
!310 = !{!311, !312}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 8, baseType: !275, size: 32, align: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !7, line: 8, baseType: !21, size: 32, align: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "machine", file: !7, line: 17, baseType: !314, size: 192, align: 64, offset: 1088)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**.regexp.machine,int,int}", file: !35, size: 192, align: 8, elements: !315)
!315 = !{!316, !85, !86}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.machine", file: !7, line: 17, size: 2112, align: 8, elements: !320)
!320 = !{!321, !322, !323, !324, !325, !347, !364, !365, !370, !371, !372, !376, !380}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "re", file: !7, line: 17, baseType: !56, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !7, line: 17, baseType: !256, size: 64, align: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "op", file: !7, line: 17, baseType: !279, size: 64, align: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "maxBitStateLen", file: !7, line: 17, baseType: !16, size: 64, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "b", file: !7, line: 17, baseType: !326, size: 64, align: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.bitState", file: !7, line: 17, size: 704, align: 8, elements: !328)
!328 = !{!329, !330, !331, !336, !346}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "prog", file: !7, line: 17, baseType: !256, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "end", file: !7, line: 17, baseType: !16, size: 64, align: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "cap", file: !7, line: 17, baseType: !332, size: 192, align: 64, offset: 128)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*int,int,int}", file: !35, size: 192, align: 8, elements: !333)
!333 = !{!334, !85, !86}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", file: !7, line: 17, baseType: !337, size: 192, align: 64, offset: 320)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.regexp.job,int,int}", file: !35, size: 192, align: 8, elements: !338)
!338 = !{!339, !85, !86}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.job", file: !7, line: 17, size: 128, align: 8, elements: !342)
!342 = !{!343, !344, !345}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !7, line: 17, baseType: !21, size: 32, align: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !7, line: 17, baseType: !27, size: 8, align: 8, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pos", file: !7, line: 17, baseType: !16, size: 64, align: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "visited", file: !7, line: 17, baseType: !291, size: 192, align: 64, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "q0", file: !7, line: 17, baseType: !348, size: 384, align: 64, offset: 320)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.queue", file: !7, line: 17, size: 384, align: 8, elements: !349)
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sparse", file: !7, line: 17, baseType: !291, size: 192, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dense", file: !7, line: 17, baseType: !352, size: 192, align: 64, offset: 192)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.regexp.entry,int,int}", file: !35, size: 192, align: 8, elements: !353)
!353 = !{!354, !85, !86}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.entry", file: !7, line: 17, size: 128, align: 8, elements: !357)
!357 = !{!343, !358}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "t", file: !7, line: 17, baseType: !359, size: 64, align: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.thread", file: !7, line: 17, size: 256, align: 8, elements: !361)
!361 = !{!362, !363}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "inst", file: !7, line: 17, baseType: !263, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "cap", file: !7, line: 17, baseType: !332, size: 192, align: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "q1", file: !7, line: 17, baseType: !348, size: 384, align: 64, offset: 704)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pool", file: !7, line: 17, baseType: !366, size: 192, align: 64, offset: 1088)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**.regexp.thread,int,int}", file: !35, size: 192, align: 8, elements: !367)
!367 = !{!368, !85, !86}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "matched", file: !7, line: 17, baseType: !27, size: 8, align: 8, offset: 1280)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "matchcap", file: !7, line: 17, baseType: !332, size: 192, align: 64, offset: 1344)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "inputBytes", file: !7, line: 17, baseType: !373, size: 192, align: 64, offset: 1536)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.inputBytes", file: !7, line: 17, size: 192, align: 8, elements: !374)
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "str", file: !7, line: 17, baseType: !125, size: 192, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "inputString", file: !7, line: 17, baseType: !377, size: 128, align: 64, offset: 1728)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.inputString", file: !7, line: 17, size: 128, align: 8, elements: !378)
!378 = !{!379}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "str", file: !7, line: 17, baseType: !9, size: 128, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "inputReader", file: !7, line: 17, baseType: !381, size: 256, align: 64, offset: 1856)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: ".regexp.inputReader", file: !7, line: 17, size: 256, align: 8, elements: !382)
!382 = !{!383, !400, !401}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !7, line: 17, baseType: !384, size: 128, align: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "RuneReader", file: !7, line: 12, size: 128, align: 8, elements: !385)
!385 = !{!386, !207}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 12, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{int32,int,error}}", file: !35, size: 128, align: 8, elements: !389)
!389 = !{!390, !391}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !35, line: 12, baseType: !38, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ReadRune", file: !35, line: 12, baseType: !392, size: 64, align: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!395, !56}
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int32,int,error}", file: !35, size: 256, align: 8, elements: !396)
!396 = !{!397, !398, !399}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !35, line: 12, baseType: !275, size: 32, align: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !35, line: 12, baseType: !16, size: 64, align: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !35, line: 12, baseType: !105, size: 128, align: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "atEOT", file: !7, line: 17, baseType: !27, size: 8, align: 8, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pos", file: !7, line: 17, baseType: !16, size: 64, align: 64, offset: 192)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "command_line_arguments.textEscapeRegexp", linkageName: "command_line_arguments.textEscapeRegexp", scope: !1, file: !7, line: 592, type: !248, isLocal: true, isDefinition: true)
!404 = distinct !DISubprogram(name: "amber.Compile..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.Compile", scope: null, file: !7, line: 302, type: !405, isLocal: false, isDefinition: true, scopeLine: 302, isOptimized: false, unit: !1, retainedNodes: !3)
!405 = !DISubroutineType(types: !406)
!406 = !{!407, !537, !537}
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Template,error}", file: !35, size: 192, align: 8, elements: !408)
!408 = !{!409, !536}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !35, line: 302, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "Template", file: !7, line: 11, size: 320, align: 8, elements: !412)
!412 = !{!413, !414, !518, !519}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "escapeErr", file: !7, line: 11, baseType: !105, size: 128, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "text", file: !7, line: 11, baseType: !415, size: 64, align: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "Template", file: !7, line: 11, size: 512, align: 8, elements: !417)
!417 = !{!418, !419, !498, !474, !475}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !7, line: 11, baseType: !9, size: 128, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Tree", file: !7, line: 11, baseType: !420, size: 64, align: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tree", file: !7, line: 11, size: 1984, align: 8, elements: !422)
!422 = !{!423, !424, !425, !463, !464, !469, !484, !495, !496, !497}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !7, line: 11, baseType: !9, size: 128, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ParseName", file: !7, line: 11, baseType: !9, size: 128, align: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Root", file: !7, line: 11, baseType: !426, size: 64, align: 64, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "ListNode", file: !7, line: 11, size: 384, align: 8, elements: !428)
!428 = !{!429, !431, !433, !434}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "NodeType", file: !7, line: 11, baseType: !430, size: 64, align: 64)
!430 = !DIBasicType(name: "NodeType", size: 64, encoding: DW_ATE_signed)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Pos", file: !7, line: 11, baseType: !432, size: 64, align: 64, offset: 64)
!432 = !DIBasicType(name: "Pos", size: 64, encoding: DW_ATE_signed)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tr", file: !7, line: 11, baseType: !56, size: 64, align: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Nodes", file: !7, line: 11, baseType: !435, size: 192, align: 64, offset: 192)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Node,int,int}", file: !35, size: 192, align: 8, elements: !436)
!436 = !{!437, !85, !86}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !438, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !7, line: 11, size: 128, align: 8, elements: !440)
!440 = !{!441, !207}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 11, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Node,*func(*void)Pos,*func(*void)string,*func(*void)NodeType,*func(*void)*Tree}", file: !35, size: 384, align: 8, elements: !444)
!444 = !{!445, !446, !450, !454, !455, !459}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !35, line: 11, baseType: !38, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Copy", file: !35, line: 11, baseType: !447, size: 64, align: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!439, !56}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "Position", file: !35, line: 11, baseType: !451, size: 64, align: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!432, !56}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !35, line: 11, baseType: !113, size: 64, align: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !35, line: 11, baseType: !456, size: 64, align: 64, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!430, !56}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tree", file: !35, line: 11, baseType: !460, size: 64, align: 64, offset: 320)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!56, !56}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "text", file: !7, line: 11, baseType: !9, size: 128, align: 64, offset: 320)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", file: !7, line: 11, baseType: !465, size: 192, align: 64, offset: 448)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*FuncMap,int,int}", file: !35, size: 192, align: 8, elements: !466)
!466 = !{!467, !85, !86}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "lex", file: !7, line: 11, baseType: !470, size: 64, align: 64, offset: 640)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: ".text/template/parse.lexer", file: !7, line: 11, size: 896, align: 8, elements: !472)
!472 = !{!418, !473, !474, !475, !476, !477, !478, !479, !482, !483}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "input", file: !7, line: 11, baseType: !9, size: 128, align: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "leftDelim", file: !7, line: 11, baseType: !9, size: 128, align: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rightDelim", file: !7, line: 11, baseType: !9, size: 128, align: 64, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pos", file: !7, line: 11, baseType: !432, size: 64, align: 64, offset: 512)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "start", file: !7, line: 11, baseType: !432, size: 64, align: 64, offset: 576)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "width", file: !7, line: 11, baseType: !432, size: 64, align: 64, offset: 640)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "items", file: !7, line: 11, baseType: !480, size: 64, align: 64, offset: 704)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !10, line: 1, align: 8, elements: !3)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "parenDepth", file: !7, line: 11, baseType: !16, size: 64, align: 64, offset: 768)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "line", file: !7, line: 11, baseType: !16, size: 64, align: 64, offset: 832)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "token", file: !7, line: 11, baseType: !485, size: 960, align: 64, offset: 704)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 960, align: 8, elements: !493)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: ".text/template/parse.item", file: !7, line: 11, size: 320, align: 8, elements: !487)
!487 = !{!488, !490, !491, !492}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !7, line: 11, baseType: !489, size: 64, align: 64)
!489 = !DIBasicType(name: ".text/template/parse.itemType", size: 64, encoding: DW_ATE_signed)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pos", file: !7, line: 11, baseType: !432, size: 64, align: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "val", file: !7, line: 11, baseType: !9, size: 128, align: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "line", file: !7, line: 11, baseType: !16, size: 64, align: 64, offset: 256)
!493 = !{!494}
!494 = !DISubrange(count: 3)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "peekCount", file: !7, line: 11, baseType: !16, size: 64, align: 64, offset: 1664)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "vars", file: !7, line: 11, baseType: !304, size: 192, align: 64, offset: 1728)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "treeSet", file: !7, line: 11, baseType: !233, size: 64, align: 64, offset: 1920)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "common", file: !7, line: 11, baseType: !499, size: 64, align: 64, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: ".text/template.common", file: !7, line: 11, size: 448, align: 8, elements: !501)
!501 = !{!502, !503, !508, !516, !517}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "tmpl", file: !7, line: 11, baseType: !233, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "option", file: !7, line: 11, baseType: !504, size: 64, align: 64, offset: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: ".text/template.option", file: !7, line: 11, size: 64, align: 8, elements: !505)
!505 = !{!506}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "missingKey", file: !7, line: 11, baseType: !507, size: 64, align: 64)
!507 = !DIBasicType(name: ".text/template.missingKeyAction", size: 64, encoding: DW_ATE_signed)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "muFuncs", file: !7, line: 11, baseType: !509, size: 192, align: 32, offset: 128)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !7, line: 8, size: 192, align: 8, elements: !510)
!510 = !{!511, !512, !513, !514, !515}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !7, line: 8, baseType: !309, size: 64, align: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !7, line: 8, baseType: !21, size: 32, align: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !7, line: 8, baseType: !21, size: 32, align: 32, offset: 96)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !7, line: 8, baseType: !275, size: 32, align: 32, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !7, line: 8, baseType: !275, size: 32, align: 32, offset: 160)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "parseFuncs", file: !7, line: 11, baseType: !233, size: 64, align: 64, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "execFuncs", file: !7, line: 11, baseType: !233, size: 64, align: 64, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "Tree", file: !7, line: 11, baseType: !420, size: 64, align: 64, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nameSpace", file: !7, line: 11, baseType: !520, size: 64, align: 64, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: ".html/template.nameSpace", file: !7, line: 11, size: 640, align: 8, elements: !522)
!522 = !{!523, !524, !525, !526}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "mu", file: !7, line: 11, baseType: !309, size: 64, align: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "set", file: !7, line: 11, baseType: !233, size: 64, align: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", file: !7, line: 11, baseType: !27, size: 8, align: 8, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "esc", file: !7, line: 11, baseType: !527, size: 448, align: 64, offset: 192)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: ".html/template.escaper", file: !7, line: 11, size: 448, align: 8, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534, !535}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ns", file: !7, line: 11, baseType: !56, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "output", file: !7, line: 11, baseType: !233, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "derived", file: !7, line: 11, baseType: !233, size: 64, align: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "called", file: !7, line: 11, baseType: !233, size: 64, align: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "actionNodeEdits", file: !7, line: 11, baseType: !233, size: 64, align: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "templateNodeEdits", file: !7, line: 11, baseType: !233, size: 64, align: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "textNodeEdits", file: !7, line: 11, baseType: !233, size: 64, align: 64, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !35, line: 302, baseType: !105, size: 128, align: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "Compiler", file: !7, line: 56, size: 768, align: 8, elements: !539)
!539 = !{!540, !541, !542, !560, !561, !562, !574, !575}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Options", file: !7, line: 58, baseType: !24, size: 192, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !7, line: 59, baseType: !9, size: 128, align: 64, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "node", file: !7, line: 60, baseType: !543, size: 128, align: 64, offset: 320)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !7, line: 22, size: 128, align: 8, elements: !544)
!544 = !{!545, !207}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 22, baseType: !546, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)SourcePosition}", file: !35, size: 128, align: 8, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !35, line: 22, baseType: !38, size: 64, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Pos", file: !35, line: 22, baseType: !551, size: 64, align: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!554, !56}
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "SourcePosition", file: !7, line: 22, size: 320, align: 8, elements: !555)
!555 = !{!556, !557, !558, !559}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "LineNum", file: !7, line: 22, baseType: !16, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ColNum", file: !7, line: 22, baseType: !16, size: 64, align: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "TokenLength", file: !7, line: 22, baseType: !16, size: 64, align: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Filename", file: !7, line: 22, baseType: !9, size: 128, align: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "indentLevel", file: !7, line: 61, baseType: !16, size: 64, align: 64, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "newline", file: !7, line: 62, baseType: !27, size: 8, align: 8, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", file: !7, line: 63, baseType: !563, size: 64, align: 64, offset: 576)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", file: !7, line: 4, size: 832, align: 8, elements: !565)
!565 = !{!566, !567, !568, !572}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 4, baseType: !125, size: 192, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "off", file: !7, line: 4, baseType: !16, size: 64, align: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "bootstrap", file: !7, line: 4, baseType: !569, size: 512, align: 8, offset: 256)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, align: 1, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "lastRead", file: !7, line: 4, baseType: !573, size: 8, align: 8, offset: 768)
!573 = !DIBasicType(name: ".bytes.readOp", size: 8, encoding: DW_ATE_signed)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "tempvarIndex", file: !7, line: 64, baseType: !16, size: 64, align: 64, offset: 640)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mixins", file: !7, line: 65, baseType: !233, size: 64, align: 64, offset: 704)
!576 = !DILocalVariable(name: "c", arg: 1, scope: !404, file: !7, line: 302, type: !537)
!577 = !DILocation(line: 302, column: 1, scope: !404)
!578 = !DILocalVariable(name: "$ret12", scope: !404, file: !7, line: 302, type: !410)
!579 = !DILocation(line: 302, column: 31, scope: !404)
!580 = !DILocation(line: 303, column: 42, scope: !404)
!581 = !DILocation(line: 303, column: 36, scope: !404)
!582 = !DILocation(line: 303, column: 10, scope: !404)
!583 = !DILocation(line: 303, column: 2, scope: !404)
!584 = distinct !DISubprogram(name: "amber.CompileString..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.CompileString", scope: null, file: !7, line: 352, type: !585, isLocal: false, isDefinition: true, scopeLine: 352, isOptimized: false, unit: !1, retainedNodes: !3)
!585 = !DISubroutineType(types: !586)
!586 = !{!587, !537, !537}
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{string,error}", file: !35, size: 256, align: 8, elements: !588)
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !35, line: 352, baseType: !9, size: 128, align: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !35, line: 352, baseType: !105, size: 128, align: 64, offset: 128)
!591 = !DILocalVariable(name: "c", arg: 1, scope: !584, file: !7, line: 352, type: !537)
!592 = !DILocation(line: 352, column: 1, scope: !584)
!593 = !DILocation(line: 353, column: 6, scope: !594)
!594 = distinct !DILexicalBlock(scope: !584, file: !7, line: 352, column: 1)
!595 = !DILocation(line: 355, column: 28, scope: !596)
!596 = distinct !DILexicalBlock(scope: !594, file: !7, line: 355, column: 2)
!597 = !DILocation(line: 355, column: 13, scope: !596)
!598 = !DILocalVariable(name: "err", scope: !596, file: !7, line: 355, type: !105)
!599 = !DILocation(line: 355, column: 5, scope: !594)
!600 = !DILocation(line: 355, column: 39, scope: !596)
!601 = !DILocalVariable(name: "$ret18", scope: !584, file: !7, line: 352, type: !9)
!602 = !DILocation(line: 352, column: 37, scope: !584)
!603 = !DILocalVariable(name: "$ret19", scope: !584, file: !7, line: 352, type: !105)
!604 = !DILocation(line: 352, column: 45, scope: !584)
!605 = !DILocation(line: 356, column: 3, scope: !596)
!606 = !DILocalVariable(name: "buf", scope: !594, file: !7, line: 353, type: !563)
!607 = !DILocation(line: 353, column: 6, scope: !584)
!608 = !DILocation(line: 359, column: 15, scope: !594)
!609 = !DILocalVariable(name: "result", scope: !594, file: !7, line: 359, type: !9)
!610 = !DILocation(line: 359, column: 2, scope: !584)
!611 = !DILocation(line: 361, column: 2, scope: !594)
!612 = distinct !DISubprogram(name: "amber.CompileWithName..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.CompileWithName", scope: null, file: !7, line: 307, type: !613, isLocal: false, isDefinition: true, scopeLine: 307, isOptimized: false, unit: !1, retainedNodes: !3)
!613 = !DISubroutineType(types: !614)
!614 = !{!407, !537, !537, !9}
!615 = !DILocalVariable(name: "c", arg: 1, scope: !612, file: !7, line: 307, type: !537)
!616 = !DILocation(line: 307, column: 1, scope: !612)
!617 = !DILocalVariable(name: "name", arg: 2, scope: !612, file: !7, line: 307, type: !9)
!618 = !DILocation(line: 307, column: 36, scope: !612)
!619 = !DILocalVariable(name: "$ret14", scope: !612, file: !7, line: 307, type: !410)
!620 = !DILocation(line: 307, column: 50, scope: !612)
!621 = !DILocation(line: 308, column: 40, scope: !612)
!622 = !DILocation(line: 308, column: 10, scope: !612)
!623 = !DILocation(line: 308, column: 2, scope: !612)
!624 = distinct !DISubprogram(name: "amber.CompileWithTemplate..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.CompileWithTemplate", scope: null, file: !7, line: 312, type: !625, isLocal: false, isDefinition: true, scopeLine: 312, isOptimized: false, unit: !1, retainedNodes: !3)
!625 = !DISubroutineType(types: !626)
!626 = !{!407, !537, !537, !410}
!627 = !DILocalVariable(name: "c", arg: 1, scope: !624, file: !7, line: 312, type: !537)
!628 = !DILocation(line: 312, column: 1, scope: !624)
!629 = !DILocalVariable(name: "t", arg: 2, scope: !624, file: !7, line: 312, type: !410)
!630 = !DILocation(line: 312, column: 40, scope: !624)
!631 = !DILocalVariable(name: "$ret16", scope: !624, file: !7, line: 312, type: !410)
!632 = !DILocation(line: 312, column: 63, scope: !624)
!633 = !DILocation(line: 313, column: 16, scope: !634)
!634 = distinct !DILexicalBlock(scope: !624, file: !7, line: 312, column: 1)
!635 = !DILocalVariable(name: "err", scope: !634, file: !7, line: 313, type: !105)
!636 = !DILocation(line: 313, column: 2, scope: !624)
!637 = !DILocation(line: 315, column: 9, scope: !634)
!638 = !DILocalVariable(name: "$ret17", scope: !624, file: !7, line: 312, type: !105)
!639 = !DILocation(line: 312, column: 83, scope: !624)
!640 = !DILocation(line: 316, column: 3, scope: !634)
!641 = !DILocalVariable(name: "data", scope: !634, file: !7, line: 313, type: !9)
!642 = !DILocation(line: 319, column: 22, scope: !634)
!643 = !DILocation(line: 319, column: 15, scope: !634)
!644 = !DILocation(line: 319, column: 30, scope: !634)
!645 = !DILocation(line: 321, column: 9, scope: !634)
!646 = !DILocation(line: 322, column: 3, scope: !634)
!647 = !DILocalVariable(name: "tpl", scope: !634, file: !7, line: 319, type: !410)
!648 = !DILocation(line: 319, column: 2, scope: !624)
!649 = !DILocation(line: 325, column: 2, scope: !634)
!650 = distinct !DISubprogram(name: "amber.CompileWriter..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.CompileWriter", scope: null, file: !7, line: 331, type: !651, isLocal: false, isDefinition: true, scopeLine: 331, isOptimized: false, unit: !1, retainedNodes: !3)
!651 = !DISubroutineType(types: !652)
!652 = !{!105, !537, !537, !653}
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "Writer", file: !7, line: 4, size: 128, align: 8, elements: !654)
!654 = !{!655, !207}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 4, baseType: !656, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !35, size: 128, align: 8, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !35, line: 4, baseType: !38, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !35, line: 4, baseType: !118, size: 64, align: 64, offset: 64)
!661 = !DILocalVariable(name: "c", arg: 1, scope: !650, file: !7, line: 331, type: !537)
!662 = !DILocation(line: 331, column: 1, scope: !650)
!663 = !DILocalVariable(name: "out", arg: 2, scope: !650, file: !7, line: 331, type: !653)
!664 = !DILocation(line: 331, column: 34, scope: !650)
!665 = !DILocation(line: 332, column: 8, scope: !650)
!666 = !DILocation(line: 332, column: 2, scope: !650)
!667 = !DILocation(line: 347, column: 1, scope: !650)
!668 = !DILocation(line: 338, column: 3, scope: !650)
!669 = !DILocation(line: 338, column: 13, scope: !650)
!670 = !DILocation(line: 338, column: 11, scope: !650)
!671 = !DILocation(line: 339, column: 11, scope: !650)
!672 = !DILocation(line: 339, column: 3, scope: !650)
!673 = !DILocation(line: 341, column: 6, scope: !650)
!674 = !DILocation(line: 341, column: 13, scope: !650)
!675 = !DILocation(line: 341, column: 20, scope: !650)
!676 = !DILocation(line: 342, column: 4, scope: !650)
!677 = !DILocation(line: 345, column: 12, scope: !650)
!678 = !DILocation(line: 345, column: 19, scope: !650)
!679 = !DILocation(line: 346, column: 2, scope: !650)
!680 = distinct !DISubprogram(name: "amber.Parse..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.Parse", scope: null, file: !7, line: 240, type: !681, isLocal: false, isDefinition: true, scopeLine: 240, isOptimized: false, unit: !1, retainedNodes: !3)
!681 = !DISubroutineType(types: !682)
!682 = !{!105, !537, !537, !9}
!683 = !DILocalVariable(name: "c", arg: 1, scope: !680, file: !7, line: 240, type: !537)
!684 = !DILocation(line: 240, column: 1, scope: !680)
!685 = !DILocalVariable(name: "input", arg: 2, scope: !680, file: !7, line: 240, type: !9)
!686 = !DILocation(line: 240, column: 26, scope: !680)
!687 = !DILocation(line: 241, column: 8, scope: !688)
!688 = distinct !DILexicalBlock(scope: !680, file: !7, line: 240, column: 1)
!689 = !DILocation(line: 241, column: 2, scope: !688)
!690 = !DILocation(line: 255, column: 1, scope: !680)
!691 = !DILocation(line: 247, column: 24, scope: !688)
!692 = !DILocalVariable(name: "parser", scope: !688, file: !7, line: 247, type: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "Parser", file: !7, line: 22, size: 576, align: 8, elements: !695)
!695 = !{!696, !740, !741, !742, !749, !750, !751}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "scanner", file: !7, line: 22, baseType: !697, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: ".github.com/eknkc/amber/parser.scanner", file: !7, line: 22, size: 768, align: 8, elements: !699)
!699 = !{!700, !718, !731, !732, !733, !734, !735, !736, !737, !738, !739}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "reader", file: !7, line: 22, baseType: !701, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !7, line: 13, size: 704, align: 8, elements: !703)
!703 = !{!704, !705, !713, !714, !715, !716, !717}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !7, line: 13, baseType: !125, size: 192, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "rd", file: !7, line: 13, baseType: !706, size: 128, align: 64, offset: 192)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reader", file: !7, line: 4, size: 128, align: 8, elements: !707)
!707 = !{!708, !207}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 4, baseType: !709, size: 64, align: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !35, size: 128, align: 8, elements: !711)
!711 = !{!659, !712}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !35, line: 4, baseType: !118, size: 64, align: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "r", file: !7, line: 13, baseType: !16, size: 64, align: 64, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !7, line: 13, baseType: !16, size: 64, align: 64, offset: 384)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !7, line: 13, baseType: !105, size: 128, align: 64, offset: 448)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "lastByte", file: !7, line: 13, baseType: !16, size: 64, align: 64, offset: 576)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "lastRuneSize", file: !7, line: 13, baseType: !16, size: 64, align: 64, offset: 640)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "indentStack", file: !7, line: 22, baseType: !719, size: 64, align: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", file: !7, line: 5, size: 384, align: 8, elements: !721)
!721 = !{!722, !730}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "root", file: !7, line: 5, baseType: !723, size: 320, align: 64)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "Element", file: !7, line: 5, size: 320, align: 8, elements: !724)
!724 = !{!725, !727, !728, !729}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !7, line: 5, baseType: !726, size: 64, align: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !7, line: 5, baseType: !726, size: 64, align: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "list", file: !7, line: 5, baseType: !56, size: 64, align: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 5, baseType: !202, size: 128, align: 64, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "len", file: !7, line: 5, baseType: !16, size: 64, align: 64, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "stash", file: !7, line: 22, baseType: !719, size: 64, align: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !7, line: 22, baseType: !275, size: 32, align: 32, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", file: !7, line: 22, baseType: !9, size: 128, align: 64, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "line", file: !7, line: 22, baseType: !16, size: 64, align: 64, offset: 384)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "col", file: !7, line: 22, baseType: !16, size: 64, align: 64, offset: 448)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lastTokenLine", file: !7, line: 22, baseType: !16, size: 64, align: 64, offset: 512)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "lastTokenCol", file: !7, line: 22, baseType: !16, size: 64, align: 64, offset: 576)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "lastTokenSize", file: !7, line: 22, baseType: !16, size: 64, align: 64, offset: 640)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "readRaw", file: !7, line: 22, baseType: !27, size: 8, align: 8, offset: 704)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !7, line: 22, baseType: !9, size: 128, align: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "fs", file: !7, line: 22, baseType: !30, size: 128, align: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "currenttoken", file: !7, line: 22, baseType: !743, size: 64, align: 64, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: ".github.com/eknkc/amber/parser.token", file: !7, line: 22, size: 256, align: 8, elements: !745)
!745 = !{!746, !747, !748}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Kind", file: !7, line: 22, baseType: !275, size: 32, align: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 22, baseType: !9, size: 128, align: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "Data", file: !7, line: 22, baseType: !233, size: 64, align: 64, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "namedBlocks", file: !7, line: 22, baseType: !233, size: 64, align: 64, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !7, line: 22, baseType: !56, size: 64, align: 64, offset: 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "result", file: !7, line: 22, baseType: !752, size: 64, align: 64, offset: 512)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "Block", file: !7, line: 22, size: 512, align: 8, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "SourcePosition", file: !7, line: 22, baseType: !554, size: 320, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Children", file: !7, line: 22, baseType: !757, size: 192, align: 64, offset: 320)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Node,int,int}", file: !35, size: 192, align: 8, elements: !758)
!758 = !{!759, !85, !86}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !35, line: 1, baseType: !760, size: 64, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!761 = !DILocation(line: 247, column: 2, scope: !680)
!762 = !DILocation(line: 249, column: 9, scope: !688)
!763 = !DILocation(line: 253, column: 17, scope: !688)
!764 = !DILocation(line: 253, column: 3, scope: !688)
!765 = !DILocation(line: 253, column: 9, scope: !688)
!766 = !DILocation(line: 250, column: 3, scope: !680)
!767 = distinct !DISubprogram(name: "amber.ParseData..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.ParseData", scope: null, file: !7, line: 258, type: !768, isLocal: false, isDefinition: true, scopeLine: 258, isOptimized: false, unit: !1, retainedNodes: !3)
!768 = !DISubroutineType(types: !769)
!769 = !{!105, !537, !537, !125, !9}
!770 = !DILocalVariable(name: "input", arg: 2, scope: !767, file: !7, line: 258, type: !125)
!771 = !DILocation(line: 258, column: 30, scope: !767)
!772 = !DILocalVariable(name: "c", arg: 1, scope: !767, file: !7, line: 258, type: !537)
!773 = !DILocation(line: 258, column: 1, scope: !767)
!774 = !DILocalVariable(name: "filename", arg: 3, scope: !767, file: !7, line: 258, type: !9)
!775 = !DILocation(line: 258, column: 44, scope: !767)
!776 = !DILocation(line: 259, column: 8, scope: !777)
!777 = distinct !DILexicalBlock(scope: !767, file: !7, line: 258, column: 1)
!778 = !DILocation(line: 259, column: 2, scope: !777)
!779 = !DILocation(line: 277, column: 1, scope: !767)
!780 = !DILocation(line: 265, column: 24, scope: !777)
!781 = !DILocalVariable(name: "parser", scope: !777, file: !7, line: 265, type: !693)
!782 = !DILocation(line: 265, column: 2, scope: !767)
!783 = !DILocation(line: 266, column: 8, scope: !777)
!784 = !DILocation(line: 267, column: 6, scope: !777)
!785 = !DILocation(line: 267, column: 25, scope: !777)
!786 = !DILocation(line: 271, column: 9, scope: !777)
!787 = !DILocation(line: 268, column: 9, scope: !777)
!788 = !DILocation(line: 275, column: 17, scope: !777)
!789 = !DILocation(line: 275, column: 3, scope: !777)
!790 = !DILocation(line: 275, column: 9, scope: !777)
!791 = !DILocation(line: 272, column: 3, scope: !767)
!792 = distinct !DISubprogram(name: "amber.ParseFile..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.ParseFile", scope: null, file: !7, line: 280, type: !681, isLocal: false, isDefinition: true, scopeLine: 280, isOptimized: false, unit: !1, retainedNodes: !3)
!793 = !DILocalVariable(name: "c", arg: 1, scope: !792, file: !7, line: 280, type: !537)
!794 = !DILocation(line: 280, column: 1, scope: !792)
!795 = !DILocation(line: 281, column: 8, scope: !796)
!796 = distinct !DILexicalBlock(scope: !792, file: !7, line: 280, column: 1)
!797 = !DILocation(line: 281, column: 2, scope: !796)
!798 = !DILocation(line: 298, column: 1, scope: !792)
!799 = !DILocation(line: 287, column: 19, scope: !796)
!800 = !DILocalVariable(name: "p", scope: !796, file: !7, line: 287, type: !693)
!801 = !DILocation(line: 287, column: 2, scope: !792)
!802 = !DILocation(line: 288, column: 9, scope: !796)
!803 = !DILocation(line: 288, column: 20, scope: !796)
!804 = !DILocation(line: 288, column: 39, scope: !796)
!805 = !DILocation(line: 291, column: 9, scope: !796)
!806 = !DILocation(line: 289, column: 19, scope: !796)
!807 = !DILocation(line: 295, column: 12, scope: !796)
!808 = !DILocation(line: 295, column: 3, scope: !796)
!809 = !DILocation(line: 295, column: 9, scope: !796)
!810 = !DILocation(line: 296, column: 3, scope: !796)
!811 = !DILocation(line: 296, column: 13, scope: !796)
!812 = !DILocation(line: 292, column: 3, scope: !792)
!813 = distinct !DISubprogram(name: "amber.escape..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.escape", scope: null, file: !7, line: 428, type: !814, isLocal: false, isDefinition: true, scopeLine: 428, isOptimized: false, unit: !1, retainedNodes: !3)
!814 = !DISubroutineType(types: !815)
!815 = !{!9, !537, !537, !9}
!816 = !DILocalVariable(name: "c", arg: 1, scope: !813, file: !7, line: 428, type: !537)
!817 = !DILocation(line: 428, column: 1, scope: !813)
!818 = !DILocalVariable(name: "input", arg: 2, scope: !813, file: !7, line: 428, type: !9)
!819 = !DILocation(line: 428, column: 27, scope: !813)
!820 = !DILocation(line: 429, column: 33, scope: !813)
!821 = !DILocation(line: 429, column: 17, scope: !813)
!822 = !DILocation(line: 429, column: 2, scope: !813)
!823 = distinct !DISubprogram(name: "amber.indent..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.indent", scope: null, file: !7, line: 409, type: !824, isLocal: false, isDefinition: true, scopeLine: 409, isOptimized: false, unit: !1, retainedNodes: !3)
!824 = !DISubroutineType(types: !825)
!825 = !{!57, !537, !537, !16, !27}
!826 = !DILocalVariable(name: "c", arg: 1, scope: !823, file: !7, line: 409, type: !537)
!827 = !DILocation(line: 409, column: 1, scope: !823)
!828 = !DILocalVariable(name: "offset", arg: 2, scope: !823, file: !7, line: 409, type: !16)
!829 = !DILocation(line: 409, column: 27, scope: !823)
!830 = !DILocalVariable(name: "newline", arg: 3, scope: !823, file: !7, line: 409, type: !27)
!831 = !DILocation(line: 409, column: 39, scope: !823)
!832 = !DILocation(line: 410, column: 7, scope: !823)
!833 = !DILocation(line: 410, column: 5, scope: !823)
!834 = !DILocation(line: 411, column: 3, scope: !823)
!835 = !DILocation(line: 414, column: 13, scope: !823)
!836 = !DILocation(line: 414, column: 17, scope: !823)
!837 = !DILocation(line: 414, column: 24, scope: !823)
!838 = !DILocation(line: 414, column: 31, scope: !823)
!839 = !DILocation(line: 415, column: 4, scope: !823)
!840 = !DILocalVariable(name: "i", scope: !841, file: !7, line: 418, type: !16)
!841 = distinct !DILexicalBlock(scope: !823, file: !7, line: 418, column: 2)
!842 = !DILocation(line: 418, column: 6, scope: !823)
!843 = !DILocation(line: 418, column: 19, scope: !841)
!844 = !DILocation(line: 418, column: 31, scope: !841)
!845 = !DILocation(line: 418, column: 16, scope: !841)
!846 = !DILocation(line: 419, column: 4, scope: !841)
!847 = !DILocation(line: 418, column: 40, scope: !841)
!848 = distinct !DISubprogram(name: "amber.tempvar..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.tempvar", scope: null, file: !7, line: 423, type: !849, isLocal: false, isDefinition: true, scopeLine: 423, isOptimized: false, unit: !1, retainedNodes: !3)
!849 = !DISubroutineType(types: !850)
!850 = !{!9, !537, !537}
!851 = !DILocalVariable(name: "c", arg: 1, scope: !848, file: !7, line: 423, type: !537)
!852 = !DILocation(line: 423, column: 1, scope: !848)
!853 = !DILocation(line: 424, column: 3, scope: !848)
!854 = !DILocation(line: 425, column: 31, scope: !848)
!855 = !DILocation(line: 425, column: 18, scope: !848)
!856 = !DILocation(line: 425, column: 2, scope: !848)
!857 = distinct !DISubprogram(name: "amber.visit..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.visit", scope: null, file: !7, line: 364, type: !858, isLocal: false, isDefinition: true, scopeLine: 364, isOptimized: false, unit: !1, retainedNodes: !3)
!858 = !DISubroutineType(types: !859)
!859 = !{!57, !537, !537, !543}
!860 = !DILocalVariable(name: "c", arg: 1, scope: !857, file: !7, line: 364, type: !537)
!861 = !DILocation(line: 364, column: 1, scope: !857)
!862 = !DILocation(line: 365, column: 8, scope: !857)
!863 = !DILocation(line: 365, column: 2, scope: !857)
!864 = !DILocation(line: 403, column: 1, scope: !857)
!865 = !DILocation(line: 381, column: 2, scope: !857)
!866 = !DILocation(line: 382, column: 2, scope: !857)
!867 = !DILocation(line: 383, column: 16, scope: !857)
!868 = !DILocation(line: 384, column: 2, scope: !857)
!869 = !DILocation(line: 383, column: 20, scope: !857)
!870 = !DILocation(line: 383, column: 4, scope: !857)
!871 = !DILocation(line: 385, column: 18, scope: !857)
!872 = !DILocation(line: 386, column: 2, scope: !857)
!873 = !DILocation(line: 385, column: 22, scope: !857)
!874 = !DILocation(line: 385, column: 4, scope: !857)
!875 = !DILocation(line: 387, column: 18, scope: !857)
!876 = !DILocation(line: 388, column: 2, scope: !857)
!877 = !DILocation(line: 387, column: 22, scope: !857)
!878 = !DILocation(line: 387, column: 4, scope: !857)
!879 = !DILocation(line: 389, column: 14, scope: !857)
!880 = !DILocation(line: 390, column: 2, scope: !857)
!881 = !DILocation(line: 389, column: 18, scope: !857)
!882 = !DILocation(line: 389, column: 4, scope: !857)
!883 = !DILocation(line: 391, column: 15, scope: !857)
!884 = !DILocation(line: 392, column: 2, scope: !857)
!885 = !DILocation(line: 391, column: 19, scope: !857)
!886 = !DILocation(line: 391, column: 4, scope: !857)
!887 = !DILocation(line: 393, column: 20, scope: !857)
!888 = !DILocation(line: 394, column: 2, scope: !857)
!889 = !DILocation(line: 393, column: 24, scope: !857)
!890 = !DILocation(line: 393, column: 4, scope: !857)
!891 = !DILocation(line: 395, column: 15, scope: !857)
!892 = !DILocation(line: 396, column: 2, scope: !857)
!893 = !DILocation(line: 395, column: 19, scope: !857)
!894 = !DILocation(line: 395, column: 4, scope: !857)
!895 = !DILocation(line: 397, column: 21, scope: !857)
!896 = !DILocation(line: 398, column: 2, scope: !857)
!897 = !DILocation(line: 397, column: 25, scope: !857)
!898 = !DILocation(line: 397, column: 4, scope: !857)
!899 = !DILocation(line: 399, column: 16, scope: !857)
!900 = !DILocation(line: 400, column: 2, scope: !857)
!901 = !DILocation(line: 399, column: 20, scope: !857)
!902 = !DILocation(line: 399, column: 4, scope: !857)
!903 = !DILocation(line: 401, column: 20, scope: !857)
!904 = !DILocation(line: 401, column: 24, scope: !857)
!905 = !DILocation(line: 401, column: 4, scope: !857)
!906 = distinct !DISubprogram(name: "amber.visitAssignment..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.visitAssignment", scope: null, file: !7, line: 486, type: !907, isLocal: false, isDefinition: true, scopeLine: 486, isOptimized: false, unit: !1, retainedNodes: !3)
!907 = !DISubroutineType(types: !908)
!908 = !{!57, !537, !537, !909}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "Assignment", file: !7, line: 22, size: 576, align: 8, elements: !911)
!911 = !{!755, !912, !913}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "X", file: !7, line: 22, baseType: !9, size: 128, align: 64, offset: 320)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "Expression", file: !7, line: 22, baseType: !9, size: 128, align: 64, offset: 448)
!914 = !DILocalVariable(name: "c", arg: 1, scope: !906, file: !7, line: 486, type: !537)
!915 = !DILocation(line: 486, column: 1, scope: !906)
!916 = !DILocalVariable(name: "assgn", arg: 2, scope: !906, file: !7, line: 486, type: !909)
!917 = !DILocation(line: 486, column: 36, scope: !906)
!918 = !DILocation(line: 487, column: 65, scope: !906)
!919 = !DILocation(line: 487, column: 37, scope: !906)
!920 = !DILocation(line: 487, column: 22, scope: !906)
!921 = !DILocation(line: 487, column: 10, scope: !906)
!922 = !DILocation(line: 487, column: 3, scope: !906)
!923 = distinct !DISubprogram(name: "amber.visitBlock..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.visitBlock", scope: null, file: !7, line: 432, type: !924, isLocal: false, isDefinition: true, scopeLine: 432, isOptimized: false, unit: !1, retainedNodes: !3)
!924 = !DISubroutineType(types: !925)
!925 = !{!57, !537, !537, !752}
!926 = !DILocalVariable(name: "c", arg: 1, scope: !923, file: !7, line: 432, type: !537)
!927 = !DILocation(line: 432, column: 1, scope: !923)
!928 = !DILocalVariable(name: "block", arg: 2, scope: !923, file: !7, line: 432, type: !752)
!929 = !DILocation(line: 432, column: 31, scope: !923)
!930 = !DILocation(line: 433, column: 28, scope: !931)
!931 = distinct !DILexicalBlock(scope: !923, file: !7, line: 433, column: 2)
!932 = !DILocation(line: 433, column: 2, scope: !931)
!933 = !DILocalVariable(name: "node", scope: !931, file: !7, line: 433, type: !543)
!934 = !DILocation(line: 433, column: 6, scope: !923)
!935 = !DILocalVariable(name: "ok", scope: !936, file: !7, line: 434, type: !27)
!936 = distinct !DILexicalBlock(scope: !931, file: !7, line: 434, column: 3)
!937 = !DILocation(line: 434, column: 6, scope: !931)
!938 = !DILocation(line: 434, column: 6, scope: !936)
!939 = !DILocation(line: 434, column: 42, scope: !936)
!940 = !DILocation(line: 434, column: 36, scope: !936)
!941 = !DILocation(line: 434, column: 3, scope: !936)
!942 = !DILocation(line: 435, column: 5, scope: !936)
!943 = !DILocation(line: 438, column: 4, scope: !931)
!944 = distinct !DISubprogram(name: "amber.visitComment..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.visitComment", scope: null, file: !7, line: 446, type: !945, isLocal: false, isDefinition: true, scopeLine: 446, isOptimized: false, unit: !1, retainedNodes: !3)
!945 = !DISubroutineType(types: !946)
!946 = !{!57, !537, !537, !947}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DICompositeType(tag: DW_TAG_structure_type, name: "Comment", file: !7, line: 22, size: 576, align: 8, elements: !949)
!949 = !{!755, !950, !951, !952}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !7, line: 22, baseType: !9, size: 128, align: 64, offset: 320)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "Block", file: !7, line: 22, baseType: !752, size: 64, align: 64, offset: 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "Silent", file: !7, line: 22, baseType: !27, size: 8, align: 8, offset: 512)
!953 = !DILocalVariable(name: "c", arg: 1, scope: !944, file: !7, line: 446, type: !537)
!954 = !DILocation(line: 446, column: 1, scope: !944)
!955 = !DILocalVariable(name: "comment", arg: 2, scope: !944, file: !7, line: 446, type: !947)
!956 = !DILocation(line: 446, column: 33, scope: !944)
!957 = !DILocation(line: 447, column: 12, scope: !944)
!958 = !DILocation(line: 447, column: 2, scope: !944)
!959 = !DILocation(line: 448, column: 3, scope: !944)
!960 = !DILocation(line: 451, column: 3, scope: !944)
!961 = !DILocation(line: 453, column: 12, scope: !944)
!962 = !DILocation(line: 453, column: 19, scope: !944)
!963 = !DILocation(line: 0, scope: !944)
!964 = !DILocation(line: 454, column: 35, scope: !944)
!965 = !DILocation(line: 454, column: 11, scope: !944)
!966 = !DILocation(line: 454, column: 4, scope: !944)
!967 = !DILocation(line: 456, column: 11, scope: !944)
!968 = !DILocation(line: 456, column: 4, scope: !944)
!969 = !DILocation(line: 457, column: 23, scope: !944)
!970 = !DILocation(line: 457, column: 4, scope: !944)
!971 = !DILocation(line: 458, column: 4, scope: !944)
!972 = distinct !DISubprogram(name: "amber.visitCondition..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.visitCondition", scope: null, file: !7, line: 462, type: !973, isLocal: false, isDefinition: true, scopeLine: 462, isOptimized: false, unit: !1, retainedNodes: !3)
!973 = !DISubroutineType(types: !974)
!974 = !{!57, !537, !537, !975}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "Condition", file: !7, line: 22, size: 576, align: 8, elements: !977)
!977 = !{!755, !978, !979, !913}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "Positive", file: !7, line: 22, baseType: !752, size: 64, align: 64, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "Negative", file: !7, line: 22, baseType: !752, size: 64, align: 64, offset: 384)
!980 = !DILocalVariable(name: "c", arg: 1, scope: !972, file: !7, line: 462, type: !537)
!981 = !DILocation(line: 462, column: 1, scope: !972)
!982 = !DILocalVariable(name: "condition", arg: 2, scope: !972, file: !7, line: 462, type: !975)
!983 = !DILocation(line: 462, column: 35, scope: !972)
!984 = !DILocation(line: 463, column: 53, scope: !972)
!985 = !DILocation(line: 463, column: 21, scope: !972)
!986 = !DILocation(line: 463, column: 10, scope: !972)
!987 = !DILocation(line: 463, column: 3, scope: !972)
!988 = !DILocation(line: 464, column: 24, scope: !972)
!989 = !DILocation(line: 464, column: 3, scope: !972)
!990 = !DILocation(line: 465, column: 14, scope: !972)
!991 = !DILocation(line: 465, column: 24, scope: !972)
!992 = !DILocation(line: 466, column: 4, scope: !972)
!993 = !DILocation(line: 467, column: 25, scope: !972)
!994 = !DILocation(line: 467, column: 4, scope: !972)
!995 = !DILocation(line: 469, column: 3, scope: !972)
!996 = distinct !DISubprogram(name: "amber.visitDoctype..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.visitDoctype", scope: null, file: !7, line: 442, type: !997, isLocal: false, isDefinition: true, scopeLine: 442, isOptimized: false, unit: !1, retainedNodes: !3)
!997 = !DISubroutineType(types: !998)
!998 = !{!57, !537, !537, !999}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "Doctype", file: !7, line: 22, size: 448, align: 8, elements: !1001)
!1001 = !{!755, !950}
!1002 = !DILocalVariable(name: "c", arg: 1, scope: !996, file: !7, line: 442, type: !537)
!1003 = !DILocation(line: 442, column: 1, scope: !996)
!1004 = !DILocalVariable(name: "doctype", arg: 2, scope: !996, file: !7, line: 442, type: !999)
!1005 = !DILocation(line: 442, column: 33, scope: !996)
!1006 = !DILocation(line: 443, column: 17, scope: !996)
!1007 = !DILocation(line: 443, column: 3, scope: !996)
!1008 = distinct !DISubprogram(name: "amber.visitEach..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.visitEach", scope: null, file: !7, line: 472, type: !1009, isLocal: false, isDefinition: true, scopeLine: 472, isOptimized: false, unit: !1, retainedNodes: !3)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!57, !537, !537, !1011}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "Each", file: !7, line: 22, size: 768, align: 8, elements: !1013)
!1013 = !{!755, !912, !1014, !1015, !1016}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "Y", file: !7, line: 22, baseType: !9, size: 128, align: 64, offset: 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "Expression", file: !7, line: 22, baseType: !9, size: 128, align: 64, offset: 576)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "Block", file: !7, line: 22, baseType: !752, size: 64, align: 64, offset: 704)
!1017 = !DILocalVariable(name: "c", arg: 1, scope: !1008, file: !7, line: 472, type: !537)
!1018 = !DILocation(line: 472, column: 1, scope: !1008)
!1019 = !DILocalVariable(name: "each", arg: 2, scope: !1008, file: !7, line: 472, type: !1011)
!1020 = !DILocation(line: 472, column: 30, scope: !1008)
!1021 = !DILocation(line: 473, column: 9, scope: !1008)
!1022 = !DILocation(line: 473, column: 16, scope: !1008)
!1023 = !DILocation(line: 474, column: 3, scope: !1008)
!1024 = !DILocation(line: 477, column: 5, scope: !1008)
!1025 = !DILocation(line: 477, column: 17, scope: !1008)
!1026 = !DILocation(line: 0, scope: !1008)
!1027 = !DILocation(line: 478, column: 43, scope: !1008)
!1028 = !DILocation(line: 478, column: 28, scope: !1008)
!1029 = !DILocation(line: 478, column: 11, scope: !1008)
!1030 = !DILocation(line: 478, column: 4, scope: !1008)
!1031 = !DILocation(line: 477, column: 13, scope: !1008)
!1032 = !DILocation(line: 480, column: 59, scope: !1008)
!1033 = !DILocation(line: 480, column: 28, scope: !1008)
!1034 = !DILocation(line: 480, column: 11, scope: !1008)
!1035 = !DILocation(line: 480, column: 4, scope: !1008)
!1036 = !DILocation(line: 482, column: 19, scope: !1008)
!1037 = !DILocation(line: 482, column: 3, scope: !1008)
!1038 = !DILocation(line: 483, column: 3, scope: !1008)
!1039 = distinct !DISubprogram(name: "amber.visitExpression..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.visitExpression", scope: null, file: !7, line: 632, type: !1040, isLocal: false, isDefinition: true, scopeLine: 632, isOptimized: false, unit: !1, retainedNodes: !3)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!9, !537, !537, !1042}
!1042 = !DICompositeType(tag: DW_TAG_structure_type, name: "Expr", file: !7, line: 8, size: 128, align: 8, elements: !1043)
!1043 = !{!1044, !207}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !7, line: 8, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)Pos,*func(*void)Pos,*func(*void)void}", file: !35, size: 256, align: 8, elements: !1047)
!1047 = !{!1048, !1049, !1050, !1051}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !35, line: 8, baseType: !38, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "End", file: !35, line: 8, baseType: !451, size: 64, align: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "Pos", file: !35, line: 8, baseType: !451, size: 64, align: 64, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "exprNode", file: !35, line: 8, baseType: !1052, size: 64, align: 64, offset: 192)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!57, !56}
!1055 = !DILocalVariable(name: "c", arg: 1, scope: !1039, file: !7, line: 632, type: !537)
!1056 = !DILocation(line: 632, column: 1, scope: !1039)
!1057 = !DILocalVariable(name: "outerexpr", arg: 2, scope: !1039, file: !7, line: 632, type: !1042)
!1058 = !DILocation(line: 632, column: 36, scope: !1039)
!1059 = !DILocation(line: 633, column: 16, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1039, file: !7, line: 632, column: 1)
!1061 = !DILocalVariable(name: "stack", scope: !1060, file: !7, line: 633, type: !719)
!1062 = !DILocation(line: 633, column: 2, scope: !1039)
!1063 = !DILocation(line: 635, column: 9, scope: !1060)
!1064 = !DILocalVariable(name: "pop", scope: !1060, file: !7, line: 635, type: !1065)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !10, line: 1, size: 64, align: 8, elements: !1067)
!1067 = !{!1068}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !10, line: 1, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!9}
!1072 = !DILocation(line: 635, column: 2, scope: !1039)
!1073 = !DILocalVariable(name: "exec", scope: !1060, file: !7, line: 645, type: !1074)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !7, line: 645, size: 64, align: 8, elements: !1076)
!1076 = !{!1077}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !7, line: 645, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!57, !1042}
!1081 = !DILocation(line: 645, column: 6, scope: !1039)
!1082 = !DILocation(line: 647, column: 9, scope: !1060)
!1083 = !DILocation(line: 647, column: 7, scope: !1060)
!1084 = !DILocation(line: 809, column: 2, scope: !1060)
!1085 = !DILocation(line: 810, column: 9, scope: !1060)
!1086 = !DILocation(line: 810, column: 2, scope: !1060)
!1087 = distinct !DISubprogram(name: "amber.visitInterpolation..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.visitInterpolation", scope: null, file: !7, line: 614, type: !814, isLocal: false, isDefinition: true, scopeLine: 614, isOptimized: false, unit: !1, retainedNodes: !3)
!1088 = !DILocalVariable(name: "c", arg: 1, scope: !1087, file: !7, line: 614, type: !537)
!1089 = !DILocation(line: 614, column: 1, scope: !1087)
!1090 = !DILocalVariable(name: "value", arg: 2, scope: !1087, file: !7, line: 614, type: !9)
!1091 = !DILocation(line: 614, column: 39, scope: !1087)
!1092 = !DILocation(line: 615, column: 17, scope: !1087)
!1093 = !DILocation(line: 615, column: 9, scope: !1087)
!1094 = !DILocation(line: 615, column: 2, scope: !1087)
!1095 = distinct !DISubprogram(name: "amber.visitMixin..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.visitMixin", scope: null, file: !7, line: 813, type: !1096, isLocal: false, isDefinition: true, scopeLine: 813, isOptimized: false, unit: !1, retainedNodes: !3)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!57, !537, !537, !1098}
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mixin", file: !7, line: 22, size: 704, align: 8, elements: !1100)
!1100 = !{!755, !1101, !1102, !1103}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "Block", file: !7, line: 22, baseType: !752, size: 64, align: 64, offset: 320)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !7, line: 22, baseType: !9, size: 128, align: 64, offset: 384)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "Args", file: !7, line: 22, baseType: !304, size: 192, align: 64, offset: 512)
!1104 = !DILocalVariable(name: "c", arg: 1, scope: !1095, file: !7, line: 813, type: !537)
!1105 = !DILocation(line: 813, column: 1, scope: !1095)
!1106 = !DILocalVariable(name: "mixin", arg: 2, scope: !1095, file: !7, line: 813, type: !1098)
!1107 = !DILocation(line: 813, column: 31, scope: !1095)
!1108 = !DILocation(line: 814, column: 16, scope: !1095)
!1109 = !DILocation(line: 814, column: 3, scope: !1095)
!1110 = !DILocation(line: 814, column: 23, scope: !1095)
!1111 = distinct !DISubprogram(name: "amber.visitMixinCall..1command_line_arguments.Compiler", linkageName: "command_line_arguments.Compiler.visitMixinCall", scope: null, file: !7, line: 817, type: !1112, isLocal: false, isDefinition: true, scopeLine: 817, isOptimized: false, unit: !1, retainedNodes: !3)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!57, !537, !537, !1114}
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DICompositeType(tag: DW_TAG_structure_type, name: "MixinCall", file: !7, line: 22, size: 640, align: 8, elements: !1116)
!1116 = !{!755, !1117, !1118}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !7, line: 22, baseType: !9, size: 128, align: 64, offset: 320)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "Args", file: !7, line: 22, baseType: !304, size: 192, align: 64, offset: 448)
!1119 = !DILocalVariable(name: "c", arg: 1, scope: !1111, file: !7, line: 817, type: !537)
!1120 = !DILocation(line: 817, column: 1, scope: !1111)
